{"url": "http://dx.doi.org/10.16995/dscn.52", "identifier": {"string_id": "10.16995/dscn.52", "id_scheme": "DOI"}, "abstract": "In John Napier’s classic study of the structure, function, and behavior of the human hand, he states that \"[i]magination is basic to tool-making. All human-made tools start off as chunks of undifferentiated material, which are then shaped according to some cerebral blueprint of what is required\" (1993, 99). These words can be productively repurposed to describe the digital humanities practice of tool making, tool use, and modelling. After all, making, shaping, and using tools for analysis, archiving, and visualisation has become central to humanistic research methods. Napier's \"cerebral blueprint\" blends imaginative and technical ways of making that emulates how digital humanists seek out new insights alongside technological development. As increasing numbers of digital humanists hone their literacy of the programming languages to build and remake tools, I argue that the means by which we describe this particular philosophy of tool use will become an increasingly thorny issue that may even hinder the usefulness of the knowledge produced by the digital humanities. Therefore, digital humanists will need to find ways to negotiate this role in the humanities and better define their critical agency within the history of epistemology. Additionally, a collaborative development of tools requires a theoretical framework that is critical of the value of data derived from literature in a purely instrumental way and is able to redefine research artifacts in the humanities to include digital tools.", "article_title": "\"To think a world without thought\": Negotiating Speculative Realism in a Digital Humanities Practice", "authors": [{"given": "Aaron", "family": "Mauro", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Open Library of the Humanities", "date": "2017", "keywords": null, "journal_title": "Digital Studies/Le champ numérique", "volume": null, "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}