{"url": "http://dx.doi.org/10.16995/dscn.266", "identifier": {"string_id": "10.16995/dscn.266", "id_scheme": "DOI"}, "abstract": "Lev Manovich posits that new media and the World Wide Web are modular or layered in nature, similar to structural computer programming in that their distinct elements are combinative while retaining independence. Modular structures and systems (such as Lego, mobile apps, computer software, and even language itself) exchange precision, specific connectivity, narrative stability, and a focus on progressive products for flexibility, general compatibility, adaptiveness and a focus on aggregative processes. These attributes are well suited for new knowledge environments: Peter Schillingsburg sees modularity at the heart of dynamic digital collaboration and Susan Brown (et al) liken the modularity of digital projects to the cumulative nature of academic periodicals but caution that such projects are still often judged “as if they were a book,” or by their apparent finishedness. While scholarly journal articles and monographs, as finished products of scholarly activity, are not often constructed to demonstrate modularity or to function as modular components in broader arenas of scholarly communication, they could be reimagined as such (beyond citation). This is something that the NewRadial environment encourages through its modular design and in the kinds of modular scholarly communication that it facilitates.", "article_title": "Connecting the dots: Integrating modular networks and narrativity in digital scholarship", "authors": [{"given": "Amy", "family": "Robinson", "affiliation": [{"original_name": "Acadia University", "normalized_name": "Acadia University", "country": "Canada", "identifiers": {"ror": "https://ror.org/00839we02", "GRID": "grid.411959.1"}}]}, {"given": "Jon", "family": "Saklofske", "affiliation": [{"original_name": "Acadia University", "normalized_name": "Acadia University", "country": "Canada", "identifiers": {"ror": "https://ror.org/00839we02", "GRID": "grid.411959.1"}}]}, {"given": "The INKE Research", "family": "Team", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Open Library of the Humanities", "date": "2017", "keywords": null, "journal_title": "Digital Studies/Le champ numérique", "volume": "9", "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}