{"url": "http://dx.doi.org/10.16995/dscn.265", "identifier": {"string_id": "10.16995/dscn.265", "id_scheme": "DOI"}, "abstract": "Humanities scholars have long claimed the importance of browsing in the library stacks as part of their research process. The digitization practices of libraries and archives, while meant to assist with preservation and access, make the physical browsing experience impossible. While there have been various attempts to recreate this experience online, none as yet has created a digital tool which users can interact with as they move through the physical material in the library. This paper aims to introduce the concept of the Serendipitous Tool for Augmenting Knowledge (STAK), a geolocative app that allows users to access material complementary to what they are looking at on library shelves. The authors outline the research behind STAK, the potential for locative media and augmented reality in libraries, and the design requirements for STAK. Finally, they outline two elements of serendipity that they hope to emulate in STAK: Noticing, and Capture and Recall. By enhancing the physical collection with digital information, STAK aims to bring scholars the best of both worlds, and to encourage them to return to the physical library to explore, learn, and browse.", "article_title": "STAK – Serendipitous tool for augmenting knowledge: A conceptual tool for bridging digital and physical resources", "authors": [{"given": "Kim", "family": "Martin", "affiliation": [{"original_name": "University of Guelph", "normalized_name": "University of Guelph", "country": "Canada", "identifiers": {"ror": "https://ror.org/01r7awg59", "GRID": "grid.34429.38"}}]}, {"given": "Brian", "family": "Greenspan", "affiliation": [{"original_name": "Carleton University", "normalized_name": "Carleton University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02qtvee93", "GRID": "grid.34428.39"}}]}, {"given": "Anabel", "family": "Quan-Haase", "affiliation": [{"original_name": "University of Western Ontario", "normalized_name": "Western University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02grkyz14", "GRID": "grid.39381.30"}}]}], "publisher": "Open Library of the Humanities", "date": "2017", "keywords": null, "journal_title": "Digital Studies/Le champ numérique", "volume": "9", "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}