{"url": "http://dx.doi.org/10.16995/dscn.25", "identifier": {"string_id": "10.16995/dscn.25", "id_scheme": "DOI"}, "abstract": "Using large-scale analysis of a music-download database provided by MixRadio, a leading online music-service provider formerly under Nokia ownership, this paper investigates the following in relation to global-music consumption: (1) differences in the downloading trajectories of various musical genres; (2) the extent to which downloading trajectories are invariant with respect to countries and/or genres; and (3) possible links between the downloading behaviour of various genre-defined user subgroups and pre-existing music-personality studies. Substantial differences were observed between download trajectories pertaining to pop, rap, rock and metal—metal, in particular, was seen to exaggerate features of rock's trajectory. Of the genres studied, metal was found to have the only invariant trajectory, seemingly impervious to the local conditions of the country in which it was downloaded. Similarly, musical styles within Brazil were found to be downloaded in more or less the same way, in contrast to the UK where download trajectories varied with musical genre. Lastly, the analysis demonstrated a statistical link between pre-existing music-personality research and patterns of downloading within the metadata, suggesting that different downloading behaviours are due, in part, to differences in personality.", "article_title": "Generalizing case-based analyses in the study of global music consumption", "authors": [{"given": "Matthew", "family": "Woolhouse", "affiliation": [{"original_name": "School of the Arts McMaster University", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}, {"given": "James", "family": "Renwick", "affiliation": [{"original_name": "University of Toronto", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}]}], "publisher": "Open Library of the Humanities", "date": "2017", "keywords": null, "journal_title": "Digital Studies/Le champ numérique", "volume": null, "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}