{"url": "http://dx.doi.org/10.16995/dscn.27", "identifier": {"string_id": "10.16995/dscn.27", "id_scheme": "DOI"}, "abstract": "In the preface to her influential book, Lesbian images, writer for The Body Politic and person in the Lesbian and Gay Liberation in Canada (LGLC) data set, Canadian author Jane Rule stresses the importance of not reducing human experience in order to understand it. Lesbian Images, her collective biography, or prosopography, of lesbian writers therefore offers a view of the complexity of life, presenting as \"many answers as there are voices to speak… for no one can comfortably dismiss all those who find a place in these pages\" (1975 vi). The Lesbian and Gay Liberation in Canada project (LGLC) is using prosopography to respond to Rule's call to document the complexity of gay and lesbian lives. While prosopography has traditionally been used to uncover the averages, the norms, and the likely lives of people about whom historians have little information (for example, Roman slaves or Anglo-Saxon peasants), LGLC is taking up prosopography, not to fill in gaps or to reduce liberationists to a few statistical averages, but to develop new knowledge about how the ideas at the heart of the liberation movement, and the communities that espoused them, shaped Canadian culture.", "article_title": "Lesbian and Gay Liberation in Canada: Representing the Dyke Dynamo", "authors": [{"given": "Michelle", "family": "Schwartz", "affiliation": [{"original_name": "Ryerson University", "normalized_name": "Ryerson University", "country": "Canada", "identifiers": {"ror": "https://ror.org/05g13zd79", "GRID": "grid.68312.3e"}}]}, {"given": "Constance", "family": "Crompton", "affiliation": [{"original_name": "University of British Columbia, Okanagan Campus", "normalized_name": "University of British Columbia", "country": "Canada", "identifiers": {"ror": "https://ror.org/03rmrcq20", "GRID": "grid.17091.3e"}}]}], "publisher": "Open Library of the Humanities", "date": "2017", "keywords": null, "journal_title": "Digital Studies/Le champ numérique", "volume": null, "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}