{"url": "http://dx.doi.org/10.16995/dscn.51", "identifier": {"string_id": "10.16995/dscn.51", "id_scheme": "DOI"}, "abstract": "Using a music-download database provided by the Nokia Corporation, this paper explores three primary questions: (1) Do different musical genres create different patterns of downloading? (2) Do different countries download a particular song in different ways? And (3) how do different events affect downloading? Question (1) is studied in relation to representative songs from the pop, rap and rock genres, and reveals rock to be significantly different from pop and rap in a number of key respects. Question (2) investigates the downloading patterns of a mainstream pop song in Brazil, Germany, Italy, and Mexico. Using Kolmogorov-Smirnoff tests to compare the countries’ download distributions, Brazil is found to be substantially dissimilar to the other countries. And Question (3) is explored with respect to types of event, the first \"musical\" (Adele's Grammy Awards triumph in February 2012), and the second \"extra-musical\" (the death of Michael Jackson in June 2009). The extra-musical event is found to have had a far greater effect on downloading patterns than the musical event. The findings are discussed in relation to various factors, including musical genres, the music industry, social media, and globalisation.", "article_title": "Every Track You Take: Analysing the Dynamics of Song and Genre Reception Through Music Downloading", "authors": [{"given": "Matthew", "family": "Woolhouse", "affiliation": [{"original_name": "School of the Arts McMaster University", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}, {"given": "James", "family": "Renwick", "affiliation": [{"original_name": "McMaster University", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}, {"given": "Dan", "family": "Tidhar", "affiliation": [{"original_name": "University of Cambridge", "normalized_name": "University of Cambridge", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/013meh722", "GRID": "grid.5335.0"}}]}], "publisher": "Open Library of the Humanities", "date": "2017", "keywords": null, "journal_title": "Digital Studies/Le champ numérique", "volume": null, "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}