{"url": "http://dx.doi.org/10.16995/dscn.24", "identifier": {"string_id": "10.16995/dscn.24", "id_scheme": "DOI"}, "abstract": "Even though large aggregations of humanities data are emerging through the efforts of significant federations, the larger the collection, the more difficult it is for large-scale standards to effectively account for and relate the complex variety of data objects and their characteristics. How can we simultaneously embrace this complexity with the help of the computer and achieve interoperability while still retaining the interpretative flexibility that is the heart of meaningful humanities work? Additionally, what scale is the optimal viewpoint through which we can do humanities-related work on such large data sets? At what point do we lose a humanist sensibility when working with big data, and how do we take advantage of computing technology to pluralize perspective, confront complexity, avoid reductiveness and preserve meaning as we interpret meaningful subsets of big data collections? NewRadial— an INKE prototype—addresses these questions by enabling users to connect and explore humanities databases across plural scales of engagement without imposing a universal metadata standard. Its web-based environment visually displays the objects of humanities databases in a manner that encourages browsing, searching, collecting, organizing, connecting and annotating, modelling a way to bring different standards and ontological perspectives together without negating their differences or requiring conformity to a reductive or limiting overall system.", "article_title": "NewRadial: Challenging scales and standards of humanities scholarship through new knowledge environment prototypes", "authors": [{"given": "Jon", "family": "Saklofske", "affiliation": [{"original_name": "Acadia University", "normalized_name": "Acadia University", "country": "Canada", "identifiers": {"ror": "https://ror.org/00839we02", "GRID": "grid.411959.1"}}]}, {"given": "The INKE", "family": "Research Team", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Open Library of the Humanities", "date": "2017", "keywords": null, "journal_title": "Digital Studies/Le champ numérique", "volume": null, "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}