{"url": "http://dx.doi.org/10.4000/jtei.1274", "identifier": {"string_id": "10.4000/jtei.1274", "id_scheme": "DOI"}, "abstract": "This paper describes the technical structure of the project ReMetCa (Repertorio Digital de Métrica Medieval Castellana), the first online repertoire of Medieval Spanish metrics and poetry. ReMetCa is based on the combination of traditional metrical and poetic studies (rhythm and rhyme patterns) with digital humanities technology, TEI-XML integrated into a Relational Database Management System (RDBMS) through an XMLType field, thus opening up the possibility of launching simultaneous searches and queries by using a searchable, user-friendly interface. The use of the TEI Verse module to tag metrical and poetic structures is especially important for two reasons: first, because it lets us tag different kinds of poems with a variable metadata structure, making it possible to express a very high level of detail for poetry description that cannot be registered in a conventional database; and second, as it enables extensibility and adds more information to enrich the conceptual model, which is under constant development.", "article_title": "ReMetCa: A Proposal for Integrating RDBMS and TEI-Verse", "authors": [{"given": "Elena", "family": "González-Blanco", "affiliation": [{"original_name": "Universidad Nacional de Educación a Distancia (Open University) of Spain in Madrid", "normalized_name": "Universidade Aberta", "country": "Portugal", "identifiers": {"ror": "https://ror.org/02rv3w387", "GRID": "grid.26693.38"}}]}, {"given": "José Luis", "family": "Rodríguez", "affiliation": [{"original_name": "Royal Library, Madrid", "normalized_name": "Royal Library", "country": "Denmark", "identifiers": {"ror": "https://ror.org/03vvy0v27", "GRID": "grid.474779.e"}}]}], "publisher": "OpenEdition", "date": "2015", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 8", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}