{"url": "http://dx.doi.org/10.4000/jtei.2926", "identifier": {"string_id": "10.4000/jtei.2926", "id_scheme": "DOI"}, "abstract": "The paper discusses the question of how genetic encoding can be taught in order to introduce encoding strategies of text genesis to less technologically adept scholars. The TEI Guidelines have offered ways to encode manuscript genetics for almost a decade (chapter 11.7). However, this topic is considered to be relatively advanced, and is rarely covered in introductory courses or teaching materials. The paper is based on two encoding workshops at the University of Vienna in different settings. Participants produced a dossier génétique (genetic dossier) in a collaborative writing process. They had at their disposal several writing tools (pens, typewriters) and different kinds of paper, in order to produce a text with several layers, while the whole process was recorded on video. The products were then digitized, and each group got digital copies of a different one. Participants analyzed the specific phenomena of the primary sources, such as additions, corrections, deletions or scribal hands. The participants were then introduced to the necessary encoding strategies to represent the genesis of texts. After the introduction to the transcription tool Transkribus, the students transcribed one of the texts, exported it, and enriched it further with Oxygen Author using a dedicated framework.", "article_title": "Collaborative Encoding of Text Genesis: A Pedagogical Approach for Teaching Genetic Encoding with the TEI", "authors": [{"given": "Stefano", "family": "Apostolo", "affiliation": [{"original_name": "Università degli Studi di Milano", "normalized_name": "University of Milan", "country": "Italy", "identifiers": {"ror": "https://ror.org/00wjc7c48", "GRID": "grid.4708.b"}}]}, {"given": "Ingo", "family": "Börner", "affiliation": [{"original_name": "Austrian Academy of Sciences", "normalized_name": "Austrian Academy of Sciences", "country": "Austria", "identifiers": {"ror": "https://ror.org/03anc3s24", "GRID": "grid.4299.6"}}]}, {"given": "Angelika", "family": "Hechtl", "affiliation": [{"original_name": "Vienna University of Economics and Business", "normalized_name": "Vienna University of Economics and Business", "country": "Austria", "identifiers": {"ror": "https://ror.org/03yn8s215", "GRID": "grid.15788.33"}}]}], "publisher": "OpenEdition", "date": "2020", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 12", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}