{"url": "http://dx.doi.org/10.4000/jtei.432", "identifier": {"string_id": "10.4000/jtei.432", "id_scheme": "DOI"}, "abstract": "This paper presents a newly developed framework for online publishing of scholarly text editions based on the TEI Guidelines. At the core of our publishing framework is support for delivery of TEI-encoded documents in Drupal, a popular, fairly powerful, and modular content management system (CMS). In this article we present the TEICHI suite of modules for Drupal that we developed, as well as a prototype implementation. TEICHI consists of a collection of modules for displaying TEI files online (via XSLT and CSS), interacting with them (via JavaScript), as well as uploading, searching, and downloading them. To showcase the particular strengths and possible use cases of our framework, we compare our tool to other currently available systems. Here, we focus on those tools which are suitable for textual scholars new to Digital Humanities and the TEI who would like to use the powerful encoding mechanisms provided by the TEI but have relatively little technical expertise. Therefore, we compare the TEICHI framework specifically to the Versioning Machine (VM) and the Scalable Architecture for Digital Editions (SADE). We look at these tools from four perspectives: that of the user interacting with the digital edition or archive, of the editor encoding and publishing texts, of the administrator setting up the publishing tool, and of the programmer possibly modifying or enhancing the tool. Our more general aim here is to investigate, from the perspective of tool development in the area of online delivery of TEI-encoded documents, what could be called the “tools paradox”: there is evidence for textual scholars’ need of such tools, and a number of them are available; however, the existing tools are not widely adopted by scholars. Our findings suggest that tool development has to address two aims which seem to be mutually exclusive, that of “keeping it simple” and that of “going generic”. In fact, we suggest that tool developers need to find ways of turning these conflicting aims into concurrent aims if they want to build successful tools and broaden their user base.", "article_title": "TEICHI and the Tools Paradox", "authors": [{"given": "Sebastian", "family": "Pape", "affiliation": [{"original_name": "University of Kassel", "normalized_name": "University of Kassel", "country": "Germany", "identifiers": {"ror": "https://ror.org/04zc7p361", "GRID": "grid.5155.4"}}]}, {"given": "Christof", "family": "Schöch", "affiliation": [{"original_name": "University of Würzburg, Germany", "normalized_name": "University of Würzburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00fbnyb24", "GRID": "grid.8379.5"}}]}, {"given": "Lutz", "family": "Wegner", "affiliation": [{"original_name": "University of Kassel", "normalized_name": "University of Kassel", "country": "Germany", "identifiers": {"ror": "https://ror.org/04zc7p361", "GRID": "grid.5155.4"}}]}], "publisher": "OpenEdition", "date": "2012", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 2", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}