{"url": "http://dx.doi.org/10.4000/jtei.2800", "identifier": {"string_id": "10.4000/jtei.2800", "id_scheme": "DOI"}, "abstract": "This paper describes the ongoing development of a TEI-conformant model for the encoding of hybrid primary sources containing text and graphical components on a similar level of semantic meaning. The subsequent considerations are part of the digital scholarly edition project representing the notebooks of the Austrian conceptual artist Hartmut Skerbisch (1945–2009), a handwritten corpus created over a period of almost 40 years. Besides text, drawings were an important visual means of expression for the artist. In the context of digitally representing the numerous graphics embedded in the notes with equivalent depth to the text, a three-step model is proposed. This model takes into account the (1) graphical components characterizing the composition, (2) textual functions describing and directing the execution of artworks, and (3) interpretation of the graphics and their contextualization with connected material and information. The paper discusses the existing methods of representing graphics in TEI, presents the combination of these methods in the actual scholarly edition project, and introduces the semantic enrichment of the TEI sources through formal descriptions in RDF/XML taxonomies using linked open data. Thus, the genealogy of artistic concepts and artworks documented in the notebooks will become traceable.", "article_title": "Taking Note: Challenges of Dealing with Graphical Content in TEI", "authors": [{"given": "Martina", "family": "Scholger", "affiliation": [{"original_name": "University of Graz", "normalized_name": "University of Graz", "country": "Austria", "identifiers": {"ror": "https://ror.org/01faaaf77", "GRID": "grid.5110.5"}}]}], "publisher": "OpenEdition", "date": "2020", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 12", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}