{"url": "http://dx.doi.org/10.4000/jtei.1114", "identifier": {"string_id": "10.4000/jtei.1114", "id_scheme": "DOI"}, "abstract": "In this article we describe the DTA “Base Format” (DTABf), a strict subset of the TEI P5 tag set. The purpose of the DTABf is to provide a balance between expressiveness and precision as well as an interoperable annotation scheme for a large variety of text types of historical corpora of printed text from multiple sources. The DTABf has been developed on the basis of a large amount of historical text data in the core corpus of the project Deutsches Textarchiv (DTA) and text collections from 15 cooperating projects with a current total of 210 million tokens. The DTABf is a “living” TEI format which is continuously adjusted when new text candidates for the DTA containing new structural phenomena are encountered. We also focus on other aspects of the DTABf including consistency, interoperability with other TEI dialects, HTML and other presentations of the TEI texts, and conversion into other formats, as well as linguistic analysis. We include some examples of best practices to illustrate how external corpora can be losslessly converted into the DTABf, thus enabling third parties to use the DTABf in their specific projects. The DTABf is comprehensively documented, and several software tools are available for working with it, making it a widely used format for the encoding of historical printed German text.", "article_title": "The DTA “Base Format”: A TEI Subset for the Compilation of a Large Reference Corpus of Printed Text from Multiple Sources", "authors": [{"given": "Susanne", "family": "Haaf", "affiliation": [{"original_name": "Berlin-Brandenburg Academy of Sciences and Humanities (BBAW)", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}, {"given": "Alexander", "family": "Geyken", "affiliation": [{"original_name": "Berlin-Brandenburg Academy of Sciences and Humanities (BBAW)", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}, {"given": "Frank", "family": "Wiegand", "affiliation": [{"original_name": "Berlin-Brandenburg Academy of Sciences and Humanities (BBAW)", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}], "publisher": "OpenEdition", "date": "2015", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 8", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}