{"url": "http://dx.doi.org/10.5399/uo/hsda.1.1.1191", "identifier": {"string_id": "10.5399/uo/hsda.1.1.1191", "id_scheme": "DOI"}, "abstract": "Art plays a fundamental role in Arthur Schopenhauer’s philosophical system, and among the many artists who Schopenhauer cites, Francis Petrarch may be considered the most significant. Schopenhauer includes Petrarch among his favorite authors, referring to him as “the poet of [his] heart” and quoting him in those parts of The World as Will and Representation and Parerga and Paralipomena that center on the topics of ethics and the art of living. In this essay, I analyze Schopenhauer’s most significant passages on Petrarch, suggest connections between those passages, and conclude that, for Schopenhauer, the Italian poet is much more than a poet; he is a true sage whose words one can turn to for comfort. Petrarch is a thinker, a promoter of solitary life and the love of knowledge, a writer of philosophy and, although only in part, even an ascetic man. From Schopenhauer’s writing, it appears that Petrarch encompasses many of the features of the ideal Schopenhauerian man: someone who understands the senselessness of life, who has succeeded in denying the Will and has been able to express it through his poetry, his philosophical writings and his life choices. Petrarch’s verses foreshadow the basic ideas of Schopenhauer’s philosophy; his actions and his example serve not only as a model and inspiration for the readers of Schopenhauer but also for the German philosopher himself.", "article_title": "Quanto piace al mondo è breve sogno. Petrarch and Schopenhauer: Elective Affinities", "authors": [{"given": "Enrico", "family": "Vettore", "affiliation": [{"original_name": " California State University, Long Beach", "normalized_name": "California State University, Chico", "country": "United States", "identifiers": {"ror": "https://ror.org/027bzz146", "GRID": "grid.253555.1"}}]}], "publisher": "Oregon State University", "date": "2011", "keywords": null, "journal_title": "Humanist Studies & the Digital Age", "volume": "1", "issue": "1", "ISSN": [{"value": "2158-3846", "type": "electronic"}]}