{"url": "http://dx.doi.org/10.5399/uo/hsda.2.1.3016", "identifier": {"string_id": "10.5399/uo/hsda.2.1.3016", "id_scheme": "DOI"}, "abstract": "The title of this paper is inspired by the book edited by Domenico Fiormonte entitled Canoni liquidi (Liquid Canons). Of course, the adjective “liquid” refers to Zygmunt Bauman’s term at which my critique is also indirectly aimed. The title of Fiormonte’s book seems to suggest equivalence between textual “mobility” and “liquidity.” Yet the “liquefying” of (literary) canons and the emergence of new intrinsically kinetic or fluid forms of mobile textuality requires a critical assessment that does not prematurely celebrate the funeral of the text as we know it but pays close attention to what seems to be waiting for us beyond the text, as suggested in Francesco Fiorentino’s recent edited volume. This means paying attention to what in my recent book, Il futuro della letteratura (The Future of Literature), I call digital incunabula: objects/textual tools, devices programmed in a twofold, reciprocal sense, whose linguistic properties and rules interact and interfere with the algorithmic procedures of artificial languages. In this programmed and programmable interaction and intermediation one can perceive the horizon of incomprehensibility of posthuman language, providing a new aporetic dimension to Gadamer’s assertion that “the being that can be understood is language.“ This assertion is by now the most significant issue in the horizon of literary (digital) arts.", "article_title": "\"Liquid/Cloudy/Foggy: For a Critique of Fluid Textuality\"", "authors": [{"given": "Massimo", "family": "Riva", "affiliation": [{"original_name": "Brown University", "normalized_name": "Brown University", "country": "United States", "identifiers": {"ror": "https://ror.org/05gq02987", "GRID": "grid.40263.33"}}]}], "publisher": "Oregon State University", "date": "2013", "keywords": null, "journal_title": "Humanist Studies & the Digital Age", "volume": "2", "issue": "1", "ISSN": [{"value": "2158-3846", "type": "electronic"}]}