{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In 2003 a project Paper and Virtual Cities, financed by the Netherlands Organization for Scientific Research was started. The ultimate goal is to make explicit choices in the use of historical maps in virtual (re-) constructions for research and design. In order to do so three projects started, focusing on the historical reliability, the technical reliability and on the creation of a mark-up language and visualization tool that could combine the historical and technical data. This presentation is on the toolbox and the mark-up that is created in this third project. Researchers often use historical maps in order to describe the changes that took place in cities. By using techniques as used in Geographical Information Systems, e.g. rubber sheeting it is possible to make overlays of maps in order to combine data from several sources. Earlier research (Koster 2001) has shown that such combination can provide new insight in the transformation processes in the 17th century townscape. But this process can introduce new errors, for example due to the fact that later copies of maps can depict outdated information. Historical and Architectural Historical research is needed in order to trace this kind of errors. A second kind of errors is due to the fact that, although the measuring techniques used by 17th century cartographers were very precise, we still need to transform the map in order to make it fit with a modern map. The method of triangulation, measuring angles between high points, e.g. church towers makes that distant points are depicted with high precision, but the area in between might be less accurate. This kind of technical irregularities become visible in the process of rectifying the map. This process is used to bring all the maps to the same scale and orientation so they can be layered and compared. By storing the technical evidence and the historical evidence in a standardized format, a mark-up language, we are able to connect the two. Such a format visualizes the reliability and veracity of historical town plans and virtual (re-) constructions (separately or in combination) in relation to function and context. This might help an (urban) historian in making choices in studying and describing the change of urban form. But how would such a standardized format look like? And how can we visualize the reliability and veracity? The extensible markup language (XML) offers different languages that can be used. Historical Events can be stored in Historical Event Markup Language (HEML) while the technical evidence can be captured in the Geography Markup Language. In combination with library standards (Marc-21) used to describe the physical document and RDFPIC to describe the digitized image we are able to describe the document in such a way that data from several maps can be combined into one new standard. In order to do so a new tool has been created that offers the user a way to annotate the digital representation of a map. This tool, with the working title DrawOverMap contains a number of layers in which a researcher, of even a team of researchers can register their data and store in the new markup language. The data can be used to create a new data layer that visualizes the reliability of the map, or even a combination of maps. With mouse-overs a researcher can query the map, see annotations made by others, and decide what data might be used in research. The user can do so using the DrawOverMap toolbox, but since the XML data is also stored as Scalable Vector Graphics (SVG), again another Markup Language the data can also be browsed interactively over the Internet giving other researchers access to the annotations of historical maps. With the growing interest in historical maps on the Internet we need a tool to annotate them, rank them and give a valuation on its usability in historical research. We hope that the markup language produced in this research might help historians in choosing which maps to use in their research. On a cultural level this research is important for cultural heritage and for new cultural creations. In the domain of cultural heritage it facilitates the search, the organization and presentation of different sources that are necessary for understanding our urban history. A better understanding of historical developments can lead to an improvement of tools used in town planning.", "article_title": "How to Annotate Historical Townplans?", "authors": [{"given": "Elwin ", "family": "KOSTER", "affiliation": [{"original_name": "Humanities Computing, Groningen University", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}