{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Microblogging, a variant of a blogging which allows users to quickly post short updates to websites such as twitter.com, has recently emerged as a dominant form of information interchange and interaction for academic communities. To date, few studies have been undertaken to make explicit how such technologies are used by and can benefit scholars. This paper considers the use of Twitter as a digital backchannel by the Digital Humanities community, taking as its focus postings to Twitter during three different international 2009 conferences. This paper poses the following question: does the use of a Twitter enabled backchannel enhance the conference experience, collaboration and the co-construction of knowledge, or is it a disruptive, disparaging and a inconsequential tool full of ‘pointless babble’? Microblogging, with special emphasis on Twitter.com,Twitter was created by a San Francisco based privately funded startup and launched publicly in August 2006. http//:twitter.com/about the most well known microblogging service, is increasingly used as a means of extending commentary and discussion during academic conferences. This digital “backchannel” communication (non-verbal, real-time, communication which does not interrupt a presenter or event, Ynge 1970) is becoming more prevalent at academic conferences, in educational use, and in organizational settings. Frameworks for understanding the role and use of digital backchannel communication, such as that provided by Twitter, in enabling a participatory conference culture are therefore required. Formal conference presentations still mainly occur in a traditional setting; a divided space with a ‘front’ area for the speaker and a larger ‘back’ area for the audience. Implying a single focus of attention. There is a growing body of literature describing problems with a traditional conference setting; lack of feedback, nervousness about asking questions and a single speaker paradigm (Anderson et al 2003, Reinhardt et al 2009). The use of a digital backchannel such as Twitter, positioned in contrast with the formal or official conference programme, can address this, providing an irregular, or unofficial means of communication (McCarthy & Boyd, 2005). Backchannel benefits include being able to ask questions, or provide resources and references, changing the dynamics of the room from a one to many transmission to a many to many interaction, without disrupting the main channel communication. Negatives include a cause of distraction, disrespectful content and creating cliques amongst participants (Jacobs & Mcfarlane 2005, McCarthy and Boyd 2005).  Nevertheless research consistently shows the digital backchannel as a valuable way for active participation (Kelly 2009) and that it is highly appropriate for use in learning based environments (Reinhardt et al. 2009). Recently microblogging has been adopted by conferences such as DH2009 to act as a backchannel as it allows for the ‘spontaneous co-construction of digital artefacts’ (Costa et al 2008). Such communication usually involves note taking, sharing resources and individuals real time reactions to events. This paper presents a study that analyses the use of Twitter as a backchannel for academic conferences, focusing on the Digital Humanities community in three different physical conference settings held from June to September 2009. During three key conferences in the academic field (Digital Humanities 2009, That Camp 2009 and Digital Resources in the Arts and Humanities 2009), unofficial Twitter backchannels were established using conference specific hashtags (#dh09, #thatcamp and #drha09, #drha20091The community aspect of Twitter means that participants self organize, instigating tags themselves, hence the participants of Digital Resources in the Arts and Humanities used two different hashtags to discuss the conference depending on the twitter user.) to enable visible commentary and discussion. The resulting corpus of individual “tweets” provides a rich dataset, allowing analysis of the use of Twitter in an academic setting, and specifically presenting how the Digital Humanities community has embraced this microblogging tool.  Method Data from the three conferences was collected by archiving tweets which used the four distinct conference hashtags.  (These hashtags were used prior to and after the conferences, and have been reused by other conferences, therefore the corpus was limited to tweets posted during the span of each conference). This provided a data set of 4574 tweets from 326 distinct Twitter users, resulting in a corpus of 77308 tokens, which were analysed using various quantitative and qualitative methods which allowed us to understand and categorize the resulting corpus effectively.  Quantitative measures were used such as identifying prominent tweeters, analysing the frequency of conversations between users and the frequency of reposting messages (“retweeting”), and the differing use of Twitter at the three separate events. Text analysis tools were also used to interrogate the corpus.   Tweets were then categorized qualitatively using open coded content analysis where each post was read and categorized, determining the apparent intention of each twitter post.  It was necessary to develop our own categories: although Java et al (2007) present a brief taxonomy of Twitter user intentions (daily chatter, conversations, sharing information and reporting news)  they are based on general Twitter use and were too imprecise for our needs. Ebner (2008) discovered four major categories in his study of the use of Twitter during the keynote presentation at the Ed-Media 2008 conference, but this is a small study limited to 54 posts made by ten distinct users, whereas the DH conferences involved a much larger user population. Through our analysis, Tweets were divided into seven categories: comments on presentations; sharing resources; discussions and conversations; jotting down notes; establishing an online presence; and asking organizational questions.  Tweets which were highly ambiguous were placed in an Unknown category.    Findings Conference hashtagged Twitter activity does not constitute a single distributed conversation but, rather multiple monologues and a few intermittent, loosely joined dialogues between users. The majority of the activity was original tweeting (93%): only 6.7% were re-tweets (RT) of others’ ideas or comments. The real time interchange and speed of review of shared ideas appears to create a context of users offering ideas and summaries and not spreading the ideas of others verbatim. 45% of the tweets during the conference proceedings included direct references to others’ Twitter IDs, using the ‘@’ sign, as the source of a quote, object of a reply or debate. This implies a form of collaborative writing activity, driving a conference community of practice (Wenger 1998) who are involved in shared meaning making and the co-construction of knowledge (McNely 2009). However, the content of the tweets indicate that the discussion was between a few Twitter users rather than mass collaboration and was not necessarily focused on conference content. Jacob and Mcfarlane (2005) discuss polarization in digital backchannels, highlighting a conflict between an inclusive and participatory conference culture and a fragmentation of conference participants into cliques only intermittently engaged with the main presentations. This, in some instances seems to be the case during the Digital Humanities conferences, suggesting that newer members of the discipline or newer uses to Twitter may be excluded from the discussion. This also raises the question about official and unofficial backchannels. When communication is digitally mediated, backchannels may not be obvious. That is, even if participants know who else is participating in an interaction, this doesn’t guarantee (as it does in the front channel) that it is an accessible backchannel. Therefore by its nature an unofficial backchannel does not enable active participation. Further research is currently being undertaken on this corpus, which will be presented fully in the paper.  Most tweets in the corpus fell into the category of jotting down notes, triggered predominately by the front channel presentation, suggesting that participants are sharing experiences and to a degree co-constructing knowledge. What is surprising is the lack of direct commentary on presentations. Although Reinhardt et al (2009) argue that Twitter enables thematic debates and offers a digital backchannel for further discussion and commentary, the tweet data suggests that this does not appear to have happened to a significant extent at the digital humanities conferences. This raises the question of whether a Twitter enabled backchannel promotes more of an opportunity for users to establish an online presence and enhance their digital identity rather than encouraging a participatory conference culture.    Conclusion This study of digital humanities conference tweets provides an insight into the Digital Humanities community of practice. The Twitter enabled backchannel constitutes a complex multidirectional discursive space in which the conference participants make notes, share resources, hold discussions and ask questions as well as establishing a clear individual online presence. While determining individual user intentions in Twitter in a conference setting is challenging, it is possible to describe broad behavioral trends of tweeting during Digital Humanities conferences. The predominance of note taking suggests that the DH community could be classed as social reporters, commenting on the conference presentations for outsiders, rather than collaborating during the conference. There was also a tendency for a small group of users to produce the majority of tweets, interacting with each other about other matters. This suggests the small friendly nature of the DH researcher community, but may also be somewhat intimidating for those new to the field or conference. The Twitter enabled backchannel thus raises some interesting questions about the nature of conference participation and whether or not it is helped or hindered by a digital backchannel. Rather than pointless babble, the twitter record produced at each conference provides important evidence regarding how Digital Humanities, as a community of practice, functions and interacts.   ", "article_title": "Pointless Babble or Enabled Backchannel: Conference Use of Twitter by Digital Humanists", "authors": [{"given": " Claire", "family": "Ross", "affiliation": [{"original_name": "Department of Information Studies, University College London UK", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Melissa", "family": "Terras", "affiliation": [{"original_name": "Department of Information Studies, University College London UK", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Claire", "family": "Warwick", "affiliation": [{"original_name": "Department of Information Studies, University College London UK", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Anne", "family": "Welsh", "affiliation": [{"original_name": "Department of Information Studies, University College London UK", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}], "publisher": "Centre for Computing in the Humanities, King's College London", "date": "2010", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}