{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  Introduction In the last few years, one technological innovation has been the appending of discussion forum facilities to online arguments, such as in online versions of newspapers. The facility allows readers to post responses to an argument and to debate issues raised in it. Such online discussion forums can be regarded as electronic supplements to these arguments. The aim of this presentation is to report on research which highlights the utility value of this electronic supplementarity for critical reading of arguments (see O’Halloran, 2010, 2011 2012). I show how a content analysis of an online discussion forum appended to an argument can illuminate repression or marginalisation in the latter of concepts which are used in normal discussion of the argument’s topic. In turn, I demonstrate how this can reveal where the rhetorical structure of the argument is unstable, where it deconstructs. Since, to conduct such content analysis, I use corpus linguistic method – the analysis of collections of electronic texts – I refer to this approach to critical reading as Electronic Deconstruction. The theoretical stimulus for this approach comes from an appropriation of ‘the supplement’, an idea of the French philosopher, Jacques Derrida.   Keyword Analysis  Concepts normally used for discussion of a topic If an online discussion forum is sufficiently large, and contains a substantial number of critical posts, it can provide illumination of what concepts are normally used in discussion of a particular topic regardless of how these concepts are used, e.g. whether these concepts are assented to or not. Should certain concepts be salient in the forum as a whole but absent from, or at best marginal in, the original argument, this can offer insights into what the argument might be said to repress or marginalise from normal conceptual discussion of its topic. Since the discussion forum is directly related to the original argument, then arbitrariness will have been considerably reduced in producing these insights.   Keywords Salient concepts in an online discussion forum, or any collection of electronic texts, can be revealed through keyword analysis using appropriate corpus linguistic software. A keyword is ‘a word which occurs with unusual frequency in a given text…by comparison with a reference corpus’ (Scott 1997: 236). Keywords are established through statistical measures such as log likelihood (see Dunning, 1993). A log likelihood value of ≥ 7 (p < 0.01) confers keyness on a word. The larger the log likelihood value ≥ 7, the greater the salience of the keyword. Importantly, the log likelihood value, as a statistical measure, reduces arbitrariness in what is selected as salient. Comparison of the highest value keywords in a discussion forum with words in the original argument can be illuminating. For this presentation, the following types of keyword are relevant:   high value keywords in the forum which are absent from the original argument. These are candidates for the status of repressed concepts from the argument; high value keywords in the forum which are used infrequently in the original argument. These are candidates for the status of marginalised concepts in the argument.  Keyword analysis should not only be quantitative. They also need to be qualitatively explored to understand how they are being used. Qualitative exploration of keywords in the discussion forum can, in turn, strengthen judgements as to marginalised / repressed candidacy in the original argument. In order to mobilise how I use keywords in a discussion forum supplement for purposes of Electronic Deconstruction, I take as stimulus how Derrida conceives of ‘the supplement’.    Discussion forums as supplements  Derrida’s supplement   We normally think of the word ‘supplement’ as meaning something extra, an add-on. For Derrida, the supplement is more subtle. This is because he illuminates how a supplement ‘adds only to replace’ a lack of something. So, while the supplement may seem like an add-on and thus outside that which is supplemented, in fact it becomes simultaneously inside that which it is added to. Derrida writes that every supplement: …harbors within itself two significations whose cohabitation is as strange as it is necessary […] [The supplement] adds only to replace. It intervenes or insinuates itself in-the-place-of (Derrida 1976 [1967]: 144-145). Take, for example, a shop sign outside a bicycle shop. It is outside the shop not part of the inside. It is an add-on, an extra, signaling the nature of the shop. However, in being outside the shop it ‘adds to replace’ a ‘lack’ inside the shop – the shop cannot function unless it can attract custom. The shop sign is thus simultaneously an add-on and an essential part of the shop – it is both outside and oddly ‘inside’ the shop as well.   Discussion forums as Derridean supplements If we apply the logic of the supplement to online discussion forums appended to arguments, then a discussion forum is not just outside the original argument. It is not just an add-on, an extra. On the logic of the supplement, concepts which are normally used to discuss a topic as reflected in keywords in an online discussion forum - but which are absent in the original argument – can be seen as ‘lacking’ in the argument. In turn, this can offer insights into repression or marginalisation in the argument (relative to the particular supplement). Furthermore, since keywords are generated non-arbitrarily, we have in turn a non-arbitrary basis for intervening in the argument. We can use these keywords to ‘add to replace’ what can be perspectivised as deficient in normal discussion of the argument’s topic, intervening to replace an absence inside the argument with keywords outside the argument. Via the logic of the supplement, the border between an argument and its discussion forum supplement is porous.  To be clear, my use of Derrida’s notion of the supplement is an appropriation of his work. Though Derrida is synonymous with an approach to critical reading called ‘Deconstruction’, I am not doing Derridean Deconstruction. While I appropriate the idea of supplements as being simultaneously inside and outside the things that are supplemented, this does not mean that I concur with Derrida’s vision where meaning is ultimately undecideable. Indeed, a corpus linguistic approach illuminates Derrida’s focus on undecideability in language and meaning to be misguided (see O’Halloran 2012).    Using the supplement to investigate deconstruction in an argument  The next stage is to trace the extent to which an intervention in the argument ‘to add to replace’ leads to instability in its cohesion. An argument’s rhetorical structure is dependent on effective cohesion. If cohesion is disturbed by this intervention, then the credibility of the argument diminishes.    The argument topic: ‘New Atheism’  Orientation I demonstrate the method of Electronic Deconstruction on an argument in an online version of a British newspaper.The argument consists of 926 words (42 sentences). The whole argument and the discussion forum appended to it can be found at: http://www.guardian.co.uk/commentisfree/2007/dec/30/thenewatheism. Written by the journalist Brendan O’Neill, the argument criticises ‘new atheism’, the atheism associated with thinkers such as Richard Dawkins. The entire argument rests on a rhetorical structural opposition: ‘old atheism’ (e.g. the atheism of Karl Marx) is good while ‘new atheism’ is bad. Using the corpus linguistic software WMatrix (Rayson 2008), O’Halloran (2010, 2011) generates keywords in the discussion forum appended to the argument.The discussion forum appended to the argument consists of 365 individual posts, which in total come to 69, 252 words. In order for keywords to be revealed, WMatrix compares the discussion forum with a reference corpus of around 1 million words of written English (which WMatrix accesses online).  ‘Faith’ is a keyword with high statistical significance, its meaning mostly equivalent to ‘religious belief’; ‘belief’ in the sense of ‘religious belief’ also has a high keyness value. Qualitatively examining how the keywords are used in discussion forum posts, I found that discussion of ‘new atheism’ is in relation to criticism of belief/faith in a supernatural power. That ‘religious belief’ or ‘faith’ are key concerns of ‘new atheism’ can be corroborated by examining relevant websites / books by ‘new atheists’In a three minute clip, Richard Dawkins summarises a central argument of ‘The God Delusion’: ‘The great majority of people on this planet do believe that there is some kind of a supreme being…historically it’s always been very important to people their belief in some sort of a supreme being…I give in the book the argument…that there is no supernatural supreme being and that belief in such a being can under some circumstances be rather a bad thing’ [my bold]. The clip can be viewed at:  http://www.amazon.com/The-God-Delusion-Richard-Dawkins/dp/0618918248/ref=sr_1_1?ie=UTF8&qid=1330788377&sr=8-1   [Accessed March 2012]. Turning my attention to the argument, ‘faith’ is absent from it and ‘religious belief’ is marginal, only occurring twice; in contrast, the argument contains 21 instances of the general category ‘religion’. O’Neill describes ‘new atheists’ as being critical of ‘religion’ generally rather than of ‘faith’ / ‘religious belief’ in a supernatural power. In sum, we can say that relative to normal discourse for ‘new atheism’ (as reflected in the discussion forum), there is a deficiency in the argument of ‘faith’ / ‘religious belief’.    Exploring possible deconstruction in rhetorical structure  Below is an example of deconstruction in O’Neill’s argument. Sentences 8-10 set up the rhetorical structure of ‘new atheism’ (bad) versus ‘old atheism (good)’: 8. History’s greatest atheists, or the ‘old atheists’ as we are now forced to call them, were humanistic and progressive, critical of religion because it expressed man’s sense of higher ethical purpose in a deeply flawed fashion [emphasis added]. 9. The new atheists are screechy and intolerant; they see religion merely as an expression of mass ignorance and delusion. 10. Their aim seems to be, not only to bring belief [in] God crashing back down to earth, but also to downgrade mankind itself [emphasis added]. Notice ‘new atheists’ are described as LOW and ‘old atheists’ as HIGH (see italics). What happens to the cohesion of this rhetorical structure if I ‘add to replace’ the deficiency of ‘faith’ and ‘religious belief’ in normal discussion of ‘new atheism’ (as reflected in the discussion forum) in sentences 9 and 10? (I do not intervene in sentence 8 since this relates to ‘old atheism’): 8. History’s greatest atheists, or the ‘old atheists’ as we are now forced to call them, were humanistic and progressive, critical of religion because it expressed man’s sense of higher ethical purpose in a deeply flawed fashion [emphasis added]. 9. The new atheists are screechy and intolerant; they see  {religion} religious belief merely as an expression of mass ignorance and delusion [emphasis added]. 10. Their aim seems to be, not only to bring belief [in] God crashing back down to earth, but also to downgrade mankind itself [emphasis added]. As a result of this intervention, the general category of ‘religion’ in sentence 8 is no longer in cohesion with this general category in sentence 9. Since the rhetorical structure of ‘old atheists’ = good / high and ‘new atheists’ = bad / low is dependent on this cohesion, the rhetorical structure can be said to deconstruct. Thus, once normal discourse for ‘new atheism’ is instituted, the argument can be evaluated as falling apart structurally.   ", "article_title": "Electronic Deconstruction of an argument using corpus linguistic analysis of its on-line discussion forum supplement", "authors": [{"given": " Kieran Anthony", "family": "O’Halloran", "affiliation": [{"original_name": "King’s College, University of London, UK", "normalized_name": "University of London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04cw6st05", "GRID": "grid.4464.2"}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}