{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " This paper reports on the completion and launch of the locative media app “Go Queer.” Taking the theorization, iteration, and development of “Go Queer” as a model and case study, the paper argues that locative media is uniquely suited to re/mediating queerness. It then proposes that these findings can be used as a framework and set of best practices for developing a variety of queer history applications.  Go Queer is a ludic, locative media experience that occurs on location, in the city, on the playful border between game and story, the present and the past, the queer and the straight, the normative and the  slant. The app takes the city of Edmonton’s queer history as its text, and produces a locative, spatialized narrative of that history by displaying text, images, video and audio in place at the actual locations where they occurred, thus creating what Richardson and Hjorth (2014, 256) call “the hybrid experience of place and presence.” The app invites its users to drift queerly through the city, discovering the hidden histories that always surround us, yet somehow remain just beyond our apprehension. It compiles these traces into a media layer that augments quotidian city space, juxtaposing the past onto the present, creating a deep, queer narrative of place. By bringing together the physical navigation of the contemporary city with the imaginative navigation of its queer past, the app enacts a praxis that I characterize as a  queer ludic traversal, one that renders the navigation itself as queer as the content that it presents. In so doing, the app produces the experience of  place, in Lucy Lippard’s (1997) formulation that  Place is latitudinal and longitudinal within the map of a person’s life. It is temporal and spatial, personal and political. A layered location replete with human histories and memories, place has width as well as depth. It is about connections, what surrounds it, what formed it, what happened there, what will happen there. (7) The app proposes that a productive and underrepresented setting for queer play is the space of the city itself, and that the hybrid reality of locative media provides specific affordances to enable particularly queer navigations, occupations, and constructions of urban space.  The app arises from, and takes shape in relation to, a range of theoretical inspirations. First are the contributions queer theories of space, the urban, and community, such as David Bell’s (2001) observation of “the special relationship between the city and the deviant” (84) and Theories recognizing the very public-ness of the formation, circulation, and inhabiting of queer identities (D’Emilio, 1983; Berlant and Warner, 1998); central here is Sara Ahmed’s theorization of “orientation” and her contention that “orientations are about the directions we take that put some things and not others in our reach” (552). New theorizations of space and place that have come to be called  the spatial turn have similarly mobilized our thinking, challenging us to imagine space as a complex social production (Lefebvre, 1992) and asking us to think through how we move in space as either  tactical or  strategic (deCerteau, 2011). Praxis-based interactivity, which I draw principally from the field of Game Studies, has introduced concepts like the fidelity context (Galloway 2004) and ambient experience (Flanagan 2009). Deep mapping offers new possibilities for modeling space, particularly historical space, by bringing together the explanatory and critical capacities of both narrative and mapmaking (Bodenhamer 2007). These theoretical methods intersect in locative media itself, the vehicle for “Go Queer” and a platform, I argue, that holds significant promise for queer scholarship and expression.  By exploring how each of these theoretical arenas is literalized in the app itself, this paper aims to provide a framework and method for other practitioners interested in deploying locative media technologies to engage queer subjects, histories, and cultural productions. ", "article_title": "Locative Media for Queer Histories: Scaling up \"Go Queer\"", "authors": [{"given": "Maureen", "family": "Engel", "affiliation": [{"original_name": "University of Alberta, Canada", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}], "publisher": "Name, Institution", "date": "2018", "keywords": ["technologies", "geohumanities; spatial & spatio-temporal analysis", "queer studies", "modeling", "public humanities and community engaged scholarship", "cultural studies", "feminist studies", "visualization", "English", "gender studies"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}