{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "“Counting Words with Henry James” undertakes text analysis and topic modelling to demonstrate how the digital humanities participates in the recent turn in literary theory from the “hermeneutics of suspicion” to what Rita Felski calls post-critical or “reflective reading.” I argue that critiques of the digital humanities as being anti- or even non-theoretical fundamentally misrecognize its alliance with such recent theoretical initiatives. Instead, the self-critical methodologies of digital humanities also manifest the “the intricate play of perception, interpretation, and affective orientation” that characterizes critical reading after suspicion. Thus, I ultimately hope to move beyond the unfortunate associations of quantitative literary analysis with “not reading” or data crunching by offering a different theoretical vocabulary for its continuing work in partnership with literary theory. At the same time, I propose that the emerging theoretical program of “reflective reading” can address methodological insufficiencies in how quantitative analysts move from data to interpretation or from signal to concept.", "article_title": "Counting Words with Henry James: Towards a Quantitative Hermeneutics", "authors": [{"given": "Paul", "family": "Fyfe", "affiliation": [{"original_name": "Florida State University, United States of America", "normalized_name": "Florida State University", "country": "United States", "identifiers": {"ror": "https://ror.org/05g3dte14", "GRID": "grid.255986.5"}}]}], "publisher": "University of Nebraska-Lincoln", "date": "2013", "keywords": ["data mining/ text mining", "cultural studies", "historical studies", "english studies", "text analysis", "corpora and corpus activities", "digital humanities - nature and significance", "history of Humanities Computing/Digital Humanities"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}