{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " This paper will analyse narrative style in selected fiction of Beckett (French and English versions). It will use computational stylistics for a formalist discrimination of patterns of language in the texts and will thus begin with a descriptive base. Previous published work by Burrows, Love, Craig, Holmes, Forsyth, Tweedie, Baayen, and Smith has shown the strength of computational procedures, particularly in such areas as the identification of authorship, genre, period, and character. This present work builds upon these foundations by examining issues in narrative theory and translation theory, with particular reference to Bakhtin's ideas on the way different discourses interact. Whilst Bakhtin recognised \"the positive influence of Formalism\" (1986: 169) he exposed its limitations, recognising the need to extend analysis to broader cultural issues. If, as Bakhtin argues, all utterance is ideologically governed and can never be neutral then the differentiations in language patterns revealed in our work cannot be construed as merely linguistic phenomena. That would be to rest with the formalist approach that Bakhtin wished to move beyond. The cultural questions arise as soon as one applies Bakhtinian concepts. Beckett is highly appropriate for such an investigation given the complexity, subtlety, and significance of his narrative experiments. When Beckett came to consider an English version of Molloy, which had been written in French in 1947 and published in 1951, he talked of producing a \"new\" text. To ask in what sense the text might be \"new\" is to open the large question of what can be and what cannot be achieved in translation - a question whose implications range from the immediate practical realities of searching for the nearest equivalent of a given word to the philosophical issues pertaining to language and how it means. At the philosophic level, translation raises ontological questions, the very questions raised by Molloy himself early in the text: \"But my ideas on this subject were always horribly confused, for my knowledge of men was scant and the meaning of being beyond me\" (52). The reference to a distinctive phrase in Heidegger's work alerts us to the link between the problem of translation and central ideas in Beckett's trilogy: commentators such as O'Hara argue, for example, that Beckett's work 'could almost be seen as a literary exploration of Heideggerian metaphysics', and that Beckett's fundamental inquiry in the trilogy centres around the question of how language means. This question then becomes refocussed through consideration of what can be achieved in translation. Heidegger's reservations about the way in which translation violates meaning in the source text appear eventually to be taken up by Beckett, who is reported as stating during a London rehearsal of Endgame: \"The more I go on the more I think things are untranslatable\" (Cockerham 1440. This issue of 'untranslatability', Steiner argues, 'is founded upon the conviction, formal and pragmatic, that there can be no true symmetry, no adequate mirroring, between two different semantic systems' (1975: 239). Expanding this argument concerning 'semantic dissonance' Steiner writes that 'Because all human speech consists of arbitrarily selected but intensely conventionalized signals, meaning can never be wholly separated from expressive form. Even the most purely ostensive, apparently neutral terms are embedded in linguistic particularity, in an intricate mould of cultural-historical habit. There are no surfaces of absolute transparency.' Patterns of prepositionality or conjunctivity, such as emerge in our analyses as a feature both of Beckett's English and French versions, impact upon our understanding of each text's meaning. How might these patterns influence our reading of Beckett? Does Beckett provide one work of literature called Molloy, or does that title mask two works of literature? How different is it really to read Beckett in French as opposed to reading him in English? These questions have not, I believe, been addressed in quite the way that this project proposes. The closest work is that of Opas (1995), who has studied translations of Beckett's How It Is and All Strange Away into Finnish, German, and Swedish. Using the University of Toronto's TACT program as the basis for her computational analysis, and applying the postulate of van Leuven-Zwart (1989,1990) that 'if there are enough consistent changes between a text and its translation on the microstructural level, it will affect the macrostructure of the text also', she has provided evidence of the ways in which common words influence syntactic structures and of how translations of them can influence the meanings we read in a text. The research data used in this paper derives from analyses of word frequencies, using established statistical techniques (e.g. principal component analysis, t-test, Mann-Whitney test). In order to produce this computational evidence texts are first prepared for the computer programs in accordance with protocols developed by Burrows. Frequency counts are established for each of the 99 most common words in the texts. These counts are standardized to allow for the variations in the total size of each section of text and each count is correlated with every other count so as to produce a matrix (using the Pearson product-moment method of correlation). We also use a technique of multivariate statistics known as principal component analysis and plot the results so as to show the relationships between the variables in the data. The plots show which words behave most like each other and which sections most resemble each other in their word-frequency patterns. The significance of this evidence is further tested by using distribution tests such as the t-test and Mann-Whitney test, which assess whether the variations in the data occur at a level of probability that statisticians would deem likely to be an effect of chance or a significant outcome. These procedures enable identification of the words that discriminate significantly - in computational terms - between narrative styles. The discriminating words will also be examined through \"scatter plots\" which generate the scatter of values for each word in each section of the text. This procedure will reveal how sporadically or consistently each word discriminates in a particular comparison. Although this research therefore begins with computational evidence, it will move from the quantifiable data to consider the literary significance of a word's use in context. As McCarty (1996) writes, \"no tool is 'just a tool' but is an agent of perception and means of thinking\". Common words are significant because they point to the larger linguistic structures in which they participate. With Beckett's work, investigations of stylistic differentiation show how translated texts maintain in the second language similar kinds of discriminations as those operating in the first language. The present work on a range of Beckett's early, middle, and late fiction extends previously published work by McKenna, Burrows, and Antonia on Molloy (1999) and on the trilogy (1999 forthcoming). ", "article_title": " The Statistical Analysis of Style: How Language Means in Beckett", "authors": [{"given": "C.", "family": "McKenna", "affiliation": [{"original_name": " The University of Newcastle, Australia  ", "normalized_name": "University of Newcastle Australia", "country": "Australia", "identifiers": {"ror": "https://ror.org/00eae9z71", "GRID": "grid.266842.c"}}]}], "publisher": " University of Glasgow ", "date": "2000", "keywords": ["Stylistics"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}