{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In his seminal work on Austen, John F. Burrows demonstrates that characters can be distinguished from each another on the basis of the frequencies of the most frequent words of their dialogue treating the characters as if they were authors (1987). Computational stylistics has also been used to study the distinctive interior monologues of Joyce’s characters in Ulysses (McKenna and Antonia 1996), the styles of Charles Brockden Brown’s narrators (Stewart 2003), style variation within a novel (Hoover 2003), and the interaction of character separation and translation (Rybicki 2006). Here I address two kinds of local style variation: the multiple narrators of Wilkie Collins’s The Moonstone (1868) and the multiple letter writers in Hannah Webster Foster’s sentimental American epistolary novel The Coquette (1797). The Moonstone has several narrators whose styles seem intuitively distinct, though all the narrations share plot elements, characters, and physical and cultural settings. The Coquette, based on an infamous true story, and very popular when it was published, is read today more for its cultural signifi cance and its proto-feminist tendencies than for its literary merit. Nevertheless, one would expect the coquette, the evil seducer, the virtuous friend, and the disappointed suitor to write distinctively. Treating the narrators and letter writers of these two novels as different authors will test how successfully Collins and Foster distinguish their voices and shed light on some practical and theoretical issues of authorship and style. Computational stylistics cannot be applied to narrators and letter writers of these novels, however, unless they can distinguish Collins and Foster from their contemporaries. Experiments on a 10-million word corpus of forty-six Victorian novels confi rm that Collins is easily distinguished from fi ve of his contemporaries, as shown in Fig. I. For The Coquette, I have made the task more diffi cult by comparing Foster’s letter writers to those of fi ve other late 18th-century epistolary novels by fi ve authors. I separated all the letters by writer and addressee and retaining only the 22 writers with the most letters, then combined the letters between each single writer and addressee and cut the combined texts into 42 sections of about 3,500 words. Both Delta and cluster analysis do a good job on this diffi cult task, and many Delta analyses give completely correct results. Cluster analysis is slightly less accurate, but several analyses are correct for fi ve of the six authors; they also show that individual letter writers strongly tend to group together within the cluster for each novel (see Fig. 2). Examining the individual novels reveals a sharp contrast: Collins’s narrators are internally consistent and easy to distinguish, while Foster’s letter writers are much less internally consistent and much more diffi cult to distinguish. For Collins, cluster analysis consistently groups all narrative sections of 6 of the 7 narrators. When a modifi ed technique developed especially for investigating intra-textual style variation is used (Hoover 2003), the results are even better. As Fig. 3 shows, all sections by all narrators sometimes cluster correctly (the sections range from 4,300 to 6,900 words). “Tuning” the analysis to produce better clustering may seem circular in an analysis that tests whether Collins’s narrators have consistent idiolects. But this objection can be answered by noting the consistency of the groupings. The stable clustering across large ranges of analyses with different numbers of MFW that is found here is obviously more signifi cant than frequently-changing clustering. Note also that the sections strongly tend to occur in narrative order in Fig. 3: every two-section cluster consists of contiguous sections. This “echo” of narrative structure provides further evidence that the analysis is accurately characterizing the narrators’ styles. A fi ne-grained investigation of The Moonstone involving smaller sections and including more narrators puts Collins’s ability to differentiate his narrators to a sterner test, but some cluster analyses are again completely correct. The distinctiveness of the narrators of The Moonstone is thus confi rmed by computational stylistics: the narrators behave very much as if they were literally different authors. Given the length of the novel, the generic constraints of narrative, and the inherent similarities of plot and setting, this is a remarkable achievement. For my analysis of The Coquette, I have added 3 more sections of letters, so that there are 13 sections of approximately 3,000 words by 6 writers, with separate sections by a single writer to two different addressees. Although these sections should be considerably easier to group than those in the fi ne-grained analysis of The Moonstone, the results are not encouraging. Cluster analyses based on the 300-700 MFW produce very similar but not very accurate results, in all of which letters by Boyer and Eliza appear in both main clusters (see Fig. 4). Lucy’s letters to Eliza also cluster with the last section of Eliza’s letters to Lucy in all of these analyses a misidentifi cation as strong as any correct one. In a real authorship attribution problem, such results would not support the conclusion that all of Boyer’s or Eliza’s letters were written by a single author. Perhaps one could argue that Boyer’s letters to Selby should be different from his letters to Eliza, and perhaps it is appropriate that Eliza’s last section includes only despairing letters written after Boyer has rejected her. Yet such special pleading is almost always possible after the fact. Further, any suggestion that Boyer’s letters to Eliza should be distinct from those to Selby is impossible to reconcile with the fact that they cluster so consistently with Eliza’s early letters to Lucy. And if Eliza’s early and late letters should be distinct, it is diffi cult understand the clustering of the early letters with those of Boyer to Selby and the consistent clustering of the late letters with Lucy’s letters to Eliza. It is diffi cult to avoid the conclusion that Foster has simply failed to create distinct and consistent characters in The Coquette. In contrast, Fanny Burney, whose Evelina is included in the novels compared with The Coquette, above, creates very distinct voices for the letter writers. Although only four of the writers have parts large enough for reasonable analysis, Evelina writes to both her adoptive father Mr. Villars and her friend Miss Mirvan, and Villars writes both to Evelina and to Lady Howard. One might expect signifi cant differences between letters to these very different addressees. Evelina’s style might also be expected to change over the course of this bildungsroman. However, analyses of all 34 sections of letters from Evelina (approximately 2,500 words long), show that Burney’s characters are much more distinct and consistent than Foster’s, as a representative analysis shows (see Fig. 5). This dendogram also strongly refl ects the narrative structure of the novel. Burney, like Collins, is very successful in creating distinctive voices for her characters. Criticism of Foster’s novel has paid little attention to the different voices of the characters, but what commentary there is does not suggest that the patterns shown above should have been predictable. Smith-Rosenberg, for example, suggests a contrast between Eliza and “the feminized Greek chorus of Richman, Freeman, and Eliza’s widowed mother, who, at the end, can only mouth hollow platitudes” (2003: 35). Although these women and Julia are often considered a monolithic group urging conventional morality, the distinctness of Julia’s sections, especially from Lucy’s (see Fig. 5) might suggest a reexamination of this notion, and might reveal how the styles of Julia and the other women are related to more signifi cant differences of opinion, character, or principle. Various suggestions about changes in Eliza over the course of the novel might also benefi t from a closer investigation of the language of the letters. Because Foster’s novel is of interest chiefl y on cultural, historical, and political grounds rather than literary ones, however, such an investigation is more likely to advance the theory and practice of computational stylistics than the criticism of The Coquette. It is clear, at any rate, that computational stylistics is adequate to the task of distinguishing narrators and letter writers, so long as the author is adequate to the same task.", "article_title": "The Moonstone and The Coquette: Narrative and Epistolary Styles", "authors": [{"given": "David L. ", "family": "Hoover", "affiliation": [{"original_name": "New York University, USA", "normalized_name": "New York University", "country": "United States", "identifiers": {"ror": "https://ror.org/0190ak572", "GRID": "grid.137628.9"}}]}], "publisher": null, "date": "2008", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}