{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Digital technologies are facilitating a renaissance of large-scale oral history projects (Gallwey, 2013; Thomson, 2007). Big oral history projects enjoyed a heyday in the 1970s and 1980s. They were often led by sociologically trained historians who sought to create interview samples of sufficient size and diversity to enable ‘the larger insights or generalizations’ that we might gain by finding patterns across many interviews. But large oral history projects ‘receded from view’ by the 1990s as funding dried up for the expensive task of producing and transcribing multiple interviews (Armitage and Gluck, 2006). Just as important, as Armitage and Gluck acknowledge, was the redirection of researcher energy to the cultural or narrative ‘turn’ in oral history (and in history more generally), in which oral historians focused on the  meanings of oral narratives and mostly found it easier, and cheaper, to find and interpret those meanings if they worked with a small number of interviews.   Twenty-first-century technologies have made large oral history projects feasible and attractive again, by offering new tools for creating, managing, and accessing large collections of interviews. Digital technologies are transforming the creation, preservation, presentation, and use of oral history, whilst generating methodological challenges and stretching old ethical dilemmas in new directions (Boyd, 2011; 2013; Frisch and Lambert, 2011; Lambert and Frisch, 2013; Larson, 2013; High, 2010; Zembrzycki, 2013. See also the resources and essays on the Oral History in the Digital Age website, http://ohda.matrix.msu.edu/).  The Australian Generations Oral History Project, an ARC-funded collaboration between university historians, the National Library of Australia, and ABC Radio National, has pioneered digital technologies for oral history (see http://artsonline.monash.edu.au/australian-generations/). A team of nine researchers and 25 interviewers has recorded 300 life history interviews with 50 people born in each decade from the 1930s to the 1980s. We have produced 1,221 hours of digital audio recordings that are searchable via TROVE, the NLA’s aggregation and discovery system, and which will be available for online research, subject to consent agreements, by anyone, anywhere, forever.  Our presentation will focus on how we are preserving and documenting our interviews, and presenting and interpreting them through writing in online formats that integrate aural material. We consider the opportunities and challenges posed by an internationally cutting-edge timed summary system linked to hundreds of hours of digital audio recordings and searchable online via TROVE (Bradley, 2014); an interviewer Google site that collected interviewer discussion forum postings about each of 300 life history interviews and offers an essential finding aid to the interviews; a ZOTERO database that combines the different types of data produced by the project, which grows as researchers add notes about each interview and which will, in due course, be available to future researchers; and an aural history book that enables readers/viewers to listen to interview extracts as they read them, and to discover the aural meanings of recorded interviews. Each technological innovation has posed significant ethical issues, which we will examine in our presentation (for example, each interviewee completes an NLA Rights Agreement that specifies conditions for use of their interview, but in some cases we have closed interviews that interviewees wish to place online because of contents that are potentially defamatory or that reveal illegal activity). ", "article_title": "Making Digital Aural History", "authors": [{"given": "ALISTAIR", "family": "THOMSON", "affiliation": [{"original_name": "MONASH UNIVERSITY, Australia", "normalized_name": "Monash University", "country": "Australia", "identifiers": {"ror": "https://ror.org/02bfwt286", "GRID": "grid.1002.3"}}]}, {"given": "KEVIN", "family": "BRADLEY", "affiliation": [{"original_name": "NATIONAL LIBRARY OF AUSTRALIA", "normalized_name": "National Library of Australia", "country": "Australia", "identifiers": {"ror": "https://ror.org/04yvjg468", "GRID": "grid.453984.7"}}]}], "publisher": "Paul Arthur, University of Western Sidney", "date": "2015", "keywords": ["digitisation", "repositories", "historical studies", "libraries", "archives", "museums", "video", "audio", "sustainability and preservation", "English", "multimedia", "GLAM: galleries", "resource creation", "data mining / text mining", "and discovery", "folklore and oral history"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}