{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "As twenty-first century Australian citizens, the main way in which we “do” democracy is through the media. Every important issue in public life comes to us via the mass media, almost always structured as some form of ‘argument’. It is therefore important that these arguments are not only analysed, dissected and evaluated, but are also presented in ways that enable as wide a section of the population as possible to understand them, so that when citizens engage in deliberation about public issues, their dialogue will be logical, systematic and dialectical. Dialectic is two-sided. It is argument that is constructive and balanced. Now more than ever, at a time when “social, cultural and religious issues are of growing significance due to the insecurities of globalization and the increasing role of non-state players in the security environment” (Aust. Govt. 2004-2005: 9), we need not only greater scrutiny of mediatised arguments, but also stronger strategies for “[E]nhancing our nation’s understanding of social, political and cultural issues [which] will help Australia to engage with our neighbours and the wider global community and to respond to emerging issues” (Aust. Govt.: 8) To this end, my aims are threefold: to analyse a range of important public issues presented as arguments in the newspapers read by the majority of Australians, using the argument-diagramming computer software Araucaria (Reed and Rowe 2001); to evaluate each argument thus represented as diagrams, assessing each one in terms of its logical and dialectic reasoning; lastly, to use the diagrams to develop strategies for maximizing public understanding of important issues. A discussion of a small section of the research leading to the first two aims forms the content of the current paper, research that involves the trialling of the conjunction of argumentation schemes (Walton 1996) with the software Araucaria (Reed and Rowe 2001), capable of diagramming the construction of reasoning in a particular set of argumentative texts. The texts analysed are two sets of ‘columns’ of argumentative journalism (‘op-eds’) from the two ‘rival’ daily newspapers in Melbourne Australia, The Age, and the Herald Sun (the readership of both together comprising the largest per-capita newspaper reading population in Australia), owned respectively by Fairfax Ltd., and Rupert Murdoch’s News Ltd. Research of this type has not been done before in Australia in relation to newspaper arguments. Despite many studies on propaganda, bias, ethics, and news framing in the media, often focusing on the Australian media (see for example Hirst and Patching 2005), systematic empirical research into argumentative structures of news writing is tantalizingly absent. Not only is it important that mediated arguments be subject to analysis and critique, but also that the findings from such research be presented so that a wide section of the public can understand logical argument structures, and thus learn to decide for themselves whether arguments in the media are logically and dialectically reasoned. This is turn will aid citizens to engage optimally in deliberation about important public issues. Research suggests that currently this is not occurring (Kuhn 1991, Van Gelder 2003). As Van Gelder states: “Deliberation is a form of thinking in which we decide where we stand on some claims in the light of the relevant arguments. It is common and important, whether in our personal, public or working lives. It is also complicated, difficult and usually poorly done” (Van Gelder 2003, emphasis added). My project seeks to address this problem by presenting some of the results in computer-generated graphic format—by making argument maps. In this way, the inconsistencies, biases, and other fallacies will be able to be clearly understood by as wide a section of the public as possible. The benefit of such maps over verbal explanations has been articulated by Van Gelder (2003): “Although prose is the standard way to present reasoning, it is not a good tool for the job. Extracting the structure of evidential reasoning as typically presented in prose is very difficult and most of the time we do it very badly…” It is hoped that my project will serve to make argument-mapping more widely known and understood, in terms of both its use in assessing arguments presented in the media, as well as in its potential to improve reasoning and deliberation in the public sphere. It is likely that some or many arguments will be found—by way of the argument-diagramming and subsequent evaluation—to be one-sided or dialectically ill-reasoned. The proportion found to be like this will have a major bearing on the conclusions of my project. If, for example, the majority of the arguments are found to be invalid, and not to contain a sequence of reasoning, this has serious implications for public understanding of and reasoning about important issues—that is, the skills of deliberation. Some research has suggested that these skills are not possessed by up to half the population (Kuhn 1991). But is this inability to deliberate over public arguments due to lack of “basic reasoning and argument skills”, or due to arguments presented by the media in ways that are illogical, faultily-reasoned or one-sided? Is it possible that flawed or fallacious arguments in the public sphere might in some way be causally linked to this lack of basic reasoning and argument skills, and so to the inability of many to deliberate over important issues? Such questions underpin the aims of my project, because deliberation is crucial in any public sphere, not simply because it is about achieving consensus, but rather because it about seeking knowledge.", "article_title": "Our Daily Dose of Rhetoric : Patterns of Argument in the Australian Press", "authors": [{"given": "Carolyne ", "family": "LEE", "affiliation": [{"original_name": "Media & Communications Department,     University of Melbourn", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}