{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Narrative, as it evolves with technological developments, constantly reinvents itself in order to better capture new social orders and individual experiences. As an emerging cultural expression, however, most computer-generated narrative works are still restricted to an action-based, goal-driven aesthetics, leaving little space for characters’ inner world. This paper proposes to expand the range of computer-generated narrative by addressing this imbalance between the “physical” and the “internal.” It presents our approach for algorithmically narrating characters’ inner world by leveraging the synergy between modernist stream of consciousness literature and contemporary research in artificial intelligence and cognitive science. The Riu system, a text-based computational narrative system inspired by Woolf’s novel Mrs. Dalloway, is provided as a case study towards this new direction.  Computer-Generated Narrative Contemporary forms of narrative have evolved rapidly as digital technologies continue to be integrated in modern society. New conventions at the levels of both content and discourse have been established to reflect the constantly changing relationship between human and technology. For instance, popular science fictions of the 1980s (e.g., The Terminator) embodied the prevailing cyborg discourse and confusions of human identity within the Cold War context (Edwards, 1996). Similarly, hypertext fictions in the 1990s instantiated the postmodernist mentality of its time by turning everything – writer, reader, and society – into fragments (Johnson-Eilola, 1997). In this regard, the emerging form of computer-generated narrative,Although this paper focuses on text-based narratives generated by computer algorithms, the core of the discussion can be extended to other computational narrative forms, such as video games. that is, stories produced by computer algorithms, may offer an important cultural expression to portray our increasingly technology-dependent modern life. Compared to other forms of electronic literature (e.g., hypertext fictions), the strict technological requirements for computer-generated narrative have confined its development largely to the computer science community, particularly artificial intelligence (AI). Over the past decades, serious attempts have been made to integrate narratology theory into existing AI framework for story generation (Bringsjord & Ferrucci, 2000; Cavazza & Pizzi, 2006; Mateas, 2002; Meehan, 1976). Despite the considerable progress the community has made, the expressive power of computer-generated narrative is still limited compared to its non-digital antecedents. In particular, this paper is concerned with the prominent goal-driven, problem-solving aesthetics that dominate many story generation systems. A salient example is the Tale-Spin system (Meehan, 1976), which generates stories in the spirit of: Joe Bear was hungry; Joe couldn’t reach his food because of certain obstacles; Joe resolved the issues; Joe got his food.  It is true that recent narrative systems have evolved in numerous aspects since then. Nevertheless, this ultra-rational, \"behaviorist\" narrative style, afforded by Meehan’s now-widely-adopted planning-based framework, has remained and been taken for granted by many practitioners. As we become more aware of digital media’s capability of constructing subjective mental imagery and evoking users’ imagination and awareness (Harrell, 2009), it is crucial to revisit some of these early assumptions of computer-generated narrative and critically understand the expressive affordances as well as restrictions of the computational techniques that we use.  This paper proposes to expand the spectrum of computer-generated narratives by focusing on the richness of characters’ inner world, hidden behind the external world of actions. This approach aligns with modernist writers’ concerns of depicting \"hidden life at its source\" (Woolf, 1957 [1925]). Notice this is not a strong AI attempt to model human (semi-)consciousness. Instead, the goal is to explore new ways of conveying human subjectivity and life stories by algorithmically generating narratives that are reminiscent of similar phenomena. Informed by modernist literary techniques (particularly Virginia Woolf’s work), cognitive science discoveries and AI, this paper proposes a new approach for generating inner narratives and presents initial results from our on-going narrative project Riu.   Synergy of the Old and New As argued elsewhere (Zhu & Harrell, 2010 (forthcoming)), the overlooked synergy between stream of consciousness literature, artificial intelligence (AI), and cognitive science provides valuable insights to generating stories about characters’ inner world. In their respective historical contexts, both stream of consciousness literature and AI challenged the domination of behaviorism by turning internally to the human psyche. Rejecting the literary representation of characters as the \"external man\", modernist writers such as Virginia Woolf and James Joyce invented techniques to depict the moment-by-moment psychic existence and functioning of the \"internal man\" (Humphrey, 1954). Similarly, AI broke away from the behaviorism-dominated scientific community in the 1950s and legitimated human mental constructs, such as knowledge and reasoning, as crucial subjects of scientific inquiries. The differences between AI and modernist literature further dissolve when we take account of recent cognitive science theory, a sister field of AI. Stream of consciousness literature’s key concern with pre-speech level of consciousness, minimally mediated by rationality and language, is echoed by new discoveries in cognitive linguistics. Recent research (Fauconnier & Turner, 2002) has confirmed that the vast cognitive resources of \"backstage cognition\" are called up unconsciously when we engage in any language activity.   Generating Inner Narratives Generating narratives about characters’ inner world requires innovation at the story content, discourse and algorithmic levels. The techniques in stream of consciousness literature offer invaluable insights into literary representations of inner life, such as Woolf’s loosely structured plot, the \"caves\" of characters’ past (Woolf, 1957 [1925]), and various modes of interior monologues (Cohn, 1978).  The insights from planning-generated stories illustrate the impact of underlying computational techniques. Substantial changes at the algorithmic level therefore are needed to incorporate the new content and aesthetic requirements. As we have argued (Zhu & Ontañón, 2010), computational analogy, influenced by related cognitive science studies, is one of the promising directions towards our goal. Its emphasis on similarities and associations between different constructs is particularly useful to establish connections between external events and inner thoughts (e.g., the action of \"buying flowers\" and flower-related memories). Computational analogy may also be used to depict \"the train of thoughts\" by connecting a sequence of related events, one after another.    Case Study: Riu Our generative narrative project Riu is an on-going attempt to computationally generated stories about characters’ inner world. Inspired by Woolf’s novel Mrs. Dalloway (Woolf, 2002 (1925)), this project harnesses computational analogy at different levels of story generation for various narrative effects (Zhu & Ontañón, 2010). Similar to our earlier conceptual-blending-based (Fauconnier & Turner, 2002) project Memory, Reverie Machine (Zhu & Harrell, 2010 (forthcoming)), Riu is explicitly geared towards algorithmically narrating characters’ inner world, through the depiction of characters’ unrolling thoughts and subjective variations of such thoughts based on user interaction. An excerpt of system output at the current stage of development can be found in Fig 1.   Figure 1. Sample output of Riu (including user input)   Rather than ordering events in ways that lead to a desired goal, as in many planning-based systems, Riu adopts the computational analogy algorithm of structural mapping (Falkenhainer, Forbus & Gentner, 1989; Gentner, 1983) to connect external events with inner thoughts. The overall plot is loosely structured with potential inner thoughts between various external events. The overall story intends to invoke what Woolf described as \"no plot, no comedy, no tragedy, no love interest or catastrophe\" (Woolf, 1957 [1925]) and thus focuses primarily on characters’ psyche.  In Fig 1, the protagonist’s memory of a pet bird (italicized) is triggered because of its similarity to his encounter of another animal in the external story world. Importantly, inner events such as memories in Riu also have a significant impact on the protagonist’s external actions. In the case of Fig 1, when the user chooses to play with the cat on the street, the system infers that this action may, again, lead to the death of the cat and hence the protagonist’s sadness. In order to prevent that from happening, the system ignores this user command and removes \"play\" from the next user input options.  In conclusion, computer-generated narrative is an important frontier in digital humanities as a potential cultural expression innate to our contemporary society. Drawn on the synergy between stream of consciousness literature, artificial intelligence, and cognitive science, this paper proposed a new approach for expanding its narrative spectrum and focusing on characters’ inner world with its connection to external behaviors and environments. The Riu system was used to illustrate the initial results of our work, which suggests new expressive possibilities afforded by our approach.  ", "article_title": "Towards a Computational Narration of Inner World", "authors": [{"given": " Jichen", "family": "Zhu", "affiliation": [{"original_name": "Department of Digital Media, University of Central Florida USA", "normalized_name": "University of Central Florida", "country": "United States", "identifiers": {"ror": "https://ror.org/036nfer12", "GRID": "grid.170430.1"}}]}], "publisher": "Centre for Computing in the Humanities, King's College London", "date": "2010", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}