{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Stylometry, the automated examination of texts in search of characteristic patterns that reveal clues to the author (genre, et cetera) of the text, is a well-studied problem with a rich history. In general terms, the standard approaches used involve calculating statistics of linguistically salient events [such as function word distributions (Burrows, 1989), common lexical cooccurences (Hoover, 2002), or character subsequences (Juola, 2002)] in texts of known authorship. These statistics form the basis for similarity-based inferences about texts of unknown authorship; similar methods can be used to \"attribute\" other aspects of text such as genre, time of writing, sex/age/background of author, and so forth. However, not all human-created \"documents\" are, strictly speaking, texts. There is a wide variety of what can be called \"paralinguistic\" data which shares several properties with standard linguistic/textual data. One example (among many) of this sort of data would be music. Both on the printed page and on the CD, music can be clearly seen to be a sequence of (relatively) independent events with a given probability distribution. Furthermore, these events are not uniformly random, but structured in such a way that certain patterns repeat. Even the terms used by musicians, such as \"phrases,\" can be evocative of linguistic phenomena. In this paper, it is argued that the statistical variation present in music can be examined with an eye to performing the same sort of stylometric analysis and to determining the \"author\" (= composer and/or performer), \"genre,\" and so forth. As with conventional stylometry, the analytic process involves three basic steps : canonization of the source \"document\" to insure that similar \"events\" are treated identically determination of the event set of interest and calculation of the statistical distributions inferential statistics to determine the composer/performer Some examples of how each of these steps can be performed in a a computationally tractable fashion will be presented. The results of preliminary experiments are extremely encouraging. Samples were collected of a number of polyphonic recordings from various records of two musical groups. An extremely naive analysis, using histograms of bytes, was nevertheless capable of distinguishing the groups with high accuracy. Even with this level of naivete, the results are \"statistically significant.\" (p < 0.05, using a binomial test) Refinements of various sorts can be deployed to increase the accuracy and reliability of these results. On a more theoretical level, these results show not only that \"composership\" attribution is a practical and solvable problem for non-linguistic musical data, but also that stylometric analysis is practical for other types of paralinguistic data than pure text. From a practical standpoint, this sort of analysis may eventually make it possible to develop musical analysis, search, and retrieval tools similar to existing search engines and text processing tools. Finally, this research raises the question about what other sorts of properties might be useful and accessible for performing other forms of \"document\" classification.", "article_title": "On Composership Attribution", "authors": [{"given": "Patrick", "family": "Juola", "affiliation": [{"original_name": "Duquesne University", "normalized_name": "Duquesne University", "country": "United States", "identifiers": {"ror": "https://ror.org/02336z538", "GRID": "grid.255272.5"}}]}], "publisher": null, "date": "2004", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}