{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The assumption that authorial style changes over time is a reasonable one that is widely accepted in authorship attribution. Some important studies concentrate on individual authors, using a wide array of methods, and yielding varied results, however, so that is unwise to generalize (see the overview in Stamou 2007). Henry James’s style, for example, changes in a remarkably consistent and extreme way (Hoover 2007), and Austen’s stylistic development also seems consistent (Burrows 1987), but Beckett’s texts are individually innovative without showing consistent trends (Stamou 2007: 3). For some authors, different investigators have obtained inconsistent results. We know of no general study that investigates how authorial style changes over a long career. We thus explore how working and otherwise living abroad for periods exceeding two years may affect an author’s vocabulary and style. Our presentation begins a broadly based study of the growth and decay of authorial vocabulary over time. Although we limit our study to nineteenth-century prose, to reduce the number of possible variables to a manageable level, we compare French and English authors, allowing us to test whether any discovered regularities are cross-linguistic. Because authors’ vocabularies seem related to their life experiences, we compare authors who spent most of their lives in a single geographical area with others who traveled and lived extensively abroad. For the purposes of this study, we defi ne extensive living and working abroad as at least two consecutive years, somewhat longer than the contemporary American student’s or faculty member’s stay of a semester or a year. This differentiation allows us to investigate in what signifi cant ways, if any, extensive foreign travel affects an author’s vocabulary. Our investigation of these questions requires a careful selection of authors and texts. Although research is still ongoing, we have selected the following eight authors–two in each of the four possible categories–for preliminary testing and further biographical study: Domestic authors: English • George Meredith (1828-1909). German schooling at age fi fteen, but apparently no signifi cant travel later; fi fteen novels published between 1855 and 1895 available in digital form. • Wilkie Collins (1824-1889). No foreign travel mentioned in brief biographies; 20 novels available over 38 years. French • Honoré de Balzac (1799-1850). He traveled little outside of France until 1843. Subsequent excursions abroad in the last seven years of his life, mainly for romance, were relatively infrequent and never exceeded fi ve consecutive months. Over two dozen novels in digitized format are available. • Jules Barbey d’Aurevilly (1808-1889). Raised in France and schooled in the law, he was devoted to his native Normandy and seldom ventured abroad. Initially cultivating the image of the dandy, his novels and novellas create a curious paradox in his later writing between sexually suggestive themes and nostalgia for earlier aesthetics and a defense of Catholicism. His literary productivity can be divided into the three periods of 1831-1844 (fi rst published novel and novella), 1845-1873 (return to Catholicism; work as both literary critic and novelist), and 1874-1889. At least fourteen novels or novellas are available in digitized format. Traveling authors: English • Dickens (1812-1870). Seven novels available 1836-43, foreign travel for 3 yrs 1844-47, and more travel in 1853-55; four novels after 1855 available. • Trollope (1815-1883). Travel to Brussels in 1834, but briefl y; six novels available before 1859, Postal missions to Egypt, Scotland, and the West Indies, 1858-59; 1871 trip to Australia, New Zealand, and US; travel to Ceylon and Australia, 1875, South Africa 1877, Iceland 1878; fi ve novels available after 1878. French • Arthur de Gobineau (1816-1882). Raised partly in France, partly in Germany and Switzerland, he learned German and began the study of Persian in school while his mother, accused of fraud and estranged from her military husband, kept the family a step ahead of the French police. Three periods encompassing his publication of fi ction and often related to career travel can be divided as follows: 1843- 1852 (at least 4 novellas and 1 novel); 1853-1863 (1 novella); 1864-1879 (10 novellas, 2 novels). Living mainly in France from 1831-1849, he was a protégé of Alexis de Tocqueville, who brought him into the French diplomatic service in 1849. Gobineau was then stationed in Switzerland and Germany (1849-1854), Persia (1855-1858, 1861-1863), Newfoundland (1859), Greece (1864-1868), Brazil (1868- 1870) and Sweden (1872-1873). Following travel through Europe in 1875-77, he left the diplomatic service. His fi rst short fi ction was published and serialized in 1846. At least a dozen novellas written throughout his career (mostly written and published as collections) and two novels (1852 and 1874) are available in digitized format. • Victor Hugo (1802-85). Raised in France except for a six-month period in a religious boarding school in Madrid (1811-12), Hugo began writing his fi rst novel, Bug-Jargal (1826) in 1820. This initial literary period includes 1820- 1851. Aside from a few short trips lasting less than three months, Hugo lived and wrote mainly in his homeland until his exile on the Island of Guernsey during the reign of Louis-Napoléon from 1851-1870. The third period encompasses his triumphant return to Paris in 1871 until his death, celebrated by a state funeral, in 1885. Research on the French authors is being facilitated by use of PhiloLogic and the ARTFL database, complemented by local digitized works and tools that are also used to investigate the English authors. Preliminary testing must be done on all the authors to discover overall trends or principles of vocabulary development before investigating any possible effects of foreign travel. The importance of this can be seen in fi gures 1 and 2 below, two cluster analyses of English traveling authors, based on the 800 mfw (most frequent words). Dickens’s novels form two distinct groups, 1836-43 and 1848-70, a division coinciding with his 1844-47 travels. For Trollope, the match is not quite so neat, but it is suggestive. Ignoring Nina Balatka, a short romance set in Prague, and La Vendee, Trollope’s only historical novel, set in France in the 1790’s, only two remaining novels in the early group were published after his travel to Egypt, Scotland, and the West Indies in 1858-59. Unfortunately, comparing cluster analyses of the English domestic authors casts doubt on any simple correlation between travel and major stylistic change. Meredith, like Dickens and Trollope, shows a sharp break between his two early novels 1855-57 and the rest of his novels (see Fig. 3). And, ignoring Antonina (an historical novel about the fall of Rome), Collins’s novels also form early and late groups (see Fig. 4). Furthermore, although our results for French authors are more preliminary, a test of six works by Gobineau shows that two of his earliest texts, written before any extensive travel, are quite similar to some of his latest texts (see Fig. 5). We are still developing the techniques for the study of the effects of travel, but preliminary testing based on a division of each author’s career into early, middle, and late periods allows us to check for consistent trends rather than simple differences between early and late texts, and to begin comparing the four categories of authors. Choosing novelists with long careers allows us to separate the three periods, selecting natural gaps in publication where possible, but creating such gaps where necessary by omitting some texts from the study. For traveling authors, these divisions also take into account the timing of their travel, creating gaps that include the travel. Three stylistic periods create six patterns of highest, middle, and lowest frequency for each word in the an author’s texts. Depending on the number and size of the novels, we include approximately the 8,000 to 10,000 most frequent words, all those frequent enough to show a clear increase or decrease in frequency; we delete words that appear in only one period. Thus, as shown in Fig. 6, each of the six patterns would be expected to occur about one-sixth (17%) of the time by chance. Results for the English authors, shown in Fig. 7, are both surprising and suggestive (note that the axis crosses at the “expected” 16.7% level, so that it is easy to see which patterns are more or less frequent than expected for each author. Gradual decrease in frequency, E > M > L, is the only pattern more frequent than expected for all four authors (Meredith’s fi gure is only very slightly more frequent than expected), and both M > E > L and L > E > M are less frequent than expected for all four authors. Although the patterns for these authors suggest some regularity in the growth and decay of vocabulary, no simple relationship emerges. Consider also the surprising fact that vocabulary richness tends to decrease chronologically for Dickens, Trollope, and possibly Collins, while only Meredith shows increasing vocabulary richness. (These comments are based on a relatively simple measure of vocabulary richness, the number of different words per 10,000 running words; for more discussion of vocabulary richness, see Tweedie and Baayen, 1998 and Hoover, 2003.) These facts contradict the intuitive assumption that the main trend in a writer’s total vocabulary should be the learning of new words. Similar comparisons are being developed for the French authors in question. The conference presentation will include not only a comparison of style within each language group, but between language groups. Such comparisons also build on strengths of corpus stylistics important to translation (Goldfi eld 2006) and a possible related future for comparative literature (Apter 2005).", "article_title": "Homebodies and Gad- Abouts: A Chronological Stylistic Study of 19th Century French and English Novelists", "authors": [{"given": "Joel ", "family": "Goldfield", "affiliation": [{"original_name": "Fairfi eld University, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "David L. ", "family": "Hoover", "affiliation": [{"original_name": "Fairfi eld University, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2008", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}