{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " The project Mapping the Enlightenment: Intellectual Networks and the Making of Knowledge in the European Periphery is funded by the Research Centre for Humanities (RCH) for the academic year 2016-2017. The project uses interactive mapping tools for visualising, exploring, and analysing the intellectual and geographical networks developed by Greek-speaking scholars of the Ottoman Empire during the 17 th and 18 th centuries. Based on the convergence of the latest achievements in digital mapping and historiographical discussions about the representation of the Enlightenment, the project develops user-friendly interactive and dynamic web maps of the itineraries of traveling scholars, and visually represent the building of networks between scientific centers and peripheries. Additionally, this dynamic system provides multi-layered maps that enables users to query and visualize data and flows through a modern and robust environment. This interactive interface offers a simple and effective way of showing how the intellectual networks developed within the European periphery in the 17 th and the 18 th centuries contributed to the shaping of knowledge during the Enlightenment. The project is a collaboration between the ", "article_title": "Mapping the Enlightenment: Intellectual Networks and the Making of Knowledge in the European Periphery", "authors": [{"given": "Vassilis", "family": "Routsis", "affiliation": [{"original_name": "Centre for Digital", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}, {"original_name": "Humanities University College London", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": "Eirini", "family": "Goudarouli", "affiliation": [{"original_name": "Department of History and Philosophy of Science", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}, {"original_name": "of the National and Kapodistrian University of Athens and the Centre for Digital Humanities of University College, London", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}, {"original_name": "Kapodistrian University of Athens", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2017", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}