{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Interdisciplinary and multidisciplinary projects are becoming an important part of academic life. Research questions are becoming more complex and sophisticated, requiring a team approach to address (Newell et al., 2000, Hara et al., 2003). At the same time, funding agencies are also encouraging these types of projects through their granting programs. One result of this increased level of research collaboration is that teams have members located at other institutions, whether nationally or internationally. Digital Humanities as a community is becoming increasingly international in focus. For example, the Digging into Data Challenge was jointly sponsored by Canada’s Social Sciences and Humanities Research Council (SSHRC), the British Joint Information Systems Committee (JISC) and the American National Endowment for the Humanities (NEH) and National Science Foundation (NSF) and required each research team to have membership from at least two of the participating countries (Office of Digital Humanities, 2010). Further, the Digital Humanities Summer Institute at the University of Victoria has had participants from every continent, except the Antarctic. Finally, the Text Encoding Initiative Consortium has members and users from around the world, with a growing number of projects based in Asia (Siemens, 2008c). These collaborations are possible given the advances in computers and telecommunications. The recruitment of the right person is no longer limited by geography (Cramton et al., 2005).However, these types of teams encounter the general challenges associated with collaborative work, but also with more specific ones relating to the geographical distribution of members. Despite this increasing use of research teams, protocols to prepare individual researchers to work as part of a team, particularly within those groups which cross language, culture, and country lines, are not widely developed. Our work is designed to identify effective work patterns and intra-team relationships and describe the support and research preparation that is required to develop international research collaborations. The results will enable those who work in such teams to recognize those factors that tend to predispose them to success, and perhaps more importantly, to avoid those that may lead to problematic interactions, and thus make the project less successful than it might have otherwise been.While there is a growing knowledge base of the benefits and challenges inherent in academic research teams (See, for example: Bracken et al., 2006, Choi et al., 2007, Fiore, 2008, Kraut et al., 1987), little knowledge exists about the ways in which teams with memberships across universities and disciplines work together (Garland et al., 2006), much less about teams with members from multiple country, culture and language groups (Setlock et al., 2004, Shore et al., 2005).At a practical level, geography presents relatively simple challenges. As time zones increase, the flexibility in scheduling meetings decreases while the cost of face-to-face interactions increases. Technology may not always be capable of overcoming these challenges. Distance between team members limits the amount of interaction needed for creativity and innovation (Cummings et al., 2005, Lawrence, 2006). Further, some technologies and software may not be available in some countries due to infrastructure gaps or government policy (for example, the Great Firewall of China).At a more complex level, differences in culture and language may impact on various aspects of team work such as structure, management, communication, conflict expression and resolution, decision making, and appropriate team behaviour and may be further complicated by professional and academic cultural differences (Dafoulas, 2002, Setlock et al., 2004, Shachaf et al., 2007, Fry et al., 2007, Lee-Kelley et al., 2008, Dekker et al., 2008). At a very basic level, teams must decide a working language, a decision that may be political in nature (Butler, 1998, Deepwell et al., 2009, Bournois et al., 1998). And even with a common language, members may find that they must still translate terms. For example, institutions in different countries define a research assistant (RA) in a variety of ways. In Canada, an RA is generally a graduate student who works on a research project on a part-time basis while in the United Kingdom, an RA is a post-doctoral fellow who is on a full-time contract for a specified period of time. As a result, confusion can occur among team members when they use common terms in different ways.Research suggests several factors that may minimize the impact of the above challenges. First, education and training may mitigate the impact of cultural differences because team members may share professional norms. University education is fairly similar across countries (Dafoulas, 2002, Lee-Kelley et al., 2008, Nason et al., 1998). Teams may also find it beneficial to spend time in members’ cultures to create understanding of differences and similarities (Nason et al., 1998, Bagshaw et al., 2007). Finally, teams may also consider creating a cultural profile, both by country and professional/discipline culture (Dafoulas, 2002, Zakaria et al., 2008). This profile can be combined with team norms to express understandings of time, deadlines, language, communication channels, conflict resolution mechanisms, and other issues (Saunders et al., 2004). However, more research is needed to understand the supports and research preparation that is needed to ensure effective collaborations in teams with memberships from many countries, cultures, and language groups.This paper is part of a larger project examining research teams with multi-country, culture and language representation, led by a team based in Canada, United Kingdom and Germany (For more details, see Siemens, 2010). The larger study uses a combination of data collection methods including an ethnomethodological approach with diary/log studies of research teams in the midst of their collaboration (Garfinkel, 1984) and semi-structured interviews with individuals who have experiences in the types of teams under investigation (Marshall et al., 1999). This paper will report on the findings from the interviews.Digital Humanities community will serve as an exemplar case study population given the community’s international focus and collaborative networks. To achieve their objectives, and because of the variety of skills and expertise that these projects require, DH researchers must work collaboratively both within their institutions and with others nationally and internationally and often across disciplines. Team members include humanities, social science and computer science scholars, undergraduate and graduate students, research assistants, computer programmers and developers, librarians, and others. At present, several research projects involving national and international teams with funding ranging from thousands to millions of dollars are already in place with others in development. In addition, several DH research centres have faculty and research staff drawn from several countries, creating a mix of languages and cultures.This research project builds on earlier work on DH research teams presented at previous digital humanities conferences (Siemens, 2008a, Siemens, 2008b, Siemens et al., 2009a, Siemens et al., 2010).At the time of writing this proposal, interviews are being conducted and data analysis completed.The benefits to the Digital Humanities community will be several. First, the study contributes to an explicit description of the community’s work patterns and relationships, particularly as the Digital Humanities community continues to become international in focus (Alliance of Digital Humanities Organizations, 2010, Tei-C, 2010). This research demonstrates that much of digital humanities research is accomplished within interdisciplinary research teams, which are developing tools and processes to facilitate this collaboration. One particular issue highlighted in this research relates to challenges experienced within teams with members from various countries and cultures (Siemens et al., 2009b). Second, it is designed to enable those who work in such teams to recognise factors that tend to predispose them to success, and perhaps more importantly, to avoid those that may lead to problematic interactions, and thus make the project less successful than it might otherwise have been.", "article_title": "A Trip Around the World: Balancing Geographical Diversity in Academic Research Teams", "authors": [{"given": "Lynne", "family": "Siemens", "affiliation": [{"original_name": "School of Public Administration, University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": "Elisabeth", "family": "Burr", "affiliation": [{"original_name": "Institute of Romance Studies, University of Leipzig", "normalized_name": "Leipzig University", "country": "Germany", "identifiers": {"ror": "https://ror.org/03s7gtk40", "GRID": "grid.9647.c"}}]}, {"given": "Richard", "family": "Cunningham", "affiliation": [{"original_name": "Acadia Digital Culture Observatory, Acadia University", "normalized_name": "Acadia University", "country": "Canada", "identifiers": {"ror": "https://ror.org/00839we02", "GRID": "grid.411959.1"}}]}, {"given": "Wendy", "family": "Duff", "affiliation": [{"original_name": "Faculty of Information, University of Toronto", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}]}, {"given": "Dominic", "family": "Forest", "affiliation": [{"original_name": "École de bibliothéconomie et des sciences de l'information, Université de Montréal", "normalized_name": "University of Montreal", "country": "Canada", "identifiers": {"ror": "https://ror.org/0161xgx34", "GRID": "grid.14848.31"}}]}, {"given": "Claire", "family": "Warwick", "affiliation": [{"original_name": "UCL Centre for Digital Humanities, Department of Information Studies, University College London", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}], "publisher": null, "date": "2011", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}