{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " The past decade has witnessed a wave of manuscript digitization projects initiated by museums, libraries, and individual scholars. This paper will address digitization of some primary sources essential for the study of late antiquity and Byzantine history and religion. Many of these initiatives will advance the study of Greek and Latin texts, as well as Hebrew—the primary languages of the Christian canon and the early to medieval Christian tradition in the West. Research in Syriac, Coptic, and Christian Arabic, however, are essential for understanding the development of religion in the late antique and early Medieval or Byzantine periods. The digitization of their sources has lagged behind. Focusing specifically on Coptic manuscripts—the texts of early and medieval Christian Egypt—this paper will explore the role of colonialism in in the history of Coptic archives and how to resist reinscribing both colonial epistemologies and traditional notions of “canon” after the “digital turn” in archival studies.  Digitization has been heralded as a means of increasing access and availability of texts that may be inaccessible for various reasons, including the dispersal or dismemberment of the original archives or repository. Technology is seen as a possible means to reassemble these dismembered texts and archives, to reunite fragments of papyri and codices virtually online. It is also heralded as a way to save texts that still reside in the Middle East, in zones of political, military, or cultural conflict. Finally some scholars hope it will bring more exposure to traditions that up until now have been seen as marginal to the dominant Greek and Latin traditions. This paper will interrogate two premises: first, that digitization can “recover” or “reconstruct” an original, now dismembered ancient or medieval archive; second, that current digitization efforts are disrupting the dominant canonical paradigms in the study of late antique, Byzantine, and Medieval religious history. The paper will argue that digitization cannot fully repatriate, reconstruct, or save damaged or dispersed physical archives. But the digital can transform our relationships with the sources of early Christanities if we pay critical attention to the limits of the digital, so as not to reify colonial archaeological, archival, and canonical practices in the digital realm.  This paper will first discuss the original collection of Coptic manuscripts in the context of colonial occupation of Egypt, excavations in Egypt, and the antiquities trade. It will then examine the progress, possibilities, and potential problems of digitization initiatives at specific libraries and museums with significant Coptic collections: British Library, Vatican, Bibliothèque Nationale, Österreichische Nationalbibliothek, etc. The paper will also analyze the work of specific digital humanities projects in Coptic (particularly Coptic Scriptorium at the University of Pacific and Georgetown University, PATHs at Sapienza University in Rome, and the virtual Hill Museum and Manuscript Library) as well as the efforts of the Coptic cultural heritage organization the St. Shenouda Foundation to collect microfilms and digital images for diasporic Coptic cultural heritage preservation. The paper draws on insights from post-colonial digital humanities, Native American digital humanities (especially regarding issues of repatriation and digitization of cultural heritage), archival theory, Coptic Studies, and manuscript studies. ", "article_title": "The Digitization of “Oriental” Manuscripts: Resisting the Reinscribing of Canon and Colonialism", "authors": [{"given": "Caroline T.", "family": "Schroeder", "affiliation": [{"original_name": "University of the Pacific, United States of America", "normalized_name": "University of the Pacific", "country": "Chile", "identifiers": {"ror": "https://ror.org/005gk0s47", "GRID": "grid.441817.f"}}]}], "publisher": "Name, Institution", "date": "2018", "keywords": ["classical studies", "repositories", "corpora and corpus activities", "sustainability and preservation", "digitisation - theory and practice", "globalization & digital divides", "archives", "English", "theology", "near eastern studies"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}