{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "As the digital humanities have become more visible, attracting attention both from publications such as the  Chronicle of Higher Education and from universities eager to develop emerging areas of research and teaching, commentators have been debating what qualifies as digital humanities and whether the community is sufficiently inclusive. In part, as Geoffrey Rockwell suggests, this debate reflects digital humanities’ failure to provide multiple paths to entry. In the past, many entered the digital humanities by apprenticing with established practitioners, but such opportunities are not available to all (Rockwell 2010). New educational programs such as the MA in Digital Humanities at University College London and the proposed MA in Knowledge and Networks at Duke are being put forward to address these needs, joining established programs at Kings College London, University of Alberta, and other universities. As educational opportunities expand, the digital humanities (DH) community should examine how digital humanists are being trained (Hirsch & Timney 2010). Based on this knowledge, the community can create a more coordinated (though still flexible) approach to the DH curriculum that reflects its own commitment to openness, collaboration, interdisciplinarity and experimentation. Education is fundamental both to how the community comprehends itself and how it brings in new members. As Melissa Terras observes, curriculum “can be seen to define the field in the way the publication record cannot,” serving as a “hidden history” that reveals what knowledge experts believe to be crucial and how that knowledge is transmitted (Terras 2005, p.1). By examining digital humanities education, we can participate in a concrete conversation about how to make the field both more inclusive and more targeted toward the core knowledge and skills that digital humanists need.In order to understand how the digital humanities are taught at universities today, I will look at both curriculum and courses.I am in the process of collecting and synthesizing information related to this research, particularly through my Zotero group, “Digital Humanities Education” (http://www.zotero.org/groups/digital_humanities_education), and posts on my blog, “Digital Scholarship in the Humanities” (http://digitalscholarship.wordpress.com/). I am also working on a related project for Brett Hirsch’s collection Teaching Digital Humanities: Principles, Practices, and Politics proposing an open certificate for digital humanities.  First, to get a broader perspective on the digital humanities curriculum, I will examine degree requirements and curriculum plans for digital humanities undergraduate, masters, and Ph.D. programs. How are digital humanities degree programs structured? What courses are deemed necessary, and how are they sequenced? To what extent are projects and/or internships required? How do explicitly digital humanities programs compare to more traditional programs that include a digital humanities component? How are collaboration and interdisciplinarity inculcated? Case studies of several programs will be offered to elucidate different approaches.  I am also analyzing a collection of over 200 DH syllabiAll of these syllabi were found through web searches. Almost all are from universities in the United States, Canada and the UK. The earliest syllabus is from the late 1990s, but the bulk are from the late 2000s. for both graduate and undergraduate courses. These syllabi represent a variety of approaches to digital humanities, such as media studies, text encoding, programming, and information visualization, and come from a range of departments, including history, English, digital humanities, library and information science, and computer science. I am examining: I plan to use a combination of manual and automated methods to analyze the syllabi corpus. I am tagging the syllabi using a set of custom keywords so that I can sort them easily and see emerging patterns. I am also compiling a linked bibliography of readings assigned in DH courses. In addition, I will experiment with methods such as topic modeling and word frequency analysis to categorize the syllabi and extract key concepts. Although my research is still underway, my initial analysis of a subset of approximately 50 syllabi suggests that: In a sense, this research updates Melissa Terras’ 2005 study of the curriculum in humanities computing, charting how the field has changed in the last five years. I am returning to Terras’ question about whether the digital humanities curriculum reflects the field’s research agenda and whether DH has emerged as an “ academic subject,” capable of standing on its own (Terras 2005). I also hope my research helps to inform the digital humanities curriculum going forward. While the digital humanities curriculum should be nimble enough to keep up with the pace of technological change, diverse enough to encompass the variety of approaches to “big tent” digital humanities, and flexible enough to reflect the strengths of particular institutions, the community can benefit from greater coordination and sharing of educational resources to save labor, spread ideas, and provide greater coherence across programs. Of course, my analysis will focus on the characteristics of current DH education programs rather than on emerging areas of skill development, but I hope to document innovative educational approaches as well as points of consensus. Developing a DH curriculum may make it easier for departments (and individuals) to understand what they need to do to beef up their digital humanities portfolio and how they can specialize in particular areas of knowledge. Although my study will not define such a curriculum (which should be worked out by the community rather than an individual), I hope that it will illustrate trends and gaps in digital humanities education.", "article_title": "Knowing and Doing: Understanding the Digital Humanities Curriculum", "authors": [{"given": "Lisa", "family": "Spiro", "affiliation": [{"original_name": "Rice University", "normalized_name": "Rice University", "country": "United States", "identifiers": {"ror": "https://ror.org/008zs3103", "GRID": "grid.21940.3e"}}]}], "publisher": null, "date": "2011", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}