{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Humanities scholarship has traditionally viewed a literary work of art as an act of production belonging to larger social and cultural networks, yet remaining relatively fixed within a single medium. The recent identification of patterns of convergence in technological, social/organic, economic and global contexts seems to suggest, however, that although these same traditional models of literary production still constitute a significant portion of the cultural output, they are being transformed and shifted in order to accommodate increasingly intersectional exchanges between media forms and content. In many cases, these shifts have made it possible to develop new structures that shatter the fixity of narrative as a single-medium endeavor and establish instead a multiply-mediated storyworld, a cross-sited narrative, defined here as multisensory “clustered” or “packeted” stories told across a divergent media set. The proliferation of cross-sited narratives—across film, literature, music, video games, live performance and the internet—presents significant challenges to the current modalities of humanistic theory and practice. As both a product of and a reaction to the process of the discrete nature of digitization, cross-sited narratives require us to not only “imagine an infinitely segmentable media market” (Coit-Murphy 91) but also, it seems, an infinitely segmentable and infinitely mediated story that, as a network, draws and exchanges narrative information from site to site. Evidence of this sort of networking can be seen in works such as Mark Danielewski’s House of Leaves, which operates across no less than 5 media channels (novel, novella, live performance, recorded music, the web), each integral to the establishment of the narrative storyworld. The question posed by this paper, then, is whether we can use current models of digital archiving and editioning as the means through which to preserve and distribute a narrative network such as Danielewski’s. Is it possible, in the context of contemporary textualities, to retain even a semblance of such a work? Although similar crisis points have always plagued the arts, exposing in many ways the utter ephemerality of even venerated and “durable” technologies such as codex book, we’ve looked towards the digital as the means through which the fragile materials of paper and print are hardened and made permanent from a bitstream that flows from an electronic fountain of youth. Paradoxically, studies of new media have recently (and perhaps belatedly) moved toward the preservation of digital objects such as early computer games and interactive fictions, recognizing rightly that an entire generation of artifacts is in danger of being obliterated by hardware and software advancements. Although it is universally acknowledged that there is obviously no possible way to replicate the historical moment during which a given work is produced, we have, for the most part, been content to instead refashion the work into whatever single medium seemed to have the greatest potential for preservation. Friedrich Kittler’s assertion that “the transposition of media is always a manipulation and must leave gaps” (1990:267) does hold some sway here but, in the sense that a given text (such as Emily Dickinson’s letters or William Blake’s illuminated manuscripts) has content that is somewhat extractable from its form, such gaps are acceptable when the tradeoffs are vastly improved distribution and conservation. It will be argued here that such an approach will inevitably fail when confronted with the preservation of a cross-sited narrative, as the transcoding of a narrative that relies on the tensions between multiple media sites into a single medium will irrevocably disrupt the network that constitutes its storyworld. We’ve found ways to overcome the displacement of a medium, but can we hope to approximate a narrative/media network? In short, we can’t. Drawing upon (cognitive) narratology (Herman 2004; Ryan 2003, 2004; Bortolussi and Dixon 2004), cognitive linguistics (Turner 2003; Fauconnier and Turner 2002), convergence theory (Jenkins 2004, 2006; Kittler 1990), archiving strategies for “network” fictions (Montfort and Wardrip-Fruin 2004; Liu, Durand, et al. 2005) and Pierre Levy’s theories of virtualization (1998), the focus of this paper will be as follows: 1) to outline the structures of cross-sited narratives, focusing particularly on their network structure, 2) to assess the current methods of archiving/ preserving literature, such as those proposed by the Electronic Literature Organization, and especially methods that deal with transient texts and networked stories (such as hypertext and interactive fiction) 3) to propose that such methods are inadequate for transcribing the complex interactions between media that occurs within cross-siting and 4) to suggest a new model of temporal textuality that argues that these networks cannot be transposed except through primary materials, and that, often, this primacy is fleeting and not reproducible. In fact, it is possible that the only remnant of these textual networks that will remain are in the annotations and collaborations left by users on message boards, blogs and chat rooms. The structures that will be recommended for cross- siting are presented as a series of gradient models representing the continuum between a text’s materiality and it’s narrative. The works that will be studied include Danielewski’s House of Leaves, The Matrix, Neil Young’s Greendale and the alternate reality game, I Love Bees, a selection that provides a range of blindspots in current practices of textual preservation. Through text, gaming, comic books, live phone calls, the texture of paper and the spontaneity of live performance, each of these works exposes the single-medium logic through which most textual preservation operates. If we are truly entering an era of convergence where media come together in conversation over narrative, then we must also be aware that this coming together is not without consequence. Indeed, the end product of this convergence just might be the erasure of many of the networks it produced.", "article_title": "Many Houses, Many Leaves: Cross-Sited Media Productions and the Problems of Convergent Narrative Networks", "authors": [{"given": "Marc ", "family": "RUPPEL", "affiliation": [{"original_name": "Textual and Digital Studies,     University of Maryland College", "normalized_name": "University of Maryland, College Park", "country": "United States", "identifiers": {"ror": "https://ror.org/047s2c258", "GRID": "grid.164295.d"}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}