{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  The technological demands of today’s global society call into question the use of traditional approaches to language and literary studies and challenge educators to think about ways to integrate multimedia creatively in their scholarship and teaching. The project presented in this paper and currently under construction offers an innovative approach to studying literature that employs tools from the field of the digital humanities. The Comprehensive Digital Glossary of Golden Age Spanish Literature or GALGO (GoldenAgeLiteratureGlossaryOnline) is a searchable Spanish-English online glossary that consists of select words, from the most commonly studied literary texts of the 16th and 17th centuries, whose meanings and multiple connotations reflect important linguistic and cultural concepts. The selection of words is broadly consistent with the keyword theory developed by Raymond Williams in the mid-20th century. Keywords are lexical units that comprise a network of associations, triggering ‘different memories and imaginings,’ centered around dominant cultural notions and practices (Hart et al. 2005: 6). Keywords illustrate ways of perceiving the world and reflect the shared interest or ideology of a particular society and find expression in a common vocabulary (Williams 1983: 15). Analyzing keywords is an exercise in examining their usages in context and in considering the evolution of their meanings over time (Burgett & Hendler 2007: 1). Keywords research is rooted in historical semantics and focuses on how meaning is constructed and altered through conflict and negotiation among certain social groups and movements; it is about exploring the possibilities of language and unlocking meaning. GALGO is a vocabulary of keywords that explores the canonical prose texts of Golden Age Spanish literature – El abencerraje, Lazarillo de Tormes, Miguel de Cervantes’ twelve Novelas ejemplares, and principal comedias by Calderón de la Barca, Cervantes, Lope de Vega and Tirso de Molina – from the perspective of a history of ideas. The digital glossary tags socially charged words that reverberate through the texts and beyond. The glossary stimulates students to evaluate critically their own assumptions and reflect on philosophical and ethical questions that continue to be of current importance. The polysemic nature of the terms selected, words such as esfuerzo, fuerza, gentileza, and honra, offers valuable insight into the complex, idiosyncratic Golden Age Spanish lexicon. We believe that identifying the different uses of the same word in a literary work is both essential to reading comprehension and to an understanding of societal attitudes of the period. GALGO is organized in such a way that the specific contextualized definition is given in each instance where the keyword is tagged. The literary works have been digitized and are available in the glossary in complete electronic versions. The box containing the definition can remain open and is moveable, and users are able to compare and contrast immediately the word’s varied meanings in the text. Furthermore, with the support of a search algorithm, the glossary’s multilayered design gives students the option to view the same keyword in all of the texts in the database. GALGO also contains a Javascript snippet that will highlight and group together each distinct definition of a search term across texts, thereby allowing students to chart the prevalence of a particular usage of the word. The methodology of GALGO combines the rich word inventory of literary concordances with the ideological interpretations of medieval and early modern manuscript glosses. The entries reveal a word’s different shades of meaning and, borrowing from the exegetical tradition popularized in the Middle Ages, function as brief explanatory notes that give broader significance to literary passages. For example, in the novella El abencerraje, the noun gentileza and its adjective form gentil are defined in the following ways, depending on the context: gentileza: Unrequired goodwill shown by the more powerful to the less powerful (magnanimity). gentil: 1. Of cultivated manner and appearance. 2. The best of its kind (exemplary). When necessary, an additional feature called Expansion of meaning appears alongside the definition in order to identify further semantic connections. The entry for honra in the line ‘…tuyo es mi corazón, tuya es mi vida, mi honra y mi hacienda’ from El abencerraje reads: Definition: Public esteem received in acknowledgement of one’s strength of character, specifically here, a woman’s chastity and/or marital fidelity. Expansion of meaning: In this period, honor (good reputation) was based on the following factors: social status, material wealth, strength of character, achievements, and in the case of a woman, her chastity and/or marital fidelity. Here, in pledging vida, honra, and hacienda, the noblewoman was committing everything she was and had to the man. By integrating qualitative analyses of literary texts with quantitative computer derived methods, GALGO promotes a novel form of active reading and engagement in language and culture. In the last two decades, the pedagogical approach to foreign language study has moved beyond a primary emphasis on developing functional communication skills to an equally compelling interest in acquainting students with representative literary and cultural texts in the target language. The Modern Language Association’s 2007 report places the acquisition of transcultural and translingual competencies, namely the ability to reflect on how realities are shaped differently across languages, historical periods and cultures, at the core of the foreign languages discipline. GALGO engages learners in the analysis of classic literary texts in a meaningful way, allowing them to test their hypotheses as to possible lexical and cultural preconceptions through immediate feedback.  ", "article_title": "Developing Transcultural Competence in the Study of World Literatures: Golden Age Literature Glossary Online (GALGO)", "authors": [{"given": " Nuria", "family": "Alonso Garcia", "affiliation": [{"original_name": "Providence College, USA", "normalized_name": "Providence College", "country": "United States", "identifiers": {"ror": "https://ror.org/00rxpqe74", "GRID": "grid.418778.5"}}]}, {"given": " Alison", "family": "Caplan", "affiliation": [{"original_name": "Providence College, USA", "normalized_name": "Providence College", "country": "United States", "identifiers": {"ror": "https://ror.org/00rxpqe74", "GRID": "grid.418778.5"}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}