{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Despite the ground-breaking work of graphics visionaries like Alan SutherlandAlan Sutherland built the first graphics program named “Sketchpad” as part of his PhD. work in 1963. Sketchpad allowed users to draw geometric shapes and create copies of them. This work was not only important in the realm of computer aided design (it is viewed as the grandfather of modern CAD software), but also in its organization of the code in objects, which is the basis for modern object oriented design. and Ed CatmullBeyond his current role as CTO of Pixar, Catmull is perhaps one of the most important people in the world of computer graphics, discovering methods to apply images to geometries, smoothing lines drawn on computer screens, among many others. He was also a student of Sutherland... in the 1960s and 1970s, which unlocked computer screens as interactive tools, hardware portability issues have constrained computer interaction to a two-dimensional space which often simulates the real world. However, the considerable market growth of sophisticated mobile devices over the last several years has begun to push the boundaries of interaction in virtual environments. Instead of experiencing a simulated environment sitting at a computer, users are shifting to experiencing physical environments with a computing device capable of enriching their subjectie experience of the space. The success of augmented reality systems like BionicEye, RobotVision, TATAugmented ID, and Layar provides glimpses at how this technology might be leveraged by cultural heritage institutions, individual academics, and even local, municpal officials, to provide opportunities for students and the general public to interact with space and place in new and exciting ways.The University of Virginia’s Department of Architectural History holds its training-oriented field school, under the direction of Professor Louis Nelson, in the city of Falmouth Jamaica each year. Falmouth is a fruitful city for study because of its unique history, which makes it the best preserved example of Georgian architecture in the Caribbean. Founded in 1769, the city was originally designed as the main northern port for the island’s thriving sugar trade. Tied closely to the infamous “Triangle-trade”, the slave-based sugar economy allowed the city to grow until the emancipation of slaves in the British Empire in 1840. After 1840, the town saw a significant decline and experienced very little construction over the next 170 years, preserving its architecture and urban design as an early nineteenth-century time capsule.In 2009, the Jamaican government approved development of a cruise ship terminal in Falmouth. Its first ships are scheduled for docking in the summer of 2011. The predicted influx of tourism to the town will be an economic boon to residents, but will also bring significant changes to the architectural identity of the town. The 11-acre port is of such size that, while ships are docked, they will tower over the Trewlany Parish Church of St. Peter, the tallest building in the town. New dining and recreation facilities will be constructed around the terminal, and a simplified interpretation of early nineteenth-century life will be constructed for the enjoyment of tourists. This will result a better standard of living for most residents of the town, but will mean the loss of an historical laboratory for architecture. As businesses sprout up, residents will be pushed away from areas around the terminal and century-old houses will be torn down and replaced with store-fronts.Realizing that the introduction of the cruise terminal to the city will forever alter the architectural identity of the town, the UVa Architectural History Field School recently shifted its focus from deep analysis of a handful of buildings in a single summer, to a more general effort to survey the status of the buildings of the entire city. This survey includes measured sketches, colorcoding of a given structure’s overall condition, images of the structure as it stands today, and information on when the building was constructed, construction material, and other items of interest to architectural historians. These findings were then submitted to UVa Library’s Special Collections for long-term archiving.Sensing a real opportunity to provide access to this important work, the Scholars’ Lab partnered with Louis Nelson, chair of the Architectural History department, to investigate ways to make this nearly decade’s worth of research available to a wider audience. We identified three groups of users for the content: academics interested in the underlying data of the city, government officials who need to plan city restoration efforts, and tourists interested in finding out more about the town they will visit. The Scholars’ Lab was particularly interested in interface design decisions that would serve each of these communities well.In order to provide different mechanisms of access for three distinct user groups, we employed several open-source tools to create a solution that would expose this valuble architectural and historical data to a large and varied audience. Leveraging our own expertise in open-source Geographic Information Systems infrastructureIn 2009 and 2010, the Scholars’ Lab hosted an NEH-funded “Institute for Enabling Geospatial Scholarship:”  (link) . At DH 2009, several members of the Scholars’ Lab presented a panel discussion (“New World Orderings”) on GIS, including a description of our open source , web services-based Geospatial Data Portal:  (link) . And at DH 2010, Scholars’ Lab director Bethany Nowviskie presented a poster on possibilities for spatial humanities, “Inventing the Map.” with the flexibility of the Omeka collections and exhibits framework, the Scholars’ Lab has constructed several different ways in which these different audiences may interact with library-curated spatial data.In order to allow city planners access to the underlying data, maps originally drawn in AutoCad were converted to a GIS format and loaded on to a web-accessible server. Web services were created to allow high-end users of GIS software access to the information with proprietary tools like ArcGIS. We then utilized those same web services to create map interactions within Omeka using the open source mapping library OpenLayers. Images and metadata (along with the full architectural survey report) were uploaded to Omeka and a custom VRA Core metadata standard was created to allow more appropriate description of the architectural elements in the collection. Long-form academic essays are also in the process of being written for approximately 30 of the most important structures in the city. These will be presented along with maps highlighting where important structures are located, to allow visual methods for browsing the collections to function in tandem with scholarly interventions to highlight specific structures of interest. Importantly, this approach also allows us to expose underlying geographic information as web services, allowing other scholars to reuse the information.While the site boasts other advanced features, including a faceted Solr-based search, we also wanted to explore methods for exposing the same data in new ways to the different target groups for the project. With the growth of web-enabled smart devices, we plan to try two experiments at the Vernacular Architecture Forum’s Annual Meeting, in June 2011 in Falmouth, Jamaica. The first will place QR codes at selected structures around the town to allow individuals with web-enabled phones to access all of the information about the structure presented on the Scholars’ Lab website. We are also building a Layar-based augmented reality browser for the city which will allow individuals with smart phones (iPhones and Android-based devices) to install a simple application that will overlay information about buildings on a viewport, accessed simply by pointing their phones at the building.This is an ongoing project, with field experiments and user feedback scheduled to be conducted before the Digital Humanities 2011 conference. We hope to model a technical approach to providing access to library-curated information for multiple audiences, using different technological approaches and techniques to frame the data not only in terms of scholarly use, but for tourism and cultural heritage appreciation, and for the more practical employment of the data by city planners to optimize restoration efforts. We also hope that these tools will help raise awareness about the fragility of the town to tourists, and can act as a way to expose UVa students’ and scholars’ research in multiple formats to those interested in underlying historical and spatial data, and the multimedia and embodied arguments which have been crafted using new tools and methods.", "article_title": "Historic Interpretation, Preservation, and Augmented Reality in Falmouth Jamaica", "authors": [{"given": "Wayne", "family": "Graham", "affiliation": [{"original_name": "University of Virginia", "normalized_name": "University of Virginia", "country": "United States", "identifiers": {"ror": "https://ror.org/0153tk833", "GRID": "grid.27755.32"}}]}, {"given": "Bethany", "family": "Nowviskie", "affiliation": [{"original_name": "University of Virginia", "normalized_name": "University of Virginia", "country": "United States", "identifiers": {"ror": "https://ror.org/0153tk833", "GRID": "grid.27755.32"}}]}], "publisher": null, "date": "2011", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}