{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  In Toward a Geography of Art, Thomas DaCosta Kaufmann, stated that his research would ‘investigate how notions of place, of the geographical, have been inflected into writing about change through time as it has been and is still discussed in art history’ (DaCosta 2004). He goes back to some of the ideas of this book in his contribution to the multi-volume Catalogue of the 2010-2011 international exhibition Painting of the Kingdoms. There he insists on the fact that political geography and artistic geography do not coincide as countries, viceroyalties, native areas, and notions of center and periphery superpose one another in different research works and cataloguing efforts. Da Costa Kaufmann also emphasizes the need of a theory of diffusion that help explain the movements of creators, paintings and features from territory to territory and the effects that this transfers have in the spatial organization of art that experts carry out. Here, we present the results of a multi-disciplinary collaboration in Digital Humanities, Computer Science and Art History that focuses in proposing a digital geography of Hispanic Baroque art. By digital geography we imply the various possible organizations of the place of art by digital means in a manner that connects various types of data about authors and art-works with different notions of space. This digital geography of art also takes advantage of recent advances in data mining and visualization to offer multiple views of the space of Hispanic Baroque art, as related to geography, movement through territories, transfers over time and cultural borders, clusters of artistic centers (as opposed to centers and peripheries), and movements of works from their places of origin due to contemporary practices of collection by museums and private collectors. The results shed light on the different ways in which social practices – from creation to circulation to collection – affect the spatial organization of art beyond political territories. The paper also shows how culture – defined as information that affects humans’ behavior and represented here by the case of Hispanic baroque paintings – organizes different real and symbolic ‘places’ in different times. We argue that the study of large-scale cultural systems such as the Hispanic Baroque is better suited by a combination of tools and concepts that deal with the complex and evolving nature of the system and can study it through multi-scale techniques that reduce that complexity to a minimum, offering new ways of arranging the space in which that system unfolded over time. Finally, we argue that this methodology can be extended to other projects in Digital Humanities. Over the last few years, we have collected an online BaroqueArt (http://baroqueart.cultureplex.ca/) database of more than 12,000 paintings and more than 1,500 creators associated with the territories of the Hispanic Monarchy from the 16th to the beginning of the 19th centuries. The database also contains around 400 series, 200 schools and 2500 geographical locationsFor a detailed explanation of the methodology, please see Juan Luis Suárez, Fernando Sancho and Javier de la Rosa (2011 and 2012).. On top of the data stored under a traditional entity-relation model, we implemented a system of annotations that would allow to work on the objects stored in the database and that would provide enough flexibility to describe all aspects of any artwork, defining a hierarchy in a structure similar to an ontology. From a set of more than 200 descriptors we carried out a manual semantic annotation of all artworks (with an average of 5.85 descriptors/work and peaks of 14 per work). To analyze the resulting dataset we represent it as a graph in which artworks are nodes and that relations among them are established as a function of the descriptors shared by the works (for example, if an artwork is described through 7 descriptors and another work is also using the same set of descriptors, then we say that these artworks are connected through a weighted link with weight 7). We limited our experiment to the period 1550-1850 and divided the global graph into 12 sub-graphs in order to study the temporal evolution, each of them covering a period of 25 years (see Fig.1).   Figure 1: Graph obtained from one of the periods  Then, for each of the periods of our data we determine which are the clustering classes, that can be considered bags of ‘similar artworks’, and calculate the distances between classes by measuring the frequency of use of descriptors in the artworks contained in the cluster. We apply our own algorithm to distribute those classes in a 2D space so that their relative positions represent the relative distances among them (the closer the clusters are, the more similar descriptors they use). We are aware that 100% accuracy is impossible because of the size of the descriptors pool we are using, that would require a higher dimensional space. Once these clusters are organized in our space with a size proportional to the amount of artworks they have, we go back to the descriptors they contain and we generate the areas of influence of each descriptor as a potential field. As it is normal that, due to the ontological organization of the descriptors, some of these areas contain other areas or sections of them, we also represent the borderlines of the areas to show how these intersections play out. This allows us to generate different views of the art-space, taking into account elements such as time, descriptors by modularity class, or specific descriptors closely related to current discussions by art historians specializing in the period (see Figure 2). These different views provide as many different facets of a digital geography of Hispanic Baroque Art. Also, we calculate distances between similarity classes in different time periods so that we can infer which class evolve from previous ones and draw the semantic evolution of the artworks. This is fundamental for a better understanding of the generation of families of artworks and the variants that this evolution produces, what would help us to connect this process with explanations in political, artistic or economic discourses.   Figure 2: Art-space of one period from the point of view of main descriptors  Finally, and from the geographical information available for a subset of artworks (where original location and current location has been determined) we can make a representation of the movement of the artworks along time, and obtain information about how the museums (the main repositories of artworks currently) and other collectors have collected artworks from specific areas or attending to the semantic groups we have discovered from previous analysis. This methodology allows us to address different issues related to the political, geographic and cultural aspects of art production, reception, and consumption. Some of these issues are: are paintings local, regional, or national?; how different visualizations affect the clustering of art-works and artists?; are there differences between political and artistic territories?; what is the transmission of features across time and space like?; which is the effect of flows of art-works away from their place of origin due to market forces?; how different clusters of art behave and what its effect is on center-periphery debates?. The result is a digital geography of Hispanic Baroque art that will contribute to a better understanding of art history from a spatial point of view and will also shed light on cultural transfers in complex systems.      Funding This work was supported by the Social Sciences and Humanities Research Council of Canada and by the Canada Foundation for Innovation. ", "article_title": "A Digital Geography of Hispanic Baroque Art", "authors": [{"given": " Juan-Luis", "family": "Suárez", "affiliation": [{"original_name": "The University of Western Ontario, Canada", "normalized_name": "Western University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02grkyz14", "GRID": "grid.39381.30"}}]}, {"given": " Fernando", "family": "Sancho-Caparrini", "affiliation": [{"original_name": "Universidad de Sevilla, Spain", "normalized_name": "University of Seville", "country": "Spain", "identifiers": {"ror": "https://ror.org/03yxnpp24", "GRID": "grid.9224.d"}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}