{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper directly engages with the (oft-overlooked) notion that data visualization is in fact an argumentative, non-neutral process and asks: what is and is not visualized, how are visualizations produced, why and how are digital humanists using this technology, and how can data visualization be contextualized historically, materially, and politically. The paper does so by offering focused case studies of two specific data visualization environments: IBM’s Many Eyes platform and Alan Liu’s NEH-funded Research-oriented Social Environment. It examines the corporate lineage of Many Eyes, while constructing a parallel genealogy for RoSE, one rooted more in scholarship, new media art practice, and collaborative knowledge production. The goal is not to critique the corporate affiliation of Many Eyes as such, but to ask what might be at stake in the implementation of a technology that has its ideological roots and disciplinary methodologies outside of the humanities.", "article_title": "Theorizing Data Visualization: A Comparative Case-Study Approach", "authors": [{"given": "Dana Ryan", "family": "Solomon", "affiliation": [{"original_name": "English Dept. UC Santa Barbara, United States of America", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "University of Nebraska-Lincoln", "date": "2013", "keywords": ["data mining/ text mining", "sustainability and preservation", "english studies", "literary studies", "linking and annotation", "history of Humanities Computing/Digital Humanities", "repositories", "archives", "information architecture", "media studies", "text analysis", "knowledge representation", "interdisciplinary collaboration", "databases & dbms", "management", "visualisation", "cultural studies", "project design", "organization"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}