{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " In this paper, we highlight the need in humanities research for 3D tools with enhanced analytical functionality and present an innovative 3D Web GIS system that we are developing – called QueryArch3D – for studies of ancient architecture and landscapes. We explore the role this tool is playing in the development of new methodologies and formulating and addressing research questions in humanities research. Specifically, we demonstrate how research and teaching on archaeology and art history can be dramatically assisted by a Virtual Research Environment that offers the ability to search and query segmented 3D models (both CAD and reality-based) that are linked to attribute data stored in a spatial database in the context of an online VR landscape – in this case, the eighth-century Maya kingdom of Copan, Honduras.   Modern sensor and computing technologies are changing the practice of art history and archaeology because they offer innovative ways to document, reconstruct, and research the ancient world (e.g., El-Hakim et al. 2008; Reindel & Wagner 2009). 3D digital models and virtual reality (VR) environments allow for remote viewing of objects, as well as multiple iterations of hypothetical reconstructions, and offer the sense of space and experience that researchers now desire (e.g., Barcelo et al. 2000). But, as has been pointed out, there is a common perception that while 3D models are good for education or data conservation, they are not useful for research because they are often deemed as purely illustrative and not useful for analysis (e.g., Frischer & Dakouri-Hild 2008). One promising opportunity offered by 3D models is to use them as visualization ‘containers’ for different kinds of information. Given the possibility to link their geometry to external data, 3D models can be analyzed, split into sub-components, and organized following proper rules. Powerful 3D visualization tools already exist, but often they implement no or only limited query functionalities for data retrieval, and very few of these are web-based. In contrast, Geographic Information Systems (GIS) include queries as standard functions and allow for complex spatial analyses – and therefore are well-suited to research (e.g., Bodenhamer et al. 2010; Conolly & Lake 2006).  Along these lines, archaeologists are using GIS to perform quantitative analyses, such as visibility, accessibility, and network studies, to explore the structure of ancient societies and relationships between anthropogenic and natural phenomena. GIS software, however, falls short when dealing with detailed and complex 3D data. It is comprised of 2.5D data, which are not ideally suited to approaches such as performance studies, phenomenology and aesthetics, the relationship of architecture and landscape, and archaeoastronomy that are becoming increasingly common in archaeology and art history. 3D models of architecture are simply more appropriate for these kinds of investigations, but most 3D digital models of architecture are single objects, removed from the context of their place in the landscape and are not linked to scientific data. In 2009, the MayaArch3D Project (http://mayaarch3d.unm.edu) was begun to explore the possibilities of integrating GIS and 3D digital tools for humanities research. This interdisciplinary, international project was funded largely by two Digital Humanities Start-Up Grants from the National Endowment for the Humanities (USA) and brings together art historians, archaeologists, and cultural resource managers with experts in remote sensing, photogrammetry, 3D modeling, and virtual reality. The project was founded by Jennifer von Schwerin and Heather Richards-Rissetto at the University of New Mexico working with data from the UNESCO World Heritage site and ancient Maya city in Copan, Honduras, when they realized that their research goals would be better served if they could join their separate sets of data in a tool that linked GIS and 3D data in a virtual reality environment. Von Schwerin, an art historian, had turned to digital 3D tools in order to test her reconstructions of an eighth-century temple at Copan (Figure 1). But other aspects of her research seek to analyze the temple within its larger urban context and the role that space plays in human experience – something for which GIS is well-suited. Richards-Rissetto, an archaeologist, created a GIS for Copan to study the visual and spatial relationships between built forms and natural landscape features, but soon realized that her research could benefit from a 3D perspective, as the 2D perspective of GIS maps limited her interpretations (Figure 2).  Working together, von Schwerin and Richards-Rissetto asked themselves: What are the real research possibilities for 3D models?  How can we create an online resource for researchers of Maya architecture where they can compare and study geo-referenced 3D models and attribute data? How can we perform quantitative and qualitative comparisons with other Maya structures and analyze architecture in larger spatial and temporal contexts?   To address these questions, the MayaArch3D Project developed a new computing pipeline in order to build a prototype tool for an online, searchable repository – called QueryArch3D – that brings together GIS data, 3D models, and virtual environments for teaching and research on ancient architecture and landscapes. This pipeline uses PostgreSQL as spatial repository back-end and allows for the import and export of standard GIS formats, as well as 3D models as triangulated meshes via the common obj format. Like traditional databases, this tool can curate, query, and compare 2D digital objects (such as drawings, maps, diagrams, text, photographs, and videos). However, what is unique and technologically cutting-edge is that QueryArch3D enables users to 1) integrate and edit 2D and 3D data of multiple resolutions, 2) to perform attribute and spatial queries of archaeological data, and 3) to visualize, compare and analyze 3D buildings and artifacts – all in a single online, navigable virtual reality landscape. Developed in 2010 in collaboration with Fabio Remondino and Giorgio Agugiaro at the Bruno Kessler Foundation (FBK) in Trento, Italy, and Gabrio Girardi at Graphitech, in Trento, Italy, the QueryArch3D tool stores both low resolution models, high resolution reality-based, hybrid models and all ancillary attribute data in an open source spatial database, and then makes them queryable via a virtual reality environment that runs on the Unity 3 game engine. Currently the contents of the digital resource include collections on ancient Copan (Figure 3). Overall, our preliminary research results indicate the QueryArch3D tool is poised to offer a new level of collaborative work in any field that works with 3D models, GIS, and large data sets, because it allows researchers to bring 2D and 3D datasets from separate projects into a single environment and work in real-time using the online query and analysis capabilities. This paper presents this new tool and the results of the beta-testing that was carried out in fall 2011 with researchers, students, and educators in the humanities. Beta testers unanimously were enthused about the tool, particularly at having the ability to (1) navigate online through a virtual model of an ancient Maya city, (2) access higher resolution models of objects, (3) query the archaeological database via the model – and vice versa. Suggestions for improvement centered on decreasing the initial download time, improving the user interface (changes to navigation commands, adding a text search box), and adding a broader range of spatial queries. Because the project is still in its initial stages, the paper also summarizes current research problems, and the tasks to be solved in the project’s next stage of development, in collaboration with the German Archaeological Institute and the University of Heidelberg. The paper concludes with a critical assessment of the possibilities that 3D Web GIS systems currently offer scholars and educators in terms of organizing, searching, and visualizing data, and identifying patterns over space and time.  Figure 1a and 1b: Working hypothetical reconstruction and 3D model of Temple 22 created by the MayaArch3D Project (Graphic: Raul Maqueda, from von Schwerin et al. 2011) Figure 2: Copan GIS (Graphic: Heather Richards-Rissetto 2011) Figure 3: QueryArch3D tool showing different data visualization modes and levels of detail. Graphic: Giorgio Agugiaro ", "article_title": "The MayaArch3D Project: A 3D GIS Web System for Querying Ancient Architecture and Landscapes", "authors": [{"given": " Jennifer von", "family": "Schwerin", "affiliation": [{"original_name": "University of New Mexico, USA", "normalized_name": "University of New Mexico", "country": "United States", "identifiers": {"ror": "https://ror.org/05fs6jp91", "GRID": "grid.266832.b"}}]}, {"given": " Heather", "family": "Richards-Rissetto", "affiliation": [{"original_name": "University of New Mexico, USA", "normalized_name": "University of New Mexico", "country": "United States", "identifiers": {"ror": "https://ror.org/05fs6jp91", "GRID": "grid.266832.b"}}]}, {"given": " Giorgio", "family": "Agugiaro", "affiliation": [{"original_name": "FBK Trento, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Fabio", "family": "Remondino", "affiliation": [{"original_name": "FBK Trento, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Gabrio", "family": "Girardi", "affiliation": [{"original_name": "GraphiTech Trento, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}