{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "How were computers introduced to the public and how did humanities issues figure in the introduction of computing? The time has come in the digital humanities to think historically about computing in the humanities as Willard McCarty has pointed out in Humanities Computing and other venues. This paper describes a study of public representations of computing in Canada using the Globe and Mail, our major national newspaper. This paper restricts itself to what we call the incunabular years when computing was still a curiosity and business applications didn’t yet dominate the public discourse.References to digital computers in the Globe and Mail start in 1950 with a report of the annual meeting in London, England of Ferranti Ltd. This report describes under the heading of “Instruments” the development of a digital computer that was probably the predecessor of the Ferranti Atlas which pioneers like Susan Hockey worked on.\"The instrument department has a design team of considerable strength working in conjunction with Manchester University on the development of an electronic digital computer.\" (Globe and Mail, Oct. 31, 1950, p. 21)From this first reference to digital computers buried in a business report, interest in and then anxieties about computers grow steadily through the 1950s and early 1960s until by 1964 the Globe runs a full page story in “The Woman’s Globe and Mail” on “Will Computers Replace the Working Girl?” by Michelle Landsberg (Globe and Mail, May 21, 1964) that warns of the effects of automation on women who do most of the clerical work that can be automated. Computers go from being objects of curiosity in research labs at the University of Toronto with speculative utility to instruments that are changing the nature of office work, especially for women. It is this “incunabular” period that interests us, partly because it is a period when the academy is one of the major sites where computers are being installed and because academics are explaining computers to the broader community. This paper, using these early stories about computers, will tease out a history of early representations of computing in Canada. Specifically we will:  Describe the content analysis methodology used in this study. Discuss the ways computers are presented to the public in the first decade and a half. Who is represented as having access to digital computers? What tasks are they presented as suitable for? Discuss how computing jobs like data-entry, training and programming are gendered in the public discourse of the Globe. Discuss the first references to the installation of computers at Universities and how these installations were presented to the public. How was research computing presented and how were humanities applications of computing presented? The Globe and Mail online archive, unabashedly titled “Canada’s Heritage from 1844,” provides a full-text historical database of articles, ads, editorials and special features. In order to document the early discourse around computers we searched and collected all references to the word “computer” for content analysis coding and reading. The first reference we found dates back to 1897, though in this case it is not a reference to digital computers, but the computer as a type of job. The first reference to digital computers dates from 1950 and the number of references per year remains fairly low until the early 1960s when computing takes off as a subject of news, advertising and opinion.Once gathered we coded the articles for content analysis. The coding rubric was developed iteratively as we read articles and developed hypotheses. For example, during the coding we became interested in gender and went back over the early stories to recode materials. Below is an example of the codes applied:  Type of reference (i.e. news, classified ad, feature) Photos (i.e. were there photos and what do the photos show) Category of Application (University, Science, Military, Automation, Industry, Government, and Arts and Humanities) Gender of Named People (male, female, both, none) Discourse like “Brain” (Is the computer described as a giant “brain”) Types of computers mentioned in the references where applicable Close reading and content analysis led us to identify and follow a number of themes running through the stories in these incunabular years. For example, related to the Ferranti mentioned in the first reference, is a Canadian turn from being oriented towards computing in the UK to being oriented towards computing from the USA. This turn is obviously a much larger issue for Canada after the war than just a change in where computers are coming from, but you see the turn in the articles from the 1950s. Bylines from London dominate in the early 50s, but by the end of the 1950s New York begins to be source of information about computers outside of Canada. You can see the early orientation towards the UK in titles like the 1955 article “Britain Leads in Office Automation.” But, by 1961, in a comprehensive pair of articles on the computer industry, it is clear that US companies dominate. As the author Hugh Munro puts it, “Ferranti is the only company that designs and manufactures in Canada – specializing in big installations – which means the country is heavily dependent on the United States, where the other companies are based, not only for supplies but for technological advancement in the computer field.” (Munro, “Surging Computer Industry Confident It Has Only Begun”, December 6th, 1961, p. 23.)One theme that stands out in the early representations of computing in the Globe is how women were excluded from computing. Advertisements for programmers are in the “Help Wanted Male” section. It isn’t until 1960 that a woman is named in a story and then she is discussed as an exception. The exclusion of women gets discussed explicitly in 1964 when Michelle Landsberg writes the extraordinary feature “Will Computers Replace the Working Girl?” mentioned above (Globe and Mail, May 21, 1964). This feature confronts the effects of automation on women who happen to do most of the clerical work that is being automated. In the full paper we will contrast the exclusion with what we know of pioneers like Beatrice Worsley who was one two staff hired initially by the University of Toronto Computing Centre.  Computers and the Working Girl; Title, Illustration and Text Full Size Image   The second story published about digital computers in the Globe is much more substantial than the Ferranti reference and it describes the first research computer installed in Canada at the University of Toronto. The story titled “Junior Electronic Brain Cost $100,000” dates from 1951, was accompanied by two photographs, and is about the UTEC Jr. computer installed at the U of T’s Computing Centre. It is really the first significant story about computing in the Globe, which is significant. In the full paper we will go into some detail about this first significant representation of computing as it illustrates many of the other points we want to make. Much could be said about the U of T Computing Centre and the birth of academic computing in Canada. Here we will restrict ourselves to the way computing was presented to the public as starting at the University of Toronto. The U of T Computing Centre stayed in the news for decades, along with its director, Dr. Gotlieb, who was the most frequently mentioned expert of the period. But academic computing is not just about Gotlieb and research at his Centre. By 1955 we see the first ads for computing courses at U of T and the first reports of computers at other universities. By 1957 we see an article about computing in the arts and humanities. This article, titled, “Strange Music Made By an Electronic Brain” reports about a music composition experiment.  \"To the casual observer, the squeaks, squawks, groans and hints of tunes were a harsh cacophony. To Professor C. C. Gotlieb and his colleagues, the sounds were the Iliac Suite, a string quartet composed by the electronic brain at the University of Illinois. It was an experiment in composition designed by Prof. Gottlieb and his fellow-workers with the university’s electronic brain to show that humans are not the only ones that can compose music.\"What stands out about this and subsequent stories is that they are about the computer as an extraordinary device best understood as an “electronic brain” performing tasks that are human. The stories don’t really report humanities applications differently from scientific and engineering ones. Instead this research brain is presented as answering questions and completing tasks from all fields – it is a general purpose inquiry engine that the U of T Computing Centre is turning to questions and academic tasks from one field to the next. The brain is curious as we are, and the stories convey a sense of the discovery as Gotlieb’s team crosses disciplines discovering new uses for the computer. What remains to be seen (in a future study) is how the public discourse matches or reflects the evolving discourse within the academy and especially in humanities computing circles. We humanists, after all, are also reading the news; did we come to computing influenced by news of its promise or were we concerned about how it might affect our work?", "article_title": "Computing in Canada: a History of the Incunabular Years", "authors": [{"given": "Geoffrey", "family": "Rockwell", "affiliation": [{"original_name": "University of Alberta", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}, {"given": "Victoria Susan", "family": "Smith", "affiliation": [{"original_name": "University of Alberta", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}, {"given": "Sophia", "family": "Hoosein", "affiliation": [{"original_name": "University of Alberta", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}, {"given": "Sean", "family": "Gouglas", "affiliation": [{"original_name": "University of Alberta", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}, {"given": "Harvey", "family": "Quamen", "affiliation": [{"original_name": "University of Alberta", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}], "publisher": null, "date": "2011", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}