{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Victorian Women Writers Project (VWWP,  (link) ) began in 1995 at Indiana University under the editorial leadership of Perry Willett and was celebrated early on for exposing lesser-known British women writers of the 19th century. The VWWP’s original focus on poetry was meant to complement The English Poetry Full-Text Database, but soon Willett acknowledged the variety of genres in which women of that period were writing – novels, children’s books, political pamphlets, religious tracts. The collection expanded to include genres beyond poetry, and continued active development from 1995 until roughly 2000 at which point the corpus reached approximately two hundred texts. These nearly two hundred texts comprise only a small fraction of Victorian women’s writing. Encouraged by renewed interest among Indiana University’s English faculty and graduate students, the Indiana University Libraries and the English Department are exploring ways to reinvigorate the project. The real challenge lies in the project’s past and present susceptibility to graceful degradation, which can be defined as stagnation or “deterioration of a system in such a manner that it continues to operate, but provides a reduced level of service rather than failing completely” (“Graceful degradation”). This has been a recurring topic in the digital humanities community as evidenced by a recently published article cluster, “Done,” in the Digital Humanities Quarterly (Spring 2009, v 3 n 2) and research by Bethany Nowviskie and Dot Poter on the very topic: “Decline is a pressing issue for digital scholarship because of the tendency of our projects to be open ended. One could argue that digital projects are, by nature, in a continual state of transition or decline. What happens when the funding runs out, or the original project staff move on or are replaced? What happens when intellectual property rests with a collaborator or an institution that does not wish to continue the work? How, individually and as a community, do we weather changes in technology, the patterns of academic research, the vagaries of our sponsoring institutions?” (“Graceful Degradation: Managing Digital Projects in Times of Transition and Decline”). The Orlando Project is a text-based resource containing primary texts, archival documents, biographies, chronologies and bibliographies. Despite the collection’s extensive size, Brown et al. reveal their sustainability challenges in an article published as part of the “Done” cluster: Lack of people, time, or funding has consigned more than one project involuntarily to becoming a static tribute to its former activity. The reasons for this include people moving on, intellectually or institutionally, without taking their projects along with them, or people using electronic media to disseminate without particularly desiring to exploit their potential for continual updating, but even where the will to continue persists, inadequate funding mechanisms for sustainability may make it impossible. This is a shame, since, as we have argued here in the case of Orlando and many other digital publications not only does there remain the potential to enrich the contents, but the first iteration often merely begins to tap the potential of the project’s data architecture and potential for interface development (“Published Yet Never Done”). Unfortunately and to no surprise, the VWWP, quite modest compared to its Orlando Project counterpart, has also suffered from nearly all the challenges highlighted by Nowviskie, Porter, and Brown. In an effort to combat this “darker side of project management,” a framework for continual project support is being explored that reaches beyond any one individual or department (Nowviskie and Porter). At the crux of this framework is digital humanities-focused curriculum-building for the English department in partnership with the library, with a concentration on scholarly encoding and textual editing, working with English faculty, librarians, and technologists. The goals are to leverage domain expertise in the English Department; integrate the VWWP as a core research and teaching tool in the English curriculum; develop TEI and text encoding expertise in faculty and students; and through coursework, internships, and other opportunities, encourage English literature students— graduates and undergraduates—to continually contribute new content to the VWWP. Tools and workflows, such as robust encoding guidelines, quality control assessment, etc. will be provided to ensure proper markup, and the VWWP editorial board will additionally vet course output before submission to the project. Through our newly offered graduate English course (L501, Digital Humanities Practicum), an eager and curious group of students learned not only encoding skills but also began to develop the collaborative practices pervasive in the digital humanities. As part of our talk, we plan to explore whether cultivating “markup skills” are sufficient enough in establishing a digital humanities curriculum (Rockwell) and whether “majoring in English” today means the curriculum should include awareness of the possibilities that arise for new scholarship when technology is applied to literary studies (Lanham). Certainly Indiana University is not breaking new ground or alone in this endeavor, but the literature is scarce is terms of understanding successes of graduate level digital humanities curricula situated in an English or any other humanities department. As Diane Zorich reports in her recent review of digital humanities centers, “A Survey of Digital Humanities Centers in the United States,” archives such as the Willa Cather and Walt Whitman Archives are precisely leveraged for teaching and learning, and this reporting is promising for the Victorian Women Writers Project as a project reconceived to meet both teaching and research needs in a classroom setting (19). Currently, the VWWP is a standard e-text project, although current plans call for phased, modular development that will eventually include now commonplace “Web 2.0/3.0” functionalities. By garnering institutional commitment (at the risk of wavering priorities) across multiple departments (thereby minimizing risk), we hope to achieve the following:   Encourage English department buy-in and continual collaboration by updating the current state of the VWWP’s functionality and modernizing the look-and-feel (eliminate “first impressions” syndrome discussed by Brown et al.)   Establish a sustainable scholarly encoding infrastructure based in the English department curriculum   Provide a consistent mechanism (e.g., coursework output) for critical content to accompany the encoded texts   Facilitate connections between other DLP-supported Victorian projects like the Swinburne Project and the Victorian Studies Bibliography   Evolve the project’s encoding guidelines, inclusion of critical contextual materials, and advanced functionality (e.g., visualizations, textual analysis tools, blog integration, etc.) so that the VWWP becomes a dependable, growing and relevant online resource that can be adopted as a pedagogic and research tool for Victorian scholars  Our talk will introduce the Victorian Women Writers Project, explore curriculum-building strategies; and propose ways in which faculty and students can reliably and perpetually contribute to the VWWP. ", "article_title": "Victorian Women Writers Project Revived: A Case Study in Sustainability", "authors": [{"given": "Michelle", "family": "Dalmau", "affiliation": [{"original_name": "Indiana University Digital Library Program", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Angela", "family": "Courtney", "affiliation": [{"original_name": "Indiana University Digital Library Program", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2011", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}