{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "   Ensuring evidence of women’s experiences and contributions to our world are kept for the public record and adequately represented in memory institutions has been a key challenge for many inside and outside of the academy over the last half century. This material is vital in order to continue the work of retrieving women’s history from ‘the shrouds of silence and obscurity’ and ‘fill in the blank half of a huge canvas’.The title of this paper owes much to the wonderful words of Australia’s first female Governor General, Quentin Bryce, when re-launching the Australian Women’s Register on the 13 October 2009. In her speech she highlighted the words of Adrienne Rich, American poet and feminist, ‘Whatever is unnamed, undepicted in images, whatever is omitted from biography, censored in collections of letters, whatever is misnamed as something else, made difficult-to-come-by, whatever is buried in the memory by the collapse of meaning under an inadequate or lying language – this will become, not merely unspoken, but unspeakable.’ See http://www.gg.gov.au/governorgeneral/speech.php?id=625. The wordes in quotes come from the same source. Over the past decade, the Australian Women’s Archives Project (AWAP) has been developing the Australian Women's Register (http://www.womenaustralia.info/) as a central part of its strategy to encourage the preservation of women’s archival heritage and to make it more accessible to researchers. The Register is a specialist central access point to information about Australian women and their achievements and the multifarious resources in which varying aspects of their lives are documented. It provides a gateway to archival and published material relating to women held in Australian cultural institutions as well as in private hands. A series of small and large grants have contributed to the development of the content of the Register and the technology in which it is captured, managed and made available to as wide an audience as possible via the Web. The National Foundation for Australian Women,Information about the aims of the National Foundation for Australian Women can be found at http://www.nfaw.org/. the community organisation behind the AWAP, plays a significant role in securing project funding, along with driving innovation in its coverage and content.  The latest of these grants, an Australian Research Council Linkage Infrastructure Equipment and Facilities Grant (ARC LIEF) awarded in 2008, allowed the exploration of the Register as part of a federated information architecture to support historical scholarship in digital and networked environments. It involved the investigation of community based methods for populating the Register, as well as enabling the harvesting of its content into emerging national discovery services. With the National Library of Australia (NLA) as a key industry partner, a mechanism for harvesting Encoded Archival Context (EAC)Encoded Archival Context – Corporate bodies, Persons, and Families (EAC-CPF) is a metadata standard for the description of individuals, families and corporate bodies which create, preserve, use, are responsible for, or are otherwise associated with records. Its purpose is to standardize the encoding of descriptions of agents and their relationships to resources and to one another, to enable the sharing, discovery and display of this information. See http://eac.staatsbibliothek-berlin.de/  records from the Register was established for incorporation into their exciting new Trove discovery service,Trove is the National Library of Australia’s new discovery service, providing a single point of access to resources held in Australia’s memory institutions and incorporating rich contextual metadata from a variety of sources. See http://trove.nla.gov.au/. using the Open Archives Initiative Protocol for Metadata Harvesting (OAI-PMH).OAI Protocol for Metadata Harvesting (OAI-PMH) is a lightweight harvesting protocol for sharing metadata between services developed by the Open Archives Initiative. It defines a mechanism for harvesting metadata records from repositories based on the open standards HTTP (Hypertext Transport Protocol) and XML (Extensible Markup Language) in support of new patterns for scholarly communication. See http://www.openarchives.org/pmh/. The federated information architecture which such harvesting services make possible is aimed at increasing the productivity of all those associated with the creation, management and use of source material for historical research. As well as fostering the development of complicit systems, it is also about allowing a rich multiplicity and variety of voices to contribute their knowledge to resource discovery systems. It involves scholars' direct participation in resource description frameworks allowing their extensive, intimate and fine grained knowledge of sources and their relationships to areas of study to become part of networked information infrastructure. It also aims to provide a mechanism by which the flow of information about resources in and out of cultural institutions is improved, allowing researchers to discover, explore and make connections between materials held in disparate locations efficiently and effectively, and in turn to feed that knowledge back into the network.   As a pioneering e-Research initiative, the story of AWAP and the Australian Women’s Register (AWR) offers much insight into the establishment, evolution and sustainability of advanced scholarly information infrastructure to facilitate information intensive collaborative research in the humanities.Christine Borgman, Scholarship in the Digital Age: Information, Infrastructure and the Internet, MIT Press, Cambridge Massachusetts, 2007. It is illustrative of how digital and networking technologies change the roles and relationships of scholars, information professionals, universities and the wider community in order to build greater capabilities, connectedness, robustness and resilience into historical/archival/humanities information systems. Above all it asserts the value of scholarly principles, re-visioned, re-imagined and re-distributed for the digital and networked age, and it places women’s history firmly in the mainstream rather than being consigned to the margins. What began ten years ago as a small, community initiative aimed at securing the uncertain future of women’s archival records has developed into a project of national significance. The fact that it is a feminist project is entirely relevant to the story as well, given the distributed and partial nature of women’s archival collections and the historical circumstances of their production.   This paper will outline and review the development of the Australian Women’s Register, by discussing the problem of female under-representation in the archival record, explaining the implications of this for historical researchers and describing how the AWR works to harness information about existing records while it creates a new ‘community’ archive in cyberspace. There will be an emphasis on how it has and has not been able to address emerging requirements for e-Humanities infrastructure as articulated in reports such as Our Cultural Commonwealth; however, the focus will be on explaining how the successful development of any e-Humanities infrastructure is shaped by the strength of the collaboration between users and developers.American Council of Learned Societies, Our Cultural Commonwealth: The Final Report of the American Council of Learned Societies Commission on Cyberinfrastructure for the Humanities & Social Sciences, 13 December 2006, 43 pp, http://www.acls.org/cyberinfrastructure/OurCulturalCommonwealth.pdf. It will discuss the content and technological developments undertaken as part of the ARC LIEF project, and reflect on the readiness of various stakeholders of the Register to take advantage of these capabilities and participate in the design and development of future ones.  ", "article_title": "Naming the unnamed, speaking the unspoken, depicting the undepicted: The Australian Women’s Register story", "authors": [{"given": " Joanne", "family": "Evans", "affiliation": [{"original_name": "The University of Melbourne, Australia", "normalized_name": "University of Melbourne", "country": "Australia", "identifiers": {"ror": "https://ror.org/01ej9dk98", "GRID": "grid.1008.9"}}]}, {"given": " Helen", "family": "Morgan", "affiliation": [{"original_name": "The University of Melbourne, Australia", "normalized_name": "University of Melbourne", "country": "Australia", "identifiers": {"ror": "https://ror.org/01ej9dk98", "GRID": "grid.1008.9"}}]}, {"given": " Nikki", "family": "Henningham", "affiliation": [{"original_name": "The University of Melbourne, Australia", "normalized_name": "University of Melbourne", "country": "Australia", "identifiers": {"ror": "https://ror.org/01ej9dk98", "GRID": "grid.1008.9"}}]}], "publisher": "Centre for Computing in the Humanities, King's College London", "date": "2010", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}