{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The use of computational methods of stylistic analysis to consider issues of categorization and authorship is now a widely accepted practice. The use of computational techniques to analyze style has been less well accepted by traditional humanists. The assumption that most humanists make about stylistics in general, and about computational stylistics in particular, is that it is “concerned with the formal and linguistic properties of the text as an isolated item in the work” (Clark 2005). There are, however, two other points of emphasis that are brought to bear on a text through a cognitive approach. These are: “that which refers to the points of contact between a text, other texts and their readers/listeners”, and “that which positions the text and the consideration of its formal and psychological elements within a socio-cultural and historical context” (Clark 2005). Urszula Clark (2005) argues that these apparently independent strands of analysis or interpretive practice are an “integrated, indissolvable package” (Clark 2005). Computational stylistics of the kind undertaken in this study attempts to link statistical fi ndings with this integrated indissolvable package; it highlights general trends and features that can be used for comparative purposes and also provides us with evidence of the peculiarities and creative adaptations of an individual user. In this case, the individual user is Elizabeth Cary, the author of the earliest extant original play in English by a woman, The Tragedy of Mariam, The Fair Queen of Jewry (1613). As well as Mariam, the set of texts in the sample includes the other 11 closet tragedies associated with the “Sidney Circle”, and 48 tragedies written for the public stage. All plays in the study were written between 1580 and 1640.1 The only other female authored text in the group, Mary Sidney’s Antonius, is a translation, as is Thomas Kyd’s Cornelia2.Alexander Witherspoon (1924), describes the Sidnean closet tragedies as “strikingly alike, and strikingly unlike any other dramas in English” (179). He attributes this to the extent to which the closet writers draw on the work of French playwright Robert Garnier as a model for their own writing. In contrast to other plays of the period closet tragedies have not attracted much in the way of favourable critical attention. They are, as Jonas Barish (1993) suggests, “odd creatures” (19), and Mariam is described as one of oddest. Mariam, as it turns out, is the closet play that is most like a play written for the public stage, in terms of the use of function words. But this isn’t immediately obvious. Some textual preparation was carried out prior to the analysis. Homographs were not tagged, but contracted forms throughout the texts were expanded so that their constituents appeared as separate words. The plays were divided into 2,000 word segments and tagged texts were then run through a frequency count using Intelligent Archive (IA). A total of 563 two-thousand word segments were analysed, 104 of which were from closet plays, and 459 from plays written for the public stage. A discriminant analysis on the basis of the frequency scores of function words demonstrates that there are signifi cant differences between the two groups of plays. Table 1 shows the classifi cation results for a discriminant analysis using the full set of function words. In this test, 561 of the 563 segments were classifi ed correctly. One segment from each group was misclassifi ed. Thus 99.6% of cross-validated grouped cases were correctly classifi ed on the basis of function words alone. The test also showed that only 38 of the 241 function word variables were needed to successfully discriminate between the groups. A principal component analysis (PCA) gives additional information about the differences and similarities between the two sets. An Independent-samples T-test was used to identify the variables most responsible for the differences. This process picked out 54 variables that were signifi cant at the level of 0.0001 and these 54 variables were used for the PCA. PCA looks to defi ne factors that can be described as most responsible for differences between groups. For this text, the texts were broken into 4000 word segments to ensure that frequencies remained high enough for reliable analysis. This produced 268 segments in total (50 closet segments and 218 public play segments). Figure 2 plots the 54 most discriminating words-types for the fi rst two eigenvectors (based on factor loadings for each variable) and shows which words behave most like or unlike each other in the sample. In Figure 3 the eigenvalues from the component matrix have been multiplied through the standardised frequencies for each of the 4,000 word segments to show which segments behave most like or unlike each other on the fi rst two principal components. The scores that produce Figure 3 are “the sum of the variable counts for each text segment, after each count is multiplied by the appropriate coeffi cient” (Burrows and Craig 1994 68). High counts on word variables at the western end of Figure 2 and low counts on word variables at the eastern end bring the text segments at the western end of Figure 3 to their positions on the graph. The reverse is true for text segments on the eastern side of Figure 3. We can see that the far western section of Figure 3 is populated predominantly with public play segments, and that the eastern side of the y-axis is populated exclusively with segments from stage plays. It is clear that in the case of these most discriminating variables, the segments from Mariam are the closet segments most intermingled with the segments written for the public stage. Looking at Figure 2 there is evidence of an “emphasis on direct personal exchange” in western section of the graph. In the opposite section of the graph there is evidence of a more disquisitory style of language that is “less personal”, with “markers of plurality, past time, and a more connected syntax” (Burrows and Craig 1994 70). It may be that the results refl ect the kinds of observations that critics have long made about early modern closet tragedy and tragedy written for the public stage, suggesting that “word-counts serve as crude but explicit markers of the subtle stylistic patterns to which we respond when we read well” (Burrows and Craig 1994 70). It may also be the case, however, that we can link these statistical results with more interpretive work. Returning to Mariam, the function words which most distinguish the Mariam segments from the rest of the segments of both closet and public plays, are the auxiliary verbs did (8.4) and had (6.9). In the case of did over 500 of the segments have scores of between -1 and 2. Six of the eight of the Mariam segments are extremely high (the two middle segments of Mariam have fairly average z-scores for did). The lowest score occurs in segment 4, when Mariam is conspicuously absent from the action. A very similar pattern emerges for had. In conventional grammars do and other auxiliaries including be and have are viewed as meaningless morphemes that serve a grammatical purpose. Langacker argues that serving a specifi able grammatical function is not inherently incompatible with being a meaningful element (1987 30). Cognitive linguistics suggests that function word schemas interact with each other to produce what Talmy calls a “dotting” of semantic space (1983 226), and that they “play a basic conceptual structuring role” (Talmy 88 51). In this framework, auxiliaries are viewed as profi ling a process – they determine which entity is profi led by a clause and impose a particular construal. Langacker argues, for example, that do always conveys some notion of activity or some kind of volitionality or control on the part of the subject. Have designates a subjectively construed relation of anteriority and current relevance to a temporal reference point (Langacker 1991 239). Talmy argues that have can be understood in terms of force dynamics patterns; it “expresses indirect causation either without an intermediate volitional entity…or… with the “concepts” of force dynamics are “extended by languages to their semantic treatment of psychological elements and interactions” (1988 69). Bringing the tools of cognitive linguistics to bear on the results of computational analysis of texts can provide a framework that validates the counting of morphemes like did and had. The same framework may also shed light on questions of interpretation. This approach appears to provide a disciplined way of identifying and analyzing the linguistic features that are foregrounded in a text, while supporting their interpretation as part of an integrated, indissolvable package.", "article_title": "Function word analysis and questions of interpretation in early modern tragedy", "authors": [{"given": "Louisa ", "family": "Connors", "affiliation": [{"original_name": "University of Newcastle, Australia", "normalized_name": "University of Newcastle Australia", "country": "Australia", "identifiers": {"ror": "https://ror.org/00eae9z71", "GRID": "grid.266842.c"}}]}], "publisher": null, "date": "2008", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}