{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "   Background For some time, the Servei de Lexicometria at the University of Barcelona has been working in conjunction with the Latin Linguistics Group (Catalan acronym GLLUB) of the same university on the promotion and application of quantitative methods and computerized analysis of texts in the field of corpus languages, in this case Latin. Most of the work carried out to date has focused on questions of authorship attribution. Our main object of study is Sextus Iulius Frontinus, a writer of technical prose who was active during the first century AD. Parts of his work present problems of attribution; to add to the difficulty, there are few other candidates for the authorship of the doubtful text. Three texts by Frontinus have survived: De agrimensura (\"Agrimensura\", fragments on land survey and its legislation), Stratagemata (\"Stratagems\", a set of instructional anecdotes for Roman army officers, which illustrated the principles of the art of warfare via examples of strategems selected from Greek and Roman history) and De aquaeductu urbis Romae (\"On the aqueducts of the city of Rome\", a treatise on water supply for Rome). The problem of attribution arises with the fourth and last book of the Stratagemata. The hypotheses proposed by philologists for the date of book IV do not coincide: due to the lack of qualitatively distinctive linguistic features, the pseudo-Frontinus has been placed in the first century (thus a contemporary of the author himself), at the beginning of the second, and between the fourth and fifth. For this reason we decided to work on this text of doubtful authorship by applying quantitative statistical analysis methods with computerized support (Espinilla-Nofre: 1998). In that study, we used some of the quantitative methods that are generally accepted for questions of authorship attribution (Holmes: 1994): the ratio of simple forms/occurrences, the ratio of forms/occurrences with a fixed number of occurrences (fixed N), the ratio of simple occurrences/forms, the ratio of hapax legomena/forms, the R-HonorE function, the ratio of hapax dislegomena/forms and the study of the length of forms. These data allowed a comparison between the doubtful text and the rest of the works of Frontinus. The results in that first study highlighted two points: i. Between the doubtful text and the texts reliably attributed to Frontinus there is no inconsistency (this finding underlines the difficulties facing traditional hypotheses). ii. Another point of reference is required, i.e. another author, with whom to compare the data obtained.  So as the second stage of the project we have decided to approach the problem from another perspective. Following on from previous studies (Tweedie-Frischer: 1999; Frischer-Holmes-Tweedie, et al: 1999) and others, we are keen to analyze the order of the forms in the text in question and to compare them (1) with the texts recognized as Frontinian, and (2) with another text of a later date (control author, Tweedie: 1998). This analysis assumes that there was a change in word order in the Latin sentence between the classical era and the later period (Linde: 1923, Marouzeau: 1953). In spite of the fact that the use of the computer is a considerable aid in performing quantitative analysis of the texts, our study has faced two particular problems from the very beginning:  I. The first derives from the premise of an established word order in Latin. The generalized opinion is that word order is basically S(ubject)-O(bject)-V(erb). However, there are a number of deviations, and certain scholars have questioned the assumption of this standard word order in Latin prose (Pinkster: 1991):  A. Deviations according to sentence type: unlike assertive sentences, in imperatives the verb is usually placed at the beginning. B. Deviations according to type of clause (main or subordinate) and the use of different types of subordinate clauses. C. Deviations deriving from the internal structure of the constituents of the sentence: the general tendency in Latin is to place the syntactically relevant constituents (the heavy material) on the right, and the constituents of less syntactic importance (the light elements) as near the beginning as possible, even though this tendency may be altered for pragmatic and semantic reasons; questions of theme and rheme, or topic and focus. Nonetheless, in our study, we subscribe in principle to the premise that in the classical era the most common order followed by authors in Latin prose was SOV, and, in the later period, SVO.  II. The second intrinsic difficulty when working with corpus languages can be summarized as follows (Ramos: 1996):  A. Productivity: the corpus does not show which of the linguistic rules that can be extracted are the most productive. B. Grammaticality: to clarify the grammatical differences observed between authors it is obviously impossible to consult a native speaker. C. Representativity of the corpus: the corpus at our disposal is a set of materials that has been preserved due to a particular sequence of events. It is not specifically selected for study by linguists.     The Corpus Studied For our study, we compared book IV of the Stratagema of Frontinus with books I, II and III, and also with the work of a control author: De diversis fabricae architectonicae, by Caetius Faventinus, another writer of technical prose who lived in the later period.    Methodology   I. Technical data A. Computerization of the texts in the corpus (ASCII format) B. The computer program used to analyze the corpus was TACT (Textual Analysis Computing Tools), version 2.1. gamma. C. The corpus was coded with COCOA labels, following the marking guidelines of the MAKEBASE module in TACT. D. The data were obtained using the USEBASE module in TACT.  II. Methods of analysis A. We examine whether the verb is in final position in the various texts in our corpus. B. We study the position of the direct object in relation to the verb that governs it. C. We establish the type of clause (main or subordinate) in which the verb is found. D. We establish differences between the position of the verb according to the type of subordinate clause. E. We do not restrict ourselves to cases of direct objects represented by nouns or pronouns in the accusative, but also study cases of governed complement (in genitive, dative or ablative) and those in which the direct object is represented by a subordinate clause.      Working Hypothesis And Results Obtained The aim of our study is to provide arguments to corroborate or reject our working hypothesis: following the traditional assumption of Latin word order, the text of the Stratagemata recognized as authentically Frontinian (books I, II and III) must follow word order SOV, while the work of the control author will predominantly follow word order SVO. According to the word order we find in the doubtful book IV we will be able to place it in one or other era. We will thus have a set of data which, though unable to date the writing exactly, will lend support to one of the traditional philological hypotheses.   ", "article_title": "Word Order in Latin Prose Applied to a Case of Authorship Attribution: Book IV of the Stratagemata by Sextus Iulius Frontinus (1st century AD). The Contribution of Quantitative Methods via Computerized Text Analysis.", "authors": [{"given": "Empar", "family": "Espinilla Buisan", "affiliation": [{"original_name": " University of Barcelona, Spain  ", "normalized_name": "University of Barcelona", "country": "Spain", "identifiers": {"ror": "https://ror.org/021018s57", "GRID": "grid.5841.8"}}]}, {"given": "Montserrat", "family": "Nofre Maiz", "affiliation": [{"original_name": " University of Barcelona, Spain  ", "normalized_name": "University of Barcelona", "country": "Spain", "identifiers": {"ror": "https://ror.org/021018s57", "GRID": "grid.5841.8"}}]}], "publisher": " University of Glasgow ", "date": "2000", "keywords": ["Stylistics"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}