{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "INKE’s Modelling and Prototyping group is currently motivated by the following research questions: How do we model and enable context within the electronic scholarly edition? How do we engage knowledge-building communities and capture process, dialogue and connections in and around the electronic scholarly edition? NewRadial is a prototype scholarly edition environment developed to address such queries. However, its unification of primary texts, secondary scholarship and related knowledge communities, and its re-presentation of the digital scholarly edition as a social edition, an open work and a shared space where users collaboratively explore, sort, group, annotate and contribute to secondary scholarship creation, makes it both a model and prototype for alternative ways of working with and contributing to data-centric humanities research online. Its unique lens — through which a diverse collection of digital humanities objects can be re-imagined, freely explored and iteratively prototyped — is also an argument advocating for evolutions in humanities theory and praxis.", "article_title": "Centre and Circumference: Modelling and Prototyping Digital Knowledge Environments as Social Sandboxes", "authors": [{"given": "Jon", "family": "Saklofske", "affiliation": [{"original_name": "Acadia University, Canada; INKE", "normalized_name": "Acadia University", "country": "Canada", "identifiers": {"ror": "https://ror.org/00839we02", "GRID": "grid.411959.1"}}]}], "publisher": "University of Nebraska-Lincoln", "date": "2013", "keywords": ["interface and user experience design, ontologies, scholarly editing, software design and development, knowledge representation, information architecture, visualisation, crowdsourcing, networks, relationships, graphs, linking and annotation, standards and interoperability"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}