{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Thanks to recent advances in scanning technologies there has been an increase in the number of methods developed for digitizing cultural heritage objects. Many of the resulting 3D models are used for visualization or archiving purposes. Unfortunately, there are still few projects oriented to gain archaeological knowledge from point clouds and triangular meshes. In this paper we present some results of an ongoing project that applies machine learning and computer vision techniques for recognizing, retrieving and classifying cultural heritage objects in an automatic way (Jiménez-Badillo, et al. 2010, 2013; Jiménez-Badillo and Román-Rangel, 2016, 2017; Roman Rangel and Jiménez-Badillo, 2015, Román-Rangel et al., 2014, 2016a, 2016b; Jiménez-Badillo and Ruiz-Correa, 2017). The presentation focuses specifically on a method to analyze style variations of archaeological artefacts with minimal human intervention. This is based on a 3D morphing algorithm proposed by Shelton (2000). Our implementation allows analyzing pairs of objects whose shapes represent the canonical extremes of a continuum, that is, objects that belong to two different “styles” within a cultural tradition. The purpose of the algorithm is taking two extreme shapes (i.e. 3D point-clouds, surface meshes or 3D digital models) as input in order to extract several 3D virtual models whose shape or “style” lies “in-between” the two extremes. This is useful in situations where archaeologists need to decide to which extreme a real artefact is more similar. Archaeologists can also apply the algorithm to compare each object of a collection against all the other members of the set. This would produce an “atlas” of the shape variations expected for such collection, which in turns would facilitate the application of a classification method based on machine learning. The formal mathematical details of this approach can be found in the original paper by Shelton (2000). During the presentation, we plan to offer an intuitive explanation of the algorithm for the benefit of those Humanists who are not experts in mathematics. This can be summarized as follows:  Mathematically speaking, the problem consists in finding correspondences between two 3D point-clouds or surface meshes. This means finding points in surface “A” that match corresponding points in surface “B” with minimal user intervention. The challenge is how to make that the algorithm recognizes meaningful geometric correspondences between models “A” and “B”. In other words, how to find structural geometric correspondences between the points that define, for example, the nose of model “A” with the nose of model “B”, and the same for all other features of the masks. The solution proposed by Shelton is a mathematical equation that fits three criteria:    Similarity. For each point a on surface A, the function  C(a) must find a point close or on the surface B.   Structure. Function C must produce the least possible distortion in the transition from A to B. In other words, the result of function C(a) must have a geometric structure similar to A.   Plausibility. Function C must represent a realistic model derived from surface A.  The first property establishes that C must find real points in A that match points in B. The second condition establishes that the correspondences found between A and B must not be arbitrary. On the contrary, there must be matching substructures of A present in B (e.g. the matching of the nose in A must have some correspondence with the nose in B), so that the deformation makes sense (figure 1). The last condition guarantees that the deformation includes the previous knowledge of the user in terms of which forms are acceptable for the deformation, because it makes no sense to transform a face mask into an airplane, for example. The idea for this project came from the need to rank shape similarities in a collection of archaeological stone masks from Mexico. This includes masks belonging to several well-defined styles, but it also includes many others that cannot be clearly positioned within a specific class because they share features of two or more canonic styles (figure 2).  These masks were found in the Sacred Precinct of Tenochtitlan, the main ceremonial Aztec complex, located in Mexico City. The schematic features of these objects set them apart from other artifacts with more naturalistic style. This has attracted the attention of many specialists and during the last three decades these items have been the subject of intense debate for two main reasons: First, the 162 masks were located in 14 Aztec offerings dating from 1390 to 1469 A.C., yet they do not show typical “Aztec” features. Indeed, their appearance resembles artifacts from the southern State of Guerrero, particularly from the Mezcala region, which is hundreds of kilometers away from the ancient Tenochtitlan.  Such origin would not be rare, as it was common for the Aztecs to import goods from other regions either by trade or by extracting tribute from conquered towns. The style of the masks and figurines, however, is more difficult to explain. It is similar, if not identical, to the style of objects produced in Mezcala and other places of Guerrero during much earlier times, probably during Classic (200 to 1000 A.C.) or even Preclassic times (2000 B.C. to 200 A.C.), while the offerings are Late Postclassic contexts. This leads to the question: Did the Aztecs collected “antique” objects to re-use them in their own offerings?, or the Guerrero/Mezcala styles survived till the late Postclassic period and therefore the offering objects were produced during Aztecs times? It is worth noticing that before the Aztec offering findings very few Mezcala style artifacts had been found in Postclassic contexts. Unfortunately, not enough stratigraphc information is available for collections from Guerrero, so specialists rely purely on stylistic considerations to explain the chronology of these artifacts. Second, it is not clear how many Guerrero/Mezcala styles exist. Some specialists believe there are at least five different traditions (Covarrubias, 1948, 1961; Olmedo and González, 1986; González and Olmedo, 1990), while others recognize only four (Gay, 1967) or two (Serra Puche, 1975). The diversity of views is due in part to a lack of contextual information available for the majority of artifacts found in Guerrero, but it also reflects the subjective criteria used to classify such artifacts.  Clearly, more objective methods are needed to answer questions such as: how many styles were developed in the Guerrero/Mezcala regions?; which specific styles are represented among the offering objects found in the Sacred Precinct of Tenochtitlan?; and more importantly for the purposes of this paper: To which style each mask belongs? Previous studies have tried to solve some of these questions by analyzing object shapes with clustering methods (Olmedo and González, 1986 , González and Olmedo, 1990, Jiménez-Badillo and Ruiz-Correa, 2017), but we believe that the application of morphing algorithms could produce a more objective assessment to solve the problem of style attribution in this and other archaeological collections.  Our application takes examples of two canonical styles and applies the deformation algorithm in order to produce a hundred virtual 3D models whose shapes go from one to the other extreme (figure 3). The virtual models produced in this way represent intermediate steps from style “A” to “B”. Each virtual model has associated a number that indicates its degree of similarity to style “A” or “B”. We can then examine a real archaeological object “c” to determine if its shape is closest to “A” or “B” and by how much. During the presentation we demonstrate a piece of software that implements the morphing algorithm and show, in a visual way, which parts of a 3D model suffer more deformation while transitioning from style “A” to “B” (figure 4). As this is a work in progress, we are interested in receiving feedback from the audience about the relevance of our tools to resolve similar or new archaeological questions and welcome collaboration with other research projects willing to try this generic software for new applications.    Figure 1. The morphing algorithm proposed by Shelton (2000) seeks to generate a sequence of intermediate virtual models from “A” to “B”. To do that, it needs to identify correspondences in geometric substructures (i.e. noses, mouths, etc.) in both models     Figure 2. The first three columns from left to right show nine masks belonging to three different styles from Guerrero, Mexico. The fourth column on the extreme right shows three masks that cannot easily be attributed to the Sultepec, Chonatl or Mezcala styles    Figure 3. A sequence of 3D virtual models produced with Shelton´s algorithm (Shelton, 2000). Notice that each model represents a transition between the shape of mask “A” and the shape of masks “B”    Figure. 4. A snapshot of the morphing software implemented as part of the research project ", "article_title": "A machine learning methodology to analyze 3D digital models of cultural heritage objects", "authors": [{"given": "Diego", "family": "Jimenez-Badillo", "affiliation": [{"original_name": "Instituto Nacional de Antropología e Historia, Mexico", "normalized_name": "National Institute of Anthropology and History", "country": "Mexico", "identifiers": {"ror": "https://ror.org/0509e3289", "GRID": "grid.462439.e"}}]}, {"given": "Salvador", "family": "Ruiz-Correa", "affiliation": [{"original_name": "Instituto Potosino de Investigación en Ciencia y Tecnología", "normalized_name": "Institute for Scientific and Technological Research", "country": "Mexico", "identifiers": {"ror": "https://ror.org/03sbzv212", "GRID": "grid.419262.a"}}]}, {"given": "Mario", "family": "Canul-Ku", "affiliation": [{"original_name": "Centro de Investigación en Matemáticas, A.C. Guanajuato", "normalized_name": "Mathematics Research Center", "country": "Mexico", "identifiers": {"ror": "https://ror.org/02nhmp827", "GRID": "grid.454267.6"}}]}, {"given": "Rogelio", "family": "Hasimoto", "affiliation": [{"original_name": "Centro de Investigación en Matemáticas, A.C. Guanajuato", "normalized_name": "Mathematics Research Center", "country": "Mexico", "identifiers": {"ror": "https://ror.org/02nhmp827", "GRID": "grid.454267.6"}}]}], "publisher": "Name, Institution", "date": "2018", "keywords": ["archaeology", "computer science", "repositories", "sustainability and preservation", "art and art history", "databases & dbms", "artificial intelligence and machine learning", "resource creation", "English", "archives", "and discovery", "digitisation"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}