{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper describes a pilot project to evaluate the use of Geographical Information System (GIS) and web-site technology to explore and display information about forced migration in a region of Macedonia (now northern Greece) from 1880 to the present day. The pilot project explored the approaches, techniques and technologies that would be required for a potential large-scale project. It identified challenges that would be encountered and possible novel solutions that could be applied within a limited budget. The products of the pilot project were a web-based digital resource and a desktop Geographical Information System. The project was hosted by Centre for Computing in the Humanities at King's College London where it is one of a number of projects using such technology for both historical and contemporary data. The partners were The Refugee Studies Centre, University of Oxford, The Centre for Computing in the Humanities, King's College London and The Research Centre for Macedonian History and Documentation, Thessaloniki. The Mapping Migration Pilot Project is one of a new style of digital projects in the humanities that make use of image, spatial database and text-based technologies. It fits the Conference theme \"Computing and Multilingual, Multicultural Heritage\" in a number of ways. It took a range of unpublished material and produced a digital museum of cultural heritage aimed primarily at the communities of its subject matter thus exhibiting a broader social role of humanities computing and the resources it develops .It also benefits scholars in cultural studies, refugee studies and social science history. It demonstrates the application of information technology, especially Geographical Information Systems, to cultural and historical studies. The presentation of information that has both spatial and temporal elements presents issues concerning information design in the humanities History Population migrations were among the decisive factors that contributed to the dynamism of Balkan history. Ancient Greece, the Roman and Byzantine Empires, the settlement of the Slavs, their medieval states as well as centuries of Ottoman rule left a deep impact on the ethnic, political and cultural composition of the peninsula. The Eastern Question and the rivalry of the European powers to participate in the Ottoman heritage introduced the Balkans into modern European history, parallel to the birth of national Balkan states in the nineteenth century. The mobility over the new borders of peoples who lived for centuries in multi-national empires made extremely difficult the establishment of ethnic frontiers based on the principle of national self-determination. The Balkan Wars of 1912-13, and in part World War I, had their origins in nationalist aspirations to complete territorial unification. The peace settlements after 1918 established boundaries very similar to those existing today, but left some populations resentful. Ethnic mixtures resulting from migrations blurred national affiliations in neighbouring Balkan national confines. After 1941, the Balkans became a battlefield between the Allied and Axis forces and the scene of resistance movements significant for the post war settlement. The states followed divergent paths from 1945 to 1990, as Communist governments took power in several. Events since 1989, as governments and economies moved into a transition period to capitalism and western type liberal democracy, the rise of nationalism and civil conflict, and the breakdown of Yugoslavia are of major significance. Project Outline The project focuses on a section of the geographical region of Macedonia, which became the present day Greek district of Kastoria. The material is organised in layers defined by a timeline showing significant events and migrations in the period 1880 to 2000. The backbone of the presentation is a series of about forty maps that were generated during the analysis of data by an off-line Geographical Information System. The displays of spatial data also act as a hub technology linking and structuring data throughout the project and allowing users to navigate their way through this structure. The content is drawn from a collection of quantitative and qualitative material consisting of historical documents, photographs (both contemporary and historical), postcards, short explanatory texts, demographic metadata in databases concerning about a hundred communities and multimedia presentations of places, historical events and cultural phenomena. The database material has been extracted from legacy database systems from the Museum of the Macedonian Struggle. This has both preserved the cultural data and opened it up to a much wider audience. An on-line bibliography on the subject is available. The project presents information that has both geographic and temporal elements, with the time aspect being of particular importance. Organising the qualitative material by both time and geography was an early challenge. The representation of time posed some design questions when considered on its own but when combined with space the challenges and opportunities multiplied considerably. A number of existing projects were studied for possible directions at the outset of the project. Much of the material recorded is unpublished and its availability online provides an invaluable resource. Its presentation through the web site is a form of digital museum presenting both archive and modern multimedia material. The GIS is a powerful visualisation tool that allows historical data to be explored and analysed through the use of maps and charts. Both the Web and GIS aspects of the project have highlighted issues concerning the design of information analysis tools and presentation media. The web site was used to integrate the quantitative and qualitative data and provide a medium for delivering interactive maps and animations. Conclusions Many of the perceived barriers to the more extensive use of spatial data in the humanities are due to the common misconception that if a project uses maps it has to use a GIS. However experience in the project has shown that even simple maps can yield valuable insights. The project also shows how spatial data can provide a \"hub technology' linking and structuring data throughout the project and allowing users to navigate their way through this structure. The unavoidably steep learning curve were minimised by utilising the interoperability of GIS software with existing software that one is familiar with. The costs associated with additional hardware and spatial data acquisition can be minimised by utilising features of GIS software. Features such as \"heads up' digitising and \"mosaicing' avoid the need to buy expensive large format scanning and digitising hardware. The project is one of a new style of digital projects in the humanities that make use of image, spatial database and text based technologies. It has explored methods of taking a range of unpublished material, quantitative and qualitative, and producing from it a digital museum of cultural heritage aimed primarily at the communities it describes. In doing so it exhibits the a broader social role of humanities computing and the resources it develops. It also benefits scholars in cultural studies, refugee studies and social science history. It demonstrates the application of information technology, especially Geographical Information Systems, to areas of cultural and historical studies. The presentation of information with both spatial and temporal aspects has presented a number of issues concerning information design in the humanities. The project demonstrates that a great deal can be achieved in the visualisation of spatial data at a relatively low cost in terms of finance, time and expertise. A number of new technologies were explored and some novel web-based solutions to simple cartographic problems were identified. During the project it also became apparent that sometimes producing maps is not important, what matters is compiling and organising information from diverse sources according to geographical location. The process of visualising the spatial data, with or without a GIS, forces this to be done and provides insights in its own right.", "article_title": "The Application of GIS to the Creation of a Cultural Heritage Digital Resource", "authors": [{"given": "Martyn", "family": "Jessop", "affiliation": [{"original_name": "Centre for Computing in the Humanities, King's College London", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}]}], "publisher": null, "date": "2004", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}