{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Tool development in the Digital Humanities has been the subject of numerous articles and conference presentations (Arts and Humanities Research Council (AHRC), 2006; Bradley, 2003; McCarty, 2005; McGann, 2005; Ramsay, 2003, 2005; Schreibman, Hanlon, Daugherty, Ross, 2007; Schreibman, Kumar, McDonald, 2003; Summit on Digital Tools for the Humanities, 2005; Unsworth, 2003). While the purpose and direction of tools and tool development for the Digital Humanities has been discussed and debated in those forums, the value of tool development itself has seen little discussion. This is in part because tools are developed to aid and abet scholarship – they are not necessarily considered scholarship themselves. That perception may be changing, though. The clearest example of such a shift in thinking came from the recent recommendations of the ACLS Commission on Cyberinfrastructure for the Humanities and Social Sciences, which called not only for “policies for tenure and promotion that recognize and reward digital scholarship and scholarly communication” but likewise stated that “recognition should be given not only to scholarship that uses the humanities and social science cyberinfrastructure but also to scholarship that contributes to its design, construction and growth.” On the other hand, the MLA Report on Evaluating Scholarship for Tenure and Promotion found that a majority of departments have little to no experience evaluating refereed articles and monographs in electronic format. The prospects for evaluating tool development as scholarship in those departments would appear dim. However, coupled with the more optimistic recommendations of the ACLS report, as well the MLA Report’s fi ndings that evaluation of work in digital form is gaining ground in some departments, the notion of tool development as a scholarly activity may not be far behind. In 2005, scholars from the humanities as well as the social sciences and computer science met in Charlottesville, Virginia for a Summit on Digital Tools for the Humanities. While the summit itself focused primarily on the use of digital resources and digital tools for scholarship, the Report on Summit Accomplishments that followed touched on development, concluding that “the development of tools for the interpretation of digital evidence is itself research in the arts and humanities.” The goal of this paper is to demonstrate how the process of software or tool development itself can be considered the scholarly activity, and not solely a means to an end, i.e. a feature or interface for a content-based digital archive or repository. This paper will also deal with notions of value: both within the development community and as developers perceive how their home institutions and the community for which the software was developed value their work. The data for this paper will be drawn from two sources. The fi rst source is a survey carried out by the authors in 2007 on The Versioning Machine, the results of which were shared at a poster session at the 2007 Digital Humanities Conference. The results of this survey were intriguing, particularly in the area of the value of The Versioning Machine as a tool in which the vast majority of respondents found it valuable as a means to advance scholarship in spite of the fact that they themselves did not use it. As a result of feedback by the community to that poster session, the authors decided to conduct a focused survey on tool development as a scholarly activity. After taking advice from several prominent Digital Humanities tool developers, the survey has been completed and will be issued in December to gather information on how faculty, programmers, web developers, and others working in the Digital Humanities perceive the value and purpose of their software and digital tool development activities. This paper will report the fi ndings of a web-based survey that investigates how tools have been conceived, executed, received and used by the community. Additionally, the survey will investigate developers’ perceptions of how tool development is valued in the academic community, both as a contribution to scholarship in their particular fi elds, and in relation to requirements for tenure and promotion. The authors will use these surveys to take up John Unsworth’s challenge, made at the 2007 Digital Humanities Centers Summit “to make our diffi culties, the shortcomings of our tools, the challenges we haven’t yet overcome, something that we actually talk about, analyze, and explicitly learn from.” By examining not only how developers perceive their work, but how practitioners in the fi eld use and value their tools, we intend to illuminate the role of tool development in the Digital Humanities and in the larger world of academia.", "article_title": "Determining Value for Digital Humanities Tools", "authors": [{"given": "Susan ", "family": "Schreibman", "affiliation": [{"original_name": "University of Maryland, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Ann", "family": "Hanlon", "affiliation": [{"original_name": "University of Maryland, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2008", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}