{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  Introduction This paper discusses the controversy over the authorship of the Federalistpapers as seen and studied by traditional historians and by over 100 non-traditional authorship attribution practitioners. The  Federalist papers were written during the years 1787 and 1788 by Alexander Hamilton,  John Jay, and James Madison. These 85 ‘propaganda’ tracts were intended to help get the  U.S. Constitution ratified. They were all published anonymously under the pseudonym, ‘Publius.’  The authorship of certain of the  Federalist essays was disputed from the beginning. Both Hamilton and Madison produced lists that claimed some of the same papers. There followed a series of lists, some claiming authorship for Madison and some for Hamilton. The consensus of traditional scholarship, seconded by Mosteller and Wallace, allocates  the papers: Hamilton 51 (1, 6-9, 11-13, 15-17, 21-36, 59-61, 65-85); Madison 29 (10, 14, 18-20, 37-58, 62, 63); Jay 5 (2-5, 64). In 2005, I presented a paper at the ACH/ALLC conference, ‘The Non-Traditional Case for the Authorship of the  Federalist Papers: A House Built on Sand?’’ After 7 more years of  ‘traditional’’ research and the addition of over 70 non-traditional studies of the Federalist, I am able to remove the question mark and put forth a reasoned argument that many, if not all, of the twelve disputed papers are a collaboration and not written solely by Madison, as the consensus of traditional scholarship and non-traditional authorship studies claim.  In 1964, Mosteller and Wallace, building on the earlier unpublished work of Frederick Williams and Frederick Mosteller, published their non-traditional authorship attribution study,  Inference and  Disputed Authorship: The Federalist. It is arguably the most famous and well respected of all of the non-traditional attribution studies. Since then, well over a thousand papers have cited the Mosteller and Wallace  work and over 100 non-traditional practitioners have analyzed and/or conducted variations of the original study.  Mosteller and Wallace set the boundary conditions for the subsequent  non-traditional work – e.g., not using the Jay articles as a control. Most of these later practitioners do not select or prepare the input text as carefully as Mosteller and Wallace – and their selection and  preparation was not as rigorous and complete as it should have been – as we will see.    Problems with the non-traditional case There are many problems with the Mosteller and Wallace study and with the over 90 other non-traditional studies that cast strong doubts on their results:  (1.) The Federalist Papers A crucial step of any non-traditional authorship study is to obtain a ‘starting text.’  As a rule, the closest text to the ‘final’ holograph should be found and  used. Every step away from that holograph introduces systematic errors. (2.) The Hamilton Texts Mosteller and Wallace go outside of the Federalist papers to construct their block of Hamilton tracts. (3.) The Madison Texts Mosteller and Wallace also go outside of the Federalist papers to construct their block of Madison tracts. In the case of the Madison block, there is a 20 year difference in their production dates. And what is worse – some of these outside essays have been shown to be not by Madison. (4.) The Control Texts There is not one non-traditional study that uses any  meaningful controls. The Mosteller and Wallace and Wachal  use of a ‘training set’ is not a control. The closest test to a necessary control is found in the ‘validation’ of four Hamilton papers (79, 80,  82, 85) and other sets by Mosteller and Wallace.   More problems – Arriving at the analysis texts (A) Background and Definitions No attribution practitioner should question the fact that valid texts are needed  if valid results are to be obtained.  No matter how sophisticated the statistical analysis is, a bad text invalidates the results.   (B) Unediting   Editorial Interpolation Printer Interpolation     (C) De-editing  Quotes Plagiarism Collaboration Graphs and Numbers Guide Words Foreign Languages Translations  (D) Editing  Encoding the Text Regularizing Lemmatizing  There are many significant weaknesses in the text preparation part of the Mosteller and Wallace study. For example, they state that:  They ignore the extent of the editing done by the other man [i.e. Hamilton or Madison]  and by all of the ‘outside’ editors. They did not disambiguate words – e.g. the personal pronoun ‘I’ is teated the same as the Roman numeral ‘I’ – the noun ‘abuse’  is treated exactly like the verb ‘abuse’. They do not publish complete details of their ‘little book of decisions’ or the rational behind any of these decisions. – They do not use the newspaper versions of the first 77 papers. They typed the text onto cards to be read by the computer, but  for reasons of ‘economics’ they used hand counts for much of  their study. They write about the many problems this introduces but do not assign any systematic errors – e.g. (1) they show the  differences in the hand counts vs. the machine counts, (2) they  tell us that their proofreaders missed missing words, repeated lines, and single word repetitions. Missing bibliographical sources – e.g. Smyth and Wachal.   One of the guiding principles of any scientific study is ‘reproducibility.’  Any other practitioner should be able to reproduce a given study and get identical results. None of the over 90  Federalist studies mentioned in this paper give anywhere near the information  needed – a fatal flaw. Time will not allow for a detailed explication of these  studies. In essence, they are all fatally flawed – many do not indicate which edition they used, most either did no unediting, de-editing, or editing –  or they fail to say if they did anything to the text.                       The case for ‘collaboration’ There can be no doubt that the Federalist project was a collaboration – a collaboration on many levels – but the depth of that collaboration is what is in question.  We know that Publius’ Federalist series was the product of three men –  Hamilton, Madison, and Jay. No one disputes this, as long as specific papers are not discussed. Most scholars agree that  Federalist 18, 19, and 20 were written jointly  by Hamilton and Madison. Exactly what parts were by which man is not agreed upon. There is strong evidence that Hamilton and Madison also had joint hands in many other numbers of the Federalist – including the twelve disputed papers. The evidence comes from traditional and non-traditional authorship attribution  methodologies.  Traditional  1840 – Renwick’s Lives of John Jay and Alexander Hamilton. 1894 – Whitaker’s, ‘A Problem in Authorship: Who Wrote “The Federalist?”’ 1978 – Smyth’s, ‘The Federalist: The Authorship of the Disputed Papers.’ 1984 – Cary’s, ‘Publius – A Split Personality.’ 1984 – Furtwangler’s,  The Authority of Publius: A Reading of  the Federalist Papers. 1999 – Kesler’s ‘Introduction to the Federalist Papers.’       Non-Traditional The Collins et al. study, ‘Detecting Collaborations in Text: Comparing the Authors’ Rhetorical Language Choices in the Federalist Papers’ confirms the premise of a deeper collaboration. Most of the  non traditional authorship studies do not agree with each other. A list will be shown that reveals how many times each of the twelve disputed papers have been attributed to Hamilton in the over 90 other non-traditional studies.                 Conclusion This paper concludes with a discussion of the following:  Acceptance of Results by Non-Traditional Practitioners Acceptance of Results by History Scholars Do the Multiple Flaws in the Non-traditional Studies Invalidate the Results  The bibliography for this paper contains  well over 300 entries. The following is just a sample.  ", "article_title": "The Twelve Disputed ‘Federalist’ Papers: A Case for Collaboration", "authors": [{"given": " Joseph", "family": "Rudman", "affiliation": [{"original_name": "Department of English, Carnegie Mellon University, USA", "normalized_name": "Carnegie Mellon University", "country": "United States", "identifiers": {"ror": "https://ror.org/05x2bcf33", "GRID": "grid.147455.6"}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}