{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In the last few years a consistent number of papers focussed on new theoretical frameworks for scholarly digital editions practice (Vanhoutte 2000a, Vanhoutte 2000b and Flanders 1998). The main attention has been paid on text encoding, on the production of apparatus criticus or variourum and its transposition form the paper to the digital format (Vanhoutte 2000a, Vanhoutte 2000b, McGann 1996 and Lavagnino 1996). Another focus is the role of the editor and whether a scholar edition must have as a goal the production of a text (a quotable text) or just different textual materials in order to allow the reader to choose his/her version of the text; a third possibility being an equilibrium (to be found) between the two school of thinking (Vanhoutte 2005). Connected to the latter point is the consideration that a digital edition based on encoding can be re-used for many purposes (e.g. electronic inspection, computer assisted analysis), and gives the possibility of producing different versions of the same text (critical, diplomatic, facsimile, reading editions, hypertext editions), according with different kind of users and readers from the same encoded text by the application of different stylesheets. In this paper I will address to a different consideration of stylesheets to be seen not only as a tool to produce different layers of the encoded texts, but as an essential component of the scholar’s work and a possible shortcut toward a compromise in the dichotomy textual criticism vs. cultural criticism, as in Vanhoutte 2005. Some time ago I started to prepare a digital edition of an Italian Renaissance’s comedy, Lo Stufaiuolo, written by Anton Francesco Doni, presumably in 1550-1551. We posses two different autographic manuscripts of the text, each of them witnessing a different and remarkable version, a fact that involves the necessity of a synoptic edition. The first question to be answered in digital edition field is certainly which kind of edition to produce: an editor-oriented or a user-oriented edition. In my opinion, according with the Italian editorial school’s theories, an editor must produce a quotable, reliable text or at least, to provide an orientation to the reader: the editor is probably the person who know the most about the text, and can not skip the task to provide the readers his circumspect opinion/version of the text. On the other side, an editor must also provide all the documentation possible of his work, according to a fundamental presumption of the scientific nature of a critical edition that lays on the possibility for the reader to reproduce/ control/verify the editorial work. For that reasons I chose to provide different versions of the text (of both texts, in this case), ranging from a minimum to a maximum of editorial intervention, in order to satisfy different readers’ needs, accompanied by ancillary documentation on the editorial work and by the photographic reproduction of the source. Due to the big interest of the Doni’s language, a peculiar point of the edition would have been the preserving of the original face of the text, allowing at the same time to non-scholar readers to appreciate the text itself, that is very funny and with a huge literary value. Starting the work, I focussed my attention to the very first level of the language: orthography and punctuation. In paper-based critical editions there is often the necessity of re-write the text in order to allow modern reader to easy decrypt it. The orthography and punctuation rules of most modern languages have sensibly changed from Middle Age since today. At the dawn of the writing of modern languages we can not even speak of orthography but of different writing habits, relayed to different cultural centres. Furthermore, very early texts are in scriptio continua and for many centuries the word-borders have been sensibly different from the present ones. Orthography and punctuation have reached the present relative stability through different phases and approximation levels in relative recent years; for Romance languages, for example, the Latin graphical habits had a long persistence in writing. Normally, in the editorial practice, editors “translate” from ancient writing-face, according to modern rules, declaring in preliminary sections of the printed book the transcription’s criteria. In this way paper-based editions are able to give just a summary of the original’s reality and can not be used by scholars who want to study the original language face, punctuation, orthography or the writing supports: as for apparatus criticus or variorum, transcription criteria in prefatory pages do not allows de facto the possibility of reproducing the editorial work. In such cases to turn back to original or facsimile editions is the only possibility, but such editions are totally resistant to electronic inspections and limit the scholar’s chance of availing large corpora of data. This limitation can be overruled by electronic editions based on text encoding. In fact, the encoding allows adding new meaningful layers without losing any aspect of the original face of the text. For example, adopting the TEI encoding schema, it is possible to encode the original face of the text as follow: <p><orig reg=”Perché”>Per che</orig> le lettere sono state sempre poste <orig reg=”nei”>ne i</orig> degni <orig reg=”e”>et</orig> <orig reg=”onorati”>honorati </orig> luoghi…</p> We can also preview a more sophisticated encoding able to classify the kind of regularization provided (after having extended the TEI encoding schema in order to enable a “type” attribute for the <orig> element): <p><orig reg=”Perché” type=”wordBorder”>Per che</orig> le lettere sono state sempre poste <orig reg=’nei’ type=”wordBorder”>ne i</orig> degni <orig reg=’e’ type=”lat”>et</orig> <orig reg=’onorati’ type=”lat”>honorati</orig> luoghi…</p> With such encoding it will be possible to display the text according to the <orig> face or to the reg face using suitable XSLT stylesheets. In case of multiple editions from the same text, we can also think to editions regularizing each time particular sets of “type”, according with different purposes, for example considering just punctuation or just orthography regularization. The usage of stylesheets can be also anticipated from the delivery phase to the encoding/editorial phase. A useful application of stylesheets during the encoding can be managed by the encoder/editor to monitor its own work and its interventions on the text. Stylesheets, in fact, are able to produce at any moment of the work statistical data in real time, a fact which can help the editor to better understand the writing habits of the author or of the copyist and, at the same time, to keep under control its own work. Similar considerations can be made over the encoding of readings and lemmas, where lists of refused or accepted readings can profitably support theeditorial work in every phase. Stylesheets are a low-cost (or a non-cost), flexible and suitable technology, relatively easy to understand in its principal applications and can be managed directly by the editor, not a secondary concern in low budget projects. In the delivery phase, the same lists and data can be produced to the scientific community, giving explicitness to the editorial practice and overruling the compactness of the introductory notes of paper-based editions. Stylesheets can be reasonably considered not only an ancillary part of the editorial practice, a technology to be recalled after the finish of the scholar work (maybe committed to computer science people), but a part of the work committed to the editor himself/herself, able to support his/her tasks in monitoring the work step by step and able to produce different texts for different tastes, under the editorial control. The paper will conclude by presenting the digital edition of the Doni’s Stufaiuolo, in order to exemplify the results obtained with such methodological approach.", "article_title": "Just Different Layers? Stylesheets and Digital Edition Methodology", "authors": [{"given": "Elena ", "family": "PIERAZZO", "affiliation": [{"original_name": "University of Pisa - Department of Italian Studies", "normalized_name": "University of Pisa", "country": "Italy", "identifiers": {"ror": "https://ror.org/03ad39j10", "GRID": "grid.5395.a"}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}