{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  This paper will discuss the potential impact upon historical research of British History Online's annotation tool. British History Online (BHO)   is a digital library containing some of the core printed primary and secondary sources for the medieval and modern history of the British Isles. Created by the Institute of Historical Research (IHR), which is part of the University of London's School of Advanced Study, BHO  is a rigorous academic resource used by researchers at postgraduate level and above. The IHR is centrally placed within academic history in the UK, and as such it is highly regarded within the profession. Two years ago, as part of an Arts and Humanities Research Council (AHRC) grant, BHO undertook to provide an annotation tool alongside the digitisation of some 500 key historical sources for early modern history: the Calendars of State Papers. These calendars summarise the manuscript heritage of the working of the state in the early modern period. Essential research tools though these calendars are, they were mainly compiled in the Victorian period, and are known to be inadequate and erroneous in some cases. Furthermore, changes in perspective on history and subsequent research means that the calendars are badly in need of updating: papers which modern editors would think worthy of close attention are sometimes treated very cursorily.  BHO's annotation tool encourages the community of scholars to update, enlarge upon, and correct the calendars, and even to supply fuller transcriptions of documents.  At the planning stage of the tool's development the team looked at other online tools for user commenting, ranging  from scholarly collections such as the Digital Image Archive of Medieval Music to non-academic sites such as the blog-style Diary of Samuel Pepys. This paper will describe the reasons why we decided that an annotation tool was preferable to a  wiki, the design process for the tool, and BHO's subsequent attempts to engage the academic community in online collaborative work: now that the AHRC project has finished (but the annotation tool remains active) DH 2010 will be a good time to assess the successes and failures this aspect of the project and the lessons that might be applicable to other digital resources for historians. The IHR is now involved in a collaborative project, Connected Histories, and the lessons of BHO's annotation tool will have a direct bearing on how the front end for Connected Histories is designed. The paper will also touch upon the issues of moderation of academic work, the role of citation within web 2.0, and the constraints we imposed on annotators in this regard, intellectual copyright and the RAE, and the broader question of how humanities research culture might change as web-based collaboration becomes the norm. The IHR is currently addressing the question of how the research community within history might be mobilised to work together online, in more general ways, with European collaboration, semantic web research tools, and VREs. The paper will conclude by briefly placing these in the context of work already done on the annotation tool.  ", "article_title": "Developing a Collaborative Online Environment for History – the Experience of British History Online", "authors": [{"given": " Jonathan", "family": "Blaney", "affiliation": [{"original_name": "Institute of Historical Research, UK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Centre for Computing in the Humanities, King's College London", "date": "2010", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}