{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This study combines elements of literary theory, citation theory, and techniques of citation analysis to study paratextual elements in the work of Victorian poets Algernon Charles Swinburne, Dante Gabriel Rossetti, and Alfred, Lord Tennyson. Our study focuses on paratexts that resemble a citation, i.e., those paratexts that explicitly reference one or more bibliographic elements, such as author, title, date, or quotation. We find such references in the paratexual elements such as titles, subtitles, epigraphs, dedications, and authorial notes. Our analysis of these referential paratexts will provide different views of these poets as seen through their paratexts and the diverse collection of authors, artists, and works referenced by those paratexts. We will present the findings from a thorough analysis of paratextual reference in Swinburne, Rossetti, and Tennyson, and based on those findings, we will make some preliminary observations about Swinburnian and Victorian paratextual poetics.", "article_title": "Victorian Paratextual Poetics and Citation Analysis", "authors": [{"given": "John", "family": "Walsh", "affiliation": [{"original_name": "Indiana University, United States of America", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}, {"given": "Cassidy", "family": "Sugimoto", "affiliation": [{"original_name": "Indiana University, United States of America", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}], "publisher": "University of Nebraska-Lincoln", "date": "2013", "keywords": ["bibliographic methods / textual studies", "genre-specific studies: prose, poetry, drama, english studies", "xml", "literary studies", "encoding - theory and practice", "text analysis"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}