{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The series You Suck at Photoshop first appeared as a three-and-a-half-minute hoax circulating on the web in late 2007—a one-off Internet meme satirizing home-made, how-to videos ubiquitous on YouTube. Conceived and performed by advertising professionals Troy Hitch and Matt Bledsoe, the video featured an ironic, My-Last-Duchess-style commentary by a fictitious computer geek Donny Holye, who unintentionally reveals messy details of his marital, legal, and emotional life while demonstrating techniques of Photoshop. That same fall, in a special issue of PMLA on “Remapping Genre,” some of the leading voices in the emergent field of the digital humanities discuss the database as a cultural form, and debate the political, ideological, and practical impact of databases on the work of the humanities, and the practices of narrative in particular. The varied contributions to “Remapping Genre” provide a dramatic tableau of twenty-first-century academic humanities confronting the database as a cultural discourse, and speculating on whether it represents an alien nemesis from the world of corporate capitalism, the long-sought embodiment of implicit literary ideals, or a value-neutral complement to narrative linearity.  This presentation argues that “Remapping Genre” and You Suck at Photoshop not only share an historical moment, but constitute a common critical effort to understand and respond to the historical rise of databases in cultural practice. Invoking this unlikely affiliation might seem to announce another scholarly incursion on the popular realm under the pirate flag of Cultural Studies.  The relationship suggested here between academic and popular cultures, however, is less a territorial rivalry than a mutually transformational dialogue.  And, in fact, this transformation is well underway.  On one hand, as contributors to “Remapping Genre” amply document, literary studies is rapidly adopting frictionless, digital tools to perform its daily work: from personal, bibliographic browser plug-ins like Zotero, to online databases like The Walt Whitman Archive, to vast digitalization initiatives like Google Books.  Less recognized, on the other hand, is the degree to which popular, database-driven New Media like Facebook, online games, and the web itself are increasingly being constructed not only by the work of programmers and designers, but by narratives that users, players, and an emerging circle of professional critics employ to shape, remember, and publicize their experiences of virtual database environments.  Such narratives reveal how the texture of language—the friction of fiction—is an integral part of how databases are culturally constructed and experienced, and the extent to which that use of narrative language is conditioned by a literary sensibility. This talk will analyze clips from You Suck at Photoshop—as well as background on the series’ circulation and presentation on the web—to examine the interplay of narrative and database as textual and cultural logics, as well as to suggest the historical transformations that such an emergent dialogic is producing in the relationship between the academic humanities and popular culture. Like Donny Hoyle’s conflicted relationship with Photoshop’s remorselessly vast database of tools, the Digital Humanists featured in “Remapping Genre” express ambivalent responses to database-driven tools of their own academic trade, and debate Lev Manovich’s claim that database and narrative are “natural enemies…[c]ompeting for the same territory of human culture, each claim[ing] an exclusive right to make meaning out of the world” (225). Ed Folsom’s and Kenneth Price’s digital project The Walt Whitman Archive provides a common case in point, serving to ground, historicize, and set in relief the critical differences among these scholars, which echo concerns and anxieties within the profession at large: questions concerning the degree to which databases may or may not threaten narrative forms of thought and meaning (N. Katherine Hayles); the ideological, as opposed to the supposedly libratory, effects of databases, especially mediated by large, corporate interfaces like Google (Jonathan Freedman); the extent to which the seemingly new logic of databases remediates pre-digital, even ancient literacies (Peter Stallybrass and Meredith L. McGill); whether or not the database can be called a genre, perhaps even belonging to the “epic” genre that crosses national and historical boundaries (Wai Chee Dimock); and the problems of deciding whether a tool like The Walt Whitman Archive is really a database at all (Jerome McGann). Beyond particular insights into the database/narrative question, this talk will explore how the very unlikeliness of this dialogue of You Suck at Photoshop and “Remapping Genre” points to emergent affinities and even alliances among popular, academic, and economically “productive” discourses. If these potential alliances have not been sufficiently described, it is not from lack of trying, however. In his monumental book The Laws of Cool, for instance, literary critic and digital theorist Alan Liu attempts to imagine the relationship between the cultures of “the literary”— not just “works of literature as such,” he says, but “the underlying sense of the literary”—and of digital “knowledge work” characterized by an ethos of “cool” (1, 3). “In [capitalism’s] regime of systematic innovation [and creative destruction],” he asks at the beginning of the book, “is the very notion of the literary doomed to extinction if—or, rather, especially if—it dares to imagine a literature of the database, spreadsheet, report, and Web page?” (3). Essentially, Liu is questioning just how “the contemporary humanities and arts…[might] not only make contact with the generations of cool but lead them beyond the present limitations of cool” (381). In his somber Epilogue, Liu declares, “I am a believer at heart…. I think literature will indeed have a place in a new-media world…. But what the eventual nature and position of that literature will be among the convergent data streams of the future is something I do not yet know how to theorize” (389). Like Richard Lanham, Katherine Hayles, and other scholars leading the search for the Holy Grail of would-be database literature, Liu tends to look for examples in high-cultural practices of Internet Art, or what he more inclusively terms “ethical hacking,” but Liu ultimately finds them “too closely associated with anarchist, Situationalist, radical leftist, and/or high-theoretical paradigms…to offer persuasive models for an art that might affect the knowledge worker in his or her ordinary cubicle” (397-98). This talk will argue that such persuasive models, or perhaps models of models, can be found in the ordinary cubicles of slackers like Donny Hoyle—but only if academic culture can develop the critical idiom to describe them. ", "article_title": "You Suck at Narrative: Disciplinarity, Popular Culture, and the Database Logic of Photoshop ", "authors": [{"given": "Craig", "family": "Stroupe", "affiliation": [{"original_name": "University of Minnesota Duluth", "normalized_name": "University of Minnesota, Duluth", "country": "United States", "identifiers": {"ror": "https://ror.org/01hy4qx27", "GRID": "grid.266744.5"}}]}], "publisher": null, "date": "2011", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}