{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " ObjectivesThe aim of the current project is to gain unique insights into popular music by assembling a new database that will combine score-based and audiobased parameters. As such, we are releasing melodic and lyric transcriptions, as well select signalprocessing data to supplement a subset of 100 songs from the already publicly available McGill Billboard Database ( Burgoyne et al., 2011). SampleThe McGill Billboard Database is a systematically sampled, professionally curated collection of harmonic transcriptions for more than 700 distinct songs that made the Billboard Hot 100 weekly charts between 1958 and 1991. Along with time-aligned chord transcriptions, each file features metadata regarding the title of the song, the performing artist, the chart date, the highest rank the song ever achieved on the Billboard Hot 100 chart, and the number of weeks the song spent on the charts. Our corpus focuses on a 100-song collection taken from the original McGill Billboard Database. More than 70 unique artists are represented, ranging from 1958 to 1991. Transcription ProcessAll songs were divided and assigned randomly among a group transcribers, including the authors. Each transcriber was in charge of finding the appropriate recording matching the original chord transcription from the McGill Billboard Database and transcribing melodic and lyrical information using their preferred notational software. In order to alleviate discrepancies among the different transcribers, a set of guidelines in the form of a \"Transcription Style Guide\" was established and distributed prior to the transcribing process. This file stipulated minimum requirements for every transcription, as well as general instructions on how to notate potentially more challenging pitch nuances, such as slides, scoops, and ornaments.We used the timestamps already available in the original McGill Billboard Database to automatically retrieve acoustical information. The data was encoded separately for the left and right channels, thus maintaining information related to stereo panning. Encoding FormatWe opted to encode the new transcriptions in the Humdrum format. Humdrum (Huron, 1995) is both a syntax to encode music information in ASCII representation and a set of tools dedicated to the manipulation of such files, alleviating the problem of having to write a dedicated parser. Figure 1 represents a typical Humdrum file in our corpus.  Impact and Future WorkWe hope that this new collection of musically-rich data will yield new and unexpected research on popular music, and allow possibilities that were, up until now, virtually impossible. We believe that supplementing traditional score-based data (e.g. harmony and melody) with lyrics and loudness descriptors is a necessary step into developing a holistic theory of form in popular music.Our plans for the future are manifold. We hope to increase the size of our corpus, with the goal to eventually provide complete annotations for every harmonic transcription in the McGill Billboard Database. We also wish to continue supplementing this corpus over the next several years with more detailed data. More specifically, we hope to have instrumental solos, drumming patterns, back vocals, and more acoustical information, including spectral annotations.", "article_title": "Supplementing Melody, Lyrics, and Acoustic Information to the McGill Billboard Database", "authors": [{"given": "Hubert", "family": "Gauvin", "affiliation": [{"original_name": "Ohio State University", "normalized_name": "The Ohio State University", "country": "United States", "identifiers": {"ror": "https://ror.org/00rs6vg23", "GRID": "grid.261331.4"}}]}, {"given": "Nathaniel", "family": "Condit-Schultz", "affiliation": [{"original_name": "McGill University", "normalized_name": "McGill University", "country": "Canada", "identifiers": {"ror": "https://ror.org/01pxwe438", "GRID": "grid.14709.3b"}}]}, {"given": "Claire", "family": "Arthur", "affiliation": [{"original_name": "McGill University", "normalized_name": "McGill University", "country": "Canada", "identifiers": {"ror": "https://ror.org/01pxwe438", "GRID": "grid.14709.3b"}}]}], "publisher": null, "date": "2017", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}