{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " This long paper will offer an archeology of the Gale database  Sabin Americana, 1500-1926, tracing its origins through an earlier microfilming project to Joseph Sabin’s  Bibliotheca Americana, a monumental 29-volume “Dictionary of works related to America” begun in 1868 and completed in 1937. While Bonnie Mak, Ian Gadd, and others have explored the bibliographic roots of much-used digital resources like the ESTC and EBBO, the category of Americana has a distinct bibliographic tradition whose digital implications have not been examined. While many contemporary databases derive from earlier bibliographic projects organized by language or nation, “Americana” was for Sabin and his contemporaries a transnational and multilingual category that understood “America” as the entire Western Hemisphere. Sabin and other nineteenth-century bibliographers of “Americana” ultimately produced works with an implied teleological view of a New World history that began with “discovery” and culminated in the emergence of the United States; nevertheless, they conceived of the early history of the hemisphere as a shared one, and their work emerged from an extended scholarly network that encompassed not only the Anglophone but also the Hispanophone world.  While Gale’s database borrows Sabin’s name and title, it is otherwise strikingly vague on the exact nature of its relationship to the original print bibliography. A close examination reveals that, although the structuring logic of the database is not dissimilar to Sabin’s alphabetic schema and indexing, its selection principles and framing radically redefine America as the United States. Unlike the original bibliography, the vast majority of the works included are in English, with few in Spanish and even fewer in indigenous languages. The search interface offers \"subject\" options that uncritically sort the entire span of New World history into U.S.-based periodizations: colonial era, early republic, antebellum, postbellum, and so on. These silent omissions both assume and reinforce the conflation of \"America\" and \"United States.” When a database that claims to be “drawn from Joseph Sabin’s famed bibliography” and, like it, to “cove[r] four centuries of life in North, Central, and South America, and the West Indies,” returns overwhelmingly English-language sources from the “colonial era,” or fails to produce a single hit for one of the most prominent Mexican historians of the nineteenth century while returning dozens for his U.S. counterpart, the effect is not just inaccurate but deeply pernicious. I will argue that this dramatic shift is not so much a function of digital remediation as of a changed scholarly infrastructure that cannot accommodate the capaciousness of “Americana” in its earlier bibliographic sense. The logic of nineteenth-century Bibliotheca Americanas, I suggest, invites us to think otherwise, offering an alternate bibliographic framework that might inform the development of non-proprietary digital systems for bibliographic control.  I will conclude by considering my own work towards this end in the context of the Digital Bibliotheca Americana project. It assembles a freely-available dataset that re-centers indigenous and Spanish-language texts, offers insight into the contours of Americana at scale, and enables computational analysis of the material and conceptual relocation of “Americana” to the United States over the course of the nineteenth century. ", "article_title": "An Archaeology of Americana: Recovering the Hemispheric Origins of Sabin’s Bibliotheca Americana to Contest the Database’s (National) Limits", "authors": [{"given": "Mary Lindsay", "family": "Van Tine", "affiliation": [{"original_name": "University of Pennsylvania, United States of America", "normalized_name": "University of Pennsylvania", "country": "United States", "identifiers": {"ror": "https://ror.org/00b30xv10", "GRID": "grid.25879.31"}}]}], "publisher": "Name, Institution", "date": "2018", "keywords": ["globalization & digital divides", "digital ecologies and critical infrastructure studies", "media archaeology", "historical studies", "film and media studies", "library & information science", "multilingual / multicultural approaches", "English"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}