{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Total of Phonostatistical Distances as Indicator of the Density of Language Taxons: Subgroup, Group, Family, Unity, Phylum, Union and Community. Language taxons (i.e. subgroups, groups, families, unities, phylum, unions and communities) were investigated from the point of view of their dispersion in the way it was first proposed in 1976 and then developed in the further articles and books of the author (Tambovtsev, 1976, 1986, 2003). We consider how compact this or that language taxon (i.e. subgroup, group, family, unity, etc.) on the basis of distribution of certain consonantal groups in the speech sound chain. Therefore, one can speak about a compact or disperse language family. If language taxon is compact, then its internal connections are shorter than its outer connections. Actually, the same notion of compact object is accepted in pattern recognition. The more compact the family is, the more correctly its languages are chosen. If we put in the family a language, which does not belong to the family, then the dispersion of the family rises, thus it becomes less compact. If the language has a similar sound chain, then the dispersion of the group remains the same or becomes less. It means that the family became more compact. In this case we speak about the typological properties of the families. We measure the dispersion of a family by the sum of dispersions of 8 phonostatistical features: frequency of occurrence of labial, front, palatal, velar, sonorant, occlusive, fricative and voiced consonants. It is important that the features do not intersect. The values of the coefficient of variance (V) and T coefficient show the degree of dispersion. The principle is the greater the dispersion, the less compact the family. We have chosen the coefficient of variance and T coefficient since they both keep to the law of commensurability. Comparing different languages of different language families and different morphological structures was possible since all of them have the same 8 phonetic features mentioned above. We have considered the dispersion of the following language taxons: Indo-European (V= 809.13%, T= 9.01; MV= 26.97%, MT= 0.30), Turkic (V= 150.16%, T= 1.66; MV= 18.77%, MT= 0.21), Mongolian (V= 86.24%%, T= 0.66; MV= 10.78%, MT= 0.08), Tungus-Manchurian (V= 148.79%, MT= 1.73; MV= 18.60%, MT= 0.22), Samoyedic (V= 128.04%, T= 1.10; MV= 18.29%; MT= 0.16), Finno-Ugric (V= 193.13%, T= 3.77; MV= 24.14%, MT= 0.47), Paleo-Asiatic (V= 271.14%, MT= 3.71; MV= 33.89%, MT= 0.46), Austronesian (V= 369.65%, T= 7.22; MV= 46.21%, MT= 0.90), Australian (V= 150.59%, MT= 3.83; MV= 21.51%, MT= 0.55), American Indian (V= 346.95%, T= 8.59; MV= 43.37%, MT= 1.07) language families and the Balkan language union (V= 237.89%, T= 2.90; MV= 2974%, MT= 0.36). Analysing the language families, one can come to the conclusion that the most compact is Mongolian (V=86.24%; T=0.66; MV= 10.78%, MT= 0.08), the least compact is Austronesian (V=46.21%; T=0.90). Tungus-Manchurian (V=17.41%; T=0.20) is more compact than Samoyedic (18.29%; T=0.16), Turkic (18.77%; T=0.21), Indo-European (V=28.00%; T=0.61) or Paleo-Asiatic (V=33.89%; T= 0.46). Language groups are more compact in general than language families. Iranian group (MV=13.21%; MT=0.09) of Indo-European language family is the most compact, the least compact is Romanian (MV=27.81%; MT=0.36). Slavonic group (MV=15.21%; MT=0.17) is more compact than Indo-Arien (MV=20.40%; MT=0.23) or Germanic (MV=24.51%; MT= 0.29). Volga group of the Finno-Ugric language family (MV=17.90%; MT=0.13) is more compact than Ugric (MV=27.66%; MT=0.47) or Finnic (MV=29.24%; MT=0.35) group. Altaic super-family is rather compact (MV=25.97%; MT=0.45). However, it is not much more compact than Indo-European (MV=26.97%; T=0.30) or Paleo-Asiatic family (V=33.89%; T=0.46). This fact may support those linguists who consider Altaic as a family, not a super language taxon than a family. Uralic super family taxon is less compact than Altaic (MV=28.31%; MT=0.47), though it is more compact than the Balkan (MV=29.74%; MT=0.36) language union (Sprachbund). Ural-Altaic language taxon (MV=30.98%; MT=0.88) is more (much more) compact than American Indian (MV= 43.37%, MT= 1.07) language taxon. Measuring the typological density of language taxons (subgroups, groups, families, unities, etc.) may help to understand how natural (or correct) these taxons are defined.", "article_title": "The Total Of The Phonostatistical Distances As An Indicator Of The Compactness Of The Language Taxons: Subgroup, Group, Family, Unity, Phylum, Union And Community.", "authors": [{"given": "Yuri", "family": "Tambovtsev", "affiliation": [{"original_name": "Dept of English and Linguistics of KF-NP University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2004", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}