{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The UCLA Encyclopedia of Egyptology (UEE) is a digitally born online publication which provides users with several interfaces to access and reproduce content. Supported by several grants from the National Endowment for the Humanities, the UEE is a highly mediated, peer reviewed information resource on Egyptian history, art, archaeology, geography and language, in which authors selected by an editorial committee are commissioned to write substantial articles with thorough bibliographies and web links. Articles will be regularly updated and previous versions of the text and other assets will remain available throughout the lifetime of the resource, which in principle is built for digital eternity. This time scale may prove not to be of the same longevity as the preservation of ancient Egyptian cultural heritage, but is nevertheless fitting the mindset of scholars who routinely deal with objects of 4000 years old.The UEE is an English language resource, while all head words or entry titles are translated also in Arabic, French and German. The English abstracts are also translated in Arabic and a standard feature of each article. The content of the UEE is available in two forms: the Open Version makes use of eScholarschip, the online publication platform of the University of California. Articles are presented in alphabetic order of the titles, and can be downloaded as PDF (http://escholarship.org/uc/nelc_uee). The UEE Full Version provides a much more sophisticated platform, where users can access information through a wide range of searches, either based on the underlying subject structure, article links, metadata, or through an interactive time-map, which provides access to articles, images and 3D VR reconstructions which refer to the same area, the same time period or both. The granularity of the time map encompasses regions (using either modern or ancient subdivisions), ancient sites, or particular features of the latter, such as a specific gate way, or altar. At present the Full Version is not yet publicly online, but will be moved from development to production in the near future. Information on the URL will be provided on the UEE project development website at http://uee.ucla.edu.The presentation will focus on the many lessons learned while developing the project, including the workflow of all the tasks which are literally performed “behind the screen”. Since this is an international project with editors in the United States, Canada, France, Belgium, Great Britain, and Egypt, with authors as well as peer reviewers from all over the world, the project relies on a large number of disparate web services, which are partly for free, partly subscription based. The commissioning phase is tracked through a number of online spread sheets through Google Docs. Authors receive an invitation by email, which provides them with the scope of the entry, a document with clear indications of what should (not) be included, in order to avoid duplication with related articles. Once an article has been submitted, the peer review platform provided by eScholarship, is used, which enables tracking and automated prodding for authors and peer reviewers. Since many of the authors are non-native speakers of English, the UEE offers a substantive copy-editing service, which streamlines the terminology, spelling and links of the articles. The project coordination, which involves communication on the progress of the extensive mark-up in TEI which is the next phase of bringing an article to online publication, makes use of the commercial project management software BaseCamp (http://37signals.com/).An important point of discussion is the digital and financial sustainability and the different solutions the UEE has proposed to enable the project to expand and be constantly renewed, which is perhaps the greatest asset of an online resource. The history of the venerable printed predecessor of the UEE, the Lexikon der Ägyptologie (published from , shows that bibliographies are outdated in five years after publication, while Egyptological scholarship begins to be outdated in approximately 20 years. Authors are therefore asked to provide twice an update of their article, and after that potentially a new entry will be created, because the development of the discipline is not only reflected in article content, but also in the structure of the resource, the selection of entry titles, and the emphasis on particular sub fields. The strict version control has, therefore, an added benefit: over the course of time the UEE will become effectively a history of Egyptological thought and methodology.This requires, however, that the digital content remains available, and that the editorial process will keep on running, two very demanding conditions. As for digital stability: all assets of the UEE are housed in the UCLA Digital Library, and are accessed from a front-end server which is at present housed at UCLA’s Academic Technology Services. This agreement does not necessarily guarantee digital preservation, because the libraries, at the forefront of digital repository preservation as they are, are also faced with the enormous costs and practical problems of digital preservation. The awareness of the problem is, however, a considerable part of the solution. The financial sustainability is an enormous conundrum. Users have come to expect free, high quality content, academics celebrate the virtue of open access, and yet to build a high quality resource comes with very real costs that need to be covered. The presentation will outline some of the avenues explored to ensure that the UEE will have a long prosperous life.", "article_title": "The UCLA Encyclopedia of Egyptology: Lessons Learned", "authors": [{"given": "Wendrich", "family": "Willeke", "affiliation": [{"original_name": "UCLA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2011", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}