{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  Introduction Digital Humanities (DH) as a discipline is highly collaborative and as such requires a departure from typical humanities work patterns with its focus on the lone scholar (Siemens 2009; Siemens et al. 2011). In particular, DHers must develop new skills and knowledge and negotiate new ways of conducting research and organizing people, financial resources, space and other factors (Scholars’ Lab 2011). In this regard, the Sciences and Applied Sciences can provide guidance and suggest several models upon which DH can draw to achieve project objectives. The Sciences use two primary models of organisation for conducting research. The first model is the typical faculty-directed laboratory where the lead researcher creates a research vision and hires staff to conduct the research. This individual is ultimately responsible for research results, including publications, patents, discoveries, and use of funds, to their department, faculty, university, academic discipline, funders and others. Collaboration occurs at the level of research vision execution, rather than the development of that vision (Haynes et al. 2006). Ultimately, the lead researcher is evaluated by traditional academic measures, including the number of articles, books, patents, lines of software code, and level of grant funding (Cantwell 2011). Many books and manuals are available to guide the new scientist on now to set up and manage a lab, people and resources (Cohen & Cohen 2005; Howard Hughes Medical Institute & Burroughs Wellcome Fund 2006). Alternatively, Big Sciences are using collaboratories to create ‘centres without walls’ where researchers work together to create common access to data and instruments, such as supercomputers, telescopes, and global history databases within an umbrella research area, but do not necessarily work on the same research projects. These collaborations are most successful when everyone contributes to the same degree that they draw upon the common instruments and data (de Moor & van Zanden 2008; Wulf 1993). Various studies have been conducted to evaluate the productivity of these different models (Finholt 2003; Haynes et al. 2006). Alongside these well-evolved and understood models of collaboration – that is those that follow patterns of the single-researcher directed ‘collaborat-ory’ and that of the multiple-researcher directed co-laboratory (Glasner 1996: 111) – opportunities exist to create hybrid organisations and apply within the Sciences and beyond to the Humanities and Social Sciences. But how do these models work within DH? Can they be applied directly to DH or does this community need collaborative research models that differ from those typically found in the Sciences? This paper will examine the experiences of one academic DH lab as it adapts these models, develops collaborative structures, meets its research objectives and produces outputs that can be evaluated by traditional academic measures. It will conclude with recommendations for other Digital Humanists who are setting up their own labs or are collaborating on the creation of new DH centres.   A Case Study The case study focuses on the evolution a DH lab as it experimented with different organisational forms to support collaboration over a seven year period of growth, and three distinct stages of organisation and operation. It initially operated as a single faculty-directed lab with graduate research assistants, postdoctoral fellows, programmers, and others as staff in its first four years. At that point, those who worked in the lab underwent a research visioning exercise, the results of which suggested that a hybridised ‘collaborator’ model would be the most appropriate organisational form, one that would allow a fuller and more active participation of faculty, staff and contractors in visioning, consensual decision-making, and leadership. Finally, the lab returned to a more standard model, with a plan for more structured growth in the future. Over all these transitions, the impacts of these various internal operational models were tracked against standard academic and funding agency benchmarks that included measurable research resource intake, provision of teaching and service, and research outputs, such as books, articles, conference papers, and other types of production, more DH-oriented research outputs in the form of tools and prototype development, and further issues – some measureable, such as documented internal and external complaints, and some less so. As other labs have found, not meeting these targets can lead to reduced grant funding and lack of research space (Cantwell 2011) and, so, meeting such targets is directly tied to the ongoing operation of a lab. Particularly notable among the results discussed is that the lab’s experimentation with a hybridised collaboratory model unintentionally introduced a diffused accountability structure; many internal mechanisms and accountability structures that allowed earlier successes were inadvertently removed as part of the process of hybridising the two models. As a result, with the checks and balances that ensured consideration of basic collaboration principles removed, lab productivity by all measures fell drastically and almost-immediately, and team functionality became severely handicapped. Formal accountability structures themselves became viewed as contrary to collaborative principles and, without those accountability structures in place, it became increasingly difficult for team members to follow through on the development and implementation of project plans; acts of planning became less meaningful in this context as well. Without a set structure that ensured that those contributing resources and those who were accountable to outside structures (Department, the Faculty, university and funding agencies) enacted a leadership role, few sanctions for non-performance existed (de Moor et al. 2008) and ‘free-riding’ became the chief mode of interaction among staff and contractors. Further, an informal work culture developed that was contrary to local and university policies as well as, in some cases, funding agency guidelines; internal lab groups formed, striated, clique-ified, and could not work together. This situation contributed to a dramatic increase in personnel complaints. In the end, the experiment could be judged to be a failure as measured by many common benchmarks. Despite attempts to fuse what the lab felt to be the most desirable features of the single-researcher directed ‘collaborat-ory’ and that of the multiple-researcher directed ‘co-laboratory’, the lab became neither. Upon the feedback from the lab’s advisors, the research lead is moving towards [1] a return to the model of the single-researcher directed ‘collaborat-ory,’ with [2] promise to implement plans to become, more formally, a multiple-researcher directed ‘co-laboratory’ – all the while retaining the strong internal operational structures and hierarchies that were in place before the experiment.   Conclusion This case study contributes to ongoing discussions in DH about appropriate organization forms and accountability mechanisms (de Moor et al. 2008; Dormans & Kok 2010; Warwick 2004) , roles, contributions, and status within projects (#alt-academy, 2011) , and the nature of collaboration (Siemens 2009) . It provides several lessons for consideration. First, Science models for collaboration and the creation of well-functioning labs can be applied within DH (Bland & Ruffin IV 1992; Haynes et al. 2006) . Second, some hierarchy is necessary, particularly when one individual is responsible for sourcing the money and other resources which sustains the lab. This lead researcher is accountable for these funds and ‘must have ultimate authority’ (Lawrence 2006; Rogers-Dilon 2005: 449). Having said this, consensus and active participation in discussions around ways to achieve a lab’s research direction can create an exciting and intellectually productive environment and working relationships, as measured by staff satisfaction and academic metrics. These roles must be backed up with clear objectives, tasks, timelines and consequences for non-performance. Lastly, this case study serves as a cautionary tale for new DH researchers who will be tasked with setting up their own labs, managing staff and research, creating partnerships, while remaining accountable to stakeholders inside and outside the university.   ", "article_title": "Notes from the Collaboratory: An Informal Study of an Academic DH Lab in Transition", "authors": [{"given": " Lynne", "family": "Siemens", "affiliation": [{"original_name": "University of Victoria, Canada", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": " Raymond", "family": "Siemens", "affiliation": [{"original_name": "University of Victoria, Canada", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}