{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " In this paper we seek to elucidate understandings of the self-management of multiple context-dependent identities of Social Networking Sites (SNS) users. Online social networking is now in its second decade and has become a central activity to a large proportion of the global population. This shift is not surprising, as humans are social animals with a need to connect and communicate with each other. SNS augment our existing offline networks, allowing us to keep in touch with people over great distances, share our experiences and associated content, organize our social lives, and discover new contacts beyond physical reach. As previous researchers have noted, many users maintain multiple online identities through which they actively manage their social interactions on the various SNS (Golbeck and Rothstein, 2008).  Most SNS, however, suffer from a common problem that prevents them from capturing the true richness of our offline social networks. As social beings, we tend to participate in different, overlapping social groups, and we adjust our identities to match the contexts, as well as our use to match the constraints imposed by the various SNS. The reasons why people choose to explicitly manage the overlap among social networks, even keeping some networks completely distinct from others, are commonplace and usually not clandestine—for example, teenagers wishing to discuss sensitive health matters in online forums (van der Velden and El Emam, 2013), employees complaining about treatment at work (O’Brien, 2014), or those engaged in political commentary in uncomfortable or dangerous situations (Attia et al., 2011).  The self-management of multiple context-dependent identities represents a topic that deserves greater attention within digital humanities and needs to be further explored and elucidated, since it incorporates the entanglement of online and offline interactivity within and around computer mediated environments (Angelopoulos and Merali, 2013) which can have significant implications for the overall sociability of SNS users (Angelopoulos and Merali, 2015). The self-management of multiple context-dependent identities implies a process in which the users control how the other users with whom they are socially connected perceive them (Baumeister and Leary, 1995; Leary et al., 1995). The extant computer-mediated communication literature highlights the needs of a diverse range of groups to incorporate and maintain multiple identities on a plethora of media, such as hobbyists like cigar smokers (Angelopoulos and Merali, 2013; 2015) and bodybuilders (Ploderer et al., 2008), as well as professionals who need to separate their professional from personal lives (Peluchette et al., 2013). Although the need for users’ multiple context-dependent identities to be further explored and elucidated is highlighted in the literature (Karl and Peluchette, 2011; Peluchette et al., 2013; Talamo and Ligorio, 2001), to date there are very few studies exploring the issue directly (Talamo and Ligorio, 2001).  We adopt a quantitative approach and explore the concept through a survey. We designed the questionnaire based on extensive literature analysis on online/offline identities as well as the environment analysis and the survey planning (Duffy et al., 2000; Karl and Peluchette, 2011; Kodjamanis and Angelopoulos, 2013; Koh and Kim, 2003; Kuhn and McPartland, 1954; Peluchette et al., 2013), and our findings are drawn from a sample of  n=272 participants and guided by a previous pilot study of 60 participants.   Our findings demonstrate that, compared to other SNS, use of multiple accounts is more common within Facebook and Twitter, and considerably less common within LinkedIn. This finding is surprising given the fact that both Facebook and Twitter provide the users with features to manage multiple groups of contacts within a single account, unlike LinkedIn.  Moreover, our findings reveal that behavior between the use of different SNS suggest that different SNS are used to manage different aspects of people’s lives despite the fact that most SNS provide tools for this, yet such tools to manage groups of contacts within SNS are rarely used, as reported by the participants of our study. Such a finding reveals that the tools that are already available and provided by the SNS for the management of multiple context-dependent identities are insufficient and neglected by the users, and thus there is a need for better tools to be implemented by either the SNS or by third parties that take into account the real needs of the users. Exploring the differences between users of multiple accounts and users of single accounts has revealed that those who use more than one account on one or more SNS generally share more personal information with those accounts and tend to engage in more audience management behavior both online and offline. These findings suggest that users of multiple accounts use both control of information and targeted sharing of personal information to manage their identities, highlighting the need for networking activities that can support both behaviors. The combination of these two tendencies also highlights the importance of security and privacy between SNS for these individuals as they reveal a lot of personal information online but want strict control of what information is revealed to whom (boyd, 2010; Edwards and McAuley, 2013; Livingstone, 2008). Practically, the findings of our survey demonstrate the need of users for better tools for the self-management of multiple context-dependent identities, as the current tools provided especially from Facebook and Twitter are insufficient.  The self-management of multiple context-dependent identities is still an issue to be pursued by the organizations behind SNS platforms, and there is a profound need for better tools to be implemented either by them or by third parties. We call, thus, for future research to focus on applied approaches trying to solve this real and practical problem. Our findings are drawn from a sample, which, although adequate for the needs of the study, remains too small to enable us to reflect on a larger scale. Whilst the following step in our future research plans is to expand our scope and explore the concept further, we suggest that future studies should explore the issue on online communities in general, as well as on online communities of hard-to-reach populations (Angelopoulos and Merali, 2013; 2015; Ploderer et al., 2008). ", "article_title": "You can leave your hat on-line: Multiple Context-Dependent Identities on Social Networking Sites", "authors": [{"given": "Spyros", "family": "Angelopoulos", "affiliation": [{"original_name": "Horizon Digital Economy Research Institute, University of Nottingham, United Kingdom", "normalized_name": "University of Nottingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ee9ar58", "GRID": "grid.4563.4"}}]}, {"given": "Michael", "family": "Brown", "affiliation": [{"original_name": "Horizon Digital Economy Research Institute, University of Nottingham, United Kingdom", "normalized_name": "University of Nottingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ee9ar58", "GRID": "grid.4563.4"}}]}, {"given": "Dominic", "family": "Price", "affiliation": [{"original_name": "Horizon Digital Economy Research Institute, University of Nottingham, United Kingdom", "normalized_name": "University of Nottingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ee9ar58", "GRID": "grid.4563.4"}}]}, {"given": "Richard", "family": "Mortier", "affiliation": [{"original_name": "Horizon Digital Economy Research Institute, University of Nottingham, United Kingdom", "normalized_name": "University of Nottingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ee9ar58", "GRID": "grid.4563.4"}}]}, {"given": "Derek", "family": "McAuley", "affiliation": [{"original_name": "Horizon Digital Economy Research Institute, University of Nottingham, United Kingdom", "normalized_name": "University of Nottingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ee9ar58", "GRID": "grid.4563.4"}}]}], "publisher": "Paul Arthur, University of Western Sidney", "date": "2015", "keywords": ["user studies / user needs", "social media", "English", "internet / world wide web", "software design and development"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}