{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Overview A good deal of the emerging research literature concerned with online information resources focuses on information retrieval, which is concerned with the use of search engines to locate desired information. Far less attention has been paid to how the found materials are read and how that critical engagement can be enhanced in online reading environments. Building on research reported in relation to Willinsky’s work in and around the Public Knowledge Project (http://www.pkp.ubc.ca/), Warwick’s “No Such Thing as Humanities Computing?” (ALLC/ACH 2004), and Siemens, et al., “The Humanities Scholar in the Twenty-first Century” (ALLC/ACH 2004), among others pertinent to our community, this paper reports on a study examines the question of whether a set of well-designed reading tools can assist a sample of 15 humanities computing scholars in comprehending, evaluating and utilizing the research literature in their area. In progress at present, the study of our group will conclude in January 2006, with results available in March 2006. Should the paper be accepted for presentation at the conference, at that time the authors will revise their abstract, fully detailing the results of the study, which will include an analysis of the degree to which different types of reading tools (providing background, related materials, etc.) contributed, if at all, to these scholars’ reading experience. Context The larger study, a subset of which is devoted to computing humanists, investigates how journal websites can be designed to better support the reading of research in online settings for a wider range of readers than has traditionally been the case with research. Given that well over 75 percent of research journals now publish online, with a number of them made free to read, the reading experience and audience for research is changing. This work looks at whether the design and structure of the journal’s “information environment” can improve the reading experience of expert and novice readers of this literature. Specifically, it examines whether providing far richer context of related background materials for a given text than is available with print, assists the online reading process. In this way, the study seeks to understand, better, reading for information in online environments. Growing out of Willinsky’s design work in online information environments for schools, policy forums, and academic journals over the last five years, and work within the digital humanities, this study evaluates whether the specific online tools and resources that journals are now able to provide can assist expert and novice readers in making greater sense and use of the research literature. By drawing on related work in reading comprehension in schools, as well as from initial design experiments with journals in online settings, it is posited that information environments that provide links to related resources will enable a wide range of readers to establish a greater context for comprehending and potentially utilizing the research they have come to read. It may also support the critical engagement of more expert readers. This study focuses on testing a context-rich Reading Tools which can accompany each journal article (and if proven useful can also be used with online conference papers, reports, and theses). This tool provides (a) background on the article and author, (b) links from each research article to directly relevant materials (based on the keywords provided by the author), and (c) opportunities for interactivity, such as commenting and contacting the author. Utilizing research studies in medicine and education as the publishing content to be read online, the contribution of this Tool will be assessed with a sample of faculty members and students in education and medicine, as well as well as with a sample of policymakers and members of the public. The study, in this case, is being conducted with computing humanities scholars. A sample of 15 scholars will read an article in their field, and utilize the Reading Tools to see which tools, if any, and to what degree, these tools contribute to their comprehension, evaluation, and interest in utilizing the work they are reading. These tools will connect the reader to the author’s other works, related studies, book reviews, summaries of literary critics; work, online forums, instructional materials, media reoports, and other data bases. The readers will be asked to reflect on their reading and use of the tools in a think-aloud protocol, with the researcher. Lessons drawn from these and other readers’ experience and assessment of the value of the Reading Tools will assist our understanding of the nature of online reading, the potential readership of online research, the role of context in reading, while the study is also intended to contribute to improving the design of journals and other informational resources in online environments.", "article_title": "Giving Them a Reason to Read Online: Reading Tools for Humanities Scholars", "authors": [{"given": "Ray ", "family": "SIEMENS", "affiliation": [{"original_name": "English, U Victoria", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "John ", "family": "WILLINSKY", "affiliation": [{"original_name": "Education, U British Columbia", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Analisa ", "family": "BLAKE", "affiliation": [{"original_name": "Geography, U Victoria", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}