{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Preliminaries Project is an ongoing study that uses social network analysis to better understand the publication of literary texts in the 17th century Spanish Empire. Using the metadata provided in the preliminaries sections of these texts, we have constructed a series of graph databases that allow us to organize this information in a custom tailored and meaningful way. The data is exported to Gephi graph visualization software for analysis to discover patterns, key communities, and structures not apparent in traditional humanistic studies. We then use traditional humanistic techniques to study important points located in the graph. This study demonstrates the utility of social network analysis in understanding Early Modern publication in the Spanish Empire. By using modern tools to analyze large data sets, we show the effectiveness of digital humanities as a tool to locate previously overlooked areas for further study using a more traditional humanistic approach.", "article_title": "Preliminaries: The Social Networks of Literary Production in the Spanish Empire During the Administration of the Duke of Lerma (1598-1618)", "authors": [{"given": "David Michael", "family": "Brown", "affiliation": [{"original_name": "University of Western Ontario, Canada", "normalized_name": "Western University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02grkyz14", "GRID": "grid.39381.30"}}]}, {"given": "Juan Luis", "family": "Suárez", "affiliation": [{"original_name": "University of Western Ontario, Canada", "normalized_name": "Western University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02grkyz14", "GRID": "grid.39381.30"}}]}], "publisher": "University of Nebraska-Lincoln", "date": "2013", "keywords": ["bibliographic methods / textual studies", "data modeling and architecture including hypothesis-driven modeling", "historical studies", "databases & dbms", "cultural studies", "spanish and spanish american studies", "metadata", "literary studies", "visualisation"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}