{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In this paper, I will introduce a new online teaching and research platform on which students can collaboratively transcribe, edit, and translate Latin manuscripts and Greek inscriptions, creating vetted open source digital editions. This platform was created by a group of faculty, software developers, and library professionals at Tufts University to enable students to work with original untranslated documents. By doing so, students not only develop their own language skills and research abilities, but they also contribute to the efforts of the scholarly community worldwide to meet the challenge of publishing large numbers of primary source documents online while preserving high editorial standards as described by Robinson (2010). The platform will be made available as open-source software and since it is language-independent, it can be used to edit and translate any source document in any language and any Humanities field.    The platform is an adaptation of Image J and Son of Suda Online (SoSOL). It allows students to transcribe ancient texts directly from a high-resolution digital image while mapping the text onto the lettering. The transcriptions thus produced are automatically encoded in accordance with the EpiDoc markup guidelines, a standard developed by an international consortium of scholars for the accurate description of inscriptions and manuscripts in TEI XML (see Sosin 2010). This ensures greater visibility for the collection and fosters scholarly dialogue since all documents published under the EpiDoc standard are compatible and can be exploited together in an open-access collaborative context (see Bodard 2008). The students’ work therefore contributes to a worldwide effort to make ancient manuscripts and inscriptions available online. To link all these resources and present the web interface, we used the CITE services (‘Collections, Indexes, and Texts, with Extensions’) developed by the Homer Multitext Project (see Blackwell and Smith 2009). We intend to investigate ways to take advantage of the chain of authority supported by the SoSOL environment to facilitate the process of the long-term archiving of the resources in the Tufts institutional Fedora repository. We will make the data from this project available to the broader humanities community through the Perseus Project.    Initially, the students will be working with Latin manuscripts (ranging in date between the 12th and 19th centuries) held in the Tufts University Library which have been digitized and published online. The students will also edit and translate ancient Greek funerary inscriptions which relate to Marie-Claire Beaulieu’s research on the poetics of Greek epitaphs. The collection created by the students will form a cohesive dataset of Latin and Greek texts which will be used at Tufts for ongoing research projects on ancient literature but will also be a valuable addition to corpora being developed by scholars worldwide such as the EpiDoc databases (see Cayless et al. 2009, esp. 34).    Students will begin their work with a high resolution image of a Latin or Greek document published in our online collection. After receiving training on the decipherment of ancient Greek and Latin scripts, they will transcribe the texts and map them onto the image of the document using the software described above. The transcription step is important since it allows for careful review: thanks to the direct visual link created by the software between the image of the document and the transcription, the instructor and the audience can instantly evaluate the accuracy of the transcription (see figures 1 and 2).    The second step is to produce a normalized edition of the texts, including the resolution of abbreviations and lacunae, wherever possible. At this stage, two important digital tool sets are integrated with each text. The Alpheios Greek and Latin tools provide interactive lexical and grammatical analysis of each word, and the Perseus tools compute dynamic word lists and help the students and their instructors keep track of the progress accomplished in language learning (see figure 3). The Perseus tools can also be used to design personalized reading lists and exams for each student. Although this project uses Latin and Greek language tools, the design can easily accommodate the integration of similar tools for any language.  The third and final step is translation and annotation, which is crucial for making the texts accessible to a wide-ranging audience of students and scholars in other disciplines as well as the general public. At this stage, students will translate the texts into English and gather as much information as possible on each text, including its date and historical and literary significance. They will establish parallels with other similar texts, which can be implemented as hyperlinks. The entries are finally rounded out with a complete bibliography of the scholarship available on each text and credits naming all contributors to the entry.     After their publication online, the entries will be linked to the SAKAI/Trunk software, an open-access collaborative learning management resource that allows students to design personalized electronic portfolios. These portfolios can be used by instructors to evaluate a student’s overall performance and progress and can also serve in applications for grants, graduate school admission, or in the context of a job search. An entry in this online collection should feature prominently in a student’s portfolio, since it constitutes a valuable and quantifiable language learning experience as well as a piece of original scholarship on a previously unedited and/or untranslated text. Throughout this process, students participate in the efforts of the scholarly community worldwide while perfecting their own language and research skills, thus becoming true citizen scholars.   Figure 1: The transcription step    Figure 2: The submission and evaluation step    Figure 3: The Alpheios tools provide interactive lexical and grammatical analysis of each word  ", "article_title": "Digital Humanities in the Classroom: Introducing a New Editing Platform for Source Documents in Classics", "authors": [{"given": " Marie-Claire", "family": "Beaulieu", "affiliation": [{"original_name": "Tufts University, USA", "normalized_name": "Tufts University", "country": "United States", "identifiers": {"ror": "https://ror.org/05wvpxv85", "GRID": "grid.429997.8"}}]}, {"given": " Bridget", "family": "Almas", "affiliation": [{"original_name": "Tufts University, USA", "normalized_name": "Tufts University", "country": "United States", "identifiers": {"ror": "https://ror.org/05wvpxv85", "GRID": "grid.429997.8"}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}