{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Civil War Washington (CWW) is a thematic research collection that strives to enable users to visualize, analyze and interpret the physical, social, cultural, and political transformation of Washington, D.C. The development of Washington, D.C., during the Civil War is pivotal in American history. When the Compensated Emancipation Act went into effect on April 16, 1862, Washington became the first emancipated city—and the country's largest and most important magnet for freed and runaway slaves. From that moment forward, the city would lead the nation in the sometimes tortuous route from slavery to freedom and from an entrenched system of legal inequality to a new commitment to equality for all. Our work on slavery, race, and emancipation in Washington, D.C., is crucial to our larger long-term study of the city in this time of crisis. We are already studying Civil War Washington from a medical perspective (the number of hospitals jumped from three to nearly one hundred making it a city of hospitals), from a military perspective (the city was the prized objective of Southern military strategy and in response the Union army made it the most fortified city in the world), and in fact from numerous other perspectives as well. With the assistance of a collaborative research grant from the National Endowment for the Humanities, our emphasis in 2010-2013 is to study the history of race, slavery, and emancipation in the city, a story of national importance. The transformation of the U.S. capital has received surprisingly little sustained examination. One reason for this, no doubt, is that developing a rich and accurate understanding of the city's remaking requires not only access to but also synthesis and analysis of large and diverse sets of data, most of which exist only in analogue form. Our project, for example, draws on government reports, journalism, legal documents, diaries, census records, correspondence, city directories, poems, maps, and photographs. A further (and we believe necessary) complication is added by our desire to make a temporally-aware and user-manipulable GIS a significant constituent of our project, perhaps in some ways even its core.  The number of projects, both emergent and established, that claim an interest in GIS and place-based scholarship seems to grow daily. This developing interest is reflected in an increasing number of seminars and training opportunities focused on GIS for the humanities, including at the University of Victoria's Digital Humanities Summer Institute, the Digital Humanities Observatory Summer School in Dublin, and the NEH-funded Geospatial Institute hosted by Scholars' Lab at the University of Virginia. In addition, there is a growing body of work on the value of spatial analysis in the humanities, and historians have taken a leading role in theorizing and conceptualizing the integration of GIS into humanities research, as well as in advancing arguments informed by GIS-enabled research.  In recent years, at conferences such as this, a fair number of projects have been presented as models for addressing the still-daunting set of obstacles to the use of GIS for humanities projects.Martyn Jessop, in his talk At the first Digital Humanities conference in 2006, “The Inhibition of Geographical Information in Digital Humanities Scholarship,\" presented a list of barriers to the application of GIS to humanities projects. This talk, later published in Literary and Linguistic Computing (April 2008), is largely still relevant. In addition, see also the report of the 7th Scholarly Communication Institute at the University of Virginia, \"Spatial Technologies and the Humanities\": http://www.uvasci.org/wp-content/uploads/2009/10/sci7-published-full1.pdf Our experience on Civil War Washington for the past five years, though, suggests that several important challenges have not yet been adequately investigated (let alone addressed). Our talk, then, is designed to be not a celebration of goals achieved but a case study for the consideration of several large issues that face our project and others like it.) Whereas most projects presented as models began with fairly well defined sets of data,For example, see the following DH2010 abstracts: Ian Gregory, \"GIS, Texts and Images: New Approaches to Landscape Appreciation in the Lake District,\" Elton Barker, et al., \"Mapping the World of an Ancient Greek Historian: The HESTIA Project,\" and \" Wayne Graham, \"A New Spatial Analysis of the Early Chesapeake Architecture,\" available at http://dh2010.cch.kcl.ac.uk/academic-programme/abstracts/ ours began with a research question to which we want to apply as comprehensive a variety of data as possible. Our goal is not the digitization of materials for the sake of digitization but the exploration of a complex set of questions about the transformation of Washington, D.C. Further, our goal ultimately is to produce both a scholarly argument of our own and a resource that will enable our users to perform original, and truly meaningful, research based on our data and interfaces. Given these aims, on what basis should one decide the best technologies and methods for data capture, storage, and retrieval? We have responded to these questions based in part on the expertise of project members and the technologies that are familiar to us and local support staff. This strategy has the benefit of quicker development and an ever-more-refined knowledge in specific tools and technologies. Too heavy a reliance on the technologies and methods that one already knows, however, can lead to overlooking a more appropriate approach or set of approaches. 2) Given the fact that capture and storage of geo-referenced textual data can be accomplished in several different ways (e.g., through wholly TEI-XML, through assigning atomistic textual units to database fields, or through a combination strategy that uses both XML and database), what principles should guide the adoption of a particular encoding strategy? What tools exist or are most easily imaginable for making such data available for a wide variety of research approaches? TEI began providing for the georeferencing of textual data only with the release of P5 in late 2007, and we believe that the integration of textual and geospatial data remains an underdeveloped area to which the DH community should give greater thought. Surely it has potential beyond its rather modest application in existing projects. 3) How should a project deal with the catch-22 situation of wanting to develop and enable geospatial and historical analysis using open source tools even as the most adequate tools for the task, regrettably, are proprietary and the use of these proprietary tools is taught in leading DH institutions? In other environments, work on open source GIS has emerged as part of the larger open source and open access movement. The Open Source Geospatial Foundation, for example, is working to “promote the collaborative development of open geospatial technologies and data.”See http://www.osgeo.org/content/foundation/about.html Humanities scholars, however, do not seem to be involved in the organization. What is and should be the role of humanities scholars in the developer community for GIS software? Does the existing open source GIS software originally conceived of by organizations such as the Army Corps of Engineers (Grass GIS) or NASA (MapServer) meet the needs of humanities scholars? We have considered these questions not merely in the realm of abstract ideals, but as immediate and pressing concerns; we wish to use our project's responses to them not as recommendations but as opportunities for critical reflection and discussion. ", "article_title": "Civil War Washington: An Experiment in Freedom, Integration, and Constraint", "authors": [{"given": "Ken", "family": "Price", "affiliation": [{"original_name": "University of Nebraska-Lincoln", "normalized_name": "University of Nebraska–Lincoln", "country": "United States", "identifiers": {"ror": "https://ror.org/043mer456", "GRID": "grid.24434.35"}}]}, {"given": "Brett", "family": "Barney", "affiliation": [{"original_name": "University of Nebraska-Lincoln", "normalized_name": "University of Nebraska–Lincoln", "country": "United States", "identifiers": {"ror": "https://ror.org/043mer456", "GRID": "grid.24434.35"}}]}, {"given": "Liz", "family": "Lorang", "affiliation": [{"original_name": "University of Nebraska-Lincoln", "normalized_name": "University of Nebraska–Lincoln", "country": "United States", "identifiers": {"ror": "https://ror.org/043mer456", "GRID": "grid.24434.35"}}]}], "publisher": null, "date": "2011", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}