{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper will discuss how our newly prototyped POEMAGE visualization tool (see McCurdy et al, 2015), created to identify and visualize complex sonic relationships within individual poems, has provided poetry scholars with new ways to identify and conceptualize metaphor, which has previously been considered computationally intractable because of its semantic and syntactic complexities. It focuses not on the tool's technical details but on the ongoing re-theorization of poetry it has engendered, Close readers are trained to connect every element in a poem to every other in an ambiguous, shifting complex of meaning, which the reader, bringing her own complexities to the process, activates. This poetic dynamic makes computational analysis and visuali-zation of any aspect of poetry a challenge. The goal of our research team has been to take a single poetic element-sound-and treat it computationally and visually at a level of complexity that will make POE-MAGE useful to poets and scholars performing sophisticated close readings of poetry, even as it makes poetry more accessible to students and casual readers. Though sound interacts with the other features operating within a poem, unlike most other features it can be looked at in its own terms and is subject to computer analysis through quantification. As we began, poet Julie Gonnering Lein and I sought to preserve poetry's qualitative, aesthetic experience ; computer scientists Miriah Meyer and Nina McCurdy sought to address open questions in their field. Both goals required moving beyond what the machine could already do. Off-the-shelf software can see exact rhyme quickly, as can a good reader-who will swiftly move on to look for sonic relationships that don't replicate themselves but enact disruptive changes that are hard to identify computationally. To capture the progression of sonic clusters as they repeat in different and evolving combinations not only within but across syllables presents a computational problem that required our technical team to develop RhymeDesign, which allows users to query a broad range of sonic patterns within a poem and to design custom templates to query patterns we haven't imagined. Built on top of RhymeDesign, the POEMAGE interface visualizes and allows users to explore interactions of the queried patterns. In performing this work, we have looked for (and not yet found) computational breakthroughs that might bring metaphor within reach, a process that has required us to consider closely how metaphor works. The difficulty with metaphor inheres even in simple instances. Getting the machine to understand why \"Hope is a bird\" (or, more problematically, \"'Hope' is the thing with feathers\") is a metaphor but \"Juliet is a Capulet\" and \"Karen is a Carpenter\" may be either similar or different statements of fact is not straightforward. Poets as different as Dickinson and Donne play complex metaphors out across entire poems in elaborate and shifting figural structures. To develop a tool that can reliably identify metaphoric relationships as POEMAGE identifies sonic relationships-in real time across the entire poetic field-would require the solution of multiple open problems in computer science. However, recent readings of poems by Dickinson and others, undertaken using POEMAGE, suggest that it is possible to use the tool to access some metaphors not directly but indirectly, leveraging the fact that both rhyme and metaphor operate by substituting one word for another that is different-but-similar, and that inevitably sites of sonic difference-in-similarity point to semantic difference-in-similarity as well. In close reading, we have noted that places the machine marks as being sonically \"interesting\" are also sites of metaphorical action, and that this action often in-heres in, rather than simply existing alongside, the sonic relationships being indicated by the tool. This inherence can emerge through various kinds of sonic relationships, including but not limited to homonyms like \"knot\" and \"naught,\" which POEMAGE shows in Bradstreet's \"Prologue,\" and eye-rhymes like \"blood\" and \"mood,\" which it picks up across Pelizzon's \"Blood Memory,\" about menstruation. In presenting these words as related, even conjoined, the machine opens a space for us to tease out figural connections between a loop in a rope and nothingness, or men-strual blood and emotional pain. A more complex example of metaphor developing through sound occurs in Dickinson's #313:", "article_title": "Getting at Metaphor", "authors": [{"given": "Katharine", "family": "Coles", "affiliation": [{"original_name": "University of Utah", "normalized_name": "University of Utah", "country": "United States", "identifiers": {"ror": "https://ror.org/03r0ha626", "GRID": "grid.223827.e"}}]}], "publisher": null, "date": "2017", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}