{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Digital gazetteers—databases of named places--are becoming widely recognized as an integral element of any application or library that includes geographical information. In the humanities, where historical maps and texts are replete with place names but precise spatial information is often limited, it is often a good practice to conceive of the development of geographical information as beginning from place names (a gazetteer) rather than geometry (a GIS). As a reference work, digital gazetteers are an exceptionally useful tool in their own right, making it possible to trace the history of named places, relate places to one another, link multiple names for the same place across languages, and (with even rudimentary georeferencing), and make maps. As a component of a digital library or web application, gazetteers permit place-based or map-based search, display and integration of any kind of content that includes named places. Finally, using existing service protocols, multiple gazetteers can be searched and used together, allowing very specialized research in historical geography to be used in new contexts. This paper has several components. First, I introduce recent research in digital gazetteers for digital libraries and the humanities, with a primary focus on work by the Alexandria Digital Library and modifications to its standard by the Electronic Cultural Atlas Initiative. Second, I work through several examples of gazetteer design from my personal research in early modern Chinese history, looking at frequently changing places in a time of rapid political change, complex and localized religious spatial hierarchies, and multiple, coexisting civil and military spatial systems. I reflect on a classic cultural geography notion of space from Yi-fu Tuan that “as centers of meaning, the number of places is enormous, and cannot be contained in the largest gazetteer.” In response to Tuan, who made this claim in 1975, I respond both that more recent developments in database design and networked systems mitigate the “largest gazetteer” concern; but also, I claim that it is possible—and, for use in the humanities and related fields of cultural heritage management, essential—to create a gazetteer that acknowledges places as centers of meaning, not just administrative spaces. Finally, I discuss on emerging work by myself and other colleagues in the design of named time period directories. While digital gazetteers are a well-recognized genre (indeed, their antecedents begin long before the digital era), databases of time periods are not. Nevertheless, search, display and integration of historical and cultural information demands that such a resource be developed. Times, like places, have names—overlapping, multiple, hierarchical, and rich with information. Just as time modifies place (as cities are founded, rivers change course, or empires are vanquished), so too does place modify time (as the Abbasid Caliphate refers to a political formation on a particular part of the earth at a given time, or the Neolithic Period begins and ends at different times in, say, the Yellow River valley or the Andes). This paper introduces some of the issues concerned with data modeling and visualization of time period directories along with gazetteers in digital atlases, and discusses next steps.", "article_title": "Digital Gazetteers and Temporal Directories for Digital Atlases", "authors": [{"given": "Ruth ", "family": "MOSTERN", "affiliation": [{"original_name": "Founding Faculty     School of Social Sciences, Humanities and     Arts University of California, Merced", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}