{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In response to a demand made by LUNO (Lorraine Open University), the teaching team of the CTU (University Distance Teaching Centre) of Nancy 2 offered to create a module entitled “Chairing a meeting in English / Conduire une réunion en anglais”. LUNO is an open university regrouping the main higher education establishments of Lorraine, which are bound by a charter. The project was mainly funded by the Regional Council of Lorraine in September 2000. The members of LUNO have developed numerous course modules in their respective fields of competence. The online courses are accessible to any employee or job-seeker in Lorraine. The “Chairing a meeting in English” module is thus aimed at learners in vocational training schemes who wish to follow on-line courses. The specificity of the learners was the first criterion to be taken into account in the preliminary draft. Contrary to academic students, who are extrinsic goal orientated (main objective: to obtain a grade), such learners are more intrinsic goal orientated (main objective: personal challenge) and are consequently more likely to set specific learning goals. However, we endeavoured to arouse the interest of those “non academic” students even more and to adapt the teaching material to the requirements of learners who are already in the labour market. The other criterion was the learners’ differences in language level. Some, who have just obtained their professional baccalauréat, just needed to learn expressions belonging to a specific lexical field. Others, who had finished secondary education a long time ago, wanted to revise the basic language skills before acquiring this specialized vocabulary. Our ambition was to elaborate a module whose flexibility enabled the needs of the broadest and most heterogeneous public possible to be met. We had also to take into account the degree of motivation and commitment of the participants. The rate of dropout being particularly high in distance teaching, we wished to find a means of captivating the learner’s attention throughout the module. Streaming video seemed to us the most appropriate tool to fulfil this role providing that we used it advisedly. We focused our efforts both on the teaching contents and on the storyboard. After the initial work consisting in looking for linguistic tools, mainly in books specialized in commercial and business English, we wished to write dialogues with the objective of arousing the learner’s interest. We planned to give a touch of humour to the content. Thus took form the LMD company (Lorraine Mirabelle Drinks), a liquor manufacturer, whose exports to the United Kingdom are threatened. The agenda of the meeting would primarily be devoted to the analysis of the financial situation and to the measures taken to put the company on its feet again. The “Chairing a meeting” module would be used within the framework of LUNO with a reduced tutorial scheme (complete self-training or reduced tutorial). It was a collaborative training rather than a co-operative one. Collaboration (learner-machine) asking for more autonomy than co-operation (learner/teacher and machine), we wished to simplify ergonomy (video and audio quality, screen visibility, design, weight) to offer the best learning environment possible and to facilitate the learner’s orientation within the module. We had to adapt the technique to the requirements of pedagogy and not the reverse. The video recording was conducted by VIDEOSCOP, a production company of Nancy 2, with significant technical means and staffing. Five native speakers played the various parts: managing director, personnel manager, sales manager, managing director, staff representative, salesperson for Britain. We decided to divide the recording into 11 sequences to allow the learner to adapt his use of the tools to his own pace. For each sequence, we privileged interaction: the possibility of reviewing a passage of the recording, of making a pause, etc. The originality of the module lies in the “surgical cutting” of very short sequences. It offers the learner the possibility to view only the sentences useful to “chair a meeting” .Isolated from their context (the problems encountered by the LMD company...), learners are invited to use them again in a different context. They are accompanied by synonymous sentences, available in the form of audio recordings, in order to offer a wide range of linguistic tools that are used for taking or giving the floor, reformulating, concluding, etc. Different learning activities provide diverse forms of formative assessment. The variety of short activities encourages the learner. Some exercises comprise several levels of difficulty to try to meet the needs of each learner. Lastly, a lexicon (French-English and English-French) is also available. We made the choice to oblige the learner to click on a word if he wants to obtain the translation of it, in order to enhance his receptiveness. An evaluation of the module by the learners has been carried out. The priority of this questionnaire is to evaluate the use of video. The form includes a rating scale and open-ended questions that ask what the learner thinks about the training materials and activities. This research does not include the evaluation of the trainer and the training environment. Our main objective is the upgrading of new video based material that we want to realise. We also intend to revise the different tasks offered in this module to fit the needs of future learners. After the presentation of the “Chairing a meeting” module, the conference will be the occasion to analyze the results of this evaluation, by stressing the contribution of video in the module.", "article_title": "The teaching contribution of video in the “Chairing a meeting” module", "authors": [{"given": "Marc ", "family": "NUSSBAUMER", "affiliation": [{"original_name": "Université Nancy 2, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}