{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " How can Decision Support System (DSS) software aid the interpretation process involved in the reading of ancient documents? This paper discusses the development of a DSS prototype for the reading of ancient texts. In this context the term ‘ancient documents’ is used to describe mainly Greek and Latin texts and the term ‘scholars’ is used to describe readers of these documents (e.g. papyrologists, epigraphers, palaeographers). However, the results from this research can be applicable to many other texts ranging from Nordic runes to 18th Century love letters. In order to develop an appropriate tool it is important first to comprehend the interpretation process involved in reading ancient documents. This is not a linear process but rather a recursive process where the scholar moves between different levels of reading, such as ‘understanding the meaning of a character’ or ‘understanding the meaning of a phrase’ (Youtie 1963; Terras 2006). This realization has been paramount to the development of the DSS prototype. Aiding, not making decisions When examining whether a tool such as DSS can aid the reading of ancient documents it is important first to realize what such a tool can and should do and what it cannot and should not do. I did not set out to develop a tool that could automate the process of reading ancient documents without human interaction. Firstly, I did not wish to see humans removed from this interpretational process and replaced with robotics. Good reading is a reflective as well as a sensational process which engages our abstract mental faculties, and we give it up at our peril (Deegan & Sutherland 2009: viii). Secondly, interpretation is a part of the ‘higher levels of analytic and creative functions which are the prerogative of the human mind’ (Busa 1980: 89) and the symbol-processing powers of a computer should not be mistaken for this (Jonscher 2000: 149). Instead this research has examined how the use of DSS technology can support the interpretative process, among other things, by remembering the complex reasoning that forms a large part of this interpretation process. Remembering decisions and the complex reasoning leading up to decisions is something that DSS is good at. The DSS prototype has demonstrated how this is possible.  Furthermore the prototype has demonstrated other aspects of reading ancient documents, apart from the interpretation process, where IT tools can provide support such as searching huge datasets and the automated publishing of editions. The DSS Prototype The prototype was developed as a proof of concept. First I used existing research on reading ancient documents (Bowman & Brady 2005; Terras 2006; Tarte 2011) to model the network of interpretation (Roued-Cunliffe 2010), and then I developed the DSS prototype to demonstrate how a DSS can aid the interpretation process based on this model.    Figure 1: Screenshot from the DSS prototype (Roued-Cunliffe 2012: 87)  The prototype (Fig. 1) demonstrates how it would be possible to input data and edit the structure and meaning of a document on different levels. Scholars can begin by entering basic structure such as line or character elements and work back and forth between this level and higher levels such as editing the meaning of a letter or word. Furthermore, the prototype enables scholars to use the letters and character elements they have input to search relevant corpora databases for possible parallels. The prototype uses the concept of argumentation, which can be defined as ‘the process of constructing arguments about propositions, and the assignment of statements of confidence to those propositions based on the nature and relative strength of their supporting arguments’ (Fox et al. 1996: 428). In the prototype these statements of confidence are merely whether the user believes the reading to be right or wrong. It does not require users to signify how much they believe in a certain decision. Furthermore, the arguments are either for or against the interpretation in question. No matter how many arguments are for or against any one interpretation the prototype will not try to persuade the user to make a certain decision. The prototype is first and foremost flexible and user-driven and its role is purely that of a good assistant, reminding users of their own decisions and reflections.   Future DSS The DSS prototype, presented in this paper, has been successful in illustrating how this technology can aid such a complex interpretation process, as is the reading of ancient documents. However, in future this prototype will need to be re-developed to contain, among others, a more advanced user interface. With this in hand it would be possible to conduct user testing, which would give a basis for the development of a fully working DSS. I have a suggestion for a future layer-based system that would be user-friendly and could work well in conjunction with a DSS and other useful tools for aiding the reading of ancient documents.   Figure 2: Drawing of the layer-based DSS concept (Roued-Cunliffe 2012: 132)  The layer-based system would contain four types of layers that users can swap and switch between so that they can edit the different layers at any time and edit one layer while others are visible below (Fig. 2). The first types of layers are the image layers. These image layers could be the original image of an object, PMT images of an object (Earl et al, 2011) or enhanced images (e.g. with wood-grain removed or the illumination corrected (Tarte et al, 2011)). The second type of layers are the editor layers which can include a layer for hand-drawn transcriptions of the text, a layer in which to edit the structure of the text (i.e. lines, words, characters and spaces in the text) and a layer in which to add meaning to the text (i.e. this letter is b). The third type of layers is the DSS layer which would resemble the DSS prototype. The fourth and final type of layers are the suggestion layers from which it would be possible to retrieve for example suggested words from a word search engine based on letters input in the earlier editor layer.   Conclusion The research presented in this paper aims to illustrate how DSS software could aid the interpretation of ancient documents and has been successful in doing this through the development of the DSS prototype. The DSS prototype covered different areas of the interpretation process from input to argumentation for and against different decisions. It has illustrated how DSS software can assist scholars by remembering their complex reasoning and suggesting readings along the way. Furthermore, the research describes an idea for a fully formed future DSS based on the finding from the development of the prototype.   Acknowledgements This research is a part of the author’s thesis: ‘A Decision Support System for the Reading of Ancient Documents’ at the Faculty of Classics, University of Oxford. It is funded by an AHRC Doctoral Studentship attached to the e-Science and Ancient Documents (eSAD) project (http://esad.classics.ox.ac.uk/). I wish to thank Prof. Alan Bowman, Prof. Sir Michael Brady, Dr. Melissa Terras, Dr. Segolene Tarte, Dr. Charles Crowther, Margaret Sasanow and John Pybus for their support throughout my research. ", "article_title": "Aiding the Interpretation of Ancient Documents", "authors": [{"given": " Henriette", "family": "Roued-Cunliffe", "affiliation": [{"original_name": "Centre for the Study of Ancient Documents, University of Oxford, UK", "normalized_name": "University of Oxford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/052gg0110", "GRID": "grid.4991.5"}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}