{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  1. Introduction The results of what has been termed the scientific method infuse every aspect of modern life.  Science, as a contested enterprise, affects and is affected by political, economic, technological, social, cultural, religious, and ethical factors. Sensational cases illustrate that people are interested scientific data and the process that produces scientific knowledge.1  Scientific data, and evidence about how it was created, shaped, and interpreted, serve as resources for humanistic studies in disciplines including journalism,2  anthropology,3 history,4 medicine,5 and literary studies.6  If scientific information is to be useful for current and future scholarship, we must answer three fundamental questions: (1) Which information is preserved and made accessible? (2) What evidence does it provide? and (3) How can it be used?   Future users of scientific records will provide conflicting answers: Archivists cannot anticipate the precise nature of future research, and selecting or arranging materials with the expectation of one particular use may preclude transformative uses. If the goal of preservation is to make accessible a record of science that is amenable to disparate analyses and interpretations, information professionals must identify and preserve evidence regarding the process of scientific production, not just the results of the process.  Given that each lab operates differently, preservation programs must use interdisciplinary modes of analysis and techniques, as must users of archives.  The fields of digital humanities, digital curation, data curation, and digital preservation have long been interdisciplinary, and are becoming increasingly hybrid in terms of the disparate theoretical frameworks and tools of analysis that they utilize. It may well be true that the lines between archives, libraries, digital humanities, and publishing are becoming more fluid, yet we believe that archives are well positioned to serve as centralized sites where these intersections lead to greater collaboration and knowledge dissemination.7   2. Academic Archives (AA) Academic and research institutions have traditionally played a leading role in preserving the ‘papers’ (i.e. personal archives) of faculty, including scientists.8.  Archival guides devoted to scientific and technical documentation emphasize that reports, correspondence, photographs, scrapbooks, lab records, and supplementary documentation hold as much continuing research value as formal research products (publications and processed datasets).  Ideally, archivists act upon the basis of the core archival doctrine, respect des fonds: the idea that grouping records by the function or activity that led to their creation best preserves their value as evidence.9 To accomplish this, archivists draw upon concepts and techniques from other disciplines, to protect the records’ provenance and original order.   3. Digital Preservation (DP) DP’s core concepts extend archival doctrine and practice.  DP establishes requirements and processes for maintaining authentic and trustworthy digital objects.10  The Open Archival Information System Reference Model (OAIS) and Trusted Digital Repositories Framework provide recommendations concerning system design, policy development, and institutional commitments.11  Research regarding digital personal papers (including faculty archives) recommends particular acquisition, arrangement, descriptive, and access practices that preserve contextual information regarding the creation and use of digital records, such as documentation about the research environment and the use of communication/dissemination technologies.12   4. Data Curation (DC) DC techniques complement DP and help scholars manage datasets of continuing informational value, by making them preservable, reusable, and computationally reproducible;13 and by developing “high-functioning” metadata.14  While DC provides a rich data-preservation toolkit, it focuses more attention on data than on ancillary documentation, which provides evidence of the ways in which that data was created, used, or interpreted. If the goal is to document the research environment and process, DC methods are but one (albeit, crucial) element in a broader archival strategy.    5. Anthropology Documenting scientific activity, one of many social arenas in which knowledge is constructed, is best accomplished by direct observation. In the absence of ethnography, archives play an important documentary role by providing insight into the context underlying scientific fact creation. Anthropology’s focus on praxis and its reflexive methodological and epistemological underpinnings offer meaningful points of departure for archivists seeking to capture a nuanced record of scientific processes and activities.15 One goal of science is to produce authoritative, published documents: a materialized fact.16  The archival challenge lies in documenting social factors at play from data generation through the various stages of processing and interpretation, to the final “point of stabilisation.”17  Archives can lay bare the social factors that are all too easily stripped out when the fact is reified, allowing us to read against and along the scientific grain.18  As anthropological surrogates, archives must capture the processes and events that destroy and create facts.19   6. Digital Humanities (DH) Network analysis, text mining, and information visualization provide an algorithmic supplement to the pursuit of past, present, and future research questions, enhancing analysis of digital objects.20  Recent work with digitized historical records demonstrates how the algorithmic approach offers a lens with which to gaze upon and ascertain meaning from large and unwieldy bodies of data.21  As the corpus of materials amenable to computational analysis grows in archives throughout the world, approaches of this type are becoming indispensable. While great promise lies in the analytic potential of the DH, its practitioners are increasingly aware of the challenge to making the results of their research preservable and in the optimal case, reusable.22  For their part, the familiarity that archivists have with the lifecycle of data prepares them well for having conversations with digital humanists.23  Archivists can become digital humanists themselves as they utilize approaches like topic modeling to enhance the ways in which they, and their users, interact with archival materials.    7. General Application An archival processing strategy that is informed by anthropological principles and that uses DH tools will facilitate reflexivity between the archivist’s professional practices and the scholar’s interpretive possibilities. Evidence of the knowledge production process can be better preserved by integrating DP, DC, and DH concepts and tools as essential elements of a systematic archival processing workflow covering analog, born-digital, and digitized records.24 Archivists should be particularly attuned to six elements of scientific work: inscription, circumstantiality, noise, conflict, credibility, and reification.25 To document these factors, archivists must modify how they appraise, preserve, arrange, and describe scientific records.  The challenges to the archival task are many, and include:  Recognizing the potential of archival sources as anthropological surrogates. Weighing the value of records in terms of the insight they reveal in terms of the six elements of scientific work that are listed above.  Using tools that preserve authenticity, while also providing scholars the ability to understand how the scientific process played out within the social networks and environment supporting scientific research.  Controlling costs and sustaining the archives over time.    8. Case Study The strategy being used by the University of Illinois at Urbana-Champaign is illustrated by our ongoing work with the records of Carl Woese (1928-2012), 2003 winner of the Crafoord Prize in Biosciences.26  While a full description of the project is beyond the scope of an abstract, we are integrating DP, DC, and DH concepts and tools into three particular points in our workflow.27    Appraisal/Acquisition   Professionally photograph Woese’s laboratory to document microsocial environment. Transfer materials while maintaining original order and recording original placement in lab. Create forensic image of Woese’s laptop to capture records in a consistent, verifiable manner and avoid unintended data modification.28 Extract user files with disk analysis reports to use as surrogate during processing and topic modeling. Used topic modeling and network analysis tools to help develop processing plans.   Processing   Arrange analog records into functional series representing Woese’s activities. Preserve reprint files in original order, including correspondence regarding Woese’s methods and conclusions. Generate preservation metadata for born-digital content, including genomic datasets.29 Use open-software and to identify and remove private/confidential records, and to identify documents speaking to the six factors, and to assist in generation of access copies, including topic model as alternate access point.30   Access   Create a summary online description for all analog and digital files, with file-level inventory.31 Use file conversion and normalization tools to create access copies of the digital and digitized files. Provide access copies in zip format, facilitating application of data analysis tools by scholars. Present topic-modelled view of data as alternative access point.32 Deposit preserved records in Library’s digital preservation repository (Medusa), ensuring long term integrity and accessibility.33 Undertake migration assessment and planning for at risk file formats.  The process described above is surprisingly cost effective when integrated into the “More Product, Less Process” framework for achieving archival efficiency (more information and examples will be provided at the conference and in a full paper, if selected for inclusion in the proceedings).34    9. Conclusion  In the Woese project, we seek to test one means of preserving evidence about knowledge production in scientific archives.  We believe that techniques like those described above can and should be applied to the archives of important scientists, if we wish for those archives to support humanistic research, but--as with all areas of human knowledge--we realize that our own conclusions are subject to revision after being viewed in the bright the light of experience.  ", "article_title": "Constructing Scientific Archives that Support Humanistic Research", "authors": [{"given": "Christopher", "family": "Prom", "affiliation": [{"original_name": "University of Illinois at Urbana-Champaign", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}, {"given": "Bethany", "family": "Anderson", "affiliation": [{"original_name": "University of Illinois at Urbana-Champaign", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}, {"given": "Thomas", "family": "Padilla", "affiliation": [{"original_name": "Michigan State University, United States of America ", "normalized_name": "Michigan State University", "country": "United States", "identifiers": {"ror": "https://ror.org/05hs6h993", "GRID": "grid.17088.36"}}]}, {"given": "Angela", "family": "Jordan", "affiliation": [{"original_name": "University of Illinois at Urbana-Champaign", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}, {"given": "John", "family": "Franch", "affiliation": [{"original_name": "University of Illinois at Urbana-Champaign", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}, {"given": "Andrea", "family": "Thomer", "affiliation": [{"original_name": "University of Illinois at Urbana-Champaign", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}, {"given": "Tracy", "family": "Popp", "affiliation": [{"original_name": "University of Illinois at Urbana-Champaign", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}], "publisher": "EPFL, Switzerland", "date": "2014", "keywords": ["classical studies", "linguistics", "stylistics and stylometry", "text analysis"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}