{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Introduction The Digital Songlines project differs from the approach taken by most others in the field of virtual heritage. While there are many examples of recreated cultural sites, most of them are of a built form, such as temples, monuments, cities and townships. They are frequently re-created in 3-dimensions with a high level of realism. On the other hand, the Digital Songlines project’s focus is on more than simple visualisation, rather its mission is to recreate an experience; a way of interacting with the simulated environment by identifying the key elements give to each place and its special cultural significance that an Aboriginal group identifies as being within their own tribal boundaries. Integrating the key cultural elements in a synthetic environment goes some way towards providing a setting for exploring otherwise inaccessible or previously destroyed significant sites. While traditional virtual heritage reconstructions frequently depend on technological solutions, Digital Songlines depends more on an understanding of the traditional cultural values attached to specific landscape by the participating Aboriginal people and then on a methodology and process for integrating those values in the digital environment with a focus on cultural relevance independent of its level of visual realism. The continuing traditional culture of Australian Aborigines is one of the most ancient in the world. Recent research suggests that it is at least 40000 years old. Europeancolonisation of Australia since the late eighteenth-century, and farming, mining, tourism and social impacts of modern civilisation have since threatened this most remarkable cultural heritage. Aboriginal cultural custodians realise the urgent need to preserve the evidence of Australian Aboriginal heritage and culture to give young and future generations of Australian Aborigines a chance to identify with their aboriginal roots. However, creating an Australian Indigenous cultural heritage environment causes some difficulties. Australian Aboriginal people perceive, in the landscape, details that non-indigenous people often fail to appreciate. Such details are very much a part of Aboriginal knowledge, spirituality and survival as well as cultural heritage. The landscape is perceived as a cultural entity, and needs to be recognised in a synthetic environment by Aboriginal people if the cultural heritage environment is to be perceived as authentic. One of the difficulties in undertaking such a task is the re-presentation of Aboriginal knowledge. There are few written records, hence it is mostly through the process of interviewing of cultural custodians that information can be gathered. This poses another problem: Aboriginal cultural custodians are not always comfortable with the traditional western research methods of interviewing and recording (AITSIS, 2000); they may prefer to tell their stories in a location which relates to the cultural context of the story, “Aboriginal reading comes out of the land, each place is a repository for information that is rarely commented upon elsewhere in the abstract but is released or stimulated by the place itself” (Strang, 2003, p200) (see figure 1). It is in this context that the Digital Songlines project has set itself the task of collecting cultural knowledge from Australian Aboriginal cultural custodians and Knowledge keepers, and, to provide a means of sharing that knowledge with future generations of Australian Aboriginal people through a virtual environment. Collecting Indigenous Cultural Knowledge The need to ‘locate’ the telling of a story by an Aboriginal cultural custodian where access to the original environment is not possible involved reconstructing some locations using computer generated 3D models. This offers the advantage of portability and flexibility. However, the success of this method relies on its acceptance by the cultural custodians of the synthetic environment as a valid context for sharing their cultural knowledge. Two steps were implemented to try to achieve this. The first step was to identify the elements of the natural landscape that gave it a cultural meaning in the eyes of Indigenous people. The second step was to define a methodology to recreate these elements in a synthetic environment in a way that cultural custodians could recognise the cultural elements. Within the context of this paper the following describes the approach used to identify the elements of the landscape; it explains the protocols for approaching Australian Aboriginal people and a way of enlisting their trust. Understanding the cultural elements of the landscape. To-date some research with Australian Aboriginal people has resulted in suspicion and mistrust. As such , it is essential to inculcate participants in any study at every stage. The Cultural Custodians are the elders of their communities and not generally familiar with virtual reality and multi-media technologies. Therefore, it is necessary to demonstrate the potential of the technology. In this report we discuss an initial study that used a virtual environment showing landscape and approximately 10,000 year-old rock art from Mt Moffat in the Carnavon Gorges National Park in Central Queensland, Australia (see figure 2). It was shown to a group of Australian Aborigines from central Queensland and their reactions observed. As the initial goal was to gain the trust of the community, no recording or formal interview took place. Initially the community was suspicious of the researchers and of the technology but after three hours of community consultation, the community gained a better understanding of the technology and, most importantly, the intentions of the researchers. Following the success of the initial contact, a cultural tour of the region was organised by two of the cultural custodians of the community. This allowed for more observation even though there could still not be any formal recording of the event. One example of an observation related to the tradition of collecting food. Gathering bush food is a cultural activity. Australian Aboriginal people don’t find food in the wild, they believe food is provided to them by Country (a Eurocentric analogy might be a form of benevolent land genie). However, there are conditions. Aboriginal people believe that one has to look after Country if one expects Country to provide for one. That is why, in their view, so many white people died of thirst and starvation in the early white settlement days, because they did not respect the Aboriginal Country law. Looking after Country means more than caring for it, it includes respecting the rituals taught by the ancestors Converting the Observations to VR The most important thing to come out of these observations was the attention to detail leading to a “contextual accuracy” that is very important to all the Aboriginal people encountered. Hence, in re-presenting a specific landscape in VR the following information should be gathered from the site. The importance of flora and fauna to a culturally recognisable landscape means more than realism alone. Realism has only a marginal effect on immersion in a virtual environment (Gower, 2003; Lee, 2004; Lombard and Ditton, 1997; Slater, et al, 1996). Hence, minimal realism yet culturally accurate virtual environments allows people without access to advanced technology, including Indigenous people in remote communities, to gain better access to the Digital Songlines Project and satisfies the needs of those communities for cultural sensitivity to representation of their stories about the land. Conclusion There are at least two issues facing the design of Aboriginal virtual heritage environments, contextual and cultural accuracy and realism. As the context is one of the most important aspects of culture sharing within Australian Aboriginal society then we need to know more about how to re-create a meaningful context in a virtual environment. It may be easier to evoke this by using reduced detail than highly realistic environments. In order to achieve this we need to learn from Aboriginal people what are the best ‘signs’ that can be used to identify their environments as unique and culturally significant. Acknowledgment This work is supported by ACID (the Australasian CRC for Interaction Design) established and supported under the Cooperative Research Centres Programme through the Australian Government’s Department of Education, Science and Training.", "article_title": "Capturing Australian Indigenous Perceptions of the Landscape Using a Virtual Environment", "authors": [{"given": "Stef ", "family": "GARD", "affiliation": [{"original_name": "School of Design, Queensland University     of Technology Information Environments     Program, ITEE, University of Queensland     Australasian CRC for Interaction Design (ACID), Brisbane, Australia.", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Sam ", "family": "BUCOLO", "affiliation": [{"original_name": "School of Design, Queensland University     of Technology Information Environments     Program, ITEE, University of Queensland     Australasian CRC for Interaction Design (ACID), Brisbane, Australia.", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Theodor ", "family": "WYELD", "affiliation": [{"original_name": "School of Design, Queensland University     of Technology Information Environments     Program, ITEE, University of Queensland     Australasian CRC for Interaction Design (ACID), Brisbane, Australia.", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}