{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "For the ‘hard-core’ computing humanist, e-learning seems to be a non-topic.1 While foundational issues and Humanities Computing (HC) curriculum development have been central to our debates, the technological and didactical nitty-gritty of e-learning appears to offer little insight into questions of theoretical and conceptual relevance. - This contribution argues to the contrary: (1) The current form of e-learning is shaped to a significant degree by business and political interests. (2) Consequently, some of the dominant commercial e-learning platforms are conceptually flawed: they are implicitly based on a simplistic ‘cognitive pipeline’-model of learning. (3) HC can help to deconstruct simplistic e-models of learning and contribute towards a more ‘intelligent’ computational modelling of learning processes. (4) The latter will be demonstrated by way of a practical example, the intermedial narratological e-course ‘NarrNetz’. (1) Vested interests The impression of e-learning as a non-inspiring ‘coal-face’ activity is partly a result of its swift appropriation by commercial software vendors. Indeed: there’s considerable money in e-learning – but where does it come from? In Europe, the EU and its member states have created various funding structures reserved for e-learning projects, notably eLearning: a programme for the effective integration of Information and Communication Technologies (ICT) in education and training systems in Europe which aims at the strategic proliferation of e-learning across the European school and university systems. 2 Meanwhile, the initial euphoria about e-learning – fuelled in no small way by university administrators’ and politicians’ expectation to introduce a cheaper, less staff-intensive way of teaching – has certainly worn off. The new buzzword is ‘blended learning’: the combination of physical classroom teaching with auxiliary e-learning. According to a survey presented in Schulmeister (2005), the vast majority of e-courses at non-virtual colleges and universities is indeed of an auxiliary (preparatory, supplementary or remedial) nature. Schulmeister concludes that in our present situation “E-learning ist die Reparatur am System, das wir einführen” – e-learning is the quick-fix for the BA/MA-system whose current introduction at German universities leads to a dramatic over stretching of teaching resources. (2) The pipeline model of learning However, not all short falls can be attributed to context. In our own practical experience, part of the methodological and didactical problems associated with e-learning stem directly from restrictions imposed by its platforms. One of the key functionalities of a good e-learning platform is the personalized, dynamic assignment of navigation options (so-called ‘content release’) on the basis of results achieved by a user in preceding tests. Depending on the scoring, hyperlinks may be made visible or activated, or the system may send some additional feed-back. If the content manager decides to use these functionalities, the course content must allow for tests and parallel navigation paths. Under these conditions, this kind of interactivity can be hard-wired into the course by the content developer who uses system provided templates for content and test modules (questionnaires, multiple-choice etc.) and combines these with logical or quantitative operators that specify navigation rules. To understand the conceptual premises built into commercial e-learning platforms (also known as LMS = Learning Management Systems), it is important to take a closer look at the kind of binary logic that drives this type of interactivity. For example, the currently still widely used WebCT Campus Edition 4 allows neither for the specification of complex (conjunctive or additive) rules of the type ‘if student X passed test 1 with > 65% and has already looked at modules 15-17, allow him/her to jump to module 22, else do Y’, nor for a logical ‘or’ in the control of a user’s navigation - fairly trivial process control decisions which a human teacher will make on the fly in any given class-room situation.3 The impact of such concrete technological restrictions on e-learning’s current shape is severe, considering that the recently merged WebCT and Blackboard alone account for a joint 2/3 market share in institutional and commercial e-learning.4 Courses implemented on the dominant proprietary platforms, unless their content modules are made available in pure (non-conditional) hyperlinked form, are thus implicitly based on what we call a ‘pipeline’ model of learning: the learning process within the system is organised in terms of a linear accumulation of pre-defined knowledge and skills. While the genuine dynamics of interactive learning in a real class room is the result of engagement in recursion, exploration and the adoption of a different perspective onto the same problem, systems based e-learning thus reduces much of this functionality to mere repetition (‘repeat until you pass’), while outsourcing true interactivity to humans (via chats, discussion list, e-mail etc.). Another principled problem with out-of-the-box e- learning systems is that they are themselves not designed to learn. Whereas commercial data-base driven websites like Amazon’s combine continuously updated user- profiling (items bought, pages looked at, duration of visit, etc.) with probability based feed-back (‘other users who have bought item X also bought item Y’), similarly intelligent behaviour has as yet not been implemented in the leading commercial e-learning or course-ware systems. While most e-learning platforms are of course able to track user behavior, they remain unable to act on process-relevant conclusions that might be drawn from this data.5 (3) Towards adaptive e-learning So, is (e-)learning by necessity a dumber activity than shopping? Certainly not. Current AI research explores various possibilities of making it ‘feel’ more intelligent. For example, Nakano, Koyana and Inuzuka (2003) explore the role of probabilistic algorithms in the automated generation of questions; Steinemann et al (2005) as well as Yang et al (2005) look into the design principles of more sophisticated course management systems. Providing the user with intelligent corrective feed-back is the main goal of INCOM,6 a project dedicated to developing an e-learning supported logic programming course (Le 2005, Le and Menzel 2005). On a more general level, Moreno et al. (2005) emphasize the need for so-called ‘adaptive e-learning’ systems: ‘ Adaptive e-learning is a teaching system which adapts the selection and the presentation of contents to the individual learner and his learning status, his needs, his learning style, his previous knowledge and preferences.’ This topic receives particular attention in the AH (Adaptive Hypermedia and Adaptive Web-Based System) conference series.7 ALFANET, a project supported by the EU-financed IST- (Information Society Technologies) initiative, also aimed to introduce adaptivity.8 According to the project’s self-description, the prototype can dynamically evaluate a user’s knowledge and then selectively assign different content material in order to reinforce or broaden a subject.9 However, the final project report proves this to be an aim, rather than a demonstrable accomplishment.10 (4) Opening the black box While we stake no claim to developing an intelligent e-learning system, we do believe that an individual e-learning course can certainly be turned into a more stimulating and challenging experience through comparatively simple system adjustments – provided the system itself is not a proprietary black box. Whether such adaptations and extensions can later be implemented as generic system functionalities remains to be seen. ‘NarrNetz’ – short for ‘Narratology Network’ – uses the widely adaptable PHP/MySQL-based open source platform ILIAS11. Our project is conceptually based on a learning metaphor and an architecture that combines linear modules with explorative, highly personalised learning experiences. Elements of NarrNetz try to emulate the user experience of an interactive computer game – a paradigm widely expected to revolutionize the ‘look and feel’ of e-learning (Begg, Dewhurst, Mecleod 2005; Foreman/Aldrich 2005; Schaffer 2005). In NarrNetz, the user is initially confronted with a problem modelled on a gaming ‘quest’. However, the system and its architecture allow the combination of linear with non-linear, systematic (deductive) with immersive (inductive) learning methods. If learners want to fast-track their progress, they can switch to a text-book like learning style. Conversely, while sections of the ‘learnflow’ follow a compulsory linear trajectory, others may be chosen and arranged at will. Fig. 1 sketches out the NarrNetz-learnflow which maps the user’s navigation through the landscape of the metaphorical quest onto the didactically desired cognitive progression. In our presentation we will demonstrate how comparatively simple modifications and modular extensions of the open-source e-learning platform ILIAS and the integration of multi-media objects can lead to a significantly enriched, more ‘intelligent’ learning experience. Specifically, we will discuss the following additional functionalities: • integration of user-specific avatars with dynamically attributed ‘real-time’ properties symbolizing the user’s past progress and future navigational options at any given point in time; • automated, personalized navigation control based on disjunctive reasoning and the concept of multiple, functionally equivalent learning paths rather than a pipeline-approach; • representation of the newly acquired skills and knowledge elements in the form of a personalized dynamic conceptual glossary; glossary entries can be cross-referenced, individually annotated and linked to content elements of the course. Conclusion The conceptualisation and implementation of non- standard, experimental e-learning architectures constitutes a genuine task of Humanities Computing. As in other fields of applied humanities computing, computing humanists are called upon to point out the conceptual shortcomings in simplistic attempts at reverse engineering human cognitive competences for the mere sake of making them ‘computable’. Learning is the most basic cognitive competence in human beings: a good enough reason not to turn a blind eye on how it is being conceptualised – technologically and ideologically.", "article_title": "De - Constructing the e - Learning Pipeline", "authors": [{"given": "Jan Christoph ", "family": "MEISTER", "affiliation": [{"original_name": "University of Hamburg", "normalized_name": "Universität Hamburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00g30e956", "GRID": "grid.9026.d"}}]}, {"given": "Birte ", "family": "LÖNNEKER", "affiliation": [{"original_name": "University of Hamburg", "normalized_name": "Universität Hamburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00g30e956", "GRID": "grid.9026.d"}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}