{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Text collation is a vital aspect of textual editing; its results feature prominently in scholarly editions, either in printed or electronic form. The Centre for Scholarly Editing and Document Studies (CTB) of the Flemish Royal Academy for Dutch Language and Literature has a strong research interest in electronic textual editing. Much of the research for the electronic editions of De teleurgang van den Waterhoek (2000) and De trein der traagheid (forthcoming) concerned appropriate ways of visualising textual traditions. Starting from the functionality of collation results in electronic editions, as illustrated in the latter edition, this paper will investigate the needs for a dedicated automatic text collation tool for textcritical research purposes. The second section sets out with identifying different scenarios in the production model of electronic scholarly editions (based on Ott, 1992; Vanhoutte, 2006). Consequently, possible criteria for an automatic text collation tool in these production scenarios are identifi ed, both on a collation-internal and generic software level. These criteria are analysed both from the broader perspective of automatic differencing algorithms and tools that have been developed for purposes of automatic version management in software development (Mouat, 2002; Komvoteas, 2003; Cobéna, 2003; Cobéna e.a., 2002 and [2004]; Peters, 2005; Trieloff, 2006), and from the specifi c perspective of text encoding and collation for academic purposes (Kegel and Van Elsacker, 2007; Robinson, 2007). Collation-internal criteria distinguish between three phases of the collation process: the automatic text comparison itself, representation of these comparisons and aspects of visualisation. Especially in the context of electronic scholarly editions, for which TEI XML is the de facto encoding standard, a degree of XMLawareness can be considered a minimal requirement for collation algorithms. A dedicated collation algorithm would be able to track changes on a structural and on word level. Moreover, since textual editing typically deals with complex text traditions, the ability to compare more than two versions of a text could be another requirement for a collation algorithm. Regarding representation of the collation results, an XML perspective is preferable as well. This allows for easier integration of the collation step with other steps in electronic editing. In a maximal scenario, a dedicated text collation tool would represent the collation results immediately in one or other TEI fl avour for encoding textual variation. Visualisation of the collation results could be considered a criterion for a text collation tool, but seems less vital, however prominent it features in the broader context of developing an electronic edition. From a generic software perspective, a dedicated tool would be open source, free, multi-platform, and embeddable in other applications. These criteria are summarised in a minimal and a maximal scenario. The plea for a tool that meets the criteria for a minimal scenario is illustrated in the third section of the paper. The third section of the paper is a case study of another electronic edition in preparation at the CTB: the complete works of the 16th century Flemish poetess Anna Bijns, totalling around 300 poems that come in about 60 variant pairs or triplets. The specifi c circumstances of this project led to an investigation for collation solutions in parallel with the transcription and markup of the texts. After an evaluation of some interesting candidate tools for the collation step, the choice was made eventually to investigate how a generic XML-aware comparison tool could be put to use for multiple text collations in the context of textual editing. Besides formal procedures and a set of XSLT stylesheets for different processing stages of the collation results, this development process provided an interesting insight in the specifi c nature of ‘textual’ text collation, and the role of the editor. The description of the experimental approach that was taken will illustrate the criteria sketched out in the previous section, indicate what is possible already with quite generic tools, and point out the strengths and weaknesses of this approach. Finally, the fi ndings are summarised and a plea is made for a text collation tool that fi lls the current lacunae with regards to the current tools’ capacities for the distinct steps of comparison, representation and visualisation. ", "article_title": "A Modest proposal. Analysis of Specifi c Needs with Reference to Collation in Electronic Editions", "authors": [{"given": "Ron ", "family": "Van den Branden", "affiliation": [{"original_name": "Centrum voor Teksteditie en Bronnenstudie (KANTL), Belgium", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2008", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}