{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Roman aristocratic funeral of the Republic was an incredible show. It packaged the Roman spectacular trifecta, the procession, the eulogy and the subsequent games, which comprised gladiatorial and dramatic performances. While each of these components of the funeral has received individual treatment—in the case of the gladiatorial games, extensive—no detailed, comprehensive discussion of the aristocratic funeral of the Republic exists. Moreover, before gladiatorial games were held in the Colosseum and before dramatic performances were staged in a monumental theater, they were first held in ad hoc venues in the heart of Rome. No attempt has been made to situate the phenomenon within its surrounding context, the Roman Forum. My current digital/analog manuscript project, Spectacle in the Forum: the Roman Aristocratic Funeral of the Middle Republic, offers the first attempt to study the mid-Republican funeral in its totality and, in so doing, examines the most significant aspects of spectacular stagecraft of the Roman Republic.Spectacle has received considerable attention in recent years, but its study has been marred by deficiencies in method. Classics scholar Richard Beacham pinpoints the problem: “Spectacle is three-dimensional and sequential, realized by taking place over a period of time, and its place, circumstance, and unfolding fundamentally shape what an audience both expects and experiences.”  Ritual parades, political speeches, and religious rites are well described in ancient texts and frequently depicted in art.  Yet, most spatial and spectacular analyses attempt to reconstruct the monuments, imagery, actors and audience, which are inherently kinetic and multi-dimensional (changing over space and time), by means of textual description and two-dimensional plans.The impact of monumental structures on Roman performers and their audiences, what could and could not be seen during their performance, as well as the significance of monumenta memoriae, directly affected the shows when first performed, and the reading and interpretation of the records subsequently examined by scholars. Performance “stages” of the mid-Republic were ephemeral: extant temple podia, elevated balconies, and hillsides, might serve as caveae. Simple temporary structures may have been all that was needed to mount a production.Three-dimensional digital models offer a partial solution. There are now a growing number of projects that have used computerized reconstructions to visualize Imperial Rome. There have been very few similar attempts to represent the Republican city, and hardly any that make scholarly arguments set within the digital reconstructions. Most reconstruction projects tend to focus on the creation of a highly accurate, extraordinarily precise digital model informed by scholarship as the ultimate goal. Instead, this project uses hypothetical reconstructions as a digital laboratory. By injecting historical context—the performers and the audience—into the digital environment, the digital investigation transforms the quantifiable elements of the ephemeral experience of ancient spectacle into a digital object fit for experiential analysis. It uses the hypothetical reconstructions as a digital laboratory to explore the staging of Roman spectacle and develop the digital toolset necessary for scholarly interrogation and publication of spatial and experiential arguments.The laudatio funebris of the mid-Republic was genre-defying visual theater. While it is now generally agreed that the persuasive techniques of oratory comprised verbal (the content and delivery of the speech) and visual elements (gestures charged with meaning and explicit visual and topographic references), the degree to which the choreography of the funeral eulogy subordinated the words of the speech has not been fully examined. For much of the audience, the visuality of the event eclipsed the aural content. The laudatio, like the pompa before it, relied on a basic set of quasi-formulaic visual cues to communicate with the audience, or at least, to communicate some ideas to some of the audience. To call the laudatio a speech alone, and to classify it within the realm of oratory without qualification is to misunderstand much of the purpose and the choreography of the event. In this presentation, I will put the event in its proper place: the Forum. Through the use of textual analysis, experiential investigation, and geo-temporal argumentation, I will demonstrate that the laudatio funebris was a multivariate theatrical event, comprising two discrete elements targeted at two distinct audiences.Though one can use a laboratory built out of virtual world infrastructure to experiment, a researcher cannot (yet) “publish” the entirety of a laboratory experience and call it scholarly communication. Rather, the laboratory is the space where the research occurs; the results must be woven together into a narrative in order to engage with the larger scholarly conversation. Nonetheless, a text and image narrative is insufficient to convey the totality of the kinetic and temporal subject matter. Geo-temporal argumentation presents an innovative and more robust method of idea dissemination by offering:When the experience and creation of kinetic transitions are fundamental to an understanding of an argument the reader must, quite simply, walk in the footsteps of the authors in order to participate in the debate, critique the result, and modify the conclusions. In this paper I aim to demonstrate that, for space- and time-centric, phenomenological investigations, geo-temporal argumentation is a new and superior form of scholarly communication.As is always the case, digital humanities projects are collaborative endeavors. My “manuscript” project provides the domain-specific area of inquiry, but the digital platforms that facilitate the research are part of two, larger collaborative efforts of which I am but one of a number of co-investigators.GeoTemporal Publication Platform: The research results and assessment will be published within HyperCities, a geo-temporal content aggregation and publication platform. Rather than create an entirely new digital humanities tool, “chapters” from my manuscript are being used as case-studies to guide the development of 3D narrative and mark-up tools within the HyperCities platform that will facilitate exploration of the data and publication of this new form of scholarly inquiry. We anticipate a mid-winter release of the working 3D system.", "article_title": "Geo-Temporal Argumentation: The Roman Funeral Oration", "authors": [{"given": "Christopher", "family": "Johanson", "affiliation": [{"original_name": "UCLA Classics", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2011", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}