{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper reflects on the process of designing and building a documentation and archiving tool named CloudPad on the basis of its first evaluation at Stanford Libraries and the San Francisco Art Institute in September 2010. The paper explores the value of CloudPad and its ability to document individual users’ replay of an artwork within the context of performance documentation and new media archiving, speculating on its possible use within a number of curatorial, educational and creative contexts that are relevant to digital humanities.The CloudPad was developed in 2010 by a team in Horizon RCUK-funded digital economy research and involved staff in performance studies and computer science from the Universities of Exeter and Nottingham, with partners from Stanford Libraries, the Ludwig Boltzman Institute Media.Art.Research, The San Francisco Art Institute, British Library, Blast Theory, and the University of Sheffield. The work developed out of the team’s intention to research novel theoretical and practical approaches for the documentation and archiving of mixed reality performances and artworks that span both digital and physical entities (Benford and Giannachi 2011), allowing users to engage with the materials creatively over time and from different locations. The project benefitted from previous research conducted by members of the team through the AHRC-funded Presence project (2004-9), which used second life and a wiki to document practices spanning from performance art, to video art and new media, including work in virtual reality CAVE, and the EPSRC-funded Creator project (2008-9) which used an e-science tool, the digital replay system, to generate synchronised annotations about a mixed reality performance (DRS). The project also benefitted from the findings of the e-dance project (2007- 9), which was jointly funded by AHRC, JISC and EPSRC, and conducted by colleagues from the Universities of Bedfordshire, Leeds, Manchester and Open University. This adopted access grid technologies for developing new approaches to choreographic composition, involving the use of the Memetic toolkit for recording, replaying and annotating sessions in access grid. Finally, the project was developed in dialogue with artworks such as Lynn Hershman Leeson’s RAW/WAR feminist film archives (2010), sosolimited’s interactive archival performances, and current thinking in new media documentation (e.g. Costello 2005, Depocas et al 2003, Jones and Muller 2008 and Dekker 2011, among others).Technically the CloudPad was designed as a customisable web-based platform aiming to facilitate the synchronised playback and mash-up of cloud-based media entities such as video or audio files, as well as webpages and photographic materials, together with layers of user annotations. It took a novel approach to the archiving and replay of pervasive media experiences by making use of Web 2.0 technologies (DiNucci 1999) rather than grid technologies. CloudPad users were empowered to view the repository as a living document in which they could leave their own impression of an experience (both of the original event recordings as well as any thematic connections or annotations provided by other visitors and subject experts). Previous interactive systems designed for the replay of events for analysis lack this level of emergent reflection (see Brundell 2008), treating the corpus of recorded material as essentially immutable. To enable this, the CloudPad made use of internet-based storage, which means that media from a wide variety of different sources could be included in a presentation (for example YouTube videos can be included and synchronised with images from Flickr). This was accomplished by the use of HTML5 (see w3.org), an emerging web standard that enables collaborative interactive applications to be developed which run inside a web browser (Murray 2005).As an initial form of content to assess the operation of the CloudPad we utilised a ‘bespoke’ documentation of Blast Theory’s Rider Spoke that was recorded by our team when the work occurred at the ars electronica festival in Linz in 2009. Rider Spoke is a location-based game for cyclists developed by Blast Theory in collaboration with Mixed Reality Laboratory at the University of Nottingham as part of the European research project IPerG. The work encouraged participants to cycle around a city in order to record personal memories and make statements about their past, present and future that were associated with particular locations (see figure 1).   Blast Theory, Rider Spoke. Participant listening to recordings. Copyright Blast Theory. Full Size Image   To collect a documentation that addressed the complexity of this work, we developed a hybrid approach. This included the collection of documentations pertaining to the artists and technologists’ descriptions of the works (in terms of original aims, interim analyses and final evaluations), as well as documentations of the user experience (see Jones and Muller 2008 and Depocas et al 2003), the latter recorded from a variety of points of view (e.g. first person, third person) and through a number of technologies (e.g., video, GPS, Wi-Fi) and perspectives (see figures 2, 3 and 4).   Linz documentation. Participant captured via first person point of view. Full Size Image    Linz documentation. Participant captured via third person point of view. Full Size Image    Linz documentation. Participants journey through the city captured on googlemaps. Full Size Image   The overall analytical approach was interdisciplinary, thus including different and potentially even contrasting accounts of the event (see Chamberlain et al 2010). These accounts were presented through a number of historic, canonic and participant ‘trajectories’ (see figure 5).   Matt Adams’ annotation about a participant linking first and third person perspectives in a canonic trajectory. Full Size Image   By historic trajectories we defined a historic event, i.e. a participant’s experience as documented in a video; by canonic trajectories we defined an expert user’s set of annotations through these materials; and by participant trajectories we defined the CloudPad user’s own annotations (Giannachi et al 2010). This architecture does not privilege a single viewpoint and encourages creative use of both the historic materials and their canonic annotations. Arguably, every replay, producing participant trajectories, re-constitutes the work.The CloudPad evaluation showed that users did not only envisage adopting the CloudPad for purposes of documentation and archiving, but also wanted to use it curatorially, to present work to others and engage users in annotating materials, for example in an online exhibition, academically, to write ‘visual essays’, and creatively, to make artwork. We have seen that the CloudPad offers scholars, artists and students the possibility to document, archive, curate and create synchronised variable media mash-ups from existing digital resources. These mash-ups, which show how users have engaged with the original documentation stored on CloudPad, build an invaluable resource for those who may be interested in how a core documentation or archive is navigated and interpreted over time. In other words, the CloudPad is not only a documentation and archiving tool, it also documents and archives itself, generating contextual footprints or traces and possibly even re-enactments of every replay of the original materials. This paper reflects on the advances generated by this particular functionality in terms of performance documentation, preservation, and re-enactment.We gracefully acknowledge the RCUK funded Horizon digital economy research and the AHRC funded Riders Have Spoken project. We would like to thank Blast Theory and staff at the Ludwig Boltzman Institute Media.Art.Research, Katja Kwastek, Dieter Daniels and Ingrid Spoerl in particular, who facilitated the documentation of Rider Spoke in Linz, and our participants and volunteers who gave their time to make this documentation possible. We would also like to thank the staff and students at the San Francisco Art Institute, Stanford Libraries and St Jose State University for providing crucial feedback that informed the writing of this paper.", "article_title": "CloudPad – A Cloud-based Documentation and Archiving Tool for Mixed Reality Artworks", "authors": [{"given": "Gabriella", "family": "Giannachi", "affiliation": [{"original_name": "Centre for Intermedia, University of Exeter", "normalized_name": "University of Exeter", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/03yghzc09", "GRID": "grid.8391.3"}}]}, {"given": "Henry", "family": "Lowood", "affiliation": [{"original_name": "Stanford Libraries, Stanford University", "normalized_name": "Stanford University", "country": "United States", "identifiers": {"ror": "https://ror.org/00f54p054", "GRID": "grid.168010.e"}}]}, {"given": "Duncan", "family": "Rowland", "affiliation": [{"original_name": "Mixed Reality Lab, University of Nottingham", "normalized_name": "University of Nottingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ee9ar58", "GRID": "grid.4563.4"}}]}, {"given": "Steve", "family": "Benford", "affiliation": [{"original_name": "Mixed Reality Lab, University of Nottingham", "normalized_name": "University of Nottingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ee9ar58", "GRID": "grid.4563.4"}}]}, {"given": "Dominic", "family": "Price", "affiliation": [{"original_name": "Mixed Reality Lab, University of Nottingham", "normalized_name": "University of Nottingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ee9ar58", "GRID": "grid.4563.4"}}]}], "publisher": null, "date": "2011", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}