{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "   Brief description   In this paper, we first describe the design and implementation of the GeoStoryteller project. GeoStoryteller is a project where learners engage with archival photos and multimedia narratives in historically relevant places using a combination of augmented reality technology and web-based delivery via mobile devices. The initial application of GeoStoryteller is in partnership with the Goethe-Institut New York, the worldwide cultural organization of Germany. In this partnership, learners – particularly German language students in the United States – engage with content that details the historical events and makes use of real places related to German immigration to New York City (1840-1945).  Second, based on the design and implementation of this project, we offer a framework for creating location-based mobile learning projects that could be used by others interested in implementing similar projects.   Designing GeoStoryteller GeoStoryteller builds upon recent research and development from the emerging subfield of the Digital Humanities known as GeoHumanities, which is a term that highlights the growing interconnections between geography and the humanities.  GeoStoryteller strengthens this connection specifically by layering historic narratives on a specific location and by making it available to learners’ Internet-enabled mobile device.  In the case of the application of GeoStoryteller with the Goethe-Institut – named German Traces NYC – learners can view location-sensitive maps and lists of historic sites related to German immigration to New York.  Once a learner arrives at a physical site, he or she can see historic photos layered against the imagery visible through the camera’s phone (also known as augmented reality), as well as watch videos about that particular site that include historic narratives and archival photos.  Users can also play short trivia games that answers can only be found from being on physical location and post their accomplishments to Facebook or Twitter. For developing the videos – which we also refer to as GeoStories – we turned to published, non-published, digital and non-digital sources available from cultural and memory institutions (libraries, archives, museums and historical societies). Using these sources we developed historical narratives as text, and set those to audio recordings that were augmented with archival photos. We then used geotechnologies to deliver the narratives to users’ mobile devices (smart phones, such as iPhone, Android, Blackberry, and tablets such as iPad) at the places where these events occurred. Geotechnologies used include global positioning systems (GPS), digital mapping services (available through Google) and Layar, an augmented-reality browser for mobile devices.  For example, users can find such sites as the Ottendorfer Library, the oldest public library in Manhattan, opened originally to support the German immigrant community in Kleindeutschland – or Little Germany (today known as the East Village; see Figure 1).  While on site, learners can learn about the people who crated the physical site, why they created the site (e.g., philosophies that motivated their action) and how that site has changed over time to reflect cultural and world events (e.g., anti-German sentiment during both world wars).      Framework for creating location-based mobile learning projects From our experience developing GeoStoryteller, we offer a framework that can be used in the planning and implementation of similar projects. At the core (the inner section) of this framework is traditional humanities research and development (see Figure 2). In the case of the GeoStoryteller project, this included print, non-print, digital, digitized, non-digital, archival, and published sources, all used to construct historical narratives of German immigration in New York.  Placing humanities research and development at the core of the framework highlights what distinguishes a digital humanities project from other digital projects. Additionally, this type of research and development could be done with other fields of the humanities, including philosophy, literature, and the arts.   Figure 1. Augmented-reality interface for retrieving multimedia stories  Next, we proceed to the ‘Theory and Interface Development’ ring. At this stage, researchers must consider the theory that will inform their project, and how this theory will be reflected in the user interface available to the learner. For example, some of the theoretical questions we asked were, how does situating historical content in physically relevant locations affect learner engagement? And does making augmented-reality content available to learners further enhance engagement? Such questions necessarily lead to decisions about how to present the content within a digital interface. In the third ring, learners engage with the socio-technical environment created by the researchers. In the case of GeoStoryteller, this includes not simply a user interface, but also the physically relevant locations that the interface prompts the user to explore. Additionally, social interactions may occur during this stage among multiple others in the environment (e.g. a librarian in the Ottendorfer library). It cannot be assumed that the best learning experience comes from the digital device, but could result from the serendipitous interaction in the real environment.  From this stage, we proceed to the fourth ring, which is the formal user research. In this stage, we use traditional (e.g., surveys and interviews) and digital (e.g., tags, hits, time stamps) social science research methods to uncover the working of the interface, address the theoretical questions, and evaluate the learning outcomes and user engagement.  These studies can then influence any earlier stages (e.g., specific areas of content that did not engage the interest of learners could be revised, confirming or refuting the learning theory, or requiring changes to the user interface). Figure 2: A Process for Digital Humanities Research and Development       Relevance to conference themes The GeoStoryteller project addresses several of the Digital Humanities 2012 conference themes and aspects of digital humanities described in the Call for Papers.  By focusing on vertical histories – or presenting narratives that describe events at a specific locale throughout a period of over 100 years – we introduce students to how immigrant communities, their language and cultures, contributed to the fiber of New York City as we know it today. We draw parallels between the prejudices against, hardships, discrimination and finally successful integration of the predominant immigrant community of the 19th and early 20th century immigrant and those of today. GeoStoryteller is a completely bilingual project that serves both to uncover lost histories of New York and demonstrate their relevance to contemporary geohistory.  ", "article_title": "Uncovering lost histories through GeoStoryteller: A digital GeoHumanities project", "authors": [{"given": " Debbie L.", "family": "Rabina", "affiliation": [{"original_name": "Pratt Institute, USA", "normalized_name": "Pratt Institute", "country": "United States", "identifiers": {"ror": "https://ror.org/007m3p006", "GRID": "grid.262107.0"}}]}, {"given": " Anthony", "family": "Cocciolo", "affiliation": [{"original_name": "Pratt Institute, USA", "normalized_name": "Pratt Institute", "country": "United States", "identifiers": {"ror": "https://ror.org/007m3p006", "GRID": "grid.262107.0"}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}