{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " \"Records are no longer fixed, but dynamic. The record is no longer a passive object, a 'record' of evidence, but an active agent playing an on-going role in lives of individuals, organizations, and society.\"Terry Cook. \"Archival science and postmodernism: new formulations for old concepts.\" Archival Science. 1, 2001. 22.  Advances in digital representation and preservation have ushered in new perspectives for defining the record. Terry Cook, speaking on behalf of a growing cohort interested in reshaping the disciplinary boundaries of archival studies, argues that records no longer possess the aura of absolute authority that they once held. Practitioners and theorists working within a postmodernist framework have broken open the once sacred bond between the historical craft and the archive, in the process challenging notions of evidence, truth, and narrative.  One of the great beneficiaries and active participants of this re-evaluation of the archive and the record, of course, is digital history. Digital tools, from Omeka to ArcGIS, have empowered a growing community of professional and amateur historians, museums, and libraries to provide unprecedented access to collections of primary materials and historical data. Such tools also demonstrate the ease with which archival and historical practices have come into contact with one another, thereby disrupting conventional understanding of the record in both fields.  In this paper, I will address the cross-disciplinary relationship between history and archival theory as one component in the broader development of a much-needed digital historiography.The term \"digital historiography\" has lingered in the background of the field throughout the last decade, most notably in a series of reviews by David Staley in the Journal of the Association for History and Computing between 2001-2003. I will argue that principles of archival theory and historiography together may guide the evaluation of digital and new media historical representations, especially with regards to the contextualization of historical evidence. Whether considering an online archive, database, or GIS visualization, the aggregation of large data sets necessitates proper archival management of the data. Besides enhancing the long-term sustainability and preservation of the representation – itself a worthy and often overlooked objective –, the application of archival standards to data collection, organization, and presentation influences the type and quality of conclusions users may generate. Within this complex association among history, archival theory, and digital technology this paper will examine two interrelated \"building blocks\" – search and metadata – that work hand-in-hand to form the foundation for a sound digital historical representation. How a user queries a representation, even one that is non-textual, governs the quality of historical knowledge at the user's disposal, whereas a representation's content metadata governs the conclusions the user may draw with that knowledge.   A Call for Digital Historiography New techniques to query, sort, catalogue, and visualize historical data have brought renewed interest to understanding the past on every scale, from the personal to the global. As scholars and teachers, we have encouraged digital exploration, whether in gathering local data with the support of a historical society or archive, or repurposing historical materials through museum installations, websites, documentaries, and multimedia mashups.  Despite promising possibilities in historical computing, the emergence of digital history has also created a distinct fissure in the wider field of history. Practicing digital history challenges methodological preconceptions. Conducting search queries across vast digital collections seems antithetical to visiting an archive. Similarly, navigating through a three-dimensional environment enhances interactivity and engagement with the historical representation, and in the process confronts, or at times abandons altogether, the core activities of reading and writing historical texts. In short, history in the digital age has upended notions of representation, context, inquiry, narrative, linearity, temporal and spatial orientation, and experience.For a recent survey of the digital history field and its variant representational forms see Paul Arthur. \"Exhibiting history: The digital future.\" reCollections: The National Museum of Australia. Vol. 3, number 1. http://recollections.nma.gov.au/issues/vol_3_no_1/papers/exhibiting_history/. Accessed March 12, 2010. This undeniable shift in the landscape demands that we harness the potential of digital history while not altogether abandoning established theoretical and methodological practices. A rush to embrace new digital modes of doing history, unfortunately, has overwhelmed a parallel critical examination of changes to these fundamentals. The same techniques and technologies that are laudably tearing down institutional barriers, challenging entrenched theories, and introducing new voices and democratic perspectives, can also advance specious information and theories; distort or obscure the historical record; or worse – eliminate it altogether. The role of the historian, therefore, has shifted from that of exclusive authority to the equally critical role of mediator of historical knowledge. If active participation and exploration have become the benchmarks of digital historical representations, then the (digital) historian must ensure that the manner of user participation is conducted equitably and responsibly insofar as the knowledge produced through the representation is predicated upon rigorous logic and concentrated historical data.  What principles should a new digital historiography advocate and why is its cultivation imperative? A working digital historiography will enable critical engagement with digital and new media representations, a challenging endeavor considering the spectrum of possible forms that a representation may take. We may justifiably question whether an online collection, for example, shares traits with a GIS-based visualization. While each representational genre warrants a unique set of evaluative criteria, commonalities across formats and historical content do exist and warrant further attention. We may begin with the notion that all representations possess some form of a user interface. Interrogating the user interface can lead one to assess the transparency with which the representation has selected and organized its content. We may also ask whether its formal design complements and provides sufficient access to the content. With a scholarly text, answers to such questions are readily apparent by poring over indicators such as footnotes, bibliography, and the table of contents. Many digital representations, however, collate information within multi-dimensional, non-linear structures, thereby subverting or eliminating such identifiable cues. As Edward Ayers remarks, \"We cannot judge a Web site by its cover – or its heft, its publisher's imprint, or the blurbs it wears.\"Edward L. Ayers. \"Technological Revolutions I Have Known.' In Computing in the Social Sciences and Humanities. Ed. Orville Vernon Burton. University of Illinois Press, 2002. 27. My call for a rigorous digital historiography coincides with Ayers' own remarks, when he writes: \"Whatever a project's scale and level of complexity, new media should meet several standards to justify the extra effort they take to create, disseminate, and use.\"    The Building Blocks of Digital Historiography: Search and Metadata In developing a set of evaluative criteria, we must consider the association between a representation's form and content, which together comprise the representation's overall historical argument. While there are numerous components worthy of consideration, two in particular – search and metadata – determine to a large extent how a representation organizes its historical information. Without a robust search engine the user cannot access historical data; similarly, without quality metadata, a strong search engine is rendered ineffective. While this may seem self-evident, the integration of search and metadata in a representation runs much deeper; it affects, and is affected by, nearly every aspect of the representation, including its interface, aesthetic, design, structure, and functionality. Search and metadata together govern the transformative process by which historical information becomes historical evidence.  This paper will use examples of current digital collections and visualizations to illustrate how search and metadata contributes to the overall value of the representation. I will argue that an assessment of these two building blocks, when considered from both an historical and archival perspective, can shed light on the argument put forth by the representation. In the case of an online collection, for example, the creator must weigh the benefits of generating metadata according to standardized thesauri, scholarly input, or folksonomy. These very different approaches, if applied to the same archival collection, would not only influence the type of audience that may use the archive, but also steer users towards divergent search results, which could ultimately determine how the content is recombined.For further discussion on how archival description can shape the narrative embedded within archival records, see Wendy Duff and Verne Harris. \"Stories and Names: Archival Description as Narrating Records and Constructing Meanings.\" Archival Science. 2: 263-285, 2002.  A reconstruction of an historic building, meanwhile, invites a \"search\" process of a different sort. Searching occurs while the user navigates through the environment. Is the user invited to discover new sightlines or gauge the distance between structures? If so, does the user have access to previous theories with which to compare a new finding? Even small questions, such as why a virtual archway was set at eight feet instead of six when there may be inconclusive evidence for both, can unearth rich discoveries. The reconstruction thus must make architectural or GIS metadata discoverable, to the extent that this is feasible, in order to foster further investigation.  It is critical that we do not lose sight of the underlying question that should guide the creation and evaluation of all digital historical representations: does the representation invite the user to conduct humanistic inquiry? What are the historical problems encompassed by the representation, and does the evidence compel the user towards addressing those questions or asking new ones? The more the user is made aware of a representation's construction, the greater the potential for productive engagement. Search and metadata thus function as the bridge linking a representation's formal structure and content. Evaluating these two areas along archival and historiographical lines can lead to an assessment of its trustworthiness as a source for generating historical knowledge. In other words, interrogating a representation's search and metadata provides a window to explore a representation's construction of historical context.  This paper will not advocate a single approach or methodology for applying and evaluating search and metadata to a digital representation; rather, it will argue that digital historians should think archivally when considering how these components contribute to a representation's historical contextualization. Refinement of this mindset through rigorous, systematic, and interdisciplinary theoretical and practical experimentation could benefit scholarship, peer review, pedagogy, public history, and cultural heritage.Among the possible applications could be the development of higher education curriculum constructed around a hybrid digital history-archival studies model. NYU's Archives and Public History is one of the leading programs that have taken up the call to teach archival theory alongside digital history theory and practice. It recently unveiled a new website showcasing its revamped academic program: http://aphdigital.org/. Accessed March 12, 2010.The thoughts and ideas expressed in this abstract and the conference presentation are entirely my own and do not necessarily reflect those of NEH or any other federal agency.      ", "article_title": "Thinking Archivally: Search and Metadata as Building Blocks for a New Digital Historiography ", "authors": [{"given": " Joshua", "family": "Sternfeld", "affiliation": [{"original_name": "National Endowment for the Humanities, USA", "normalized_name": "National Endowment for the Humanities", "country": "United States", "identifiers": {"ror": "https://ror.org/02vdm1p28", "GRID": "grid.422239.c"}}]}], "publisher": "Centre for Computing in the Humanities, King's College London", "date": "2010", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}