{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Nicholas Culpeper (1616–1654) was the best known name in seventeenth century medical publishing in London and is listed in the English Short Title Catalogue (ESTC) as the author of more than 230 books and as the translator of dozens more. An apothecary, man-midwife, and astrophysician, Culpeper is best remembered as the translator and editor of the London Dispensatory (1649), an unlicensed and best-selling translation of the Pharmacopoeia Londinensis, the official medicine book of the Royal College of Physicians. However, modern scholarship tells us that Culpeper was only partly responsible for his prodigious and lasting success. Much of his fame can be attributed to the efforts of his many publishers and printers, who over several decades turned the name Culpeper into a commercial brand by reprinting, reissuing, and frequently misrepresenting the author’s relatively few authentic works (see McCarl 1996; Furdell 2002). During his lifetime Culpeper became one of the first names in scientific writing that could sell books. Books bearing his name were widely published throughout the eighteenth century, and sporadically to the present day. This paper takes the case of Culpeper as a pilot study of title pages as a form of advertisement. Extra copies of title pages were commonly printed as flyers and posted on booksellers’ stalls, hung on cleft sticks, or tacked to walls (Shevlin 1999: 48). In the seventeenth century, the title page – including the title of the work – was largely the domain of the bookseller and printer (McKerrow 1928: 91; Shevlin 1999: 52), making title pages a part of what Genette calls ‘publisher’s peritext’ (1997: 16). In this paper we investigate the typographic and text-structural features of the title page in books attributed to Culpeper. The work builds on an earlier pilot study (Tyrkkö 2011) that identified the systematic nature in which printers and publishers made commercial use of not only the name Culpeper, but also the paratextual features of his previous books in an effort to emulate the style of his authentic works.  To enable the structural and typographical analysis of these title pages, the title pages of all books listed from the period 1649-1700 that mention Culpeper’s name and are available at the British Library, Cambridge University Library or Wellcome Trust Library were transcribed and annotated for structural parts and named entities, as well as for visual features such as layout, graphic elements, and different typefaces and font sizes thereof. The annotation process started with the taking of close measurements, down to one fifth of a millimeter, of the aforementioned elements from original artefacts, and was completed using digital facsimiles from Early English Books Online (EEBO). The annotation scheme is based on the TEI P5 Guidelines for Electronic Text Encoding and Interchange, using elements from the Core, Default text structure, and Names, Dates, People, and Places modules to annotate the textual structure and named entities, and elements from the Core, Representation of primary sources and Tables, Formulæ, and Graphics modules to annotate the visual layout of the title page. For the purposes of annotating the typographical layout with sufficient accuracy and consistency, we have developed an experimental system for annotating the different typefaces and their sizes, using the ’rend’ attribute and a controlled value set. This system – which is based on relating the size of the different typefaces used on the title page to the absolutely measured ’base type’ of the text – is intended to combine the benefits of absolute and relative measurement and to alleviate the difficulties caused by working with digital facsimiles, such as unknown scaling factors and distortion of proportions.  The quantitative analysis related the visual and structural features of the title pages to the bibliographic and sociohistorical parameters of the texts – such as stated target audience, format, identity and geographic location of the publisher and printer, publication year (whether before or after Culpeper’s death) and the known relationship of the text to Culpeper. This data is imported into a database together with the abovementioned bibliographic and sociohistorical data, obtained from the ESTC, the British Book Trade Index (BBTI), the Oxford Dictionary of National Biography (ODNB) and earlier book historical research.  The database of paratextual, bibliographic and sociohistorical data will be queried using methods of multivariate analysis to identify relationships between the physical features of the title pages and the variables of their production histories. The analyses will reveal diachronic trends in the design of title pages bearing the name Culpeper, and bring to light the underlying factors which influenced the decisions regarding the physical presentation of the texts and to highlight the different means used by printers and publishers to market their products. More specifically, this allows us to reconstruct a timeline of how the commercial brand of Culpeper was created and identify which features of the title page were specific to the brand, which were typical for the time and which were specific to particular publisher’s or printer’s house style. The findings will be examined in light of broader book historical scholarship on such features in an effort to distinguish features specific to the corpus of Culpeper books. ", "article_title": "Culpeper’s legacy: How title pages sold books in the 17th century", "authors": [{"given": " Jukka Jyrki Juhani", "family": "Tyrkkö", "affiliation": [{"original_name": "University of Helsinki, Finland", "normalized_name": "University of Helsinki", "country": "Finland", "identifiers": {"ror": "https://ror.org/040af2s02", "GRID": "grid.7737.4"}}]}, {"given": " Carla Maria", "family": "Suhr", "affiliation": [{"original_name": "University of Helsinki, Finland", "normalized_name": "University of Helsinki", "country": "Finland", "identifiers": {"ror": "https://ror.org/040af2s02", "GRID": "grid.7737.4"}}]}, {"given": " Ville", "family": "Marttila", "affiliation": [{"original_name": "University of Helsinki, Finland", "normalized_name": "University of Helsinki", "country": "Finland", "identifiers": {"ror": "https://ror.org/040af2s02", "GRID": "grid.7737.4"}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}