{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Laurence Sterne (1713-1768) is better-known nowadays as a novelist, but he was also an Anglican minister whose literary style was initially developed in the pulpit. He wrote many sermons before he turned to novel-writing. Indeed, his first publications were single sermons. Melvyn New, who cannot be praised enough for publishing the first scholarly edition of his sermons, claims that it is “foolish” to “argue Sterne’s uniqueness as a sermon-writer”. Others have followed suit (e.g. Elizabeth Kraft). However, Paul Goring and Judith Hawley have cogently argued that Sterne’s contemporaries often commented on the distinctiveness of Mr Yorick’s sermons. As a scholar who has devoted much of her research to eighteenth-century English pulpit literature, I have long had the impression that some of Sterne’s sermons stand out above all the rest. I therefore propose to test this intuition/assumption through a comparison between Sterne’s homiletic discourse and a corpus of contemporary sermons, in order to assess whether it is possible to reconcile the viewpoints of New and Goring. My working hypothesis is that Sterne as a preacher may have dealt with typical homiletic ideas in a very original (hence ‘eccentric’) idiolect. His innovation may be more stylistic than doctrinal. Besides, eccentricity seems to be the characteristic feature of only a relatively small number of Sterne’s sermons, which strike the reader as being more narrative, imaginative or even novelistic texts than standard post-Restoration pulpit oratory. Most of his other homilies sound much more conventional. Whether this is due to extensive plagiarism -- as first systematically analysed by Lansing Van der Heyden Hammond -- or to typically Latitudinarian theology, as argued by New, remains to be seen. Sterne’s printed sermons will be compared with a full-text corpus of eighteenth-century English sermons, comprising works by Jonathan Swift, John Wesley, perhaps George Whitefield, the manuscripts of John Sharp (1723-92), and a subset of political sermons published in the first two decades of the century. Furthermore, internal comparisons between the collections of sermons which Sterne himself prepared for publication after the first instalment of Tristram Shandy and the three posthumous volumes published by his daughter are also necessary. This paper will be based on the approach developed by the predominantly French school of lexicometry and stylometry, which emphasizes the use of exploratory multivariate statistical methods such as correspondence analysis and cluster analysis. For lack of a single software program that would ideally carry out all the necessary tasks, several packages will be used, especially Hyperbase, Lexico3, Weblex, Wordmapper, maybe Wordsmith. The linguistic and stylistic features identified by Douglas Biber as underlying different text types, especially the dimensions labelled by him as “narrative versus non-narrative concerns,” “informational versus involved production,” and “persuasion” will be explored.", "article_title": "Eccentricity and / or Typicality in Sterne’s Sermons ? Towards a Computer - Assisted Tentative Answer", "authors": [{"given": "Françoise ", "family": "DECONINCK-BROSSARD", "affiliation": [{"original_name": "Université Paris X, U.F.R.     d’Etudes anglo-américaines", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}