{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Since its initiation in 1995, the Cervantes Project has focused on creating a comprehensive on-line resource centered on the iconic Hispanic author Miguel de Cervantes (1547-1616). The project, a collaboration of researchers in Hispanic Studies and Computer Science, provides bibliographical, biographical, and textual materials, including an Electronic Variorum Edition based on first editions of Cervantes’ best known work, Don Quixote. Recent additions include an exhibit of bookplates (ex libris) inspired by the Quixote. Soon to be released are a significant collection of illustrations associated with key Quixote editions (the textual iconography) and a presentation of the musical aspects and influences of Cervantes’ works. These latter two collections will be discussed further in this paper. As our work with the Cervantes Project has evolved, we have become increasingly aware of the need to develop rich interlinkages between the panoply of resources collected for and produced by this project [3]. Within the broader scope of the project as a whole, our textual iconography collection offers a fertile ground for exploring the needs of large, interdisciplinary collections, and the techniques for integrating the resources they contain. The textual iconography collection (Figure 1) is intended to facilitate a more complete understanding of the iconic transformations of the Quixote [5] throughout history by assembling a digital collection of more than 8,000 illustrations taken from over 400 of the most significant editions of this seminal book [15]. In the process of assembling and working with this collection, we have found traditional approaches to presenting image-based collections in both print and digital media to be lacking [12]. While print has long been the dominant media of scholarly communication, it does not scale well to projects of this scope [8]. Digital image collections, on the other hand, are often focused on presenting large numbers of images and associated metadata but lack the scholarly commentary and integration with other textual resources required for scholarly investigations. Moreover, we have found a need to adopt a rich model of hypertext, based on automatically-generated links and multiply-rooted to reflect multiple interpretations of simultaneous significance.We have aggressively pursued the development of this collection 2 with the intention that it will enable new forms of textual, visual and critical analysis. In particular, it enables scholarly research in two major directions that remain poorly understood despite the incredible amount of scholarly attention devoted to the Quixote. First, the textual iconography of the Quixote is a key resource to help literary scholars better understand its reception and interpretation throughout history—the illustrations acting as a “hand-mirror 3 ” that allows us to see how successive generations of readers, including our own, have literally painted themselves into Cervantes’ story [7]. Second, this collection is an invaluable dataset for art historians enabling them to better explore the tools and techniques employed in the often neglected field of book illustration 4. The illustrations found in the pages of the Quixote trace the evolution of graphic art in modern printed works, from the first wood cuts of early 17th century, to the copper engravings, etchings aquatints of the middle and late 17th century and 18th century, to the xilographs and lithographs of the 19th century, and finally the mechanical techniques of the 20th century including offset printing [10,13,14]. These areas remain poorly understood, not simply because of a lack of attention, but in large part because traditional approaches do not adequately support investigations of this nature. The value of the textual iconography collection is not limited to the scholarly community. Its canonical status in world literature courses, its iconic nature in Hispanic culture, and the renewed interest awaked by the recent celebrations surrounding the 400th anniversary of its publication, ensure a continued popular interest in the Quixote. The illustrations of the adventures continue to captivate the popular imagination and help to bring the book alive to millions of readers. By making the collection available to the public in digital format, we are able to radically increase the resources available to students of the Quixote from all walks of life. Our goal, however, is not simply to provide a large pile of pictures for students to peruse, but to further enrich their understanding of both the Quixote and of art history by supplementing the illustrations with commentary about the significance of the images, their relationship to the text, and the artistic achievement of the illustrators and engravers who created them. To adequately support both the scholarly and popular communities that will access the collection, it is not sufficient to merely provide an online catalogue of the illustrations, regardless of the completeness of the collection or the detail of the metadata. Instead, we have identified three levels of information required to successfully present these materials: 1. Descriptive metadata: The first level of information includes factual descriptions of the items it describes. For our collection, descriptive metadata is provided for both individual illustrations and the editions in which those illustrations were published. This information includes the title of the image, its physical size and the size of the page it is printed on, the name of the artist and/or engraver, the style of the image, and the printing technique used. 2. Scholarly commentary: The second level goes beyond simple descriptions of the items in the collection to provide a critical assessment of those items, their narrative context, and their hermeneutic and aesthetic significance. Within our collection we are developing biographical commentary about artists and engravers and technical and artistic commentary about each individual image. 3. Hypertextual connections: The third level consists of the information needed to develop dense hypertextual structures and the tools to effectively navigate them. A key challenge in constructing collections of this type is developing appropriate strategies for interconnecting the resources being continuously added to the collection. While most traditional editorial approaches require editors to carefully edit each resource by hand, this is beyond the scope of our current resources and would greatly limit the size of our collection, the speed with which it could be made available, and the degree of interlinkages that could be provided. Accordingly, we are using two strategies for automatically interlinking digital resources. One approach relies heavily on the metadata associated with each digital image. We use this metadata information to automatically discover relationships between existing and new resources and then to generate navigational structures based on those relationships. A prototype of this system has been employed internally for use in a project centered on the music in Cervantes’ works [9] (Figure 2). One key application of this approach allows us to integrate multiple resources, including illustrations, with the textual and narrative structure of the Quixote [2]. To accomplish this we have developed a formal taxonomy of the narrative and thematic elements of the Quixote, which is then used in cataloging each image and can be used for the associated commentary. This allows us to codify the connections between the illustrations and commentary without requiring a particular version of the text. The second approach to interlinking resources we have developed involves elucidating the internal structure of the textual resources in the collection and using that structure to automatically generate navigational links and to inform visualizations [1]; an approach that generalizes Crane’s [4]. In this context, we have developed a toolkit to implement this approach for a collection of historical documents pertaining to Cervantes and his family. The hypertextual collections created for our purposes create separately rooted structures over a common set of interlinked elements. For example, in the music collection referred to above, natural collection roots include the compositions, the composers of the pieces, the instruments associated with the pieces, and the texts that refer to the pieces. Each rooted collection includes information specific to the collection (e.g., biographies of the composers and musical scores are associated with their respective collections), but ultimately collections are cross-linked (e.g., between compositions and composers, between instruments and compositions). The texts provide a unifying framework that draws the other components together, yet the texts themselves represent a distinct collection. The structures in the textual iconographic collection show similar relationships, with the added complexity implicit in the three-level categorization of collection information. In conclusion, by adding detailed scholarly commentary in addition to descriptive metadata and to providing sophisticated tools for automatically building a hypertextual structure into the collection, we are able to provide a new resource that better meets the research needs of scholars and to assist the general public in understanding and appreciating the significance both of the Quixote itself, as well as its reception and visual history. Our approach allows the readers of scholarly commentaries more direct access to the primary source materials used to develop and support those commentaries 5 [6,11]. Conversely, it allows individuals focusing on the primary materials access to secondary scholarly works to better understand a variety of reading perspectives and to explore and formulate their own interpretations of these unique materials. Moreover, the nature of the collection and its information relationships has required the addressing of canonical hypertextual structuring issues. Taken as a whole, our collection and hypertextual archive opens previously unavailable opportunities for scholarly study of the Quixote and its unique literary, cultural and iconic status.", "article_title": "Textual Iconography of the Quixote: A Data Model for Extending the Single - Faceted Pictorial Space into a Poly - Faceted Semantic Web", "authors": [{"given": "Eduardo ", "family": "URBINA", "affiliation": [{"original_name": "Hispanic Studies, Texas A&M University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Richard ", "family": "FURUTA", "affiliation": [{"original_name": "Computer Science, Texas A&M University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Jie ", "family": "DENG", "affiliation": [{"original_name": "Computer Science, Texas A&M University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Neal ", "family": "AUDENAERT", "affiliation": [{"original_name": "Computer Science, Texas A&M University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Fernando González ", "family": "MORENO", "affiliation": [{"original_name": "Universidad de Castilla La Mancha", "normalized_name": "University of Castile-La Mancha", "country": "Spain", "identifiers": {"ror": "https://ror.org/05r78ng12", "GRID": "grid.8048.4"}}]}, {"given": "Manas ", "family": "SINGH", "affiliation": [{"original_name": "Computer Science, Texas A&M University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Carlos ", "family": "MONROY", "affiliation": [{"original_name": "Computer Science, Texas A&M University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}