{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Beginning in the 1950s Americans sponsored international exchange programs for Polish scientists and professionals, believing that exposure to the West would undermine Communism. In 1989, Poles underwent a negotiated revolution. Were these extensive American public diplomacy efforts successful? Can pathways of influence and shifts in perception within specific epistemic communities be measured, mapped, and visualized longitudinally to better understand exogenous influences on Eastern Europe’s democratization process? Based on an approach to quantifying individuals’ lives based on their “institutional affiliations,” our interdisciplinary team has designed an interactive social network analysis visualization app, built in R Statistical Software using the Shiny package. The app allows users to interactively explore the overlapping networks of political revolution and international exchange, and illustrate how these connections shifted over time. This provides insights into Poland’s specific experience, as well as a model for studies of other complex, longitudinal networks. ", "article_title": "Mapping the Indefinable: Designing a Social Network Analysis Shiny App to Explore the Influence of East-West Exchanges on Poland’s Political Transformation", "authors": [{"given": "Gregory Frank", "family": "Domber", "affiliation": [{"original_name": "California Polytechnic State University San Luis Obispo, United States of America", "normalized_name": "California Polytechnic State University", "country": "United States", "identifiers": {"ror": "https://ror.org/001gpfp45", "GRID": "grid.253547.2"}}]}, {"given": "Kelly", "family": "Bodwin", "affiliation": [{"original_name": "California Polytechnic State University San Luis Obispo, United States of America", "normalized_name": "California Polytechnic State University", "country": "United States", "identifiers": {"ror": "https://ror.org/001gpfp45", "GRID": "grid.253547.2"}}]}], "publisher": null, "date": "2019", "keywords": ["digital humanities (history", "modeling and visualization", "spatial & spatio-temporal analysis", "theory and methodology)", "English", "network analysis and graphs theory", "prosopography", "history and historiography"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}