{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Computer-assisted text analysis has over 50 years of history in providing tools to help scholars interpret texts (see, for instance, Potter, 1991, Burrows, 2004, Bradley, 2004). The tools themselves are the products of a large range of circumstances in computing and text criticism, from the availability of certain hardware to the fluctuating fortunes of structuralist approaches in literary criticism. In this paper we will reverse the usual interpretive flow from tools to text by attempting to interpret tools themselves as artifacts of human creation. We will frame this interpretive exercise as a Gedankenexperiment; in particular: if a scholar one hundred years from now were to study the TAPoR Portal as cultural artifact, what would it reveal about its theoretical presuppositions, the methodological practices of its times, its cultural value, and even its authors?This thought experiment is predicated on the assumption that tools can be studied as cultural artifacts in ways similar to, say, literary texts. To examine this assumption more closely, we will outline several ways in which tools may be studied and interpreted, including: as functional systems fulfilling an identified needas code that corresponds to certain expectations in terms of structure, brevity, creativity, etc.as interfaces that may have an aesthetic appealas pedagogic tools that are intended to assist users in developing skillsas artifacts that express an author's perspectiveas artifacts that express characteristics about a communitySeveral differences are evident between literary texts and tools as objects of study. For instance, tools manifest themselves at two (at leaset) layers of visibility: the code layer, generally reserved for developers, and the interface layer, generally intended for users. Literary texts, in contrast, have only one layer of exposure. It may also be that text analysis tools are fundamentally too different from texts to be considered using approaches of literary criticism. A similar debate has raged in game studies for the past several years (see, for instance Frasca, 1999): can games be studied as narratives (the literary camp) or do they require an entirely different approach (the ludology camp)? We will argue for a hybrid approach: while literary criticism can be useful to interpret certain aspects of tools, other aspects require their own framework of study. Moreover, this hybrid approach leads to certain practical consequences when considering how to peer-review tools and their development (see Sinclair et al., 2003). As a case study for interpreting tools, we will use the TAPoR Portal, an initiative to build a web-based gateway to electronic texts and tools (see  and Sinclair, 2002). The TAPoR Portal is reaching the end of its development cycle, after approximately five years. It serves as a convenient case study for several reasons, including its duration (a five year project), its collaborative nature (involving several dozen researchers at five Canadian universities, its development model (a blend of academic and private sector contributions), its interdisciplinarity (representing several branches of the digital humanities and computer science), and, of course, its size and complexity (over 165, 000 new lines of code). Indeed, given the size of this \"corpus\", examples can be found for just about any interpretation that might be proposed, but such is the open-ended nature of interpretation. ", "article_title": "Reading Tools, or Text Analysis Tools as Objects of Interpretation", "authors": [{"given": "Stéfan ", "family": "Sinclair", "affiliation": [{"original_name": "McMaster University", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}, {"given": "Geoffrey ", "family": "Rockwell", "affiliation": [{"original_name": "McMaster University", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}], "publisher": null, "date": "2007", "keywords": ["text analysis", "tools development"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}