{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Modern (foreign) languages have been under pressure in a number of countries for some time now, with reduced provision in many English-speaking countries, and options increasingly focusing on English elsewhere. In the English-speaking world, a long series of reports has catalogued these challenges at all levels of education, often using words like ‘crisis’ and ‘urgency’ (Tinsley 2013) and it has been suggested that the field of Modern Languages needs to re-configure itself to meet new cultural/media landscapes (Worton 2009). Meanwhile, as the digital humanities have expanded and increasingly entered mainstream debates about the future of the humanities, there has been a growing focus on its terms of representation (Spence 2018) and commitment to diversity (Galina 2014). On a geocultural level, various initiatives have sought to address the immense Anglophone linguistic and cultural disparities (e.g. https://programminghistorian.org/ or http://www.globaloutlookdh.org/) which digital culture has amplified — and which DH has often, albeit unwittingly, reinforced within its own areas of influence — but there has been relatively little consideration given to possible interplay with ML, which seems strange given ML expertise in studying multilingual diversity, translation and transcultural perspectives. This paper starts by tracing interactions between ML and DH based on detailed empirical research, and argues that there is much to gain from connecting current debates about the future of the Modern Languages (ML) with concerns about the linguistic diversity deficit in the digital humanities.  Topography So far there has been little systematic analysis of interactions between ML and digital humanities (or digital culture more generally), something the Digital Mediations strand on the AHRC-funded ‘Language Acts & Worldmaking’ project aims to address (https://languageacts.org/digital-mediations/). Through a series of landscape surveys – questionnaires, interview surveys, literature reviews, resource reviews and curricular studies - we have mapped the topography of digital ML research and found that the engagement of Modern Foreign Languages with digital is both wider and deeper than is widely understood by DH or indeed by ML itself, although recently it has started to surface more prominently through initiatives such as the ‘digital hispanisms’ panel at the Association of Hispanists of Great Britain and Ireland conference in 2018 (http://community.dur.ac.uk/hispanists/wp-content/uploads/2018/03/AHGBI-2018-Abstracts-Booklet.pdf) or the 2019 MLA forum on ‘Digital Humanities & Modern Languages’ (https://mla.confex.com/mla/2019/forum/extra/index.cgi?EntryType=Session&username=4494&password=340557). Digital mediation in ML is particularly strong around language learning/teaching, where researchers and teachers have an elevated understanding of the potential for authentic, multimodal, learner-centred, transcultural and polylingual interaction (Guikema and Williams 2014), but the focus of our research is principally on research into (foreign) languages and their related cultures, rather than language learning. Our research first sought to establish the topography of ML-DH interactions through an open survey (158 respondents), interview study with ML respondents (35) across a range of different roles, course review (analysing 12 ML modules at 9 institutions) and resource review (analysing 1,327 digital ML resources across 8 portals/platforms). We have found that ML researchers have an elevated sense of digital affordances (and risks/limitations), but, generally speaking, low engagement with the kind of advanced digital methods represented by DH, beyond areas such as digital editing, linguistics, electronic literature and web archive studies of language communities (Spence and Brandao 2019).  There were some interesting trends in both survey and interview studies: while transcultural and plurilinguistic expertise is valued, national and disciplinary boundaries are deemed less and less relevant to ML research (making future DH-ML collaboration all the more necessary); large scale data approaches are judged to be increasingly important in facilitating interesting comparisons of cultural reception and influence across many languages; digital is becoming increasingly important as a research object in itself; and there is support for the idea that ‘digital’ needs to (and will) be integrated more closely into ML practice, rather than being something different in future.   Towards a DHML agenda? How does this connect to DH specifically? How can we start to theorise the connection between the digital humanities and ML, and what opportunities are there for deeper, bidirectional and equitably conceived/constructed collaboration? In November 2015 a writing sprint on the theme of ‘Modern Language and the digital’, later published as an open access multi-author collaborative article on ‘The Shape of the Discipline’ edited by Claire Taylor and Niamh Thornton (2017), opened up debate about this. Conversation ranged from themes such as data-driven approaches to modern languages or the ML research process, to users/interfaces in ML and digital ethnography and while some contributors argued that DH often has too narrow a conception of ‘digital’ (which doesn’t always engage well with the digital cultural studies focus which is more common in ML), the article set the scene for greater possible collaboration between the field of ML and DH. In an article for Digital Humanities Quarterly, Thea Pitman and Claire Taylor expanded on this theme, arguing that ML bridge a gap between traditional DH praxis and “linguistically- and culturally-specific cultural studies approaches to digital materials” (2017). They went on to argue that more collaboration is needed “to optimise the potential of both disciplines” through what they call a “‘critical DHML’ approach.”   Mutual disruption Debates about DH’s own communication practices have rightly received a fair amount attention in recent years, with various attempts to address linguistic and cultural diversity (http://go-dh.github.io/translation-toolkit/about/), but it has been much less common for linguistic diversity to be explicitly harnessed as part of DH’s research agenda. There is a substantial body of DH research involving language, but the overriding dynamic has historically been digital humanities disrupting ML-based research practices, rather than the other way around, and this naturally shapes discourse around the ML-DH relationship. DH2018, in many ways an exemplary conference in terms of representation, with ample discussion of cultural diversity and reappropriation of digital spaces – such as the keynote ‘Weaving the Word’, by Janet Chávez Santiago – addressed this balance to some extent, but even here the emphasis was largely on digital transformation of ML rather than vice versa, and where ML perspectives surfaced explicitly, it was generally in relation to pedagogy (e.g. ‘Global Perspectives On Decolonizing Digital Pedagogy’ panel). What if we were to change the direction of flow, or to look for challenges which are mutually transformative?  As a result of our research we propose some areas where DH might benefit from a greater, and more explicit, adoption of ‘ML’ sensibilities, which can be summarised as follows:    The international classroom. Greater attention to the concept of the international and plurilingual classroom in DH pedagogy - including diversification of the DH curriculum, and the use of virtual communications to explore multilingual interactions between DH student cohorts, potentially in liaison with ML programmes.   Linguistic diversity as research topic. The growing consolidation of ‘supercentral’ languages and English as the ‘hypercentral’ language has major implications for language diversity (de Swaan 2001), a phenomenon which will increasingly become a major challenge for DH and scholarly communications as a whole (Ortega 2014). Digital humanists are already active in some great projects to protect endangered, minority or heritage languages, but there is a need for greater awareness of, and commitment to, linguistic diversity in the actual construction of DH resources and this is an area ML where can make an important contribution.    Linguistic/cultural interfaces. Early digital experiments like the work of Jiménez, Underberg and Zorn adopted key Andean concepts such as “complementary duality and the tripartite division of time and space” into web design (Underberg and Zorn 2013: 29). Closer attention from DH to how resources are constructed linguistically and culturally would help foster greater awareness about how resources work transculturally within the field.   Greater recognition and organisation of multilingual resources. With the exception of corpus-based resources such as CLARIN (https://www.clarin.eu/portal), it is not easy to find language-based DH research online, even on otherwise excellent resources such as the EADH project list (https://eadh.org/projects).   Multilingual methods and tools. We know digital methods and tools are not culturally neutral, and yet much of the discussion about them still tacitly assumes that they operate globally and monolingually (in English) – we need more formal work in DH to explore how they operate differently in and across different linguistic and cultural contexts.     Conclusions Languages (and their associated cultures) have been a key area of focus for the Digital Humanities from its origins as a field, and yet DH has rarely explored what this means in any real depth for its own research and pedagogical practices. In this paper, we have outlined a rationale for greater focus on ML-DH collaboration and have proposed some key elements of a possible future common research agenda.", "article_title": "Topographies of Digital Modern (Foreign) Languages research", "authors": [{"given": "Paul Joseph", "family": "Spence", "affiliation": [{"original_name": "Department of Digital Humanities, King's College London", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}]}, {"given": "Renata", "family": "Brandao", "affiliation": [{"original_name": "Department of Digital Humanities, King's College London", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}]}], "publisher": null, "date": "2019", "keywords": ["digital humanities (history", "multilingual / multicultural approaches", "theory and methodology)", "English", "spanish and spanish american studies"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}