{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " In this short paper presentation a participatory ethnographic GIS-mapping approach and an example for a digital platform for the visualization and digitalization of local environmental knowledge will be introduced. The term “Indigenous” is used to refer to those who “have a historical continuity with pre-invasion and pre-colonial societies that developed on their territories and consider themselves distinct from other sectors of the societies now prevailing in those territories” (UNESCO, 2004). Based on examples and research results of the research project ANIK Alpine risks in times of climate change, funded (2012-2015) by the German Ministry of Education and Research (BMBF), this paper will question how local environmental knowledge (Pottier, 2003) and local perceptions and handling strategies of climate-related risks may be gathered through participatory GIS mapping (PGIS), (Reichel, Frömming 2015, 2014). Based on applied visual anthropological methods, PGIS is a relatively new cartographical digital approach which includes local perceptions and strategies of action gathered during interviews and participant observation. This approach fosters active participation of local people (Wood, 2012), not only during the research process in the field, but also during the presentation process of the research data as digital spaces of memory. ", "article_title": "Indigenous digital humanities. Participatory geo-referenced-mapping and visualization for digital data management platforms in digital anthropology", "authors": [{"given": "Urte Undine", "family": "Froemming", "affiliation": [{"original_name": "Freie Universitaet Berlin, Germany", "normalized_name": "Freie Universität Berlin", "country": "Germany", "identifiers": {"ror": "https://ror.org/046ak2485", "GRID": "grid.14095.39"}}]}], "publisher": "Maciej Eder, Pedagogical University in Krakow", "date": "2016", "keywords": ["folklore and oral history", "digital humanities - multilinguality", "digital humanities - pedagogy and curriculum", "teaching and pedagogy", "cultural studies", "anthropology", "digital humanities - diversity", "digitisation - theory and practice", "knowledge representation", "archives, repositories, sustainability and preservation", "English", "audio, video, multimedia"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}