{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "INTRODUCTION. BACKGROUND AND INITIAL GOALS The main purpose of this article is to introduce and describe a new digital resource, the Tesauro Terminológico-Conceptual (TTC), designed to perform research online, and the Atenea Corpus. The structure of the TTC thesaurus is conceptually innovative, and it has been specifically build to assist the user in the epistemological, terminological, textual and theoretical aspects of art research. The TTC is a development of the research done by Nuria Rodriguez for her doctoral dissertation [1]. The goal was to find a satisfactory answer to the terminological/conceptual problems that hinder research in the history, theory and criticism of art, and the TTC is the solution proposed(1). This project is closely related to the Getty Research Institute (Los Angeles, USA), and particularly to its Vocabulary Program, and the Art & Architecture Thesaurus (AAT).(2) The TTC is also linked to the Spanish version of the AAT, translated and managed by the “Centro de Documentación de Bienes Patrimoniales” based in Chile.(3) The TTC can be broadly defined as a knowledge tool for art specialists and other users, that helps to obtain a compilation of described, analyzed, classified and linked terms and concepts, primarily those having to do with theory, criticism and aesthetics. In order to build this type of tool it is essential to perform an interpretative analysis of these concepts and terms due to the ambiguity that define them. After that, these terms and concepts must be incorporated into the structure of the TTC with all the relevant information associated to them. An important outcome of this process is the development of a digitalized set of artistic texts: the Atenea Corpus, since one of the epistemological and methodological basis of this project is the study of the terms in their textual contexts. Therefore, this project creates a virtual net made up of two complementary components: a text database, and the terminological conceptual thesaurus (TTC). The textual database consists of all the digitalized texts that supply the terms and concepts recorded by the thesaurus [see figure 1]. INITIAL GOALS Why to create a new type of thesaurus? The initial context in which the project began substantially determined the conception and the characteristics of what would become the TTC. For further information on this type of thesaurus see also [2, 3, 4 and 5]. 1. Terminological/conceptual problems: ambiguity and interpretative inaccuracy. The main purpose of this project was to provide a satisfactory answer to the terminological/conceptual problems that encumber the task of conducting research in the history of art. Some of the problems most frequently found in the field of art history are terminological and discursive ambiguity, vagueness, and inaccuracy, particularly when dealing with theory and criticism. This situation derives from the high degree of semantic density typical of artistic terminology, as well as from frequent semantic alterations and shifts in meaning that terms undergo as a result of multiple reinterpretations and new uses. Thus, studying the semantic properties of terms and their diverse domains of meaning became a priority from the beginning. This approach required identifying and organizing the various meanings of each term and the semantic scope of every concept by comparing the variations found in the different discourses. None of the available thesauri was capable of performing these tasks: 1. Conventional thesauri do not take into account the theoretical and discursive contexts in which concepts appear; 2. The brief definition (or scope note) attached to each descriptor in conventional thesauri barely satisfies the needs of specialists in theory or criticism. The scope note has a very specific function, which is to limit the meaning of the descriptor to the framework of the thesaurus itself. As a result, theoretical and critical analyses are irrelevant in defining and describing concepts. Lacking these sorts of analyses, the complexity inherent to artistic concepts, with all their nuances and variations, ends up either simplified or ignored. 2. Linguistic and expressive richness. Besides categorizing the semantic component of the terminology and solving its ambiguities, a further objective was to compile and analyze the rich variety of verbal and expressive resources that characterizes the field of art history. In order to reach this goal it was necessary to collect, describe and classify all the expressive resources used by specialists in their writings about art, whether the lexical expressions were specific, or not (such as metaphoric or metonymic terms, literary or rhetorical resources). The criteria applied to the compilation of expressive resources went beyond the standards of conventional thesauri, for they only register terms identified as belonging to a particular field of study. 3. Textual and discursive approach. The essential notion underlining the project is that natural languages have to be considered in the context of their use, as they appear in a particular text; with respect to terms, they are regarded as functional entities with a contextually determined role and meaning. Consequently, the identification and analysis of terms and concepts had to be done at the discursive level, paying especial attention to the way in which authors and specialists used and defined them. Since these terminological and conceptual uses needed to be examined within their textual context, the thesaurus had to include the relevant discursive fragments. Again, conventional thesauri could not offer this type of information because, even though they provide the bibliographical sources for the terms, they do not include the textual citations themselves.In view of the shortcomings of conventional thesauri, it became clear that only the development of a new thesaurus prototype would achieve the desired results.Fig. 2: structure and parts of the TTC. It follows that the TTC simultaneously develops in three dimensions: • Conceptual and Epistemological Dimension: comprises a collection of artistic concepts described, classified into a conceptual structure and linked among them. • Linguistic and Terminological Dimension: consists of every term and verbal expression that acquires artistic meaning in the discourses being analyzed; all of them are described, classified according to terminological typologies, and assigned to the concepts they denote. • Textual and Discursive Dimension: contains the texts that are the sources for the concepts and terms registered in the TTC. Thus, the structure of the TTC, as we will explain with detail in the presentation, can be simply described as the way in which these dimensions are organized [see figure 2]. THE TEXTUAL DATABASE The database comprises the set of Spanish artistic texts used to extract all the concepts and terms registered in the TTC. This is why the textual database and the TTC can be described as two complementary tools that are virtually linked. Once there is a suitable computer application to implement the project, it will be possible to go from the textual fragments found in the TTC to the full textual sources; likewise, it will be possible to access the TTC from the textual database to obtain detailed information about the terms and concepts that appear in the texts. In addition to its complementary role, the textual corpus has also been designed to function as an independent tool that can be used by any specialist or researcher interested in aesthetics, theory, or art criticism. Indeed, a key goal of this project is to turn the textual corpus ATENEA into an exhaustive repository of pictorial and artistic texts that could serve as a basic reference tool for theoretical and critical studies, and, more generally, for research dealing with texts, sources and documents. This textual corpus represents an important contribution to the study of Spanish art history and theory since there are no other systematically digitalized texts in this field. The encoding of the texts was done at the Miguel Hernández University(4), following the TEI standards(5). The markup was performed using the Spanish set of TEI tags, allowing for automatic conversion to standard English-based TEI tags when necessary [4]. We considered that marking Spanish texts with Spanish mnemonics is more coherent than using English based marks, and improve their understanding and usability by Spanish speaking scholars [5]. For Web management and operation we used the PhiloLogic System.(6) This system was developed by the ARTFL project in collaboration with the University of Chicago Library’s Electronic Text Services(7) for the purpose of running texts compiled on digital corpuses. The textual database offers a diversity of search options that are redundant in terms of their versatility and polyvalence [see figure 3]. Depending on their interests, users will be able to: • Access a digitized copy of the complete text or texts of the author or authors being examined. • Find a listing of all the data related to a specific term, such as how it is used in a particular treatise, the frequency with which it appear, the various meanings it assumes, or even compare different treatises. • Get information about the sources or documents themselves. To this effect the textual corpus is being implemented with an additional database containing all the information related to the digitalized texts in specially structured and codified fields.Fig. 3: uses and possibilities of ATENEA database. USES AND POSSIBILITIES OF THE TTC The TTC has been conceived and developed as a research tool whose main emphasis is the terminological, conceptual and theoretical/critical analysis of artistic texts. However, the potential uses of the TTC are not limited to textual analyses for it has the capability of becoming a polyvalent tool applicable to a variety fields to the study of art in the Web. In general terms, there are four main potential applications that deserve to be emphasized: 1. Terminological and conceptual research 2. Tasks related to documentation and indexing of visual resources and textual material 3. In connection with this last point, retrieval of artistic information mounted on the Web. 4. Finally, the structure of TTC can also work as an abstract and standardized model that could be used by other specialists or other projects. These “other” TTCs could be linked as microthesauri.", "article_title": "Use of Computing Tools for Organizing and Accessing Theory and Art Criticism Information: the TTC - ATENEA Project", "authors": [{"given": "Nuria ", "family": "RODRÍGUEZ ORTEGA", "affiliation": [{"original_name": "U. Málaga (Spain)", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Alejandro ", "family": "BÍA", "affiliation": [{"original_name": "U. Miguel Hernández", "normalized_name": "Miguel Hernandez University", "country": "Spain", "identifiers": {"ror": "https://ror.org/01azzms13", "GRID": "grid.26811.3c"}}]}, {"given": "Juan ", "family": "MALONDA", "affiliation": [{"original_name": "U. Miguel Hernández", "normalized_name": "Miguel Hernandez University", "country": "Spain", "identifiers": {"ror": "https://ror.org/01azzms13", "GRID": "grid.26811.3c"}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}