{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Astronomers use telescope arrays to create high-resolution images of distant objects. In a Translation Array, by aligning multiple divergent translations (target texts) we can produce new images of the historical and contemporary dynamics of translating cultures, and also of the originals (source texts), by showing how these are refracted through translators’ varying interpretations.  Text variation – multiple documentary and curatorial witnesses – is a familiar challenge in digital edition-making (Price 2006; Schmidt & Colomb 2009). But in DH work so far, the ‘story’ which is told about a text or oeuvre is normally confined to its original language. (An exception is Rybicki 2003, 2006; and cf. Altintas et al. (2007) for a historical linguistics application of a ‘time separated’ parallel translation corpus.) In fact, the stories of ‘cultural heritage texts’ (Schmidt 2010) are normally multilingual and multicultural. Can we make it practically possible (and preferably enjoyable as well as informative) to explore, share, and debate the rich knowledge of texts and the world that is encoded in multiple translations? The fact that multiple translations have remained, until now, an unsuspected resource for DH comes as no surprise from the perspective of Critical Translation Studies (CTS). The Scandals of Translation and The Translator’s Invisibility are two titles by the doyen of the field, Venuti (1995, 1998). Few outside it appreciate the scale of divergence, of multiple kinds, caused by multiple factors, which is normal among multiple translations. The causes of divergence include varying translator competence and individual creativity, framed within target-context-specific norms: linguistic, cultural, political, legal, and ideological constraints and compulsions, which all affect the acts and outputs of translation or retranslation (Gürcaglar 2009). Multiple translations are therefore a very rich resource for transcultural study. They are tailor-made for digital approaches, because each one is implicitly aligned with each other one, and with the original – at least partially.  A Translation Array is a database (a multiple translation text corpus with rich metadata including rich segmental alignments to a source text) with a browser-based interface. It exploits existing and custom-built visualization tools for multi-scale viewing, exploration and creative interaction. Arrays will capture user generated content – both data (texts, text corpora) and metadata: catalogue information, annotations, commentaries, interpretations, algorithmic analyses, micro-alignments, and interlingual re- or back-translations. Data and metadata can be read at various scales. By supporting distant readings (à la Moretti 2005), algorithmic readings (Ramsay 2007; Hope & Witmore 2010), and close, critical and contextual readings, Translation Arrays can be powerful instruments for humanities researchers in diverse fields.  Multiply translated texts include the sacred scriptures of all religions, as well as ancient and modern literature and philosophy, political and historical texts, and so forth. Indeed, (re)translation corpora are coterminous with recorded cultural history. Beyond research applications, therefore, Translation Arrays can become valuable tools for presenting Digital Humanists’ work to wider audiences in beguiling, interactive ways, and encouraging creative interaction with cultural heritage, across global cultural and linguistic barriers. They will be welcome in worldwide classrooms – especially multilingual and cross-culturally networked classrooms. Game-like and creative engagement with cultural heritage material is a key feature of translation itself. This will be facilitated by Array interfaces, alongside more ‘serious’ modes of engagement. Artists and writers will find this type of resource irresistible. In short, Translation Arrays may become a signature Digital Humanities format, coupling screen-based exploration and interaction with truly global, multilingual and multicultural content – content which has (by definition) high international recognition value.  We will present at DH 2012 our work in progress towards building a prototype. We have an experimental corpus of over 50 different German translations of Shakespeare’s Othello, 1766-2006, plus samples from and metadata about hundreds of other translations of the play, in (so far) over 40 languages, crowd-sourced at www.delightedbeauty.org. This site demonstrates the existence of worldwide communities interested in engaging with this type of work. As well as documenting existing translations, some users are also creating their own, ad hoc translations. The site also carries outputs of our project so far, such as: a survey of text visualisation tools, and prototype corpus overview and comparison tools (Geng et al. 2011a, 2011b); discursive text sample analyses (Cheesman 2011, 2012); a Web Science presentation (Wilson et al. 2011); and a paper on using stylometrics to sort multiple translation segments by ‘distinctiveness’, thereby also enabling a source text to be read in a new way, through its translations’ variability (Cheesman et al. 2012).  By summer 2012 we aim to demonstrate a working Array prototype, with an interface designed by Stephan Thiel (see Thiel 2009 for related work). It will deploy Shakespeare’s Othello and c. 20 German translations, which each reflect cultural-historical and idiosyncratic differences, and which collectively re-interpret the original text in ways which, within the Array interface, can even excite the interest of users who know no German.  The technical and conceptual challenges are fascinating. What is a translation? What is a good or interesting translation? What makes some translations last? Why do people keep retranslating the same texts? Are they in fact ‘the same’ texts? What do terms in Translation Theory like ‘equivalence’, ‘adequacy’ or ‘appropriateness’ mean in practice? How can machine- and user-generated ‘back-translation’ best be deployed in an Array?  From a Critical Translation Studies perspective, our ‘source-text-centric’ approach is questionable. The most interesting translations for CTS are often scarcely source-focused (i.e. not very ‘faithful’, ‘literal’, ‘close’, even ‘equivalent’). Often, this means that they cannot easily be aligned with the source. Where diverse ‘translations’, ‘adaptations’, ‘versions’, and ‘rewritings’ shade into texts which are more loosely ‘inspired by’ or ‘answer back to’ source texts and previous reworkings of them, then our approach arguably reaches limits of vaildity. On the other hand, by juxtaposing multiple translations, and by reviving the cultural memory of obscure ones, a Translation Array creates a new and rich context in which radically ‘unfaithful’ ‘un-translations’, too, can be read and interpreted in new ways.  Funding   This work was supported in Feb-July 2011 by Swansea University, College of Arts and Humanities, Research Innovation Fund.  The work is currently (Feb-Sept 2012) supported by the UK’s Arts and Humanities Research Council, Digital Transformations Research Development Fund [AH/J012483/1]. The AHRC-funded team consists of: Principal Investigator, Dr Tom Cheesman (Swansea U); Co-Investigators, Dr Robert S. Laramee (Swansea U) and Dr Jonathan Hope (U Strathclyde); Research Assistant, Kevin Flanagan (Swansea U); Design Consultant, Stephan Thiel (FH Potsdam / Studio Nand, Berlin).   ", "article_title": "Translation Arrays: Exploring Cultural Heritage Texts Across Languages", "authors": [{"given": " Tom", "family": "Cheesman", "affiliation": [{"original_name": "Swansea University, UK", "normalized_name": "Swansea University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/053fq8t95", "GRID": "grid.4827.9"}}]}, {"given": " Stephan", "family": "Thiel", "affiliation": [{"original_name": "Fachhochschule Potsdam, Germany", "normalized_name": "Fachhochschule Potsdam", "country": "Germany", "identifiers": {"ror": "https://ror.org/012m9bp23", "GRID": "grid.461741.1"}}]}, {"given": " Kevin", "family": "Flanagan", "affiliation": [{"original_name": "Swansea University, UK", "normalized_name": "Swansea University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/053fq8t95", "GRID": "grid.4827.9"}}]}, {"given": " Geng", "family": "Zhao", "affiliation": [{"original_name": "Swansea University, UK", "normalized_name": "Swansea University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/053fq8t95", "GRID": "grid.4827.9"}}]}, {"given": " Alison", "family": "Ehrmann", "affiliation": [{"original_name": "Swansea University, UK", "normalized_name": "Swansea University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/053fq8t95", "GRID": "grid.4827.9"}}]}, {"given": " Robert S.", "family": "Laramee", "affiliation": [{"original_name": "Swansea University, UK", "normalized_name": "Swansea University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/053fq8t95", "GRID": "grid.4827.9"}}]}, {"given": " Jonathan", "family": "Hope", "affiliation": [{"original_name": "University of Strathclyde, UK", "normalized_name": "University of Strathclyde", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00n3w3b69", "GRID": "grid.11984.35"}}]}, {"given": " David M.", "family": "Berry", "affiliation": [{"original_name": "Swansea University, UK", "normalized_name": "Swansea University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/053fq8t95", "GRID": "grid.4827.9"}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}