{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In the work of the TEI Ontologies SIG there have been an interest in finding practical ways of combining TEI encoded documents with CIDOC-CRM models. One way of doing so is including CIDOC-CRM information in a TEI document and linking CIDOC-CRM elements to TEI elements where appropriate. In this paper, this method is described through an example, together with an outline of the additional elements necessary in the TEI DTD used. Background In projects at the Unit for Digital Documentation, University of Oslo, we have created SGML and later XML encoded versions of printed and hand-written museum documents, such as acquisition catalogues, for more than ten years (Holmen 1996). To be able to store such documents in a standard format, we are planning to use TEI. Much of our material are archaeological documents, and there have been a growing interest in the use of XML in general and TEI in specific in archaeological community the last few years (Falkingham 2005, sec. 3.3, cf. sec. 4.3 and 5.2.3). We also use CIDOC-CRM as a tool for modelling the contents of such tagged documents as they are read by museum professionals. We use this method to be able to include information from XML encoded documents in our museum inventory databases, with references back to the encoded documents (Holmen forthcoming). We would like to store CIDOC-CRM models in close relation to the TEI encoded document. This paper describes an example of how we try to define a syntax in which to store such datasets. Extension of a TEI DTD There are two different ways in which to extend a TEI DTD for inclusion of CIDOC-CRM models. We may include an element for each and every entity and property used in the model, or we may just include one TEI element for CIDOC-CRM entities and one for properties. We have chosen the latter method. This gives a limited and rather simple expansion of the DTD. This is similar to the way the XML version of the bibliographic standard MARC is designed (MARCXML). This method will make it possible to create one document storing both textual markup and semantic interpretations of a text, while keeping the two parts of the document separate, except for links between specific elements in the two parts. This means that the document can be published as a text as well as form the base of an import to a database of records based on the interpretation, keeping the links back to the original text. In this paper, we use a DTD fragment to show an outline of the extensions we need. The extensions is composed of a root crm element including a number of crmEntity elements and a number of crmProperty elements. Example of use A typical situation in which this approach could be used is in archaeological documents. We have created a short dummy document containing some of the informations types commonly existing in our museum documents, as shown in Example 1. The excavation in Wasteland in 2005 was performed by Dr. Diggey. He had the misfortune of breaking the beautiful sword in 30 pieces. There are many objects and relations of interest when modelling the archaeological world described in this text. A typical museum curator reading could include the elements shown in Table 1. 1. A place identified by a name documented in n1. 2. A person identified by a name documented by n2. 3. A time identified by a date documented in d1. 4. An event (the excavation) documented in e1. 5. An event (the breaking) documented in e2. 6. An object (sword) documented in o1. 7. Dr. Diggey participated in the excavation 8. Dr. Diggey and the sword participated in the breaking 9. The excavation took place at the place identified by a name documented in n1 and at a time identified by a date documented in d1. Table 1 A possible CIDOC-CRM representation of one of the entities in Table 1, the excavation in line 4, is shown in Example 3. Included are also references to lines 2, 3, 7 and 9. Note that Example 3 is only showing part of a model that would represent a normal archaeological reading of the paragraph above. E.g., the date should have a “is documented in” property such as the ones for the activity and the person, and the place (Wasteland) should be documented in a way similar to the person Dr. Diggey. 1) archaeological excavation 2) Dr. Diggey 3) the element identified by the id “n2” in the text of Example 2 above 4) 2005 5) the element identified by the id “e1” in the text of Example 2 above Example 3 Example 4 shows this using the TEI-CRM syntax outlined in the DTD addition above. The crm element holds the small CIDOC-CRM model we have expressed in a TEI syntax, while the link element holds connections between the CIDOC-CRM model and the TEI text from Example 2. In this example we see that although all the CIDOC-CRM information may be expressed in such a syntax, an XML validation of the document will only validate a part of the information. It will not check whether the model adheres to the rules for e.g. which CIDOC-CRM properties may be used in connection to which entities. Conclusion and further research While different uses of ontological models in connection to TEI documents will differ in their technical solutions, e.g. whether the ontological model rests in a separate document or not, and which syntax is chosen for the model, the three main elements shown here have to be present: • a TEI document • an ontological model expressed in some XML syntax • link elements to connect the specific elements from the two together We have described a way of expanding TEI that gives us the tools we need to include a CIDOC-CRM model in a TEI document, and connect specific CIDOC-CRM entities to specific TEI elements in the non-CRM part of the document. We would like to see research into similar methods of connecting informations in other ontological systems to TEI documents, to discover whether a similar method is feasible. It would also be interesting to see if it is possible to make a general addition to TEI for this use, or if each ontological system needs its own tag set. In our own research, we will write out an ODD to test this method on samples of our own data, and then continue to implement this model on real data, so that the usability of this method for complete documents and CIDOC-CRM models can be examined.", "article_title": "TEI, CIDOC - CRM and a Possible Interface between the Two", "authors": [{"given": "Øyvind ", "family": "EIDE", "affiliation": [{"original_name": "Unit for Digital Documentation at the Faculty of Arts, University of Oslo", "normalized_name": "University of Oslo", "country": "Norway", "identifiers": {"ror": "https://ror.org/01xtthb56", "GRID": "grid.5510.1"}}]}, {"given": "Christian-Emil ", "family": "ORE", "affiliation": [{"original_name": "Unit for Digital Documentation at the Faculty of Arts, University of Oslo", "normalized_name": "University of Oslo", "country": "Norway", "identifiers": {"ror": "https://ror.org/01xtthb56", "GRID": "grid.5510.1"}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}