{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Introduction Information about place is an essential part of the study of the humanities. People live, events occur, and artefacts are produced by human hand at specific geographical locations and much of what people do is spatially determined or leaves spatial signatures. In order to gain insight into human activity, past and present, the influences of geography must be taken into account. Digital scholarship makes powerful new methodologies freely available at relatively low cost. However, the new research opportunities offered by spatial and spatial-temporal data remain relatively unexplored. This paper examines the reasons for this and discusses possible ways forward for the community. GIS methodology is much more than digital cartography, it gives the researcher the ability to analyse and display data in a variety of maps, networks or hierarchy trees. The need to represent and model time is leading humanities scholars to experiment with the emerging methodologies of dynamic mapping, an approach that was impossible before the advent of digital scholarship. There are many ways that methods and tools for structuring, visualising and analysing space, spatial behaviour and spatial change can benefit humanities research. It is over fifteen years since GIS software with reasonable functionality became available in a PC environment at a relatively low cost. Despite this the use of geographical information in digital scholarship by humanists has been poor. This paper will explore some of this potential but, possibly more importantly, it will also examine why that potential continues to be ignored by many. The author believes there are many reasons, some reflect weaknesses in the methodology and current technologies but possibly the most significant concern our scholarly institutions. The Developing Role of Geographic information Systems in Humanities research The use of geographical information in digital humanities research has passed through a sequence of phases of development. Initially the technology was used to replicate pre-existing methodologies and styles of work as in projects such as the Atlas of Mortality in Victorian Britain (Woods and Shelton, 1997). This printed publication used largely standard graphs and cartographic representations to produce an atlas of patterns of health and death in Victorian England and Wales. Later the new methodologies made available by GIS methodology were applied to a variety of new areas for example, the use of 3D digital elevation models to explore the effect that terrain, specifically the gradient required for railway lines, influenced the development of railways in Victorian Britain. Other examples include the dynamic maps used in the Valley of the Shadow and Salem Witch Trial projects. The boundaries of the more rigorously quantitative methods are also being pushed back as the use of 3D and 4D work is explored. So far the majority of the humanities research performed with GIS has been largely quantitative in nature, but recently there has been increased interest in the use of geographical information for more qualitative work. A number of examples of this style of work can be seen in the Perseus Digital Library, for example the Edwin C Bolles Collection and Boyle Papers. These projects make use of traditional map materials and geographical information in a variety of ways. The Perseus project itself links a number of different digital libraries using geographical information as an integration tool. This work covers a broad range of activities which links texts, images and numerical data to the places they describe on interactive maps to produce an immersive learning environments. Geographical information also has immense potential both for research and the delivery of information. It provides an unambiguous method for indexing and searching of information. Recent work on map based front-ends to text and image collections has resulted in source discovery tools that are more intuitive and less culturally specific than traditional textual indexing. Factors Inhibiting the use of Geographical Information in the Digital Humanities It is clear that geographical information has immense potential both for research and the delivery of information. It provides an unambiguous method for indexing and searching of information offering the ability to build source discovery tools that are more intuitive and less culturally specific that traditional textual indexing. Despite this it has had little effect in the digital humanities. There area number of limiting factors which need to be addressed Existing Methodologies: Current GIS methodology is rooted deeply in the origins of the software in the earth sciences. The traditions of rich data sources led to the development of software that is ill-equipped to cope with the sparse and fuzzy data of humanities scholarship. We need to consider how to represent the complexities of the subjects of humanities research visually. What does it mean to think spatially and how do we represent the complex phenomena at work in the humanities visually? Current GIS software has very limited facilities for the handling of time and even these are based on the scientist’s view of time as being derived from the phenomenon under study. Humanists require a view of time that is determinative and that can work at different rates and scales moving backwards as well as forwards on a continuous scale. Humanities Data: Methodologies must be found for tackling issues such sparseness, fuzziness and ambiguity but there are many other broader issues concerning data. The number of digital datasets is growing rapidly and these are often of interest to researchers in fields other than the often highly specialised one that the data was originally derived for but how does one locate them? There is a need for a central archive and a metadata schema that would allow these resources to be discovered. Archivists could provide a community hub for encouraging and implementing the use of spatial content into their retrieval models thus providing a further means of linking different items of evidence. Research Practice: Ambitious work with GIS requires a high level of expertise and has a high threshold of usability. The most effective way of facilitating this style of work is through collaboration with researchers and practitioners having backgrounds in fields such as geography, history, information science, computer science, graphic design, and so on. This marks a move away from scholars working independently to a model that necessitates team working which in turn raises further problems. The teams required for this style of collaborative work will be composed of people with very different backgrounds and credentials. There is a strong need to transmit research traditions between disciplines which may have very different agendas and ways of working. There also many issues concerning how the contributions of each member of the team can be acknowledged. For example, for those whose technical work requires considerable expert knowledge far beyond ‘technical support’ but is fundamentally different from the traditional academic content of the journals and review boards where the published works will be assessed in research assessment exercises such those in the UK. It also raises the issue of how best to prepare students for work in an interdisciplinary team after graduation. Scholarly Institutions: This innovative style of work is often seen as ‘dangerous’ and can be seen as posing a career risk for new academics working in environments where successful research assessment is critical. There are limited opportunities for publishing the work and because there are relatively few people with relevant experience at the top of the profession there can be problems with peer review. An additional problem is that projects requiring GIS are often very large and require sustained funding. They also frequently produce resources that will need to be maintained after the completion of the original project. These two funding requirements can pose problems in current research and funding environments. Scholarly Perception of Geographical Information Science and visualisation: In order to encourage the greater use of geographical information we need a clear statement of the advantages of GIS, and spatial information generally, expressed in terms of research outcomes. This should be supported by a set of exemplar projects and be made available through a ‘one stop’ source of information. Such a resource could also encourage creative thinking about geographical information and how it can be used in original ways. The fact that humanists are used to working primarily with textual sources may be an inhibiting factor. Many claims are made for the value of GIS as a visualisation tool but it may be that some training is needed in thinking visually and, importantly, the interpretation of the results of visualisation. There could also be more fundamental issues concerning the status and function of images, especially those used for visualization, in humanities scholarship. A similar situation exists with spatial thinking too. Conclusions Although we are used to the idea of GIS as a positivist tool its big contribution to the humanities may be as a reflexive one. It can be used to integrate multiple perspectives of the past allowing them to be visualised at various scales. Ultimately it could create a dynamic representation of time and place within culture. This abstract has introduced some of the many factors that are currently limiting the use of geographical information in humanities teaching and research, the final paper will discuss these in more detail and suggest some immediate solutions. The greater use of geographical information could allow us to experience a view of the past that is highly experiential, providing a fusion of qualitative and quantitative information that could be accessed by both naive and knowledgeable alike.", "article_title": "The Inhibition of Geographical Information in Digital Humanities Scholarship", "authors": [{"given": "Martyn ", "family": "JESSOP", "affiliation": [{"original_name": "Centre for Computing in the Humanities     King’s College London, Strand     London WC2R 2LS", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}