{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In 1996, the Visible Language journal published, according to Eduardo Kac, “the first international anthology to document a radically new poetry, one that is impoosible to present directly in books and that challenges even the innovations of recent and contemporary experimental poetics” (98). The enthusiasm for the “radical newness” of new media poetry with which Kac introduces the anthology has been realized in part over the last ten years by a veritable explosion of new media poetry available online and in CD/DVD-ROM format. The interest of new media poets in semantic experimentation as well as with investigations of materiality have lead most critics to locate the roots of this genre in the tradition of the many avant-garde movements and experimental poetries of the twentieth-century, including surrealism, cubism, Dadism, forms of visual poetry, the L=A=N=G=U=A=G=E movement and futurism, just to new a few. Not surprisingly, this critical approach has tended to favor artists and those works, like Kac’s “Insect.Desperto” and Melo e Castro’s “The Cryptic Eye,” that most noticeably demonstrate certain tendancies of the avant-garde such as multi or non-linearity, non-narrative or non-grammatical strings of words, and the priveleging, to use Roberto Simanowski’s term of the “optic gesture” of the word over its “semantic meaning” (7). By contrast, works that fall under the purview of new media poetry by nature of their digital rendering and their use of multi-media software, but that, nonetheless, bear resemblances to more traditional twentieth-century poetries are often dismissed from consideration. This presentation will begin by exploring this critical resistance to digital work that bears resemblance to traditional print-based poetry; a resistance, I will argue, that belies the great number of new media poems that incorporate formal techniques and conventions characteristic of non-experimental poetry--in particular, techniques and conventions typical of the free verse lyric style that characterized much of the poetry of the twentieth century. By glancing at any of the online databases for new media poetry, we can see poets utilizing conventions such as iambic meter, stanzaic organization, alliteration, white space, and enjambment, among others, to organize and present the poetic line to the reader. For example, in Farah Marklevit’s “How They Sleep” the author uses a combination of end-stopped and enjamed lines to juxtapose what can be said to be the internal movement of the verse with the scrolling motion of the text on screen. The stop/start motion of the poem underscores the story being told--a romantic struggle between a husband and wife whose heads are “tuned to different pitches / like glasses of water.” As we can see in this example, the use of the rolling text serves not as an alternative to enjambment and punctuation, but rather as a vehicle by which these formal techniques are more fully realized by their incorporation into the multimedia presentation. The above is just one example of how attention to traditional formal poetic conventions can enhance our understanding of the aesthetic strategies of new media work; there are many others. It will be the contention of this presentation that, contrary to what most of the existing scholarship on new media poetry would suggest, the influence of traditional poetic forms and techniques is pervasive in the genre of electronic literature. Rather than rendering these formal strategies obsolete, moreover, the electronic environment offers poets the opportunity to render these strategies in ways that cannot be replicated on the printed page. In addition, I will attempt to show how situating new media poetry solely within the heritage of experimental poetry movements can not fully account for the aesthetic qualities of a great number of works. Rather than attempt an inclusive survey of these works, my presentation will focus specifically on the web-based work of Thomas Swiss, a poet who began, and continues, to write in print format and has recently forayed into the genre of new media poetry. I will focus on those poems that both explore the ramifications of new writing technologies as well as lay bare their debt to more traditional print-based poetry. It will be my argument that it is precisely by utilizing formal conventions typical of the free verse lyric and by preserving the visual style of the printed poem that Swiss interrogates the ways in which our pre-established patterns of reading are affected by the migration of the poem from page to screen.", "article_title": "The Ghost of the Printed Page: New Media Poetry and Its Ancestry", "authors": [{"given": "Jennifer ", "family": "ROWE", "affiliation": [{"original_name": "University Of Maryland,     Department of English", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}