{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper will focus on the use of technologies traditionally associated with knowledge management and ontological representation to express complex associations between entities in historical texts that have been marked up in XML according to the Text Encoding Initiative guidelines. In particular, we will describe our exploration of the potential use of RDF (Resource Description Framework)/OWL (Web Ontology Language) technologies and will reflect on the role of an ontology in facilitating the interpretation of implicit and hidden associations in the sources, examining its use and limits in a digital humanities project in connection with editing tools and delivery issues. We will demonstrate our findings based on the Henry III Fine Rolls project, where an RDF ontology is being developed to make explicit information about person, place and subject entities marked up as “instances” in the core texts themselves.The Henry III Fine Rolls project and the need for authority listsThe Henry III Fine Rolls is a three-year collaborative project between King's College London and the National Archives (UK) that aims to represent the complexity of a historical object known as the 'fine rolls' which chart offers of money made to King Henry III of England in exchange for a wide range of concessions and favours. A total of 64 rolls containing around 800 parchment membranes, one for almost all of the fifty-six years of Henry III’s reign from 1216-72, survive in the UK National Archives. Each fine roll was compiled in Latin by a handful of scribes and taken as a body of documentary evidence, the rolls are of “prime importance in the study of political, social, and economic history and of government and administration at a local and national level.”Dryburgh, Paul. “Henry III Fine Rolls Project” (paper presented at the Institute of Historical Research, London , February, 9, 2006).The project will cover the first thirty-two years of Henry III’s reign down to 1248 and will result in both print and digital editions of the rolls, using as a model the format of the traditional printed 'calendar' (an English summary of records, plus a set of indices) in connection with the digitised images of the rolls themselves. The digital edition will have a sophisticated search interface and both print and digital editions will provide a series of indices for people, places and subjects that include complex associations between the various entries.The core texts were encoded in XML using the TEI guidelines and include mark-up related to some aspects of the physical structure of the rolls as material artefacts.For a more detailed presentation of the mark-up model see Ciula, Arianna. “Searching the Fine Rolls: A Demonstration of the Electronic Version” (paper presented at the International Medieval Congress, University of Leeds, July 10-13, 2006). Particular attention has been given in the mark-up to the occurrences of names of persons, places and institutions. Furthermore, the project researchers have identified and marked-up relevant subjects in the fine rolls. Therefore, while the general mark-up in TEI XML provides a framework for theoretical analysis and practical encoding of the text of the calendar as it is being edited and summarised in English, the need for additional modelling has emerged so as to: associate textual instances of the same person, subject occurrence or place to their correspondent logical authority —whether that be a person (identified or anonymous), a subject class or a place;express the mutual relationships between the relevant authorities (e.g. individuals, locations, institutions and subjects).Why RDF/OWL?In previous work on projects requiring an expression of the associations between sources in core texts marked up using TEI XML we have taken more traditional approaches using XML structures or relational databases to solve the problem, but have increasingly found these wanting. There has been some research in the TEI community in this area lately, particularly around 'biographical and prosopographical data' See “Biographical and Prosopographical Data”. In Sperberg-McQueen, C. M., and Burnard, Lou, eds. TEI P5 Guidelines for Electronic Text Encoding and Interchange.  (accessed 15 November 2006)., but at the time of writing this was not mature enough for us to make a commitment to using it and in any case our attention was drawn to other standards whose main objectives are closer to what we are trying to achieve.After conducting a comparative evaluation of possible standards to create authority lists structures that included research into RDF/OWL, Topic Maps and MADS (Metadata Authority Description Schema), we opted for RDF/OWL.The main reasons for this choice were the following:OWL is a language developed on top of RDF by W3C to write ontologies. For W3C RDF specifications on RDF see . For an overview and further resources on OWL see RDF/OWL models provide a logical organisation of data together with the possibility of a flexible manipulation of meanings (e.g. rich expression of relationships among objects/entities mentioned in the source text, where an object/entity might be a person, a place or a subject);RDF/OWL decreases ambiguity by identifying unique entities independently from their instances in a decentralised way.While the more practical advantages are that: as a set of standards which are at the heart of the Semantic Web, RDF/OWL is internationally recognised and supported - its models could facilitate the interconnection between humanities computing projects in general and between directly related data in particular;there is a relatively good selection of tools for RDF/OWL compared to the other technologies that we have explored;RDF/OWL can be expressed in XML format, thus allowing the re-purposing of data for web delivery (e.g. creation of indices through the use of XSLT).Ontology: Structure, Tool and DeliveryThe RDF schema and OWL are used to define the knowledge domain around the core materials on the project (the fine rolls) using classes and predicates. Already existing predicates are used as extensively as possible (e.g. CIDOC-CRM, Dublin Core, Friend of a Friend, Simple Knowledge Organization System).The connection between the TEI source files and the ontology play an important role in our model. For a similar approach see Eide, Øyvind and Ore, Christen-Emil. “TEI, CIDOC-CRM and a Possible Interface between the Two” (paper presented at Digital Humanities 2006, Université Paris-Sorbonne, July 5-9, 2006) . Indeed the XML files not only feed the ontology with some data (e.g. variants of a certain person name), but they are themselves part of the ontological model. The fact that they exhibit names and assert facts related to those names can be modelled in the ontology together with the statement that a person name (proper name or in general reference string) is associated to a specific person as an instance of the entity person (e.g. that has a gender, a possible status etc.). Quoting Eide,Eide, Øyvind. “The Exhibition Problem. A Real Life Example with a Suggested Solution” (paper presented at Digital Humanities 2006, Université Paris-Sorbonne, July 5-9, 2006) . we include “explicit statements of the sources of the assertions exhibited in the text”: paper_196_ciula_1.jpgpaper_196_ciula_2.jpgThe concrete connection between the XML files and the ontology is maintained through the use of identifiers, as in the example below:<persName key=\"arsic_robert\"> Robert Arsic </persName> → <frh3:Man rdf:ID=\"arsic_robert\"> … </frh3:Man>Evidently, the value and granularity of the ontology depends on various factors, which include the richness of the source files themselves (e.g. how well do the fine rolls express the reality of the roles/occupations in the thirteenth century?), the specific interests of the researchers (e.g. in the types of fines rather than in the amount of money they keep record of) and the definability of the knowledge domain itself (as shown in the contrast between the identification of individuals and the much more blurred identification of subjects).In addition to expressing complex associations in an abstract intellectual sense, it was also crucial to the project to create a system endowed with sophisticated facilities for editing and final publication. We will describe our experience in creating such tools, in particular taking into account such project requirements as: the facilities for managing/editing data: the addition of new information, new classes/predicates/literal values; the definition of relationships between entries, the possibility to merge instances of classes or subclasses (e.g. while editing we may realise that person A and B are actually the same);the connection and synchronisation between the ontology structure and data on the one hand, and the TEI source files on the other (e.g. links from classes in authority list to actual references to those classes as exhibited in the mark-up);the facility to browse information alphabetically or categorised in some way (e.g. by date, county, role, kind of relation) and to search for particular associations as expressed in the ontology (e.g. all the locations connected to the person called 'Robert Arsic' or all the relatives of Robert Arsic).ConclusionsIn the case of the fine rolls (as is true of many projects involving complex primary sources) it is not enough to mark-up an occurrence of a person name if you wish to create complex indices or to create structured search functions.Moreover, an authority-based approach is essential in order to make the resource interoperable; external authority lists are needed to record information in a systematic, comprehensive and possibly standardised way, so as to: store additional information related to persons, places and subject (exhibited and marked up as corresponding instances in the TEI XML files);make explicit the multiple connections between places, persons and subjects;merge or disambiguate identifications and eventually correct the original mark-up of the rolls.Our paper will describe how, for the Henry III Fine Rolls project, an RDF/OWL ontology was used to model complex associations and how this has assisted the project researchers in the interpretation of the material they are editing and facilitated the production of a digital resource that will allow future users to browse the material under different perspectives, to explore the relationships among mentioned individuals, locations and subjects, and to foster new understandings.", "article_title": "Expressing Complex Associations in Medieval Historical Documents: The Henry III Fine Rolls Project", "authors": [{"given": "Arianna ", "family": "Ciuala", "affiliation": [{"original_name": "Centre for Humanities ComputingKing's College London", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Paul ", "family": "Spence", "affiliation": [{"original_name": "Centre for Humanities ComputingKing's College London", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "José Miguel ", "family": "Vieira", "affiliation": [{"original_name": "Centre for Humanities ComputingKing's College London", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Gautier ", "family": "Poupeau", "affiliation": [{"original_name": "École Nationale des ChartesUniversité Paris-Sorbonne", "normalized_name": "École Nationale des Chartes", "country": "France", "identifiers": {"ror": "https://ror.org/013xvg556", "GRID": "grid.462175.3"}}]}], "publisher": null, "date": "2007", "keywords": ["authorities", "text encoding", "historical texts", "ontological representation"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}