{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Consortium, is an online and annotated digital reconstruction in Unity 3D of a seminal battle of the Irish Easter Rising of 1916. A goal of the project was to leverage phenomenologies of time and space as afforded by virtual world technologies to provide new insights and help to answer what had heretofore been intractable questions about how the battle unfolded. The battle, as well as the 3D reconstruction, received a great deal of attention during the Centenary of the Easter Rising, including the specially commissioned radio documentary (Documentary on One, RTE Radio 1) Battle at the Bridge. Building on the interest in and success of this project , the project team was encouraged to further develop the project so that it could be used in secondary schools. Due to the exigencies of technology in Irish classrooms, including limitations on booking lab time with many computers too old to run the VR software, it was decided that a different approach would be taken. Hence the BMSB Augmented Reality mobile app was developed (figure 1), to educate students about the facts of the battle, while providing a deeper and more holistic understanding of war and its effects. At the same time, it provided the project team with the opportunity to leverage digital humanities research within a participatory engagement setting to reach out to second level students and teachers to provide them with opportunities of engaging with cutting edge technologies integrated into a student-led learning environment. This project shares a philosophic approach with other maker projects in the Digital Humanities, as Say-ers et al. (2016), quoting Neil Gershenfield, describe in A New Companion to Digital Humanities as \"the pro-grammability of the digital worlds we've invented\" applied \"to the physical world we inhabit\" in which objects \"move easily, back and forth, in the space between bits and atoms.'' Thus Augmented Reality (AR), a technology that superimposes digital content, including images, animations, and annotations, over the real world, was decided on as the key technology to translate our research into a classroom setting. Previous research on the affordances of AR for teaching and learning have highlighted that interactivity, collaboration , problem-solving, and narratives mediated through technology can aid both engagement and understanding (Dunleavy et al., 2009). Several AR applications have been developed for primary and secondary education for fact-based topics, such as geometry, astronomy, chemistry, and the human body (see for example Chromville Science; Anatomy 4D; Elements 4D. However, AR applications for humanities subjects are limited. To the authors' knowledge there is no history based AR application that is designed for use in the classroom, although there are several mobile-based student-centred AR for outdoor historic sites (see for example: Schrier, 2005 for the Battle of Lex-ington and Singh et al., 2014 for the Christiansburg Institute).", "article_title": "Phygital Augmentations for Enhancing History Teaching and Learning at School", "authors": [{"given": "Susan", "family": "Schreibman", "affiliation": [{"original_name": "Maynooth University", "normalized_name": "National University of Ireland, Maynooth", "country": "Ireland", "identifiers": {"ror": "https://ror.org/048nfjm95", "GRID": "grid.95004.38"}}]}, {"given": "Brian", "family": "Hughes", "affiliation": [{"original_name": "Maynooth University", "normalized_name": "National University of Ireland, Maynooth", "country": "Ireland", "identifiers": {"ror": "https://ror.org/048nfjm95", "GRID": "grid.95004.38"}}]}, {"given": "Neale", "family": "Rooney", "affiliation": [{"original_name": "Maynooth University", "normalized_name": "National University of Ireland, Maynooth", "country": "Ireland", "identifiers": {"ror": "https://ror.org/048nfjm95", "GRID": "grid.95004.38"}}]}, {"given": "Colin", "family": "Brennan", "affiliation": [{"original_name": "Maynooth University", "normalized_name": "National University of Ireland, Maynooth", "country": "Ireland", "identifiers": {"ror": "https://ror.org/048nfjm95", "GRID": "grid.95004.38"}}]}, {"given": "Maynooth", "family": "University", "affiliation": [{"original_name": "Maynooth University", "normalized_name": "National University of Ireland, Maynooth", "country": "Ireland", "identifiers": {"ror": "https://ror.org/048nfjm95", "GRID": "grid.95004.38"}}]}, {"given": "Ireland", "family": "Fionntan", "affiliation": [{"original_name": "Maynooth University", "normalized_name": "National University of Ireland, Maynooth", "country": "Ireland", "identifiers": {"ror": "https://ror.org/048nfjm95", "GRID": "grid.95004.38"}}]}, {"given": "Mac", "family": "Caba", "affiliation": [{"original_name": "Maynooth University", "normalized_name": "National University of Ireland, Maynooth", "country": "Ireland", "identifiers": {"ror": "https://ror.org/048nfjm95", "GRID": "grid.95004.38"}}]}, {"given": "Hannah", "family": "Healy", "affiliation": [{"original_name": "ie Maynooth University", "normalized_name": "National University of Ireland, Maynooth", "country": "Ireland", "identifiers": {"ror": "https://ror.org/048nfjm95", "GRID": "grid.95004.38"}}]}], "publisher": null, "date": "2017", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}