{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " The first decade of the ambitious Google Books project has produced a great deal of controversy as well as a valuable resource. The project has been consistently challenged by authors’ and publishers’ groups mounting legal action. The rhetoric that Google uses to justify the project frequently concerns fair use, access, marginal voices, a so-called global library, and the role of access to information in supporting a strong democracy.  In the process of digitization, the books are transformed considerably. The act of reading texts on Google Books is complicated by the many figures crowding the text and the act itself. In addition to the author/s of the work in question, there may be, scattered throughout the text, traces of a person who has gifted the book, of the borrowers whose trace is marked by library loan stamps, and there are the multiple readers who have left physical marks of their reading upon the page. This marginalia can be found in the form of underlines in the text and marks in the margins—from simple ‘X’s, to detailed comments of varying degrees of legibility, to questions asked of the text and doodles drawn on the page. Also present in the text, on occasion, and complicating reception, is the ghostly figure of the book scanner whose labour is made visible by spectral fingers caught in the scan and numerous other kinds of scanning errors that, given the haste of the project, make it through quality control and into the online space.    But the Google Books reader does not leave a trace. I, reading the text on the screen, make no marks upon the text to leave for others. Although my digital trace may be recorded in the IP number, I cannot leave a trace of my reading for the next reader to examine or build upon. I may transcribe the text. I may now download (selected) books to read on a plethora of devices. I may use the clip tool to take or even share a passage with my social network. But I cannot alter the book as it appears in the archive. While I can annotate—publically or privately—a Kindle book, leaving traces in the form of underlines signifying highlights and notes, I cannot annotate a Google book. The object is frozen for all time in its scanned state (or states, since frequently scans exist from a number of different editions or copies of a book).  The presence of the reader on the page of the printed book has been a marginal concern for the field of book history for scholars from manuscript culture and before to the recent obsession with David Foster Wallace’s cacophonous presence on the pages of his library, now acquired by the Harry Ransom Centre at the University of Texas. Marginalia tell us something about the reader’s response to the work, and it tends to be the marginal notes of literary giants that receives attention from scholars (Nabokov, Kerouac, Wilde). The presence of life narrative voices in the archive, and the material conditions they reflect, has significant ramifications for how we see the texts. How then do we approach the case of a published family history that has been housed for over a century in a public library and in that time has been heavily annotated with additions, comments, responses, notes, and interjections? To pursue this train of thought, I want to use as a case study a life narrative texts in the Google Books archive.  Memoir of the Farrar Family was published in 1847 by Timothy Farrar (1788–1874). The book exists in multiple online formats. It is available as full text from Archive.org as well as from Google Books. It is available for purchase on Amazon, with a caveat that the work comes from a scan and may have marks and imperfections. The book is referred to on many genealogical websites, which tells us something about the sort of text that it is. The inside cover says, ‘A Discourse occasioned by the centennial anniversary of Hon. Timothy Farrar, LL. Delivered at Hollis, N.H. July 11 1847 by Timothy Farrar Clary. Printed by Request. Andover: Printed by William H. Wardwell. 1847’.  Google’s bibliographic information for the book tells us that it was originally digitized on 18 September 2007 from a text located at the University of Wisconsin–Madison. What makes this case so curious is that the book as it exists in the Google Books archive is riddled with the markings of a later reader. The handwriting is persistent throughout the pages of the short work, and the marginalia take the form not of active reading, of someone underlining the work as they go, but of a reader supplementing and correcting the text’s facts. This paper considers the implications of Google Books on the life writing it digitizes and on the notion of the library/archive and the interplay of voices in the digitization not only of a polished and published family history but also of the voices added to the text in less formal ways. The paper uses frameworks from the history of the book discourse, marginalia studies, and new media studies to consider the residual marks of other readers in ephemera and marginalia on the page and uses as case studies two works of life writing from the 19th century to examine the implications of autobiographical voices unbound by Google Books and the intellectual labour/vandalism represented by the works’ many readers. I apply Alexander Galloway’s view of the interface as ‘a generative friction between different formats’ (2012, 31) and look to media archaeology and Lisa Gitelman’s work on the history of documents for a means of understanding the layers at work in reading an annotated digitized work of life writing, a genre in which the traces of readers and digitization procedures are more keenly felt.     ", "article_title": "Traces of Lives in Digital Archives: Life Writing, Marginalia and Google Books", "authors": [{"given": "Tully", "family": "Barnett", "affiliation": [{"original_name": "Flinders University, Australia", "normalized_name": "Flinders University", "country": "Australia", "identifiers": {"ror": "https://ror.org/01kpzv902", "GRID": "grid.1014.4"}}]}], "publisher": "Paul Arthur, University of Western Sidney", "date": "2015", "keywords": ["repositories", "literary studies", "digitisation - theory and practice", "archives", "sustainability and preservation", "English"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}