{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "We, at the Wired Humanities Project at the University of Oregon, are creating a model Distance Research Environment (DRE) for fostering international collaboration in manuscript studies. We are developing the DRE for initial use on a group of Mesoamerican pictorial manuscripts (or mapas ) and then, later, will test the model's broader applicability on a group of medieval European manuscripts. It is our intention to take online manuscript analysis well beyond what is currently available. Mesoamerican pictorial manuscripts capture the as yet incomplete story of the ramifications of the Spanish conquest and colonization of the Americas. They also illustrate internal cultural evolution both prior to European contact and after. It is only relatively recently that scholars have directed some of their energy into the study of the native languages that were employed in the original composition of many Mesoamerican manuscripts. The decipherment of their pictorial elements has also made significant gains particularly in the last few decades. Part of what has held up the advancement of this field of scholarship is the fact that it has been costly for scholars to travel to distant archives and spend extended periods consulting them. The distance research environment will provide a net that integrates both dispersed documents and dispersed scholars, facilitating communication and exchange from multiple locations. Through digitization we will make the initial group of targeted manuscripts more accessible on a \"Mapas Project\" web site. Through the site, we will provide full views and details, enhancing the whole and its parts with \"digital wash,\" magnification, and rotation to provide for the clearest possible online reading, using Flash or Shockwave. We will build \"hot spots\" over all graphic elements, glosses, and text sections, offering windows for the various scholars to submit transcriptions, translations, and commentaries in association with the most minute portions. To facilitate the paleography, we will have the facsimiles of the texts side by side with the transcription windows. To facilitate translation, we will have the transcription windows side by side with the translation windows. To aid with the analysis of images, facsimiles of all pictorial details and groups of related images will be offered next to windows for the submission of comments. We will archive these submissions in a database that is searchable on line by the other collaborating scholars and that allows for further, asynchronic commentaries. Scholars, for instance, will be able to pull up an image or cluster of images and see all associated analysis and discussion. They will be able to do the same with text, viewing all contributions surrounding, for example, a particularly difficult passage of text and the various transcriptions it has spawned or the potentially conflicting translations. We will also periodically synthesize and publish to the Mapas Project web site the more notable scholarly dialogues that emerge. We believe that the collaboration of multiple scholars around the globe will produce high-quality interpretations, the exchange will benefit the understanding and knowledge of the participating scholars, and the process will inform anyone in the humanities computing community interested in replicating this research environment. Managing multiple languages is one of the primary challenges of the DRE. The Mesoamerican manuscripts that we have selected contain texts in Spanish, Nahuatl, and Zapotec. The scholars we have chosen to work with these manuscripts are native speakers of English, Dutch, Spanish, and Nahuatl. It is our primary aim to have transcriptions for all the original texts, with translations, where necessary, into both English and Spanish. The database, however, will record comments made in additional languages, and users accessing the database will be able to request all languages or only selected ones. Users will also have the option of having search results displayed in various formats, choosing, for example, to have the original Nahuatl version next to the Spanish translation. Another one of the challenges we face in the construction of our database will be to clear some of the roadblocks we have encountered when trying to pursue advanced philology. Searching to find the use of specific terms in their original context in Nahuatl and colonial Spanish, for instance, can be complicated by the inconsistent use of diacritics. Sometimes accent marks, glottal stops, and vowel length indicators appear, and sometimes they do not. We will experiment with having multiple versions of such texts, one with all the diacritics as they appear in the original manuscript, and one that has been simplified. We will also develop guidelines for our users, suggesting various approaches they might try when searching. Unstable orthography is another potential pitfall. For example, where one might hope to find the Nahuatl term for woman, \"cihuatl,\" in a text, one might have to try \"cihvatl,\" \"ciuatl,\" \"cihuat,\" and so on. We will experiment with hypothetical searches to try to anticipate these obstacles and help our users avoid them. Our inclusion of a Nahua scholar on our team is symbolic of our hope to encourage the integration of indigenous people with native-language ability into the regular interpretation of manuscripts that once did -- or still do -- reside in their community archives. The diaspora of indigenous peoples' material culture, whether museum objects or archival manuscripts, is an issue that touches on the United Nations' concern for Indigenous Peoples' Intellectual and Cultural Property Rights, as does the presentation of such materials before a global audience by way of the Internet. We believe that indigenous people should not only participate in the study of the manuscripts in question, but should also enter into decisions about materials that might be deemed too sensitive to make public. We therefore have an advisory board that is both culturally and linguistically diverse. We are also very concerned to obtain the input of professional librarians with expertise in metadata. We will build into our databases searching vocabularies that are recognized globally and will make retrieval of discrete elements of larger documents feasible. We have recruited several librarians at our home institution to work with us on this development. The Mapas DRE will create a sustainable online, collaborative venue for scholars, involving a broad spectrum of institutions, individuals, and perspectives, free from geographical or temporal limitations, for the distribution of high-quality digital versions of historical material. Once this has been accomplished (and we anticipate it will take two years to study the six initial manuscripts), we will test the tools and standards of the DRE for its wider usability by applying it to a group of medieval European manuscripts. For the ACH/ALLC conference, we would like to demonstrate how we envision the Distance Research Environment will function, explore some of the complexities associated with the multi-lingual dimensions of the data, and solicit comments and suggestions from the audience on all of these elements. By June 2004, we anticipate having some of DRE features already functioning. But it will also be early enough in our two-year plan that we would greatly benefit from the input of our ACH/ALLC colleagues.", "article_title": "Creating a Distance Research Environment (DRE) for the Mapas Project", "authors": [{"given": "Judith", "family": "Musick", "affiliation": [{"original_name": "Center for the Study of Women in Society, University of Oregon", "normalized_name": "University of Oregon", "country": "United States", "identifiers": {"ror": "https://ror.org/0293rh119", "GRID": "grid.170202.6"}}]}, {"given": "Stephanie", "family": "Wood", "affiliation": [{"original_name": "Center for the Study of Women in Society, University of Oregon", "normalized_name": "University of Oregon", "country": "United States", "identifiers": {"ror": "https://ror.org/0293rh119", "GRID": "grid.170202.6"}}]}], "publisher": null, "date": "2004", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}