{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  The use of GIS in historical research, Historical GIS, is now a well established part of the discipline of history. The field has evolved to an extent where it can be shown to have made a significant impact in delivering high-quality research in books and peer reviewed journals including the British Medical Journal, Annals of the Association of American Geographers, the American Historical Review, Journal of Economic History, and the Agricultural History Review. Most of these studies are, however, largely concerned with quantitative, social science-based approaches to historical research. This paper explores how approaches based on other sources such as texts and images can be used to allow GIS to be applied across the disciplines of the humanities. Early research is already suggesting that it can and indeed a new field, spatial humanities, is increasingly being recognised. This paper will explore one example of this approach focusing on how we can use GIS techniques to integrate historical texts and modern 'born-digital' photographs to gain a better understanding of landscape appreciation in the Lake District.  The paper starts by looking at two early tours of the Lake District, Thomas Gray's proto-Picturesque tour of 1769 and Samuel Taylor Coleridge's 'circumcursion' of 1802. We are currently working to extend this to include a subset of William Wordsworth's work. This project extracted place-names from these texts and matched then to a gazetteer to turn them into GIS form. The advantage of this approach is that once the GIS database has been created the spatial information in the texts can be mapped, re-mapped, queried, integrated with other material, and manipulated in a wide range of ways. The project produced a range of maps including: simple dot-maps of places mentioned, density smoothed maps that use techniques pioneered in epidemiology and crime mapping to summarise complex point patterns, and maps of emotional response to the landscape. Some of these were of the individual texts, some compared and contrasted the different texts. Other forms of analysis integrated data from other sources such as a Digital Elevation Model of the Lake District, and contemporary population densities. From these we were able to show that Gray followed the main valleys of the Lake District and stayed in towns overnight. He rarely travelled to heights of more than a few hundred feet although the higher peaks, those of over 2,500 feet, attract considerable attention in his writing. Coleridge, by contrast, avoided the populous parts of the Lake District, staying in the Western Fells and climbing Sca Fell, the highest mountain in England, among other things. While his ascend (and hair-raising descent) of Sca Fell is well known, what is more interesting is that much of his account is also concerned with time spent in low places, similar to Gray, and also that he names places of all heights, especially those between 1,000 and 2,000 feet which Gray almost completely ignores. The two tours barely overlap, the only place where they do significantly is Keswick, where Coleridge lived and Gray spent several nights, and the road over Dunmail Raise between Grasmere and Keswick although neither account has much to say about this part of their journey.  This approach takes us into what F. Moretti (2005) has termed 'distant reading,' a methodology that stresses summarising large bodies of text rather than focusing on a few texts in detail. We also wanted to explore whether GIS could help with more traditional approaches to reading. To this end we created a KML version of the GIS implemented in Google Earth. This placed a text on the bottom half of the screen with a Google Earth map on the top-half. Super-imposed on the map were the locations mentioned in the texts, which can be switched on and off in various ways, and a contemporary map showing the Lakes in 1815. This allows the reader to read the text while following the locations named using either Google Earth's modern arial photographs or the historical map as a backdrop. This therefore enriches the experience of close reading of the text by visualising and contextualising the places mentioned. Given the numbers of places mentioned by both authors even someone highly familiar with the Lake District is unlikely to be able to accurately locate all of these mentally. An alternative approach that this framework provides is for the user to click on a location and ask \"what have the different writers said about this place?\" To enrich this further we allow users to link from the site to the photographic website Flickr. Flickr allows people to upload and share their digital photographs. Users can tag these with metadata such as 'landscape' or 'mountain' and can also add 'geo-tags' a latitude and longitude that give the photo a location. Using these allows us to link from our texts to allow the user to see what people have photographed nearby.  The initial idea behind linking to Flickr was simply to demonstrate what the different areas of the Lake District looked like to an audience who might be unfamiliar with it, and thus to assist the in-depth reading. It became apparent however that there are pronounced geographies within Flickr – some areas are extensive photographed and some ignored, while the different tags that people place on their images also have pronounced geographies. As Wordsworth is claimed to have extensively influenced the way people today view the landscape, particularly in the Lakes, which poses the question \"is there are relationship between the geographies of Wordsworth's writing and the geographies of Flickr.\" Using the Flickr API we were able to extract the number of photographs geo-tagged to locations in cells of approximately 1km square across the whole of England. This could be done for all photos or those with specific tags such as 'mountain(s)' or 'tree(s).'  Mapping all photographs produces some interesting geographies, in particular, most photos seem to be taken in the urban centres or the main valleys. Minor roads such as that over the passes of Wrynose and Hardknott, also seem to encourage photography. It may be therefore that modern visitors to the Lake District, at least as represented by people who upload geo-tagged photographs to Flickr, follow a tour that is more like the Picturesque tours of Gray than the Romantic experiences of Coleridge or Wordsworth. In this way we are able to return to distant reading and to integrate two apparently incompatible sources: historical writings and modern digital photographs.  This paper thus demonstrates the potential of using geo-spatial approaches to integrate disparate and apparently incompatible sources. In it we have integrated historical texts, historical maps, modern environmental information giving information on the topography, statistical data from the census giving population densities, and born digital images from Flickr. By bringing them together we have been able to shed new light on a specific topic, landscape appreciation in the Lake District. The implications, however, are far broader. The amount of geo-referenced data available from multiple sources is increasing exponentially. This can be expected to continue particularly given the growth of user-generated content and the availability of techniques to automatically geo-reference texts. The challenge is to use these sources in innovative ways to shed new insights into research questions in the humanities. If this can be done successfully it will lead to a re-awakening of the importance of geography to the humanities.   ", "article_title": "GIS, Texts and Images: New approaches to landscape appreciation in the Lake District", "authors": [{"given": " Ian", "family": "Gregory", "affiliation": [{"original_name": "Lancaster University UK", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}], "publisher": "Centre for Computing in the Humanities, King's College London", "date": "2010", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}