{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  To date, the scholarship on social networking sites (SNSs) such as Facebook and MySpace has focused largely on areas other than pedagogy, with Boyd and Ellison (2007) observing that so far, most SNS research has centred on “impression management and friendship performance, networks and network structure, online/offline connections, and privacy issues”. Some work has been done on the effect of instructor presence on Facebook (Hewitt and Forte, 2006; Mazer et al., 2007; Szwelnik, 2008), the creation of MySpace pages in terms of the acquisition of new forms of digital literacy (Perkel, 2008), and some of the difficulties and benefits of SNSs for university students (Thelwall, 2008). Aside from this, however, there is little scholarship on the educational uses and potential of SNSs at university level. As Szwelnik (2008) comments, ‘Facebook has attracted a lot of attention from media and business but not yet a lot of attention from educational researchers’.  It is perhaps not surprising that it is the social aspects of these sites that have attracted the most critical attention, given that their central purpose is understood to be the management and navigation of (often pre-existing) relationships, rather than a means by which to share interests, complete tasks, or simply communicate with others (Boyd and Ellison, 2007; OFCOM, 2008). However, given that the social dimension of education is a fundamental to learning, it is worth exploring how SNSs may be used to pedagogical advantage. This is particularly the case given the large proportion of university students that access the sites: Ellison et al. (2007) found that 94% of the undergraduate population at Michigan State University were members, while a 2007 Ipsos Mori poll found that 95% of British undergraduates are regular users (Shepherd, 2008). SNSs, it would seem, are a resource not yet being used to their full potential for university teaching.  This paper reports on the findings of a research project designed to address the under-utilisation of SNSs at university level and the corresponding gap in the literature. Undertaken with students in the School of Languages, Linguistics and Film at Queen Mary, University of London, it investigates the educational potential of Facebook for facilitating informal learning with students on their year abroad, particularly in the domain of intercultural awareness and communication. Events held in previous years demonstrated the usefulness of bringing language students together in face-to-face contexts to reflect on their own and others’ diverse experiences of the year abroad. This project set up an online space on an SNS to facilitate this kind of learning through a peer mentoring framework, and to allow discussions of this sort to occur regularly during the students’ time abroad, rather than after it was over.  Undergraduate students in their second and final year of a language course were surveyed about their attitude towards the year abroad, their use of technology and SNSs, and, following Ellison et al. (2007), their affective investment in SNSs. Two different populations were surveyed: second year students organising their year abroad for the following year, and final year students who had returned from their year abroad. The results were used to develop focus group protocols to gauge students’ receptivity to the idea of using Facebook to carry out course-related discussions, to judge the extent to which Facebook was a hospitable environment for peer mentoring to occur, and to determine which Facebook applications would best assist with educational objectives. Students were also asked about which aspects of the year abroad they were already using Facebook to engage with, and which elements of their time away could be ameliorated through provision of a virtual meeting place for discussion. Several peer mentors were then chosen from the cohort who had already completed a year abroad, and these students were trained in online moderating and mentoring. A Facebook group was set up for the student mentors to use, and this was observed over a period of three months. Following this, four methods of evaluation were used to measure the effectiveness of the Facebook group: a) an online survey for third-year students currently on their year abroad; b) informal discussions with academic staff in modern languages; c) interviews with the peer mentors held at a computer; and d) close analysis and corpus analysis of the text of the online discussions. Paul and Brier (2001) and Cummings et al. (2006) have explored how students of university age use Facebook and other internet technologies to alleviate the “friendsickness” brought about by moving away from one’s friends. This project aimed to capitalise on the powerful ability of SNSs to address this relational need by drawing students into online conversations and collaborations that not only helped them to sustain relationships but also to use those relationships to learn from one another. However, existing research points to a strong resistance from university students to academics occupying “their” space on an SNS, something Szwelnik terms “crossing the boundary” (2008). Hewitt and Forte (2003) observe that identity management is a significant concern for SNS users when the roles they occupy cross perceived social boundaries and bring organizational power relationships into visibility, citing one student’s fears that Facebook could “unfairly skew a professor's perception of a student in a student environment”. Given that both social boundaries and uneven power relationships both come into play in the context of teacher-led discussions around course-related material, the project sought to find a way to build a learning community without infringing on a space perceived not to belong to academic staff, and to shift the discursive content from social to educational without forcing students to “cross the boundary”. In working with peer mentors, the project aimed not only to avoid these boundary-crossing problems but also to work intentionality into the fabric of the Facebook group. As Woods and Ebersole (2003) observe, transforming textual exchanges into a learning community with a positive social dynamic requires intentional decisions in the realm of both verbal and nonverbal communication, so student mentors needed to be made acquainted with the learning objectives for the educational context, and carefully trained in techniques of e-moderation to overcome the challenges a mediated environment can pose to productive discussions. This approach also had the advantage of being, to an extent, futureproofed: students were more likely than academic staff to know which technologies are most popular with their peers, and once a framework for online mentoring is established, this could be moved in future years to different sites or applications as students’ usage patterns change. A further advantage of this model is that it equips the student mentors with the digital literacy and communication skills to operate in the kinds of virtual environments that, as knowledge workers, they are likely to inhabit in their careers.  In summarising the results of this study, this paper will report on the benefits of using an SNS to support informal learning in the context of students on a year abroad, and set out approaches that universities can take to promote learning more generally through the use of SNSs. It uses tools from the Internet Community Text Analyzer (http://textanalytics.net/) to visualise the networks that developed between students on the site, and to identify productive models of SNS-mediated student mentoring behaviour.  ", "article_title": "Crossing the Boundary: Exploring the Educational Potential of Social Networking Sites", "authors": [{"given": " Anouk", "family": "Lang", "affiliation": [{"original_name": "Queen Mary, University of London UK", "normalized_name": "University of London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04cw6st05", "GRID": "grid.4464.2"}}]}], "publisher": "Centre for Computing in the Humanities, King's College London", "date": "2010", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}