{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  Writing about the new economy, Jeff Madrick remarks that the kinds of good jobs increasing most rapidly \"require communication skills, social ease, and basic reasoning abilities ...\" Acquiring such skills, he believes, \"may only be possible through higher education, where students are exposed to a sophisticated culture, a variety of experiences, and varying disciplines that require analysis of facts and concepts\" (33). In our view, the conventional classroom on a college or university campus remains the best facility for such an education, and we think the new technologies can be used to make it even more powerful. By contrast, much excitement about technology in governing bodies is lavished on various money-saving adaptations of distance education using the web. Perhaps as a result, some advocates of increased use of technology in higher education seem to believe the traditional classroom anachronistic (see Daniel, 1996 and 1997). In our opinion, such thinking bodes ill for the kind of learning we see as vital. Rather than using technology to replace teachers and conversation, we think it should take its place with more conventional tools as another way to enhance teaching and learning conceived in traditional ways. In what follows, we describe (and illustrate in presentation) a technologically enhanced classroom and accompanying tools that operationalize a philosophy of pedagogy that puts technology at the service of active learning. While we have previously presented some of the tools we use in this classroom (Havholm and Stewart 1996, 1998), this presentation aims at showing a style of teaching we believe to be particularly promising. While it is too soon to claim more than anecdotal success, we know it promotes active learning because it demonstrably extends students' powers of inquiry. We and colleagues increasingly favor this kind of use of technology - in a range of disciplines - at The College of Wooster. It saves no money in the short term, however. Rather than doing away with buildings or teachers, it adds technology to a conventional classroom housing a small number of people, one of whom is salaried. But over the long term, if we are right, our graduates have the intellectual and cultural capital that allows them to think and learn independently. They will not need expensive re-training every time their environment changes a little. Our electronic classroom looks like a seminar room, with a table in the middle, surrounded by comfortable chairs. It differs in that along its walls twenty to thirty networked computers stand ready, each linked to one another, to a screen/video projector overhead, and to the internet. Such a classroom clearly values physically proximate talk, but it also brings the huge resources of the internet to any conversation that wishes them. Moreover, it makes possible the easy use of a range of new tools that encourage active learning. For example, Peter Havholm and our colleague Jenna Hayward use a freeware beta version of PennMUSH in a course on dramatic structure to allow the class (of 29) to improvise a seven-episode serial drama. Students play characters and invent actions on-line, edit the logs of their online sessions into scripts, and then publish a final version on the web for friends (on- and off- campus) to read. Because of the technology, they can write and publish a play that belongs to all of them. Most important, however, is that this exercise is not done in a playwriting class but in a study of drama. Rather than honing writing skills, writing and publishing a play in this class tests the principles of structure students are learning from their reading of a dozen plays and Aristotle's Poetics. And because the technology makes publication so easy, the whole project takes only about 15% of class time. Having students write and publish a drama to test theoretical ideas was a natural development from another kind of project several of us in the English department use in our writing courses. In the Journalism course, in Introduction to Non-fictional Writing, and in English 101 as well as in the course Writing for Magazines, students spend two to five weeks writing, editing, designing, and producing a magazine, using page layout software, which they then either give away or sell on campus. The publishing projects have pleased several of us because students so much enjoy writing to intrigue and amuse their peers - and because the projects make self-evidently necessary the tasks of re-writing, careful consideration of audience and voice, and editing. No need for exhortation about these activities; one cannot make a magazine to impress one's friends without them. We also believe that preparing writing for publication - with headlines, pullquotes, illustrations, captions, and the rest - provides valuable experience in imagining oneself as one's reader and in visual thinking. Among the tools that have been particularly useful in courses in narrative or narrative theory is the Linear Modeling Kit (or LMK), a program the two of us designed and have worked with for several years (see Havholm and Stewart, 1996). The LMK is essentially an authoring system, and it allows users to create applications that generate any kind of text according to principles proposed by the user. For example, a student can use the LMK to create a \"folktale generator\" by entering what the student perceives to be the parts or elements of a folktale, any principles of order among those parts, and characteristic text for each part. Depending on the complexity of the input, the generator will produce hundreds, thousands, or millions of different texts. In our classes, students have created not only folktale generators but bildungsroman generators, romance generators, tragedy generators, and argument generators. As do all the activities we discuss here, working with the LMK acts as an heuristic, forcing students to move back and forth between theory and practice. To produce an LMK generator, students must first abstract principles from narratives they have read and then turn them into instructions for their generators. The generator then operationalizes the student's theory; it produces narratives created according to the principles the student has derived. Another of the tools we use in the electronic classroom is the Stylistic Analysis Kit (or SAK), a combination concordance and counting program with a nearly flat learning curve. Although the SAK is a fairly conventional program, its ease of use separates it from many of the tools used by professional researchers and makes it ideal for the student in the classroom. When analyzing their own papers, students are almost always driven back to their texts by, for example, discovering their average sentence length to be half that of the person sitting at the next computer or by learning that \"the\" comprises 14.7% of their total words. Here, students move between the abstraction of statistics and their own practice as writers. Even those who seem generally to lack curiosity are fascinated by the statistical record of their writing and eager to determine what practices account for those statistics. There has recently been much publicity about the ease with which new hardware and software can be used to create complex video projects. Our students have begun to find that - like desktop publishing software - the new video tools can be used to explore and test ideas. Ben Speildenner chose to make a video as his final project in our colleague Jenna Hayward's course in Post-Colonial Literature. In Urban Legends, he wanted to to evoke reflection congruent with one of the principal issues of the course. The class had talked about how easy it is to essentialize one's own culture while seeing other cultures as \"different.\" Ben chose several urban legends - that Disney makes heavy use of phallic imagery in The Little Mermaid, that there's a boy with a shotgun in the background of a scene in Three Men and a Baby, that there's a hanged Munchkin in The Wizard of Oz if you look closely enough at the right moment, and that spiders can lay eggs on your face - to shake our presuppositions. He wanted his presentations of these legends to push his audience into problematizing their own culture. He thinks that our urban legends show us to be more \"different\" than we think we are. But he wanted to stimulate thought, not to impose his ideas on the class. In Understanding and Cognition, Terry Winograd and Fernando Flores make a convincing case against the use of computers as \"restricted to representing knowledge as the acquisition and manipulation of facts, and communication as the transferring of information\" (78). Rather, they argue that we need to design computers as \"equipment for language\" so that they can \"create new possibilities for the speaking and listening that we do\" (79). Our version of the electronic classroom and our use in it of the tools we have described reflect this understanding of technology. In every case, students use the tools to interrogate ideas in ways novel in humanistic study. In an important sense, each tool allows students to test their understanding: the effectiveness of a serial drama tests ideas about dramatic structure; reader response to a published magazine tests convictions about rhetoric; the variety of lawful stories an LMK generator produces tests the powers of the theory of narrative it has been \"taught\"; the SAK's quantitative analysis leads to testing qualitative ideas about writing style; and his classmates' response to Spieldenner's Urban Legends tested his hypothesis that presenting urban legends can help us think in new ways about \"difference.\" In every case, we believe, the technology adds power to students' ability to question and therefore to understand - in the context of a kind of discussion as old as learning.  ", "article_title": "A Toolbox for the Electronic Classroom", "authors": [{"given": "Peter", "family": "Havholm", "affiliation": [{"original_name": " The College of Wooster, USA  ", "normalized_name": "College of Wooster", "country": "United States", "identifiers": {"ror": "https://ror.org/029zqs055", "GRID": "grid.254509.f"}}]}, {"given": "Larry", "family": "Stewart", "affiliation": [{"original_name": " The College of Wooster, USA  ", "normalized_name": "College of Wooster", "country": "United States", "identifiers": {"ror": "https://ror.org/029zqs055", "GRID": "grid.254509.f"}}]}], "publisher": " University of Glasgow ", "date": "2000", "keywords": ["The Electronic Classroom"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}