{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper suggests a new approach to the study of potential interface tools, by examining not the tools themselves, but instead a set of factors that contribute to the possible benefit that might be provided by the tools. Since the proposed “affordance strength model” does not require a working version of the tool to study, it can therefore be applied at several points, beginning even very early in the research cycle, at the initial concept stage. Many standard usability instruments, such as GLOBAL, include questions that cover different aspects of the user’s perception of the tools, but require a working prototype. Other usability protocols exist for studying systems at an early design stage, such as TAM (Morris and Dillon 1997). However, these do not include a complete range of the factors in the proposed “affordance strength model.” This proposed model can also be used at later stages, both at the point where prototypes have been created, and later still, once working versions are in production. Researchers can also begin to compare the affordance strength of different kinds of software tools. An affordance is an opportunity for action (Gibson 1979). For computer interface designers attempting to create new software tools—that may in some cases offer new opportunities for action—a perennial problem exists concerning how best to study an affordance that was not previously available. Comparisons against previous interfaces with different affordances tend toward category error (comparing apples to oranges), and comparisons against interfaces with similar affordances but different designs tend to be studies of design rather than of opportunities for action. Given the need to specify the significant relational factors that characterize the strength of an affordance, it is possible to distinguish eight factors that together represent the relational aspects of the object, the perceiver, and the dynamics of the context. These factors together can be used to create a vector space that defines the relational aspects of affordance strength in an operational way. Although these eight factors are not the only possible candidate factors, it is possible to explain how they work together to create a relatively strong picture of the total affordance strength: affordance strength = (tacit capacity, situated potential, awareness, motivation, ability, preference, contextual support, agential support). Tacit Capacity The first necessary factor is the tacit capacity of the object to provide the affordance in situations of the kind being studied. For example, if a given adult wishes to keep dry while walking two blocks in the rain, the unfactored affordance of the object is the twin capacity to be carried while walking and, simultaneously, keep someone dry. In this case, the tacit capacity of the umbrella in situations where a person needs to walk two blocks in the rain while staying dry would be very high, while the tacit capacity of, for example, a wrench, would be zero. The wrench has an excellent tacit capacity for other types of actions. In fact, because it is a specialized tool (like the umbrella), it has a primary affordance. But for the work at hand it is useless. Situated Potential The second necessary relational factor is the situated potential of the object, not generally in circumstances of the kind under investigation, but in one particular situation at one particular time. It is all very well for the person about to walk in the rain to realize that an umbrella has an excellent tacit capacity for keeping a person dry, when at the point of setting out there is no umbrella available, or the umbrella that is available is torn. These two factors – tacit capacity and situated potential – are relational attributes where the attention of the researcher is directed toward the object or environment and its relevant affordances for action. There are other factors that treat the relational aspects of the agent, where the researcher’s attention is directed at what have been called the perceiver’s effectivities (Turvey and Shaw 1979). The first of these factors is awareness. For the person about to walk in the rain, a perfectly good umbrella might be sitting to hand, but if the person is distracted or confused or in a rush, the umbrella might not be perceived, and for all of its high tacit capacity and situated potential, the umbrella still stays dry while the person gets wet. Motivation The second factor is motivation. If the person in question wants to walk in the rain and would prefer not to get wet but does not really mind it all that much, that person’s tendency to seek and adopt an available affordance is significantly reduced in comparison with the person who hates getting wet, has just had a cold, and is wearing clothes that will be damaged by the rain. The former person may casually take up an available umbrella if one were available, since the tacit capacity and situated potential are high enough that the action has an appropriately low resource load. If only a newspaper is available, the lower tacit capacity might be such that the person would prefer to simply get rained on. For the latter person, it is likely that the high motivation and absence of an umbrella would lead to extremes of behavior such as deciding not to walk but take a taxi instead, or perhaps going back into the building to see if an umbrella could be found somewhere. Like many of the other factors, motivation is a composite of a wide range of sub-factors, however, it is not unreasonable to ask someone with respect to a given scenario: “how motivated would you say you would be to carry out such and such an action, on a scale of zero to five?” Ability The third relational factor that is associated with the perceiver is ability. For a person with a physical disability that makes grasping difficult or lifting the arm problematic, the option of carrying anything above the head may simply not be available. In this case, all the other factors may be present, including an umbrella with high tacit capacity and an excellent situated potential, a strong awareness of the umbrella on the part of the perceiver and a correspondingly strong motivation to use it. But inability to grasp the handle renders the affordance zero for this particular person at this particular time. Preference The last factor related to the perceiver represents the role played by individual preference. All other factors being equal or even roughly equal, it is often the case that individual adoption of affordances depends at least to some extent on established preferences. In the case of the person who wants to stay dry in the rain, if there are two umbrellas available and one is a favorite, that will probably be the one that gets employed. Preference can be based on any one of a dozen sub-factors, ranging from aesthetic considerations to interpersonal influence to previous personal experience. Preference is distinct, however, from ability, and although preference is related to motivation, the two are not equivalent. The final factors in the proposed vector space are needed in order to adequately account for features of the situation that are relevant but are not directly related to the relationship between the perceiver and the object. They stand instead for the relationship between the affordance and its context. Contextual Support The first of these factors is contextual support, where factors in the environment that are not part of the affordance have an influence one way or the other on the perceiver’s interaction with the affordance. There are a wide range of possible contextual supports, including aspects of the situation that are physical, cognitive, and environmental, and the precise nature of the contextual supports in a given situation should be outlined during the process of analyzing the affordance as a whole. In the example of someone who wishes to stay dry in the rain, the contextual factors would include environmental facts such as how hard it is raining, whether it is warm or cold outside, how hard the wind is blowing and in what fashion, and so on. Agential Support The other feature that has not been accounted for yet in an explicit form is the role of other agents in the scenario. Contextual support includes all those factors (excluding the affordance itself) that are present in the environment at the time of the perceiver becoming involved with the affordance. Agential support, on the other hand, includes those features relating to the roles of the other people, animals, insects, and so on who are also potentially part of the situation. Agents are distinct from other factors of the environment in that they have agency, which is to say volition, goals, and actions of their own, which may have some bearing either directly or indirectly on the particular affordance. For instance, for the person who wishes to stay dry in the rain, it may turn out that there are other people present who also wish to walk outside. One of them might be elderly or frail and lacking an umbrella, in which case our perceiver could be motivated to behave altruistically and turn over the superior affordance of the umbrella to the other perceiver, choosing instead an inferior solution such as a folded newspaper. Applying the Model One straightforward means of applying this model to the study of interface tools is to have participants consider a particular affordance, in order to rate each factor on a Likert scale from 0-5. A rating of zero for any factor effectively zeroes out the strength of the entire affordance, suggesting that it might be further worthwhile to obtain a composite number by multiplication of the individual items. The number could then be used to compare the affordance strength of different kinds of tools. Combining this rating with comments for each factor would add a further layer of information that can contribute to the interface designer’s decision process.", "article_title": "Proposing an Affordance Strength Model to Study New Interface Tools", "authors": [{"given": "Stan ", "family": "RUECKER", "affiliation": [{"original_name": "Humanities Computing in English and Film Studies, University of Alberta, Canada", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}