{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " This paper describes a survey study Data gathering is under way at the time of this writing. The data gathering will be complete by the time of the conference. that is part of an ongoing effort (Paling & Martin, 2009; Paling, 2008; Paling & Nilan, 2006) to extend Social Informatics(Kling, 1999) to the study of literature and art. This series of studies has focused on the emergence of new forms of literary expression offered by information technology, and whether and how those possibilities are finding a place alongside traditional forms of expression in American literary writing. The study is meant to be complementary to more discursive, hermeneutic views of literary work. Discursive discussion of literary work provides rich descriptions of work by selected authors. In contrast, a survey enables us to look at the actions of literary community members in the aggregate. This study is based, in part, on the idea that various forms of inquiry into emerging literary practices, taken together, will provide a more complete picture than any one form of inquiry alone can provide. Different approaches to inquiry need not be seen as oppositional. The previous studies in this series (Paling and Martin, 2009; Paling, 2008; Paling & Nilan, 2006) developed, and found support for, a conceptual framework made up of four key values that typify American literary writing: Positive regard was operationalized as responses that indicated admiration or desire for particular qualities, e.g., a desire to read an author's work based on previous work by that author. Similarly, avant-garde was operationalized as valuation of particular characteristics, e.g., a preference for literary work that is fresh or innovative, or electronic work that has characteristics that cannot be produced in print form. The previous studies examined the ways in which literary authors could use information technology to change those key values. They posited, and found support for, the idea of Intensifying Use of Technology, which has three characteristics: For example, a fiction writer could use a hypermedia editor to produce non-linear, electronic fiction (recognition). She might prefer this newer form of fiction (greater emphasis on newer form of support), but also continue to write more traditional work (incomplete rejection). The original study in the series (Paling & Nilan, 2006) involved interviews with a purposive sample for heterogeneity (n=36) of editors of American little magazines. That study used primarily qualitative methods. The second study (Paling, 2008) involved the same sampling method (n=22), but focused on American literary authors. Paling (2008) used both qualitative data as well as quantitative data derived from Likert scales. The third study in the series (Paling & Martin, 2009) was a pilot survey with a random sample (n=84), and that study led directly to the development of the current study. The original studies all showed the presence of intensifying use of technology, but differed in terms of how common that phenomenon seems to be. Because two of the three samples were non-random, and all three were relatively small, a larger, random sample will lead to firmer conclusions about the research questions. The current study concentrated on two research questions:  RQ1: Do members of the American literary community show support for Positive Regard for Avant-garde-ism?  RQ2: Do the actions of members of the American literary community reflect Intensifying Use of Technology with regard to Positive Regard for Avant-garde-ism?  Positive Regard for Avant-garde-ism was selected from the four key values that make up the conceptual framework because it is the most relevant to the use of information technology. It is directly relevant, for example, to how much participants value the use of information technology to produce innovative writing that cannot be done in print. However, the other key values play an important role in establishing the context within which a value such as Positive Regard for Avant-garde-ism comes into play, and they were retained as an important part of this study. The current study represents a clear methodological progression along the line of research begun in the earlier studies. A total of 900 invitations for participation were sent out. The names were selected randomly from a sampling frame built based on publicly available lists from The Association of Writers and Writing Programs and the Modern Language Association, as well as print directories such the Council of Literary Magazines and Small Presses' Literary Press and Magazine Directory. This yielded a sample of exactly 400 participants. All of the potential participants live, work, or study in America, or work for a publisher whose primary presence is in America. An international sample would be desirable in the future, but was beyond the scope and funding level of this study. The respondents were asked to complete a mail survey composed of brief yes/no or checklist questions, as well as questions that included Likert-type numeric scales. The questions were refined versions from the interviews in the earlier studies in the series. Data, and respondent comments, from the earlier studies uncovered minor problems with question wording, scaling, etc. Because of that, the data from this study cannot be combined with data from the earlier studies. Conclusions from the current study, though, should be given greater weight than conclusions from the earlier studies because of the larger, random sample and the refined questions. Much of the apparent difference between the previous studies seems to have resulted from the different sampling methods used in the studies in this series. The first two studies (Paling, 2008; Paling & Nilan, 2006), as mentioned earlier, used purposive sampling for heterogeneity. In other words, an effort was made to seek out editors and authors who were actively involved in producing literature with a substantial electronic component. The strength of purposive sampling is that it allows this kind of effort to closely examine different segments of a community such as people who participate in American literary writing. The weakness of such sampling, though, is that it is very difficult to create a purposive sample that reflects not just the presence of particular phenomena, but also an accurate sampling of how widespread the phenomenon is. The pilot survey (Paling & Martin, 2009) did find limited demonstration of Intensifying Use of Technology. One respondent showed unambiguous evidence of Intensifying Use of Technology. A number of other respondents (8) demonstrated somewhat similar, but less pronounced, patterns of Intensifying Use of Technology. This would suggest that somewhere around 10% of the American literary community demonstrates Intensifying Use of Technology, although the conceptualization of that phenomenon may need to be altered to reflect the opinions of community members who place strong positive value on technological innovation in literature, but who do not actually place greater emphasis on such forms of literature. Taken together, the previous studies suggest that we need to modify, but not reject, the concept of Intensifying use of Technology. Intensifying Use of Technology is a real phenomenon, but is not, to date, widespread in American literary writing. More importantly, the American literary establishment demonstrates very limited levels of the phenomenon. This conclusion is very similar to the conclusion reached by Rettberg (2009). Rettberg argued that electronic literature constitutes a literary avant-garde, but an avant-garde that is not part of any institutionalized mainstream. However, Rettberg's work represents the analysis of an individual directly involved in those efforts, and did not involve structured data gathering to address the actions of literary community members in the aggregate. The current study takes the contrasting approach, gathering data from respondents across the literary community to begin developing a larger picture of how information technology is influencing contemporary American literary writing. The size and type of the sample used in this study should help resolve any ambiguities raised in the previous studies. ", "article_title": "The Cultural Impact of New Media on American Literary Writing: Refining a Conceptual Framework", "authors": [{"given": "Stephen", "family": "Paling", "affiliation": [{"original_name": "School of Library and Information Studies, University of Wisconsin-Madison", "normalized_name": "University of Wisconsin–Madison", "country": "United States", "identifiers": {"ror": "https://ror.org/01y2jtd41", "GRID": "grid.14003.36"}}]}], "publisher": null, "date": "2011", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}