{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "As discussed by McCarty, Beynon and Russ in a session organised at ACH/ALLC 2005, there is a remarkable convergence between McCarty’s concept of ‘model-building in the role of experimental end-maker’ (McCarty 2005:15) - a cornerstone in his vision for humanities computing (HC) - and the principles of Empirical Modelling (EM) (EMweb). More problematic is the tension between the pluralist conception of computing that is an essential ingredient of McCarty’s stance on HC, and the prominent emphasis on ‘dissolving dualities’ in McCarty, Beynon and Russ (ACH/ALLC 2005:138). Resolving this tension transforms the status of HC from one amongst many varieties of computing to that of first amongst equals. The plurality of computing In presenting his “rationale for a computing practice that is of and foras well as in the humanities”, McCarty (2005:14) emphasises the plurality of computing. Following Mahoney (2005), he calls into question the search for “the essential nature of computing” and appeals to history as evidence that ‘what people want computers to do’ and ‘how people design computers to do it’ determine many different computings. The audacity of McCarty’s vision in recommending his readers, as would-be practitioners of a variety of computing, to “[turn] their attention from working out principles to pursuing practice”, is striking. It is hard to imagine a reputable computer science department encouraging its students to see computing primarily in terms of its practice - congenial to the students themselves as this might be. In promoting computing as an academic subject, there is no recognised focus for developing ‘scientific’ principles other than the theory of computation at its historical core (Turing). McCarty instead sets out to characterise the practice of HC in such terms that it has its own integrity. When contemplating McCarty’s boldness, it is instructive to consider the alternatives. The problematic nature of the relationship between computer science and the humanities is notorious. Consider, for instance, Chesher’s observation (ACH/ALLC 2005:39) that - in teaching a course in Arts Informatics: “The Humanities critiques of science and technology (Heidegger, Virilio, Coyne) are difficult to reconcile with scientific conceptions of humanities practices (Holtzman). Each of these areas places quite different, and often clearly conflicting discourses, techniques and systems of value”. From this perspective, seeking to characterise HC as a unified entity seems to be the only plausible strategy, though it resembles conjuring a stable compound from an explosive combination of improbable ingredients. Invoking EM is helpful in critiquing McCarty’s treatment of this unification (2005: 195-8). To elaborate the chemistry metaphor, it illuminates the precise nature of the reaction and identifies it with a more general phenomenon. How modelling and computer science interact in humanities computing The semantic orientation of HC is crucial to understanding its chemistry. Where computer science emphasises prescribing and representing precise intended meanings, humanities is of its essence obliged to engage with meanings that are ambiguous and unintended. The authentic spirit of McCarty’s notion of HC is captured in Ramsay’s ‘placing visualisation in a rhetorical context’ (in his presentation at ACH/ALLC 2005:200) - the creative construction of an artefact as a subject for personal experience, whose interpretation is to be negotiated and potentially shared. This theme is amplified in many topical contributions to the proceedings of ACH/ALLC 20051. Interpreting such activities from an EM perspective obliges a more prominent shift in emphasis from the accepted view of computing than is acknowledged in (McCarty, 2005) - the rich diversity of HC activities cannot be attributed primarily to the versatility of the Turing Machine as a generator of functional relationships2. In EM, the focus is upon the role that observables, dependency and agency play in the modelling activity, and each of these concepts appeals to a personal experience of interaction with technology that defies merely functional characterisation. On this basis, EM trades first and foremost not in objective ‘formal’ interpretations, but in speculative constructions that cannot be realised or mediated without skillful and intelligent human interaction. Appreciation of observables, dependency relationships and potential agency is acquired through developing familiarity and evolving skills. This is in keeping with Polanyi’s account - cited by McCarty (2005:44) - of how awareness is transformed through skill acquisition. Functional abstraction can express transcendental computational relationships, but does not encompass such issues, which relate to what is given to the human interpreter in their immediate experience. A useful parallel may be drawn with musical performance. Though one and the same functional relationship between visual stimulus and tactile response is involved, a virtuoso pianist can perform an extended extract from a complex score in the time it takes a novice to identify the initial chord. In this context, it is significant that - in elaborating his vision for HC, McCarty (2005:53) drew upon his experience of making a specific model - the Onomasticon for Ovid’s Metamorphoses - whose construction and interpretation can be viewed as an EM archetype. Model-building in the Onomasticon, being based on spreadsheet principles, supplies the framework within which McCarty’s experimental ‘end-maker’ role can be played out most effectively. It is implausible that the same qualities can be realised on account of adopting other model-building principles, such as the use of object-orientation, since - in conventional use - their primary purpose is to rationalise the specification of complex functional abstractions. This challenges Galey’s - no doubt pragmatically most sensible! - contention (ACH/ALLC 2005:198) that “In order to bring electronic editing projects like the eNVS to the screen, humanists must think past documents to embrace the principles of object-oriented and standards-compliant programming and design.”. Humanities computing as the archetype for all varieties of computing Though McCarty (2005:14) first discusses plurality in computing in relation to communities of practice quite generally, his interest in a conceptual unification of HC and computer science (2005:195-8) acknowledges the plurality of HC itself. Where McCarty (2005:198) identifies “general-purpose DH.indb 18 6/06/06 10:55:14 DIGITAL HUMANITIES 2006 Single Sessions P. 19 modelling software, such as a spreadsheet or database” as one component within a more diverse unity, Beynon and Russ have a radically different conceptualisation in mind. Their account identifies EM as hybrid part- automated-part-human processing within a framework for generalised computation similar to that implicit in McCarty’s Onomasticon3. Within this framework, the functionality of the Turing Machine is subsumed by closely prescribed and highly automated modes of interaction, whilst modelling with the Onomasticon is a more open-ended human-centred form of processing - though by no means the most general activity of this nature. This places EM at the centre of a broader pragmatic discourse on programming that complements the conventional rational discourse (Beynon, Boyatt and Russ, 2005). The emphasis in (McCarty, Beynon and Russ, 2005) on dissolving dualities within the frame of Radical Empiricism (James, 1996) may still appear to be mismatched to the plurality of HC. Klein’s reaction to EM exemplifies the issues. In seeking a technology to support a world-wide collaborative creative venture4, he recognises the qualities of EM as supporting a concept of creativity that is expressed in the motto: “Build the camera while shooting the film” (cf. Lubart 1996, Klein 2002, METISweb). For Klein, this recognition calls to mind Joas’s concept of creative action, and the processes that shape the evolving meaning of context in Lévy’s ‘universe in perpetual creation’ (1997). The relevance of Radical Empiricism even where such diverse perspectives are being invoked stems from the subject-independent association it establishes between sense-making and the classification of relationships between experiences. For instance, whatever meaningful relationships inform the semiotics of Lévy’s Information Economy Meta Language (2005) should somewhere be ‘experiencable’ (cf. James, 1996:160), and in this manner be amenable to EM. Seen in this light, Radical Empiricism and EM relate to universal learning activities that are orthogonal to the subject of the learning (cf. Beynon and Roe, 2004). This accords with James’s monist view of experience and pluralist view of understanding (James, 1996:194). It is also resonates best with cultures where understanding through relationship has higher priority than objectification. In emphasising interaction and the interpretation of relationships, EM does not prescribe a rigid frame for understanding, but exhibits that positive quality of blandness5 (Jullien, 2004) that affords participation in many relationships. Even within the small community of EM practitioners, this potential for plurality can be seen in different nuances and idioms of elaboration, as in relation to analogue, phenomenological or ecological variants of computing. The aspiration of EM to connect computing decisively with modelling was also that of object-oriented (OO) modelling, as first conceived nearly forty years ago (Birtwistle, Dahl, Myhrhaug and Nygaard, 1982). As a young technology, EM cannot yet compete with OO in tackling technical challenges in HC, such as devising adaptive web interfaces for the ‘end-maker’. Perhaps, unlike OO, it can be more widely adopted and developed without in the process being conscripted to the cause of supporting functional abstraction. If so, it may yet demonstrate that the modelling activity McCarty has identified as characteristic of HC is in fact an integral and fundamental part of every computing practice: that all computings are humanities’ computings. Notes 1. For instance: acknowledging that there is no definitive digital representation (Galey, ACH/ALLC 2005:198); recognising the essential need for interactive playful visualisation (Ramsay, ibid: 200; Wolff, ibid: 273; Durnad and Wardrip-Fruin, ibid: 61); and appreciating the importance of collaborative modelling and role integration (Best et al, ibid: 13; van Zundert and Dalen-Oskam, ibid: 249). 2. For more background, see McCarty (2005) Figure 4.2 and the associated discussion on pages 195-8. 3. The framework alluded to here is that of the Abstract Definitive Machine, as described at (EMweb). 4. The Metis project (METISweb) is exploring collective creativity of global virtual teams of students and professionals in the movie industry. 5. The Chinese ‘dan’, which Jullien translates as ‘fadeur’: Varsano notes that she “would have liked to find an English word that signifies a lack of flavor and that at the same time benefits from the positive connotations supplied by a culture that honors the presence of absence” (see Schroeder 2005).", "article_title": "Humanities’ Computings", "authors": [{"given": "Meurig", "family": "BEYNON", "affiliation": [{"original_name": "Computer Science, University of Warwick,     Coventry UK", "normalized_name": "University of Warwick", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01a77tt86", "GRID": "grid.7372.1"}}]}, {"given": "Roderick", "family": "R. KLEIN", "affiliation": [{"original_name": "Syscom Lab, University of Savoie,     Bourget du Lac, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Steve", "family": "RUSS", "affiliation": [{"original_name": "Computer Science, University of Warwick,     Coventry UK", "normalized_name": "University of Warwick", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01a77tt86", "GRID": "grid.7372.1"}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}