{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  This paper discusses the image of the vampire in the television series True Blood and the books by Charlaine Harris on which the series is based. Our analysis is based on cultural imagology as developed by Johnson (2005, 2006) and Lotman (1990). To this end we have used CATMA, the concordance program developed at the University of Hamburg, and added multimodal functionality to it. By time stamping and aligning the image, the soundtrack and the subtitling, we can mark up and investigate both the linguistic and the paralinguistic markers that describe the characters and their emotions. This means that we are able to move between a concordance of the subtitling and the film itself; in addition, we have linked the scenes of the film to the novels of Charlaine Harris, on which the series is based. Thus, this paper not only discusses the images created in the novels and the television series, but also presents the tools we have built to enable us to carry out the research.Beliefs and legends about vampires have existed probably as long as mankind. The earliest known records are found among the Assyrians (Wright 2006). Lores and legends of some form of the vampire can be found all around the world. The vampire has been described as an evil, bloodsucking creature, a force of darkness. He is seductive, smart, and a powerful predator. Sometimes the vampire is seen as a spirit; some legends say they can change into animals, even control them (Nobleman 2007). Vampire literature began with the Gothic tradition, a fiction that was intended to evoke a sense of dread in the reader. During Victorian times the vampire became more human and a powerful archetype. The common image, which began with Bram Stoker’s Dracula, was one of a gentleman dressed in evening wear and a long cloak; he was smart, polite, wealthy and well-dressed. Of all classic horror creatures, he has had the most sex appeal and has thus easily been able to attract humans.  The image of the vampire has once again changed. He (or she) is now beautiful, erotic, powerful, young and quite human-like. He has human emotions, is dangerous when called for, but loving and good to those humans he is attached to – a modern-day Heathcliff, a dark and brooding sexual fantasy. This is largely due to Anne Rice, who changed the image of the vampire, and vampire literature more generally, with her character Lestat. She achieved this by ignoring the old conventions of what a vampire can or cannot do; she changed the traditional Gothic settings by moving them from isolated houses and areas to central locations and beautiful homes; she made the vampire the protagonist, thus moving away from the more traditional narration by the victim, and focused on their feelings and their anxieties, making them quite sympathetic (Overstreet 2006). We investigate the True Blood television series and the books it is based on. These were written by Charlaine Harris between 2002 and 2010, in other words well after L.J. Smith’s Vampire Diaries series and after the television series Buffy the Vampire Slayer, but before Stephanie Meyer’s Twilight series. True Blood features Sookie Stackhouse, a human in her late twenties, a waitress in a local bar, and her relationship to Bill Compton, quite the Southern gentleman, and Eric Northman, the Viking, two vampires who are almost opposites of each other. We set out to investigate what kind of an image the viewer gets of Eric; this we did through investigating the adjectives used to describe him and those used by him. Thus our research questions were: How do others perceive Eric? How does Eric behave? How does Eric perceive others? How does he describe others? To carry out the investigation, we needed a concordance program, but the problem of course was that there simply wasn’t one that could also handle the video. Thus we turned to the CATMA team at Hamburg University and asked whether we could use their program and build on it. We have now built multimodal functionality on top of CATMA and carried out our investigation on the speech of the series, calling up the video of each instance in the KWIC concordance (see Fig. 1). We then marked up the text of the original book series and linked the instances describing Eric in the book to those in the TV series.   Figure 1 Our results show that in the television series True Blood, there is little description of Eric; the viewer’s image of Eric is shaped largely by comments made about his behavior, such as ‘Eric, you do not humble well’ or ‘I’m not afraid of Eric’ and ‘Eric has had a thousand years of practicing deceit.’ However, the image of Eric is not only constructed through this. In fact, the multimodality of the television series plays a crucial role in the construction of the characters more generally. Eric, for example, is created through the things he wears, the way he speaks, the things he does and the expressions on his face. Sometimes, for example, Sookie criticizes Eric harshly and his facial expression indicates that he is quite hurt, although he does not say so. Thus it is crucial that in addition to analyzing the actual speech of the characters, one can access the visual images as well – much like in modern conversation analysis, which also relies on sound and images, in addition to the actual words spoken. Another interesting aspect of the investigation is the comparison of how the image of Eric differs between the original novels and the television series. It seems that much of what is conveyed to the viewer through the images in the television series forms what in literary studies one would think of as that part of the creation of a character in a novel which is left to the reader’s imagination. It is like an interpretation of the character, perhaps even to be seen as the actor’s interpretation, which then gets reinterpreted by the viewer. The image of Eric is also created through the juxtaposition of him with Sookie’s other lover, Bill Compton, who was turned into a vampire after the Civil War and who is quite the Southern gentleman, particularly as opposed to Eric, who is the rogue; he is the ruthless Viking, an absolute ruler, at times rather cruel, and a sharp businessman. He is attractive to women, whom he uses ruthlessly, but he is also very protective of those he really cares for, which often is not reflected in the words he speaks, but rather in his facial expressions and gestures. Thus, it becomes evident that in order to carry out an analysis of data such as this, it is crucial that one has access to tools which are able to handle the multimodality of the data. Our decision to not reinvent the wheel, but to build upon an already available tool, was the right choice, but there is still work to be done to make it even more applicable to other data and other types of investigations.   ", "article_title": "‘Eric, you do not humble well’: The Image of the Modern Vampire in Text and on Screen", "authors": [{"given": " Lisa Lena", "family": "Opas-Hänninen", "affiliation": [{"original_name": "Department of English, University of Oulu, Finland", "normalized_name": "University of Oulu", "country": "Finland", "identifiers": {"ror": "https://ror.org/03yj89h83", "GRID": "grid.10858.34"}}]}, {"given": " Jacqueline", "family": "Hettel", "affiliation": [{"original_name": "University of Georgia, USA", "normalized_name": "University of Georgia", "country": "United States", "identifiers": {"ror": "https://ror.org/00te3t702", "GRID": "grid.213876.9"}}]}, {"given": " Tuomo", "family": "Toljamo", "affiliation": [{"original_name": "Department of English, University of Oulu, Finland", "normalized_name": "University of Oulu", "country": "Finland", "identifiers": {"ror": "https://ror.org/03yj89h83", "GRID": "grid.10858.34"}}]}, {"given": " Tapio", "family": "Seppänen", "affiliation": [{"original_name": "Department of English, University of Oulu, Finland", "normalized_name": "University of Oulu", "country": "Finland", "identifiers": {"ror": "https://ror.org/03yj89h83", "GRID": "grid.10858.34"}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}