{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This study aims to design the Media Query Language (MQL) combine with the Linguistic Media Query Interface (LMQI) for Elan. The system integrated with the new achievements in audio-video recognition will allow querying media files with predefined gesture phases (or motion primitives) and speech characteristics as well as combinations of both. For the purpose of this work the predefined motions and speech characteristics are called patterns for atomic elements and actions for a sequence of patterns. The main assumption is that a user-customized library of patterns and actions and automated media annotation with LMQI will reduce annotation time, hence decreasing costs of creation of annotated corpora. Increase of the number of annotated data should influence the speed and number of possible research in disciplines in which human multi-modal interaction is a subject of interest and where annotated corpora are required.", "article_title": "Automatic annotation of linguistic 2D and Kinect recordings with the Media Query Language for Elan", "authors": [{"given": "Anna", "family": "Lenkiewicz", "affiliation": [{"original_name": "Max Planck Institute for Psycholinguistics, The Netherlands", "normalized_name": "Max Planck Institute for Psycholinguistics", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/00671me87", "GRID": "grid.419550.c"}}]}, {"given": "Sebastian", "family": "Drude", "affiliation": [{"original_name": "Max Planck Institute for Psycholinguistics, The Netherlands", "normalized_name": "Max Planck Institute for Psycholinguistics", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/00671me87", "GRID": "grid.419550.c"}}]}], "publisher": "University of Nebraska-Lincoln", "date": "2013", "keywords": ["linguistics", "video", "audio", "query languages", "corpora and corpus activities", "multimedia", "content analysis"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}