{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Giotto’s Fresco Giotto’s thirteenth-century fresco Exorcism of the Demons at Arezzo in the Church of San Francesco in Assisi is often referred to as marking the transition from the flattened medieval Byzantine ritualised image to the more spatially realistic perspectives of the Renaissance proper (Damisch, 1994; Edgerton, 1991; Gombrich, 2000; Kemp, 1990; Kubovy, 1989; Panofsky, 1991) (see figure 1). His achievements were recognised by his contemporaries such as Dante and Cennini, and his teacher Cimabue. He had a profound influence on Florentine painting in general and inspired the generation of artists that followed such as Masaccio and Michelangelo. In this, the tenth panel of a series of twenty eight frescos, we see an awkward (by modern standards) attempt to depict depth on a two-dimensional surface. His frescos attempted to illustrate the natural world with depth cues such as receding lines and chiaroscuro shading techniques. He also broke with the tradition of strictly depicting size relationships between people in a scene according to their hegemonic hierarchy. Instead, Giotto illustrated a spatial hierarchy between objects in a scene – including people. On the left we see the cathedral of San Donato (now the Diocesan Museum) with St Francis and Brother Sylvester attempting to drive out the demons aloft over the city, to the right of the fresco. The cathedral has been constructed with lines receding to the left suggesting distance. This is incongruous, however, with the city buildings to the right which have their diminishing lines marching to the right (see figure 2). Hence, as a complete composition, it does not portray the truly unified perspectival space we are more accustomed to that came later in the Renaissance. Nevertheless, in his clumsy way Giotto had established a sense of depth in his paintings which would have been just as profound to the uninitiated as any photograph we could produce of the scene today. Figure 1. Giotto’s thirteenth-century fresco Exorcism of the Demons at Arezzo in the Church of San Francesco in Assisi (KFKI, 2004). Was Giotto’s depiction of depth really that clumsy though? Perhaps by today’s mathematically precise algorithmic computer-generated perspectives it is. Or, perhaps Giotto was not attempting to depict a realistic scene, as much as later Renaissance paintings would, but simply hinting at the spatial arrangements of the city of Arezzo, the cathedral and surrounding countryside? The city of Arezzo depicted in Giotto’s fresco dates back to the sixth century BC. At the time, the city was situated on the top of the Donato Hill where we can now find the Prato Gardens and the fifteenth-century Medici Fortress. Between the Cathedral and the Fortress was a vast natural depression. The cavity has since been filled in to construct the Prato Gardens. Many of the original features are present in his fresco. The Three-Dimensionalisation of Giotto’s Fresco To determine how accurate, or rather what are the spatial interrelationships between the various buildings and landscape depicted in his fresco, the author of this paper embarked upon its three-dimensionalisation. In the spirit of the endeavour that Giotto himself took, I worked directly from an image of the fresco meticulously reconstructing each individual element in it. In an architectural sense, one would normally work from plans and project the three-dimensional volumes over them. In this case, there are no plans, so a different strategy had to be found. Working as Giotto himself may have done, the method adopted was based on one of simple proportions. A geometrical analysis of the image produced a grammar of sorts that appeared to be consistent across most of the city buildings. For example, there are simple geometric relationships between the window openings and the masonry that surrounds them (1:1, 1:2, 1:3, and so on). The next relationship is the relative heights. If we assume most of the main buildings were at most two storeys then, judging by their relative heights, four distinct ground levels emerge that these buildings are perched on. In the thirteenth century the extent of building technology typically only allows for a maximum of four storeys in domestic construction. Hence, the towers are typically twice the height of the average dwelling. From here a topology emerges consistent with the actual site in Arezzo today. Analysis of the Model The next stage was to assemble the city buildings. While at first, they just seem to be a dense agglomeration, by their three-dimensional modelling and organisation, and according to the picture analysis, an order emerges. This was revealed as much by the reconstructive modelling as it was by analysis of the picture itself. For example, clearly some buildings were in front of others, and others to the side of these. Hence, once the proportions were determined gaps could be detected between buildings (when viewed from above) that are not immediately obvious in Giotto’s original fresco. Indeed, an overall layout for the city (that part that was visible in Giotto’s fresco) includes what appears to be open spaces connected by access alleys between buildings. At one stage of the project a significant city square was revealed by the overall layout. However, when the different levels of the buildings were taken into account, this turned out to be simply a steep section of land that could not be built on (see figure 3). Figure 3. Bird’s-eye-view of the three-dimensionalisation of Giotto’s fresco. Note the open spaces and alleys between buildings. Other details were revealed through this procedure too. For example, all the towers house a bell. This, in conjunction with the airborne demons, the gesticulations of the priests, and citizens gathered at the city gates, suggests that Giotto’s depiction of so many bell towers had a purpose. The 3D model is an interactive spatial model that can be navigated in real-time. As such, within the multimedia reconceptualisation of his fresco it was possible to add the sounds of the bells. This adds a level of meaning to the fresco that is not apparent from the picture alone (see figure 4). Figure 4. Screen grab of interactive real-time navigable model of Giotto’s fresco three-dimensionalised. What was Revealed Together, the details derived from the analysis of Giotto’s fresco, the spatial characteristics of its subsequent three-dimensionalisation, and the addition of bell ringing provide another level of experience and understanding of Giotto’s work that he could not have anticipated. More than this, it exposes Giotto’s spatial reasoning to be more developed than many had thought previously. The fact that such an accurate reconstruction of his fresco can be produced suggests greater insights into spatial relationships between the objects in his fresco were present than previously reported. However, as much of the original city of Arezzo was dismantled in the fifteenth century to build the Medici fortress it is almost impossible to determine if the arrangement of buildings in Giotto’s city of Arezzo are a natural recording. Nevertheless, we do know that he was one of the new breed of naturalists actively seeking greater clarity in illustrating the world around him, therefore it is reasonable to assume that his pictorial depiction of the city is much more than a simple, stylised, ritualistic, scenography.", "article_title": "The Three - Dimensionalisation of Giotto’s 13th - Century Assisi Fresco: Exorcism of the Demons at Arezzo.", "authors": [{"given": "Theodor G. ", "family": "WYELD", "affiliation": [{"original_name": "IEP, ITEE,     The University of Queensland, Aust.", "normalized_name": "University of Queensland", "country": "Australia", "identifiers": {"ror": "https://ror.org/00rqy9422", "GRID": "grid.1003.2"}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}