{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Expected resultsFirstly, this research will provide the first acoustic model for the study of acoustical properties of cultic theatres in the ancient Greek world. The study will assess and recover the acoustics of the Selinunte theatre.Secondly, the research will develop specific tools suitable for processing the resulting 3D models. It is also hoped that the results will provide some foundations from which to create experimental interpretative 3D reconstructions integrating acoustic models. The results will establish a new framework, which future researchers can use to advance their knowledge of the application of 3D technology for the documentation of instruments.Finally, this project will offer an innovative research method in the study of ancient Greek music. This research aims to create a field of comparative studies of archaeomusicological research.In conclusion, this research will develop a new theoretical basis, which will contribute to the establishment of a methodology at the crossroads of archaeomusicology, architecture, and acoustics and digital technologies. In addition, this study is part of a programme intended to valorise ancient cultural and musical heritage in the Mediterranean with cross-disciplinary approaches to human culture and technology, in order to unveil new meanings and create new research fields within the digital humanities and heritage science.   ", "article_title": "Towards a New Approach in the Study of Ancient Greek Music: The Virtual Reconstruction of an Aulos \"Early Type\" from Sicily", "authors": [{"given": "Angela", "family": "Bellia", "affiliation": [{"original_name": "University of Bologna", "normalized_name": "University of Bologna", "country": "Italy", "identifiers": {"ror": "https://ror.org/01111rn36", "GRID": "grid.6292.f"}}]}], "publisher": null, "date": "2017", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}