{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  The Text Encoding Initiative’s (TEI) Extramural Journal (EJ) project was conceived early in 2009 when the conveners of the TEI Education Special Interest Group (SIG) proposed, as a matter of urgency, the development of an online publishing suite to address the shortage of TEI educational resources.Two of the notable TEI teaching resources which are available include the Women Writers Project’s NEH-funded series of “Advanced Seminars on Scholarly Text Encoding” (see <http://www.wwp.brown.edu/encoding/seminars/neh_advanced.html>) and TEI by Example (see <http://www.kantl.be/ctb/project/2006/tei-ex.htm> and Terras et al.). Following approval by the TEI Board and Council and the receipt of a small SIG grant in support of the project, TEI-EJ advanced into development. Because TEI-EJ is being researched and developed in an era where “print is no longer the exclusive or the normative medium in which knowledge is produced and/or disseminated” (“A Digital Humanities Manifesto”) and where electronic publication is increasingly common (see Waltham; Maron and Smith; Willett), it is crucial to point out that typologically, TEI-EJ is positioned outside of two disparate points on the web publishing continuum, media-driven journals which are designed primarily for the publication of media-driven content (e.g. Vectors Journal <http://www.vectorsjournal.org/>, Southern Spaces <http://www.southernspaces.org/>; also see Toton and Martin) and text-driven journals which are designed to reproduce the print journal model in a web publication (e.g. Journal of Writing Research <>, International Journal of Teaching and Learning in Higher Education <http://www.isetl.org/ijtlhe/>). Although TEI-EJ’s ‘journal’ designation is suggestive of a single aim, from the outset, project objectives have been defined as both experimental and extramural, and TEI-EJ has been envisaged not only as a publishing venue but also as a community-driven online forum that offers members of the TEI, whether novice or expert, as well as the broader DH community new educational insights into the TEI. Significantly, the steps being taken to achieve these objectives contribute to a newly emerging body of scholarship which explores the development of new digital environments and which defines a new genre in academic publishing.   The first stage of the project has been the development of TEI-EJ as a born digital, open access, peer reviewed scholarly journal where communicative modes are bidirectional rather than exclusively unidirectional, articles are media-driven (including video, audio, and image) as well as text-driven, and where the aims of publication extend beyond print journal mimesis to include education and community building. Given the hybrid nature of the project’s goals (publishing and learning community; see Dal Fiore, Koku and Wellman) and the novel design for implementation, TEI-EJ’s site infrastructure (see Fig. 1) was designed to be extensible, capable of managing text articles (e.g. TEI-XML as well as formats such as .txt and .doc which are converted to TEI-XML), multimedia articles (e.g. video, audio, image), moderated responses to articles, and community-driven communications (e.g. forum and blog) (see Fig. 2). This is achieved through Drupal,For a good, comparative discussion of content management systems, see “Comparing Open Source Content Management Systems: WordPress, Joomla, Drupal, and Plone,” available at <http://idealware.org/comparing_os_cms/>. TEI-XML content is being handled by the Drupal XML Content module, and the journal’s publishing workflow is being handled by the Drupal E- Journal module. a customizable, open source content management system, which facilitates the social media as well as the publishing and educational aspects of the project.A preview of the publishing website and a fully functional mock journal issue are being presented at the TEI Members’ Meeting in November 2009.   Fig. 1. Schlitz TEI-EJ project planning 'mindmap'      Fig. 2. Screenshot of TEI-EJ website      This paper will introduce the TEI-EJ project, describing the why and how of the key theoretical, technological and editorial decisions that drove development as we advanced from theory into practice. In doing so, it aims to establish the project as a new model for academic publishing which is designed to harness emerging technologies, to leverage the fact that “Open access is changing the public and scholarly presence of the research article” (Willinsky), to promote learning objectives beside dissemination of scholarship, and to elevate the role of reader/end-user to the position of chief stakeholder.  ", "article_title": "The TEI's Extramural Journal Project: Exploring New Digital Environments and Defining a New Genre in Academic Publishing", "authors": [{"given": " Stephanie A.", "family": "Schlitz", "affiliation": [{"original_name": "Bloomsburg UniversityUSA", "normalized_name": "Bloomsburg University", "country": "United States", "identifiers": {"ror": "https://ror.org/007dga614", "GRID": "grid.253165.6"}}]}], "publisher": "Centre for Computing in the Humanities, King's College London", "date": "2010", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}