{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The development of digital technology make us revisit the traditionnal approach of text edition as a research tool such as used in the Humanities. Our proposal applies to the problem of electronic editing of Judeo-Spanish documents in Hebrew characters over which the translitteration and transcription techniques are carried out. We study the possibilities of collaborative platform construction in which these documents could be annotated and organized as a reference digital repository for the scholars of this specific domain. Beyond the meta description necessary for the document identification (Dublin Core metadata standard), we aim to promote the annotating of the uploaded documents (in the free form, complementary to the metadescription) for the purpose of study and discussion. The source documents (presented as image files, for instance) are transformed into digital documents, which become then the research tools. The role of annotation (carried out by a researcher or a domaine expert) is to convey the metadata information about the source and the “ derived ” documents (for the purpose of identification and localization of digital repository resources) and to make possible the discussion over these documents (to interprete, comment, refuse, accept, translate, and so forth). In a previous paper we proposed a conceptual model defining the data structuring necessary to this double purpose of identification and annotation (Rouissi, Stulic 2005). Our point of view is that the successful setting up of socio-technical device for the researchers of a particular scientific field depends on the definition of appropriate functionalities. In order to define them in this context of relatively small and geographically dispersed scientific community, we planned to realise a survey that should confront our initial hypothesis (our conceptual annotation model) with the declared academic practices. The survey results should allow us to identify the needs and the expectations of researchers and to determine the direction of project development and the setting up of appropriate functionalities. It should also measure the level of Information and Communication Technology (ICT) integration in their current activities (the type of technological tools in use, the individual or collective framework, the use of annotation over digital documents, the participation in collaborative work environments…). The answers will be analysed at the quantitative (closed questions) and the qualitative level (the content analysis) so as to provide a typology of declared practices and/or needs. In broad lines, our work is oriented towards the elaborating of the full Web platform and is based on the existent open source solutions. But only with the clear definition of the functionalities that are expected by the scientific community members we will be able to model the final technical choices. We envisage the proprietary format for the model in question, but it should permit the exportation through the standardized formats for data interchange like Text Encoding Initiative for document structuring or Dublin Core for meta description of working documents. The platform should promote the annotating in collaborative mode (with different levels of participation : from reader to editor) and organize the discussion (which can can different purposes : to transcribe, to translate, to comment, to propose…) by qualifiying it (following the vocabularies that are still to be defined, not necessarily taken into account in the specifications such as TEI). The final platform will include also the documentary corpus building that will be exploitable thanks to the search functionalities. The future user will be able to effectuate a search (of ‘selection’ type) among digital documents which constitute the corpus, and after the document selection, to consult the related discussion and according to his/her profile, he/she will be able to participate by adding the annotation and/or reacting to the annotation previously added by other user(s). The user will be able to generate a new version with his/her own annotations and to export it following the proposed formats and standards. Although the context to which we apply our project is very specific, our reflexion is oriented towards a larger approach. Our aim is to construct a digital environment which could be applied to the research domains with similar needs for documentary corpus organisation and work on documents.", "article_title": "Annotations in Collaborative Mode for Ancient Documents Study in Digital Environment", "authors": [{"given": "Ana ", "family": "STULIC", "affiliation": [{"original_name": "AMERIBER, Bordeaux 3 University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Soufiane ", "family": "ROUISSI", "affiliation": [{"original_name": "CEMIC - GRESIC, Bordeaux 3 University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}