{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Cinemetrics (www.cinemetrics.lv) is a collaborative, online tool to enable researchers to collect, store, and process scholarly data about film editing. The long-term goal of the project is to create an extensive, multi-faceted collection of freely accessible digital data on film editing - a digital laboratory for the study of film style. Over the last four years, over 600 individuals have contributed editing data on circa 6,900 films to the project. Our paper at DH2011 will focus on the types of film historical questions Cinemetrics can address today. In addition, we’ll provide a brief overview of how the software and the collaborative submission works, compare our work with similar efforts, and finally offer an early look at future directions for development.At present, Cinemetrics is programmed handle the aspect of editing known in film studies as cutting rates. Though we tend to perceive their unfolding as continuous most films consist of segments called shots that are separated by instant breaks called cuts. Shots differ in terms of space and in terms of time. We know enough about space-related distinctions between shots, which are easy to name (shot 1: baby playing; shot 2: man looking) and categorize (shot 1: medium long high angle shot; shot 2: facial close up). Time-related differences between shots are more elusive and harder to talk about for; unlike in music or poetry with their scaled feet and measures, variations in shot length are not ones of distinction but of degree.Shot lengths are sometimes convenient to present as the frequency of shot changes, or cuts, hence the term \"cutting rates.” Shorter shots mean a higher cutting rate. Unsurprisingly, cutting rates are linked to the story and its space-time articulations; likewise, montage sequences meant to cover larger spaces of story time have higher cutting rates than sequences shown in real time. Less evident, but just as important, is the relationship between cutting rates and the history of film. This is this gap in our knowledge that Cinemetrics is designed to bridge.Using Cinemetrics, we are able to obtain and present cutting-related data in a more flexible way than previously available. Rather than calculate average shot lengths (ASL) arithmetically, Cinemetrics records and stores the time-span of each separate shot. Distinct from the arithmetical ASL, which is a single datum, Cinemetrics treats each film as a database of shots and highlights its individual features. Specifically, it tells us about a film's cutting swing (standard deviations of shorter and longer shots from ASL), its cutting range (difference in seconds between the shortest and the longest shot of the film), and its dynamic profiles (polynomial trendlines that reflect fluctuations of shot lengths within the duration of the film). In the “Articles” section of our site are links to articles by a number of film scholars on movie measurement studies using Cinemetrics.The Cinemetrics database is an open-submission repository of data collected by people who use the client tool. All raw research data submitted to the site is freely available to anyone. The database's default sorting is alphabetic by film titles, but it can also be sorted by other parameters such as year, submitter's name, submission date, simple vs. advanced mode of measuring, and by the film's average shot length, median shot length, and standard deviation. By clicking on a film, title the user can access the page that provides basic statistics and interactive graphs related to this film.\"Cinemetrics Lab\" is the latest addition to our site, and a work in progress. It is envisaged to offer the students of film history a range of analytical tools that will help them dissect, visualize, and compare film-related data. We started with a large-scale comparative map that looks a little like a star map. It is a scatter graph, and each dot represents a film available on our database. If you find your film on this map, you will instantly see how it relates to thousands of other films on the x-axis on time (111 years of film history) and on the y-axis of average shot lengths.While Cinemetrics has no clones, there are a number of projects pursuing similar goals that complement our efforts. Jeremy Butler's useful \"Shot Logger\" (www.tcf.ua.edu/slgallery/shotlogger/) features a database of films (mainly TV) and offers statistics \"inspired by Cinemetrics\", but its database is still small, and the seven statistics values the site yields are numerically, not graphically, expressed. The francophone site \"Lignes de Temps\" (web.iri.centrepompidou.fr/pop_site.html), linked to the Georges Pompidou Center for Modern Art in Paris is mainly designed as a video-flow annotation and cut-detection tool.The above-mentioned \"Shotlogger,\" \"Edit 2000,\" and especially \"Research into Film\" are three sites on which Cinemetrics activities are actively echoed or discussed. Nick Redfern's \"Research into Film\" (nickredfern.wordpress.com/) uses Cinemetrics data to theorize statistical approaches to film studies. \"Edit 2000\" (www.data2000.no/EDIT2000/), launched in Norway in 2009, was made to represent Edit Decision List (EDL) files as numeric and visual summaries. Another group whose researchers deployed Cinemetrics raw data for their experiments in data visualization is \"Software Studies Initiative\" headed by Prof. Lev Manovich at UC San Diego. The site shows how Cinemetrics data can be variously represented using different visualization tools.", "article_title": "Cinemetrics: A Digital Laboratory for Film Studies", "authors": [{"given": "Arno", "family": "Bosse", "affiliation": [{"original_name": "The University of Chicago", "normalized_name": "University of Chicago", "country": "United States", "identifiers": {"ror": "https://ror.org/024mw5h28", "GRID": "grid.170205.1"}}]}, {"given": "Yuri", "family": "Tsivian", "affiliation": [{"original_name": "The University of Chicago", "normalized_name": "University of Chicago", "country": "United States", "identifiers": {"ror": "https://ror.org/024mw5h28", "GRID": "grid.170205.1"}}]}, {"given": "Keith", "family": "Brisson", "affiliation": [{"original_name": "The University of Chicago", "normalized_name": "University of Chicago", "country": "United States", "identifiers": {"ror": "https://ror.org/024mw5h28", "GRID": "grid.170205.1"}}]}], "publisher": null, "date": "2011", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}