{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "1. Introduction The recent experiments on digital support of Joyce (1989), Moulthrop (1995), Jackson (1995) or Amerika (1997) have drawn attention to the potential of the electronic medium as a medium for literary creation. The emergence of the electronic literature has also determined the coming out of a new form of aesthetics mainly concerning the possible replacement of the printed book by its electronic counterpart (Bolter, 1991; Landow, 1997; Birkerts, 1994), the dilemma of the end of book versus the book without end (Douglas, 2000), the prospective capacity of the hypertext (Joyce, 2000) or of the ergodic literature (Aarseth, 1997), and the reconciliation of immersion and interactivity as a “model for purely language-based literature” (Ryan, 2001). Unlike the previous interfaces (tablets, roll, codex), the electronic interface supposes the existence of two types of texts: on the one hand, the text intended to be read and on the other, the code written in a programming or markup language, and determining the performances of the interface. This interaction between the visible and the hidden text, between the huge potential of expression of the natural language and the constraints of the programming language, represents one of the central elements in the production of new forms of electronic textuality. This kind of dependence implies a double sense relationship: the code supports the creation of new textual forms and these forms can inspire new types of encoding, increasingly flexible. 2. Theoretical and practical assumptions From a theoretical point of view our project deals with the relationship literature – science – digital technology, writing - programming, visual – textual, in the creation of new forms of electronic textuality. We are also interested in the implications of this kind of interaction upon the domain of literary criticism and especially in the possible relationships between the aesthetics of the electronic medium and other fields of the contemporary criticism (close reading, new historicism, genetic criticism), or of the information and cognitive sciences. The present study consists in an experimental approach dealing with the unexplored possibilities of the electronic support as a medium for textual investigation. Its goal is the construction of a new type of interface (an editor written in Java programming language and using XML annotated texts) allowing the writer and the reader to increase or decrease the degree of detail of the text, by a procedure evoking the “magnifying glass effect” and the fractals geometry. Inspired by the fictional construction of Stephenson (2000) and by the fractal theory of Mandelbrot (1983), this new kind of textuality would be a layout on levels of “depth”, accessible by operations of zoom-in and zoom-out, the text of the most abridged level being reproduced and appropriately augmented on the subsequent, deeper levels. The study deals with the new types of relationship author – text – medium – reader, characters, plot, narrative strategy or knowledge organization determined by this form of “scalable” textual and conceptual structure. The main question addressed by the study would be therefore related to the possible applications of this form of electronic text intended to be written and explored “under the magnifying glass”, and implying a halfway between linearity and non-linearity, immersion and interactivity, features usually associated with the printed book and respectively with the hypertext. 3. Possible Applications The first application would be related to the concepts of close reading, a method using short excerpts from a text and carefully examining its style, rhetorical strategies, philosophical and sociological assumptions (Gallagher and Greenblatt, 2000), and of new historicism, an approach bringing to light some aspects of a literary work by trying to reconstruct its historical and cultural context (Greenblatt, 2004). The use of the magnifying glass editor would therefore allow a sort of fusion of the text with the literary or historical analysis, developed on several levels of detail. We could thus imagine the editor as a tool relating, at different “scales”, the literary text with the historical and cultural context having produced it, or with the critical commentaries and marginal notes, in a complex process of reading, re-reading and writing. The second type of application would concern the field of genetic criticism interested in the dynamics of the process of writing (Grésillon, 1994), and in the intertextual dimension and reading/writing dialectics of the “work in progress” (D’Iorio and Ferrer, 2001). From this point of view, an analysis “under the magnifying glass” would imply a layout on levels relating the definitive form, through different variants, to the first plan sketching the idea of the text. This layout could therefore facilitate the understanding of the gradual dynamics of the act of writing or the recognition of the eventual traces of previous readings. Another type of application may concern the narrative strategies. We can imagine, for instance, a sort of auto-reflexive text, conceived as a set of reflections on the act of writing and trying to retrace by details accumulation the path backwards from writing to reading, from verbal expression to life experience, and involving different “degrees of immersion” as part of the storytelling. Other approaches could be related to the development of the characters in a literary text. Greenblatt (2004) suggests that in Venus and Adonis, Shakespeare uses a technique of approaching or distancing the reader from the characters, by increasing or decreasing his “physical and emotional proximity”. On the other hand, Alan Palmer (2003) discusses the term of “behaviorist narrative” defined as an objective narrative focalized on the characters’ behavior, i.e. on their actions rather than on their feelings and thoughts. Could we therefore imagine a narrative allowing an alternation of proximity and distance or starting with a behaviorist approach and gradually investigating the psychological depths of the characters? Other applications of the model could include: the cognitive and pedagogic domain (knowledge organization on levels of complexity, from intuitive to abstract descriptions); the construction of dictionaries and encyclopedias (as collections of expanding articles intended to larger categories of readers); the domain of information science (systems providing several degrees of precision in response to users’ queries), etc. 4. Conclusion Of course, there is not an exhaustive list of possible applications, but rather some directions of study. Our presentation will concern the reconsideration of the “magnifying glass” and fractal geometry as metaphors for a new form of electronic textuality, drawing attention to some aspects of the dialectics: text / textual or historical analysis, written expression / idea or life experience, essential / detail, intuitive / abstract, precision / vagueness, in textual production and interpretation.", "article_title": "The Book “under the Magnifying Glass”. New Metaphors for New Forms of Electronic Textuality", "authors": [{"given": "Florentina ", "family": "VASILESCU ARMASELU", "affiliation": [{"original_name": "Littérature comparée, Université de Montréal, Canada", "normalized_name": "University of Montreal", "country": "Canada", "identifiers": {"ror": "https://ror.org/0161xgx34", "GRID": "grid.14848.31"}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}