{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Poetry visualization is used mostly to highlight patterns detected using computational tools and to create new forms of expression. In our research, we are attempting to challenge the already established notions about how poetry is visualized. For this purpose, we are building Ambiances: an interactive framework to write and visualize poetry. The main goal of our framework is to create a tool that makes a symbiotic relationship between writing and visualizing a poem. The contribution of our research is to explore the advantages, issues and challenges that a framework for writing and visualizing poetry interactively and can provide. Additionally, we will also address the multiple authorship issues and the implications that will surface from the use of our framework. In the end, our research aims to implement, analyze and study new interactive methods for creating and visualizing poetry.", "article_title": "Ambiances: A Framework to Write and Visualize Poetry", "authors": [{"given": "Luis", "family": "Meneses", "affiliation": [{"original_name": "Center for the Study of Digital Libraries — Texas A&M University, United States of America", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Richard", "family": "Furuta", "affiliation": [{"original_name": "Center for the Study of Digital Libraries — Texas A&M University, United States of America", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Laura", "family": "Mandell", "affiliation": [{"original_name": "Initiative for Digital Humanities, Media, and Culture — Texas A&M University, United States of America", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "University of Nebraska-Lincoln", "date": "2013", "keywords": ["interactive", "visualization", "poetry"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}