{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Our proposal introduces a methodological approach for an enhanced link between architectural objects at various scales and what documents them: uncertain raw documentary sources. It provides an operational framework for the capitalisation of the interpretation phase during which experts establish meanings and credibility of raw data, and derive from the reading of sources possible scenarios of morphological evolutions. The issue we address is an interdisciplinary one: it stands where scientific analysis of raw documentary sources meets the needs for representation and visualisation. 2D or 3D representations have historically, since the renaissance, been at the heart of the way edifices or sites are described, visualised, documented and understood, and in close connection with textual documentation analysis efforts. It seems that with the development of computer techniques architectural modelling has mainly focused on issues connected with realism, in the so-called computer graphics discipline. In parallel, scientific analysis of raw documentary sources has benefited from the development of various data management techniques, but often without even a concern for graphical visualisation. Our field of experimentation is the preservation of the architectural and urban heritage. This includes a concern for the edifice itself when it is still standing, but it also includes a concern for the edifice's documentation helping to try and state for instance how the edifice evolved through time or how the edifice was when nothing is left of it today. In this research area, the meaning of the word visualisation is often narrowed to this of virtual reconstruction. But an undocumented virtual reconstruction can hardly be considered as something more than as a dead-end realistic 3D representation (see [Kantner 2000]). Communication through realistic renderings is all cases an abusive simplification since the morphology is not the only element that should be visualised, (see for instance [Huber 2000] or [Kodym 1999]). We favour an opposite approach in which what is \"beyond\" the image is more important that the image itself, in line with contribution like [Alkhoven 1993]. What we try to visualise are not the ocular effect of elements in the real world, but a momentary state of knowledge on the edifice and its evolution. In our experiments, we give to the word visualisation another meaning: this of an interpretative graphical interface to the documentation (see [Dudek and Blaise, 2001] and [Dudek and Blaise, 2003]). In the new experiment we report here, carried out on the remains of the Roman Theatre in Arles (southern France), we addressed the issue of how to better exploit results of a survey (based on image modelling techniques) in terms of readability for architects. Our theoretical knowledge about such edifices is formalised (see its theoretical representation in figure 1) and acts as support for the various stages of investigation on the edifice, from 3D surveying to representation in a real-time 3D model for the web. The SIA3D Experiment Architectural surveying has benefited from numerous technological advances in a recent past (see [Marbs 2002] [Dekeyser et al. 2003] [Chen et al. 2001]), both in terms of data acquisition disposals (laser scanning, image-based modelling, etc..) and in terms of performance. But how can one really exploit the results of such surveys remains a key research question, as demonstrated by Ramondino [2001]. Architectural surveying and architectural documentation seem to relate to tally independent research areas whereas they by nature have one thing in common: they circle the set of information and knowledge that can be related to an edifice. As an answer, and in line with principles established in [Dudek and Blaise 2003], we consider it is necessary to identify and organise non-ambiguous elements of morphology to which we will attach various pieces of information, including raw results of surveying campaigns. Those results can be contextualised, i.e.: localised in the space of a reconstruction featuring both elements surveyed and theoretical elements, positioned with regards to the area of knowledge considered (although techniques may be the same, surveying an edifice is not equivalent to surveying a tea pot, it does not correspond to the same area of knowledge) Let us take an example: the remain of a cornice once surveyed will be displayed in a 3D model of the whole edifice with indications concerning: Its belonging to a typology of objects (stylistic references, role in the edifice, etc..) Its hypothetical position (marked as such) in the virtual reconstruction of the edifice, itself marked as hypothetical. Its links to a variety of documents Remains that were surveyed are localised in the space of a theoretical Roman Theatre (see figure 2) that we define through an analysis of the relevant architectural vocabulary. This analysis aims at identifying non-ambiguous concepts that on one hand correspond to physical objects present in the edifice (base, capital, etc..) and on the other hand have a significant role in the edifice's composition. Each such element of vocabulary can be represented by one or several architectural primitives (see figure 3). The vocabulary is used to rebuild, level after level, the theoretical model of a Roman Theatre in the Augustinian period. One should here read level after level in the sense of rebuilding starting by individual elements such as a capital to whole groups such as colonnade, i.e an understanding of the word level that matches the idea of architectural scales. The edifice is described by a hierarchical structure that derives form our analysis of the vocabulary, rooted in [Formigé, 1914] and [Pérouse De Montclos, 1988]. The hierarchical structure formalises part-of relations between elements in a five level hierarchy (example: capital/part-of/column/part-of/colonnade/part-of/ etc.) Once the elements are classified as shown in figure 4, and once the compositional rules are expressed, the understanding of the edifice is within reach. The hierarchical structure allows us to establish bilateral relations between pieces of information and the 3D model. To each of the five hierarchical levels correspond specific pieces of information . Each element in the hierarchy acts as a filter in the exploitation of the 3D model since it is represented by its own geometry or by sub-elements. Fragments can then be attached to elements of level 5. The hierarchical structure monitors the switching between levels, either inside the 3D scenes where geometry are grouped depending on the level observed, or inside the information sheets. These information sheets gather pieces of data on theoretical elements, but also descriptions of the remains that were surveyed (actual localisation, state of conservation, materials, etc.. ). The interface (see figure 5) is accessible on a standard web browser with the Virtools plug-in for reading the 3D scene. Scene/windows interactions are written in JavaScript, enabling easy updating of the various links implemented. Information sheets as we call them range from results of survey for remains to purely bibliographical information. What this experiment has clearly shown is that even though we have credible pieces of information (results of a survey) we still need, when the time has come to exploit these pieces of information, graphics that interpret them. In other words, this experiment further underlines the necessity in the field of the architectural heritage to deliver graphics that demonstrate doubts.", "article_title": "Exploiting 3D graphics for non-ambiguous anchoring of documentary sources", "authors": [{"given": "Iwona", "family": "Dudek", "affiliation": [{"original_name": "UMR CNRS/MCC 694 MAP", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2004", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}