{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " It is usually understood that literary authors have style, and numerous papers have been published about the usefulness of digital approaches and techniques for identifying stylistic specificities of a writer, for confronting styles, for attributing texts, etc. (see Holmes, 1994; Brunet, 2004; Herman et al., 2004). However, another traditional type of stylistic analysis in literary studies has been less operationalized in a digital paradigm, aimed at observing how the characters speak (see however Brynes 2010 and 2012). This paper contributes to the testing of digital tools for such an approach; in other words, it tries to answer, with digital tools, whether literary characters have a style, or if the signal of the author that creates them is prevalent over all other kinds of linguistic specificities.  In order to answer this question, the paper focuses on theatrical texts from the 17 th and 18 th French centuries. To the contrary of what happens in narrative texts, character’s discourses have clear boundaries in plays, and can be easily extracted from an XML/TEI encoded text. Also, characters in plays have been somewhat less studied with digital tools than characters in novels (Jockers and Kiriloff, 2016; Jockers 2013).  A sample of 8 comedies staged approximately from 1630 to 1740 has been put together; the sample tries to balance well known play writers, such as Molière, Corneille Destouches and Marivaux, with more obscure authors (Dancourt, Regnard, Boissy, Boursault). However, all the plays are “grandes comédies” in 5 acts and in verses, with comparable lengths and quite similar numbers of characters. A total amount of 82 discourses has been extracted using an XQuery under BaseX. First, the plays as a whole (but without the stage directions or any kind of meta-discourse) have been submitted to a PCA using the stylometric library under R written by (Eder and al., 2016). As expected, differences between author styles are well underlined by their distribution on the graph, with Molière in the middle and Regnard closer to him than to the authors from the 18 th century.     This first analysis has been conducted only to confirm that the tool works on the type of texts it has been fed to, and yields sensible results. Second, character’s discourses have been submitted to the same kind of analysis. After further adjustments, such as the exclusion from the corpus of too short roles that were skewing the general distribution on the graph, and the testing of various algorithms (covariance, correlation or cluster analysis? Classic Delta, Canberra or Eder’s Delta?), the following representation has been obtained:    As it can be observed, characters do not group by “origin” (i. e., more often than not characters from a play do not appear together), nor do they display a clear historical split - to the difference to what was happening with the authors. This tends to confirm that characters do have a style, whose parameters are to be further identified and tested. Moreover, when merging in a same txt file discourses of feminine, respectively masculine, characters from the same play/ author, significant differences appear in certain cases, with Molière’s Agnès and other feminine characters being the most intriguing case:    In a third stage, an analysis of characters’ speeches is conducted with TXM (see Heiden, 2010), so as to delineate the stylistic differences pointed to by the PCA and to attempt an explanation. Verbs do not seem to be useful discriminators, even when the texts are lemmatized. The calculus of specificities shows that personnel pronouns, names and possessives are the most discriminant features. To these, one may add the adjectives, which appear more frequently as a characteristic of male speeches according to the table of preferred words built with the “oppose” function under stylo library in R. While the importance of “pronouns of dialogue” for characterizing plays has already been underlined (Muller, 1979), the other features are a bit more surprising, since one would have expected, for instance, verbs to play a more prominent role, related to the actantial position of the characters. Also, it is not clear why male characters would use more adjectives than their feminine counterparts; sensibility and a trend towards pathos are more often evoked in relation to the second ones. After further inquiries with a new set of discourses, from other plays by the same authors, but also from other authors, so as to confirm the above mentioned phenomena, the paper will try to propose some explanations based on a close analysis of the contexts. ", "article_title": "Stylometric Analyses of Character Speeches in French Plays", "authors": [{"given": "Ioana", "family": "Galleron", "affiliation": [{"original_name": "U. Sorbonne Nouvelle, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2019", "keywords": ["corpus and text analysis", "french studies", "stylistics and stylometry", "content analysis", "English", "literary studies"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}