{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Does your library or digital humanities center employ graduate students? Are you considering employing graduate students in digital scholarship work at your university? This full-day workshop will bring together institutions that do to discuss the variety of institutional arrangements for employing graduate students in digital scholarship labor. If graduate students can help build capacity for digital work on your campus, what are some best practices for structuring their employment? What are some current models in place, and what are the benefits and challenges of fellowships vs. part time employment or RAships? This workshop will present helpful practical advice on this topic, but also serve as a starting point for a broader discussion about the place of student labor in DH work.   Graduate students represent valuable members of digital humanities teams in a variety of institutional and library settings. They collaborate with scholars in labs, as members of project teams, as fellows, interns, instructors, research assistants, principal investigators, and everything in between. In her 2015 Office of Digital Humanities keynote presentation entitled “on capacity and care,” Nowviskie argued that, as we continue to build individual, institutional, and even national capacity for digital scholarship in higher education, we should make an “ethic of care” the foundation upon which we work. This workshop will address how libraries and digital humanities organizations can make an ethic of care the foundation upon which their varied graduate student labor arrangements are built as they look to expand capacity within their institutions and beyond. Workshop participants will discuss the benefits, challenges, and best practices for the wide variety of institutional arrangements that result in graduate students doing DH work in libraries and DH organizations today.  ", "article_title": "Building Capacity with Care: Graduate Students and DH work in the Library", "authors": [{"given": "Alan Gilchrist", "family": "Pike", "affiliation": [{"original_name": "Emory University, United States of America", "normalized_name": "Emory University", "country": "United States", "identifiers": {"ror": "https://ror.org/03czfpz43", "GRID": "grid.189967.8"}}]}, {"given": "Dawn", "family": "Childress", "affiliation": [{"original_name": "University of California at Los Angeles (UCLA), United States of America", "normalized_name": "University of California, Los Angeles", "country": "United States", "identifiers": {"ror": "https://ror.org/046rm7j60", "GRID": "grid.19006.3e"}}]}, {"given": "Smiljana", "family": "Antonijević", "affiliation": [{"original_name": "Pennsylvania State University, United States of America", "normalized_name": "Pennsylvania State University", "country": "United States", "identifiers": {"ror": "https://ror.org/04p491231", "GRID": "grid.29857.31"}}]}, {"given": "Jim", "family": "McGrath", "affiliation": [{"original_name": "Brown University, United States of America", "normalized_name": "Brown University", "country": "United States", "identifiers": {"ror": "https://ror.org/05gq02987", "GRID": "grid.40263.33"}}]}, {"given": "Alex", "family": "Gil", "affiliation": [{"original_name": "Columbia University, United States of America", "normalized_name": "Columbia University", "country": "United States", "identifiers": {"ror": "https://ror.org/00hj8s172", "GRID": "grid.21729.3f"}}]}, {"given": "Brennan", "family": "Collins", "affiliation": [{"original_name": "Georgia State University, United States of America", "normalized_name": "Georgia State University", "country": "United States", "identifiers": {"ror": "https://ror.org/03qt6ba18", "GRID": "grid.256304.6"}}]}], "publisher": "Maciej Eder, Pedagogical University in Krakow", "date": "2016", "keywords": ["project design, organization, management", "digital humanities - diversity", "digital humanities - institutional support", "GLAM: galleries, libraries, archives, museums", "English"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}