{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Recent discussion about the scholarly digital edition has focussed on ways to change the edition from a passive text, only there to be consulted, into a dynamic research environment. Siemens in (Siemens 2005) asks why as yet we have seen no convincing integration between text analysis tools and the hypertext edition. Best in (Best 2005) speculates on the possibilities this vision offers for Shakespeare research. To some extent it seems to be what Mueller is realising in the Nameless Shakespeare (Mueller 2005). An essential step towards seamless integration of text analysis tools into the digital edition (TAML, the Text Analysis Mark-up Language) is suggested in (Sinclair 2005). The most visionary statement of the dynamic edition’s potential is no doubt given by Robinson in (Robinson 2003). A dynamic edition, in his view, while offering text analysis and other tools that may shed light on some aspect or another of the edited texts, would also be open to the addition of new content, of corrections, of many different types of annotations. Integrating third-party annotations into the edition is something that seems especially interesting, as it would open up the edition to the results of interpretive studies. The output of scholarly processes of textual analysis (as e.g. suggested in Bradley 2003) could be fed back into the digital edition, and made available for querying by other scholars. This paper will focus on a solution for adding third party annotations into a digital edition. It will propose a REST (Representational State Transfer, Fielding 2000) API for the exchange of annotation information between an edition and an annotation server. The edition display software (which transforms the edition XML source file into HTML) will ask the annotation server for the annotations that apply to text fragments that are being displayed to the edition user. Depending on the parameters the annotation server will return either annotations formatted for display or instructions for hyperlinking the text to the annotations. Thus, the digital edition will be able to include a display of external a nnotations without knowing about the annotations’ contents or even the annotation data model. The paper presentation will include a brief demonstration of a prototype implementation of the protocol. The demonstration will be based on a digital emblem book edition at the Emblem Project Utrecht (http://emblems.let.uu.nl) and use the EDITOR annotation toolset under development at the Huygens Institute (http://www.huygensinstituut.knaw.nl/ projects/editor, Boot 2005). EDITOR at present consists of an annotation input component that runs on the user’s workstation and an annotation display component that runs on a web server. The input component displays the CSS-styled edition XML to the user and facilitates the creation of multi-field user-typed annotations to arbitrary ranges of text in the edition. The display component, still at an early stage of development, shows the annotations in conjunction with the edition XML, has some facilities for filtering and sorting, and will offer, one day, advanced visualisation facilities. The EDITOR server component will serve up the annotations for display in other contexts, first and foremost, presumably, in the context of the digital edition that they annotate. As Robinson notes, one of the more complex issues in annotating the digital edition is the problem of concurrent hierarchies and the mark-up overlap problems to which this gives rise. The EDITOR annotation toolset assumes the edition and its annotations will be stored in separate locations. Each annotation stores information about the start and end locations of the text fragment to which it applies. There is no need to materialize the annotations into tagging interspersed between the basic edition mark-up, and the overlap issue therefore does not arise (the solution in that respect is similar to the Just In Time Markup described in Eggert 2005). Similarly, as the edition XML remains unmodified, there is no need to worry about potential corruptions during the annotation process. Making available third-party annotations from within the digital edition will go a long way towards establishing a ‘distributed edition fashioned collaboratively’, to borrow Robinson’s words. My paper will briefly look at some of the wider issues the integration of third-party scholarship into the digital edition raises. How will the presence of DH.indb 34 6/06/06 10:55:18 DIGITAL HUMANITIES 2006 Single Sessions P. 35 Edition’, CH Working Papers, http://www.chass.utoronto.ca/epc/chwp/Casta02/Siemens_casta02.htm, accessed 2005-11-13. Sinclair, Stéfan (2005), ‘Toward Next Generation Text Analysis Tools: The Text Analysis Markup Language (TAML)’, CH Working Papers, http://www.chass.utoronto.ca/epc/chwp/Casta02/ Sinclair_casta02.htm, accessed 2005-11-13. third-party material influence the edition’s status? Should there be a review process for third-party contributions? Or is it old-fashioned to even think in terms of ‘third parties’? Robinson speaks of the edition as a ‘mutual enterprise’. Editorial institutes, such as the Huygens Institute, will need to rethink their role, as scholarly editions evolve into centrepieces of ever-expanding repositories of text-related scholarship. References Best, Michael (2005), ‘Is this a vision? is this a dream?’: Finding New Dimensions in Shakespeare’s Texts’, CH Working Papers, http://www.chass.utoronto.ca/epc/chwp/Casta02/Best_casta02.htm, accessed 2005-11-13. Boot, Peter (2005), ‘Advancing digital scholarship using EDITOR’, Humanities, Computers and Cultural Heritage. Proceedings of the XVI international conference of the Association for History and Computing 14-17 September 2005 (Amsterdam: Royal Netherlands Academy of Arts and Sciences). Bradley, John (2003), ‘Finding a Middle Ground between ‘Determinism’ and ‘Aesthetic Indeterminacy’: a Model for Text Analysis Tools’, Lit Linguist Computing, 18 (2), 185-207. Eggert, Paul (2005), ‘Text-encoding, Theories of the Text, and the ‘Work-Site’, Lit Linguist Computing, 20 (4), 425-35. Fielding, Roy Thomas (2000), ‘Architectural Styles and the Design of Network-based Software Architectures’, (University of California). Mueller, Martin (2005), ‘The Nameless Shakespeare’, CH Working Papers, http://www.chass.utoronto.ca/epc/chwp/Casta02/Forest_casta02.htm, accessed 2005-11-13. Robinson, Peter (2003), ‘Where we are with electronic scholarly editions, and where we want to be’, Jahrbuch für Computerphilologie, http:// computerphilologie.uni-muenchen.de/jg03/ robinson.html, accessed 1005-11-13. Siemens, Ray (with the TAPoR community) (2005), ‘Text Analysis and the Dynamic Edition? A Working Paper, Briefly Articulating Some Concerns with an Algorithmic Approach to the Electronic Scholarly", "article_title": "Third-Party Annotations in the Digital Edition Using EDITOR", "authors": [{"given": "Peter", "family": "BOOT", "affiliation": [{"original_name": "Huygens Instituut, Department of e-Research", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}