{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Since the middle of last the decade investments in large-scale e-infrastructures for the humanities have risen enormously. Projects such as CLARIN, DARIAH and more recently CLARIAH, received funding. But there is growing scepticism concerning the value of these big infrastructures. Some even argue that methodological innovation and the modelling of humanities data is better served by small-scale research. This paper will focus on the possibility of creating tailor made solutions for researchers or Virtual Research Environments (VREs), while at the same time connecting, using and contributing to the big infrastructures. A use case will be presented: ‘The speaking map of the Netherlands’. First of all this paper will give an overview of this project. Next it will go into detail concerning the access, sharing and storage of the data. Finally, the paper will reflect on future steps in connecting research data and tools to infrastructures.", "article_title": "Combining tailor made research solutions with big infrastructures: The speaking map of the Netherlands", "authors": [{"given": "Douwe", "family": "Zeldenrust", "affiliation": [{"original_name": "Meertens Instituut (Royal Netherlands Academy of Arts and Sciences), Netherlands, The", "normalized_name": "Royal Netherlands Academy of Arts and Sciences", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/043c0p156", "GRID": "grid.418101.d"}}]}, {"given": "Marc", "family": "Van Oostendorp", "affiliation": [{"original_name": "Leiden University, Netherlands, The", "normalized_name": "Leiden University", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/027bh9e22", "GRID": "grid.5132.5"}}]}], "publisher": "University of Nebraska-Lincoln", "date": "2013", "keywords": ["interfaces and technology", "geospatial analysis", "sustainability and preservation", "repositories", "video", "other", "folklore and oral history", "audio", "archives", "information architecture", "multimedia"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}