{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  One of the challenges when designing image databases in the humanities is to provide interfaces that are drawn from the object being represented rather than from the technology used. In this paper we will discuss an image database of over 400 images that was built by a team of graduate students and faculty at McMaster University. The images relate to carving technique on Trajan's Column, one of the most extensive and important surviving sculptural monuments of ancient Rome. In addition to various text-based search tools, we also created a cartoon sketch interface to the entire frieze of Trajan's Column that allows users to move around a virtual column to access the images and to see them in narrative context. This virtual column is an example of a content driven interface to an image collection that is based on the subject matter of the collection. Trajan, Roman emperor from AD 98 to 117, has generally been remembered as a 'good' emperor. A gifted general, he was close to his soldiers and led them on a number of campaigns which substantially expanded the Roman empire. Two of these campaigns, the first and second Dacian wars, are commemorated on Trajan's column: a 100 foot tall marble column decorated with a continuous, upwardly spiraling, sculpted frieze. The scenes on this frieze are an invaluable source of information about many aspects of Roman military practice, imperial ideology, and also sculptural technique. The column still stands today in its original place in the Forum of Trajan in Rome, but, due to its great height, visibility of individual scenes from the ground is quite limited; students and scholars must often rely on old photographs and plaster casts for the study of many details. In 1997 a team of graduate students and faculty at McMaster University were given access to a unique collection of over 400 slides taken by Peter Rockwell and Claudio Martini when Trajan's Column was being restored and had scaffolding around it. The images are primarily of details that show carving technique. In addition we were given access to a series of cartoon sketches of the entire column that show the narrative of the frieze. The challenge was to create an image database that would provide a context for these photographs so that scholars and students of Roman art could use these resources easily. The WWW site is located at <>. In this paper we will do the following: 1. Discuss the background of the project.This project was initiated by Peter Rockwell who was looking for a venue for making his collection of slides available to the research and education community. While he had published on the column, the full collection of images on which his research was based could not be published economically. A WWW site seemed the most effective way to make this collection available. The team was limited by the fact that the slide collection was in Rome, Italy and could not be removed to Canada for digitization. In this paper we will discuss the steps taken to digitize the images on site and build the database from information gathered by Peter Rockwell as part of his research. 2. Discuss the technical design of the WWW site.After initially experimenting with a design that used hundreds of static WWW pages we developed a dynamic database that could generate the pages for the individual images on the fly. This gave us the freedom to easily alter the interface of the image pages and make site-wide changes in real time. This in turn allowed us to refine the design of the site in an interactive fashion as suggestions came in and users reported back. Finally the design of the database allowed editors involved in the project to make corrections over secure connections. In the paper we will comment on the virtues of moving to dynamically generated information for projects that involve teams of people, continuous correction and iterative interface design. We will contrast the development of this site with two previous projects, the Emily Pauline Johnson Archive () and the Cradle of Collective Bargaining site (). Both of these other sites use static WWW pages to hold the images. We will also comment on the choice of image resolutions that we settled on. In the Trajan site we make available small thumbnail images within WWW pages for timely access and links to medium and high resolution copies of each image and cartoon. This allows the user to look at and download images suitable for teaching and research. 3. Discuss the interface problems we faced and the solutions we settled on.The Trajan Project provides three ways for users to navigate the images. The first is to search the image database. The second is by using indexes generated from the database which give the user an overview of the keywords used. The third and most visual is to navigate the column using the cartoon sketches and click on the links to individual images. In effect we have two means of access that are driven by the technology and one that was driven by the content of the database. In the paper we will discuss at length the need for content-driven interfaces that provide access to users to images in ways that correspond to the original artifact. Content-driven interfaces cannot be standardized because they vary according to the artifact(s) represented, but they provide a way of organizing information that the user familiar with the area can use. In our case we used the column as a whole as a visual index to the collection. The visual index not only provides access but creates a context for the images which would be hard to abstract from the database. This visual context augments the interpretative essays that introduce the site. 4. Conclude by discussing uses and benefits of the site.As part of this project we have been showing the site to interested academics to get their feedback on the interface and to get ideas about how it might be used. As many of the images were taken to document carving techniques used in the sculpting of the frieze, this site is of greatest use to those interested in Roman carving. Many of the images, however, contain enough detail to be useful to those interested in Roman sculpture in general or those interested in studying Roman military equipment and activities. The WWW site provides an economical alternative to print for research image collections to be made available. In addition, the cartoons provide a continuous sketch of the narrative of the column that can be downloaded and annotated by those interested in this depiction of the events around the Dacian wars.   Viewers invited to try the site have commented on how they could use the high-resolution images and cartoons for teaching purposes since they are freely available and easily accessed. These types of comments have led us to think about the image database as not only a coherent research and teaching collection, but as an accessible collection of free images that can be mined by those who are shifting to electronic teaching tactics. Whenever you make a digitized collection of images available you are also providing the equivalent to academic clip art which can be reused in ways that are only remotely connected to the original content. This unintended outcome from the digitization of images will be discussed in the conclusion of the paper.   ", "article_title": "Trajan's Column: Building a WWW Image-Database", "authors": [{"given": "Geoffrey", "family": "Rockwell", "affiliation": [{"original_name": " McMaster University, Canada  ", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}, {"given": "Gretchen", "family": "Umholtz", "affiliation": [{"original_name": " McMaster University, Canada  ", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}, {"given": "Michele", "family": "George", "affiliation": [{"original_name": " McMaster University, Canada  ", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}, {"given": "Martin", "family": "Beckmann", "affiliation": [{"original_name": " McMaster University, Canada  ", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}, {"given": "Paul", "family": "Barrette", "affiliation": [{"original_name": " McMaster University, Canada  ", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}], "publisher": " University of Glasgow ", "date": "2000", "keywords": ["Digital Resources"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}