{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Electronic literature poses several exciting challenges and questions to literary scholars:  How do we balance our interpretations of digitally born works against the specific modes of production that make such works possible? How do our conceptions of authorial intent shift in relation to works that solicit active participation from their readers? How do we account for readers’ participation in such works, as well as the way their experiences shape and re-shape the text? In this paper I offer one strategy of interpretation that cuts across some of these questions: tracing the path of direct address in works that are digitally born, a technique that both emerges and departs from conventional literary practice.  When I visit a certain website, I am greeted in a peculiar fashion: an animated avatar with a human form speaks to me, blinks at me, and follows my mouse movements on the screen with her eyes while I read. On another site, a string of text hails me and addresses me by name, purporting to welcome me to all the treasures contained within its digital domains. As startling as these salutations initially seemed and as commonplace as they have become, I remain intrigued by their overt and shameless invocation of the reader — in this case, me. Strictly speaking, this mode of address should not be possible, at least not according to the familiar conventions of literary tradition.  In Anatomy of Criticism, Northrop Frye states the matter unequivocally: “Criticism can talk, and all the arts are dumb…there is a most important sense in which poems are as silent as statues. Poetry is a disinterested use of words: it does not address a reader directly” (4). While the examples of address above are decidedly not the poetical specimens Frye has in mind, his stance nevertheless serves as a firm response to a larger problem, one that has endured since the time of Socrates and persists to this day, a problem that can be crudely summarized in the following terms: there has always been something of a gap between the written word and its reception. Each time I see my own name staring back at me, however, I question whether the gap between text and reader has been in some way bridged, or at least contracted. Each time the avatar speaks to me, I am unable to locate myself in relation to the text no matter which paradigm I might use to explicate our relationship. Within a spectrum bounded at one end by the New Critical emphasis on textual autonomy and at the other by the “virtual” text that emerges necessarily as a correspondence between author and audience in reader-response theory, I do not know where I stand. With the announcement of my own name, I am aware that I have been identified, and therefore can no longer even maintain the convenient illusion of being, as a reader, either ideal or implied.  I have been specified. The “text,” such as it is, has called me out. The spectrum I have identified here is, of course, absurdly streamlined and unequally weighted. The New Critics exclude the reader’s thoughts as a given principle, while reader-response theory alone has perhaps generated more ways of labeling its reading audience than the sum of other critical interventions combined — in addition to offering a strong and convincing counterpoint to Cleanth Brooks’ ideal reader, Wolfgang Iser’s implied reader is only one star in a constellation of terms that includes the mock reader, the actual reader, the fictionalized reader, the hypothetical reader, the narrative reader, the ideal narrative reader, and the “real” reader, not to mention Stanley Fish’s interpretive reading communities (Brooks, 24; Iser, The Implied Reader, xii; Rabinowitz, 125-128; Fish, 219). In all of these models of reception, the impulse to name the reader, to re-assert her importance in the construction of textual meaning, still participates in the tacit agreement that this reader, whoever she may be, is never fully concretized by the written text. How could she be?  Rather, a “virtual” text emerges as a sort of ghostly correspondence between the two, one that is nigh on impossible to trace.  In the words of Iser, “It’s difficult to describe this interaction…because…of course, the two partners in the communication process, namely, the text and the reader, are far easier to analyze than is the event that takes place between them” (“Interaction Between Text and Reader,” 107).   The hypothesis that I would like to test in this essay is that works of electronic literature push the issue of responsibility and specificity into uncharted readerly terrain. What if, in certain examples of electronic literature, direct address online were specific to you, the reading reader, and not an implied reader? Put more specifically, pressed even further, what if direct address online were to make traceable the ghostly correspondence between reader and text that Iser outlines? This is not as far-fetched as it seems. As we shall see, the reader’s participation in some examples of electronic literature is required for textual constitution in ways that are fundamentally different from even the most successful and extreme examples of non-linear narrative practices found in print.  In the case of electronic literature, direct address functions to bring the text into being, by signaling the reader and requiring a response of her. Even more remarkable, this response has the ability to become a part of the initial text, such that the text that emerges is literally constituted through the feedback that exists between the reader’s actions and the author’s words.  While many claims about interactivity and customization have been made about electronic literature, there has not yet been a sustained attempt to consider the more specific mode of address that occurs in such works in relation to overtly literary practice.  In the space that follows I attempt to remedy this by considering instances both subtle and overt that occur in select works of electronic literature — including Dan Waber and Jason Pimble’s “I, You, We,” Mary Flanagan’s [theHouse], and Emily Short’s “Galatea” — that signal, cue, or otherwise point outside themselves to the reader as she progresses through the text. If the use of the vocative in conventional literary texts has the ability to point not only to characters within their narrative confines, but to an entire social, political and cultural discourse that lies tantalizingly close, yet perhaps ultimately outside the textual boundaries, I explore whether modes of address in online works allow us to exceed these boundaries altogether.  ", "article_title": "e-Vocative Cases: Digitality and Direct Address", "authors": [{"given": " Lisa", "family": "Swanstrom", "affiliation": [{"original_name": "HUMlab, Umeå University, Sweden", "normalized_name": "Umeå University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/05kb8h459", "GRID": "grid.12650.30"}}]}], "publisher": "Centre for Computing in the Humanities, King's College London", "date": "2010", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}