{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Girolamo Cardano Project: the Knowledge and the Arts of the Renaissance is devoted to a major author in Renaissance philosophy and science, although not yet fully studied. We focus on our experiment on one of his work in medicine, the Contradicentia medica, according to the methodological approach of the semantic web ontology. The multidisciplinary nature of the text, its encyclopedic references and citations, its many sources, ancient and modern, explicit and implicit, make the Contradicentia a significant case study for the methodology adopted. Our aims are:   making available online the digital edition of the Contradicentia and its transcription together with other texts related to it  providing a collaborative environment for editing, reading, studying, researching, and posting annotations and comments. An ontology has been designed to tackle the complexity of the Contradicentia, reconstructing Cardano’s ideas in medicine and philosophy of nature, and capturing knowledge about significant contextual information.", "article_title": "Ontology and collaborative knowledge environment in Digital Humanities: the Cardano Case", "authors": [{"given": "Damiana", "family": "Luzzi", "affiliation": [{"original_name": "Fondazione Rinascimento Digitale, Italy", "normalized_name": "Fondazione Rinascimento Digitale", "country": "Italy", "identifiers": {"ror": "https://ror.org/057n0mb56", "GRID": "grid.424448.a"}}]}, {"given": "Marialuisa", "family": "Baldi", "affiliation": [{"original_name": "Università degli Studi di Milano, Italy", "normalized_name": "University of Milan", "country": "Italy", "identifiers": {"ror": "https://ror.org/00wjc7c48", "GRID": "grid.4708.b"}}]}], "publisher": "University of Nebraska-Lincoln", "date": "2013", "keywords": ["ontologies", "semantic web", "software design and development", "linking and annotation", "renaissance studies"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}