{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The aim of this study is to explore the mechanisms of digital contextualisation with respect to literary studies. Reversing Willard Mc Carty’s definition of the field (“Humanities computing is an academic field concerned with the application of computing tools to arts and humanities data or to their use in the creation of these data”), I wish to examine in what way literary tools, in the broadest sense, apply to digital and digitised documents; and, in return what these findings add to literary studies and more specifically to literary analysis proper. More specifically, I intend to show in what respect the notion of the “Gradiva complex” in its widest acceptation (breathing life into a fixed representation such as a statue), can apply to multimedia representation through the concrete study of two different interfaces. In reference to this, I shall first briefly comment upon the vexed link between modernity and tradition, a paradox emblematic of Humanities Computing which harmoniously blends the old and the new, giving a new lease of life to past ideas. Humanities Computing provides old representations with a brand new and dynamic frame. Such original context necessarily alters what it displays and may therefore lead to new discoveries. This is why we should take a fresh look at old methodological habits and old academic divides. Thanks to elaborate interactive devices, what up until now seemed fixed and almost fossilised is literally brought back to life and made more accessible to each one’s sensitivity. This is highlighted in the CD-ROM Freud, Archéologie de l’Inconscient where a sophisticated multimedia environment stages, among other things, the way in which memories are repressed. The section entitled “Gradiva” - referring to Freud’s famous 1906 essay Delusions and Dreams in Jensen’s Gradiva – digitally illustrates how Jensen’s short story acts as a literary parable for the psychoanalytic process of repression, disclosing both the workings of the unconscious and those of literature - more specifically here, the metaphorical process. As we explore the CD-ROM and use the pointer to drag to the centre icons or hot-spots that would otherwise remain partly hidden in the corners1, an eerie music starts playing. The sounds echo the whirl of smoke that runs across the screen acting as some kind of Ariadne’s thread for the whole information display; it is an aesthetic and vivid reminder of Freud’s presence. “Gradiva”, the name given to the Pompeii bas-relief representing the protagonist’s obsessive dream, is visually present at the centre but gradually buried under a pile of cinders. Meanwhile, a male voice-over reveals that the stone woman is a masked figure for a long-forgotten love. The way in which information is made accessible prevents the user from random investigation. If he or she remains passive, the screen is blurred; it is only when the user deliberately points to a specific element that the latter figure emerges from an ever-changing background (the process sometimes requires both patience and reflection, as when the next page is solely made accessible by piecing a jigsaw together). The designing choices (roll-over, invisible/visible layers) coincide with the issue at stake: the will to make sense of symptoms on the one hand, of signs and symbols on the other; a difficult quest for knowledge and understanding that mirrors both the approach of psychoanalysts and of scholars. The digital extract briefly evoked here can be interpreted as a modern expression of the “Gradiva complex”: the desire to breathe life into a fixed and cold representation. Such complex typifies the graphic designer’s art or perhaps his or her fantasy. In this particular case, even though the CD-ROM is meant as a general introduction to Freud’s discoveries, the fact that it relies on a multimedia support implies constant cross-references not only to different forms of representation (static or dynamic, visual or auditory), but to different sources of knowledge (cinema, literature, photography, biology, medicine) that shed light on each other and add to the revivifying effect of the tool. Digital contextualisation enhances our own understanding of each field’s specific nature by hyperlinking it to what it isn’t: maps, music, historical data etc. As McCarty puts it: “Humanities computing [...] is methodological in nature and interdisciplinary in scope”. In the CD-ROM Georgian Cities, broaching 18th century Britain, a short animation accessible in the section entitled “A rhetorical comparison”, aptly illustrates ICTs’ metonymic nature: a quotation taken from Henry Fielding’s The History of Tom Jones mentioning one of Hogarth’s prints (The Morning) pops up unawares from each corner of the screen while the parts of the engraving successively referred to, are highlighted on the copy displayed next to the words: “[Miss Bridget] I would attempt to draw her picture, but that is done already by a more able master, Mr Hogarth himself, to whom she sat many years ago, and hath been lately exhibited by that gentleman in his print of a winter’s morning, of which she was no improper emblem, and may be seen walking (for walk she doth in the print) to Covent-Garden church, with a starved foot-boy behind, carrying her prayer book.” [book one, chapter XI]. The preterition device used by the narrator who initially “refers to [Miss Bridget] by “professing” not to do so, consists in the ekphrastic depiction of one of Hogarth’s works. In the text, the witty depiction leads to the sketching-out of an almost grotesque figure. In the CD-ROM, the duplication of the print, juxtaposed with the text discloses the writer’s technique. Once faced with the actual visual representation, the reader is made to understand the ekphrasis’ literary purpose – to add distance between the subject and the imaginary object, to conceal whilst feigning to disclose. The object of literature and that of art in general remains unattainable, it lies beyond signs, beyond the visible. In the examples aforementioned, the processes depicted seem to be duplicated by the multimedia device. The promotion of freedom that ICTs permit, along with their inherent dynamism, go hand in hand with the surfacing of cognitive processes invisible up to that point. Therein lies ICTs’ main interest in terms of innovative academic research. Humanities Computing formally overcomes the paradox between the old and the new, it also gives rise to unique questioning. It stresses the link which exists between the invisible but apt guidance involved in browsing and the interactive dimension of the tool. This link is an inextricable entanglement between apparent freedom and subtle guiding that has forever existed (notably with the literary notion of narrative viewpoint), but which is made more apparent here. Moreover, ICTs bring to light the tie that exists between creativity and learning; from objective data gathering and display, to the freest associations of ideas, thanks to interactivity. All echo the way we learn what we learn: willingly and objectively but also haphazardly and subjectively. We learn because we want to or we have to, but also because the world leaves its mark onto us. Instead of showing how new technologies can implement humanities technically-wise, I would therefore like to show how the new medium enhances literary theory in itself; in other words - how does praxis affect theory? How from the objective compilation of documents, all rationally organised and displayed, does one move to the more irrational, and the more creative? How does one shift from the objective, the technical and the logical to the more poetical association of ideas; from knowledge acquisition to creativity? If one follows the statements put forward by the philosopher Paul Ricoeur in The Rule of Metaphor, the metaphorical process - at the core of all literary practices - stems from the context not the actual word. It is the whole that prevails, not the part; or rather, the whole is meant in each of its parts and vice-versa. Once again, isn’t it most fortunate that the new medium should now be utilized in order to enhance these very ideas? To illustrate these points, I will use a Powerpoint presentation displaying relevant recorded extracts taken from the two cultural CD-ROMs aforementioned.", "article_title": "Digital Humanities or the Gradiva Complex", "authors": [{"given": "Séverine ", "family": "LETALLEUR", "affiliation": [{"original_name": "English Department,     Université de Paris-Sorbonne (Paris IV)", "normalized_name": "University of Paris", "country": "France", "identifiers": {"ror": "https://ror.org/05f82e368", "GRID": "grid.508487.6"}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}