{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  Introduction “Humanities on the Z-axis” is an interdisciplinary research project that works across modernist studies, geospatial humanities, and desktop fabrication. Through a combination of techniques in three-dimensional (3D) fabrication, geospatial mapping, speculative computing, and pattern analysis, z-axis research expresses the geospatial narratives of modernist novels by geo-referencing them and then using that geo-data to transform base layers of maps from the modernist period. The output of the research includes warped, 3D maps of cities (e.g., Paris and Dublin) central to modernist literary production. These maps can be viewed as 3D models on a screen or as physical prototypes in hand, and they are currently being transformed using geo-data drawn from novels by Djuna Barnes, James Joyce, and Jean Rhys. Ultimately, they show how modernist authors wrote the city, and findings suggest they contradict existing research in modernist studies about how, exactly, cities are expressed in modernist novels.   Research Problems This project addresses two specific research problems that currently exist across geospatial humanities and modernist studies. First, in fields such as digital humanities, geospatial mapping techniques (Moretti 2005) and data visualizations (Bostock 2012) tend to produce isomorphic cartographies or flat representations of data (Drucker 2011), even when literature resists this type of representation. One consequence of these flat or isomorphic approaches is that they tend to ignore the importance of subjective experience to literary criticism (in particular) and the humanities (in general). Second, and related to the first point, mapping techniques in geospatial humanities research can too easily be applied across literary periods without regard to the historical, material, or formal differences between texts, especially when something like Google Maps or Google Earth is the core technology. As a result, geospatial methodologies do not always persuasively correspond with the literary period, aesthetics, and textual particulars under examination. In response to these problems, z-axis research tailors mapping practices to suit the needs of literary periods. For instance, modernist literature deliberately resists isomorphic representations of geographic space (Vidler 2000). It also frequently treats the city as a medium, which is represented through fiction. Consequently, we argue that modernism not only calls for speculative, non-isomorphic modes of geographical expression (i.e., deformed maps) but also techniques that engage geographic representation directly (i.e., by distorting a map's base layer instead of \"pinning\" data on top of it). Additionally, the z-axis methodology involves a \"text-first\" workflow wherein the specificities of the text practically dictate the mapping method and, by extension, the aesthetics of the transformed, 3D maps.   Research Questions Z-axis research currently asks the following research questions of geospatial humanities and modernist studies:  How and to what extent do geospatial approaches to modernist novels benefit from distinct methods of analysis? With what implications on existing geospatial methods in digital humanities? How do modernist authors write the modernist city? Through 3D maps, how can we compare multiple, literary versions of the same modernist city, using the same base map? How can traditions in speculative computing (Drucker and Nowviskie 2004; Drucker 2009) and deformance (Samuels and McGann 1999) be applied to geospatial analysis and the modernist novel (Nowviskie et al. 2013)? In modeling and fabrication practices, to what degree (if at all) do 3D-printed maps afford interpretations that screen-based maps do not? Where visual expression is concerned, how do we put screen and print into conversation, and to what effects on the trajectories of scholarly communication?    Literature Review Many geospatial projects in digital humanities are largely two-dimensional and rely significantly on isomorphism. In the case of modernist cities, projects such as Walking Ulysses (2012) and WatsonWalk (2012) pin events to flat base maps. While the Scholars’ Lab at the University of Virginia is working on “social and spatial maps of modernist correspondence,” projects of this sort are rare in the field. Building on these initiatives, z-axis research uses historical maps as a medium for expressing social and cultural currents in the modernist city. At the same time, many writers interested in modernity have documented the constructed character of modernist geographies. Henri Lefebvre (1974) unpacks the social production of urban space, arguing that discrete social and spatial practices are embedded in different cities. Elsewhere, Foucault’s heterotopias (1984) and Marc Augé’s (1992) non-spaces chart the social construction of space as it ruptures geographic locales, producing overlapping and contradictory spaces. Embedding the social and political nature of modern cities into their narrative, many modernist novels construct the city or treat it as a medium. In his work on cartographical rhetoric in Ulysses, Jon Hegglund argues that the very act of mapping within the text is seen as a way of knowing. Richard Zeikowitz (2005) and Deborah Parsons (2000) similarly analyze the construction of feminist cityscapes in Jean Rhys's works, while Amy Wells-Lynn (2005) reveals the way Djuna Barnes and other female modernists “construct new Parisian geographic and literary female spaces” (79). When combined, geospatial research in both digital humanities and modernist studies suggests that specific mapping approaches to literary modernism underscore the importance of socially constructed, geographic space. Here, work in speculative computing (Drucker and Nowviskie 2004; Drucker 2009) and deformation (Samuels and McGann 1999) provides precedent when blending computation with humanities inquiry.   Method and Workflow When studying modernist novels, the current workflow for z-axis research is bifurcated into two processes. The first process involves geo-referencing plain-text versions of modernist novels, and includes the following steps: 1) use VueScan software to produce high-resolution scans (600 dpi) of the text; 2) run the text through ABBYY FineReader to render it machine-readable; 3) where necessary, correct the text; 4) geolocate the narrative of the text in XML (if a character appears in a certain location while imagining or talking about another location, then the location is tagged as the place where the narrative occurs); 5) conduct a word-count to see how many words are nested in certain geographic locations; 6) record these numbers in a spreadsheet; and 7) divide the number of words per location by the total number of words in the text to produce a ratio. The second process mobilizes the geo-data and ratio from the first process to transform historical maps in 3D. It includes the following steps: 1) use a high-quality scanner to digitize an archival map; 2) use Photoshop to convert the scanned archival map into a displacement map; 3) apply the displacement map to a flat subdivided mesh using Autodesk’s Mudbox, then scale the plane along its z-axis to render details from the displacement map as changes in elevation (figures 1-3); 4) procedurally apply the bulge function for each area indicated by the data model, warping the three-dimensional map along its z-axis (figures 4, 5), with differences in warping determined by the geo-data ratio; 5) use MeshLab to determine if the Mudbox model is watertight; if it is not, then automatically correct errors if they are not glaring; and 6) print the model using a desktop 3D printer.                  Findings One of the key findings of this research is the articulation of a methodology and workflow for expressing the geospatial narratives of modernist novels through transformance and speculative computing. Additional, related findings suggest that, contrary to an abundance of modernist scholarship (e.g., Hegglund 2003), James Joyce's Ulysses does not provide an isomorphic representation of Dublin. Instead, the novel presents a biased version of the city, privileging specific geographic areas over others. What’s more, in the case of modernist novels about Paris, constructions of the city are highly contingent upon constructions of sexuality, especially when Barnes's Paris is compared with that of Rhys. That is, the sexual politics of literary Paris dramatically influence how and what parts of it are represented in texts from the 1920s and '30s. Finally, where comparisons between screen and print media are concerned,  findings suggest that the latter not only affords tactile engagements lacking in the former but also bypass many visual design problems, including tendencies to squeeze too much complex information into a single frame or window. More generally, our findings suggest that the humanities can be empowered through the material transformation of scholarly communication, including evocative objects and publications in 3D.   Acknowledgements This research has been conducted at the Electronic Textual Cultures Lab and the Maker Lab in the Humanities at the University of Victoria with support from the Modernist Versions Project (MVP) and Implementing New Knowledge Environments (INKE). The research is supported by the Social Sciences and Humanities Research Council (SSHRC).  ", "article_title": "Z-Axis Scholarship: Modeling How Modernists Write the City", "authors": [{"given": "Alex", "family": "Christie", "affiliation": null}, {"given": "Stephen", "family": "Ross", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": "Jentery", "family": "Sayers", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": "Katie", "family": "Tanigawa", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": "", "family": "INKE-MVP Research Team", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}], "publisher": "EPFL, Switzerland", "date": "2014", "keywords": ["desktop fabrication", "3D modeling", "modernism"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}