{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "When Rudyard Kipling's Lahore scrapbooks became available to scholars in 1976, the clippings they contained confirmed his authorship of numerous unsigned pieces published in Anglo-Indian newspapers in the 1880s. Less commented upon were the three scrapbooks in the Kipling collection that had been filled by his father, John Lockwood Kipling, with clippings of his own writing for some of the same papers. One of Lockwood's clippings, the 4 June 1887 Civil and Military Gazette (CMG) leader \"A Word on Indian Progress,\" provides important reason to doubt recent arguments about Rudyard Kipling's multiculturalism - partly because significant circumstantial evidence suggests that Rudyard had a hand in its composition. The question of this paper is whether stylometric analysis supports the hypothesis of collaboration. For many years the standard narrative explained Rudyard Kipling's early success by imagining him peering into Indian and Anglo-Indian by-ways, achieving unmediated contact with British and Indian and Eurasian people in Lahore and Simla. But there is no evidence of such investigations during Kipling's first year in India. He joined his parents (he lived with them until 1887) in Lahore in October, 1882, and he began work as sub-editor of the CMG in November. While his 1884 letters document early extramural assignments, the 1883 letters suggest a hard routine that kept him at the office ten hours a day and otherwise at home. He was seventeen years old in 1883; it seems unlikely that he would have wandered the old city of Lahore. Instead, the young Rudyard Kipling discovered British India in the newspapers he read as a major part of his job and from his parents at home. One may find in 1883 issues of his paper many of the ideas that appear in his best known stories, and one may find his politics in the writing of his mother and father, who had lived in India since 1865. This conclusion leads us to question the view of revisionist critics like Sara Suleri, Zorah Sullivan, and Don Randall, who argue that one can see through Kipling's sympathetic understanding of the Indian people a nearly postcolonial ambivalence. But Lockwood's clippings provide a colonialist view that features no ambivalence. Particularly straightforward is \"A Word on Indian Progress,\" which offers a \"scientific\" justification of empire that both is congruent with the Kiplings' other writing on the subject and offers deep sympathy for the Indian people - but on the grounds of their racial inferiority. Rudyard probably edited his father's essay. He was in Lahore in June, so he would have read it before it was printed. In fact, the habit in the Kipling family was a kind of composition that invited collaboration. Lockwood notes in one scrapbook that Alice wrote one of his columns while he was ill; Rudyard and his sister collaborated on the 1885 Echoes by Two Writers; all four family members produced Quartette, the 1885 Christmas number of the CMG. Rudyard publicly thanks his father repeatedly for a deep knowledge of India. \"A Word\" justifies imperialism as a humane salvation for a people whose sordid lives cry out for the liberation by European civilization. The ultimate scientific causes of their condition are India's climate and the consequent \"limits set by Oriental prescription to the feminine mind.\" The heat in India \"enervates the mind and will\" and \"stimulates the passions.\" The effects of the climate have been magnified by Indian treatment of women. \"Hindu and Muhammadan women are literally imprisoned all their lives in cells which would be condemned as unfit for human habitation by the most barbarous prison-administration in existence. . . . The very talk of women thus confined is a clipped jargon, apt enough [only] for the expression of affection and the narrow round of housewifely duty . . . .\" Since \"these are the mothers of the people, . . . by the iron law of heredity, the peculiarities of their character and the limitations of their mental powers are faithfully transmitted to their children.\" That Lockwood's son read these \"facts\" in draft is nearly certain. That he shared in their presentation is likely. This likelihood, however, is based on historical evidence; the question is whether stylometrics can be used to support or reject the inference. Certainly, stylometrics has been used to examine collaboration, as in Brian Vickers' Shakespeare, Co-Author. However, previous studies focus on cases in which individual authors may have written discrete parts of a text. Rudyard and Lockwood Kipling are likely to have collaborated in a way more akin to thorough editing, revision, and re-writing. We begin by asking what stylometric techniques are appropriate in determining whether Rudyard did, indeed, have this kind of role in \"A Word,\" and we take a cue from John Burrows' distinction between \"open\" and \"closed games\" in \"Delta: a Measure of Stylistic Difference and a Guide to Likely Authorship.\" Open games are those \"where we are faced with an anonymous text but have little or no outside evidence to identify the most likely candidates\" whereas closed games are those in which \"only two or three writers are eligible candidates for the authorship of a particular text\" or the \"question is whether or not a particular writer (and no other) is the author\" (267). At least one element of the question of collaboration is clearly a closed game situation: is Lockwood (and no other) the author of \"A Word\"? About such closed games, Burrows suggests that we are relatively \"well equipped to form strong inferences\" utilizing methods \"currently employed in computational stylistics\" (267). One of those methods is the Burrows technique of using the relative frequencies of the forty most common function words as variables, performing a principal components analysis, and displaying the results on a scatter graph. We have run such an analysis, using six essays known to have been written by Lockwood and six known to have been written by Rudyard, as well as \"A Word.\" (The number of texts is limited because of the need to have texts of a sufficient length.) In the analysis, the first two principal components account for 64.57% of the variation in the data. The results are displayed in Figure 1. The results show discrete clusters that seem to differentiate the style of Rudyard on the one hand and Lockwood on the other, this being the case even when samples of Rudyard's short stories are included. Most important in attempting to determine authorship is that \"A Word\" does not cluster with other Lockwood essays in either this analysis or one that includes only essays by Lockwood. Possibly, \"A Word\" is an outlier, but, from this evidence, it would be difficult to argue that \"A Word\" is by Lockwood \"and no other.\" Given the historical evidence for Lockwood's authorship, it seems that collaboration could be a reasonable explanation for the difference in style between \"A Word\" and Lockwood's other texts. More compelling evidence for this explanation may be found in the results of a hierarchical cluster analysis using average linkage, of the same forty function words. (See Fig. 2) The dendrogram shows the close relationship among the known texts by Lockwood and also among the known texts by Rudyard. As well, it shows that \"A Word\" is more closely linked to Lockwood's texts than to Rudyard's but that the texts of the two Kiplings are more closely linked to each other than to a sample text from a t hird writer from the Civil and Military Gazette. In a series of analyses (in the full paper) using other sample texts, the results remain consistent. \"A Word\" shows slightly closer links to Lockwood's texts but is relatively closely linked to Rudyard's. The results do not prove collaboration, but they are what we would expect from a text in which Lockwood was the primary author but in which Rudyard had a role. In the conference, we would discuss the words that account for the variation in the data and attempt to suggest how they may offer evidence for collaboration insofar as the frequency of particular words is more consistent with Rudyard's practice than with Lockwood's. For instance, Lockwood uses the term \"has\" at a frequency about twice that found in any of Rudyard's texts, yet \"A Word\" uses the term at about the same frequency as found in Rudyard's texts and substantially less often than found in any of Lockwood's other texts. Looking at particular sentences allows us to see how revision and editing might account for these differences. It seems to us that stylometric evidence, when combined with historical circumstantial evidence, does allow for inference of collaboration in this case, an inference that has important consequences for our understanding of Rudyard Kipling's multiculturalism. ", "article_title": "Before Multiculturalism: Stylometric Analysis of a Collaboration by Lockwood and Rudyard Kipling", "authors": [{"given": "Peter", "family": "Havholm", "affiliation": [{"original_name": "The College of Wooster", "normalized_name": "College of Wooster", "country": "United States", "identifiers": {"ror": "https://ror.org/029zqs055", "GRID": "grid.254509.f"}}]}, {"given": "Larry", "family": "Stewart", "affiliation": [{"original_name": "The College of Wooster", "normalized_name": "College of Wooster", "country": "United States", "identifiers": {"ror": "https://ror.org/029zqs055", "GRID": "grid.254509.f"}}]}], "publisher": null, "date": "2004", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}