{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "   Figure 1:  The Rio VideoWall (Dara Birnbaum, 1989), installed at the Rio Shopping Complex, Atlanta. Image courtesy of the Smithsonian American Art Museum, NEA Birnbaum collection.   “Media Preservation between the Analog and Digital” is a project that centers on the development of a digital recreation of pioneering video artist Dara Birnbaum’s now-lost  Rio VideoWall (1989), the first  multi-screen artwork to be installed in a public setting in the United States. In its original instantiation, in downtown Atlanta, the work employed twenty-five identical 27” CRT monitors, stacked in a five-by-five grid, powered by eight LaserDisc players and proprietary computer code written specifically for the piece. Today, however, only a portion of the code remains; neither the CRT monitors, nor LaserDisc players, nor original computers, are in production, and to recreate the artwork—even in a lab setting—would involve a significant reimagining of the original piece. But there are additional considerations that extend beyond hardware and software: the  VideoWall was installed in  the Rio Shopping Complex, a mall in Atlanta’s Old Fourth Ward, a historically African American neighborhood. The artist was attuned to this, and designed the artwork to  combine scenes of the natural landscape that had been displaced by the mall with an unedited live-stream of CNN, an Atlanta-based company, all filtered through the moving silhouettes of mall patrons in real time. Neither the nature footage nor the CNN live-stream—let alone the mall patrons—presently exist (the mall was torn down in 2000), so a recreation of the artwork would need to identify footage that captures the spirit, if not the reality, of the piece. To do so would therefore involve an analysis of the themes engaged by the original artwork: the legacy of segregation, the 24-hour media cycle, surveillance culture, the relationship between art and commerce, and the Anthropocene. This paper will provide a brief overview of the project, with an emphasis on the conceptual challenges it engages, describe the recovery work underway, and describe the current work and next steps toward the  VideoWall’s ultimate recreation.   Recovering the Rio VideoWall : Conceptual Challenges  Recent seminars and symposia have explored the range of issues associated with doing digital art history (e.g. Harvard metaLab’s “Beautiful Data,” 2015, the Getty Foundation’s “Art History in Digital Dimensions,” 2016). At the same time, the field has devoted increasing attention to issues associated with digital preservation (e.g. the BitCurator initiative, or any number of conversations at the Digital Library Federation). And yet, with its hybrid analog/digital design, and its site-specific setting, the  Rio VideoWall presents a unique case study for thinking through the additional conceptual challenges related to the preservation of public media art. For instance, Matthew Kirschenbaum has argued that every media artifact “leaves a “trace,” by which he means a past that can be unearthed and understood. But what happens when the original artifact no longer exists, as is the case with the  VideoWall, which was dismantled and discarded in 1999? And what is the “trace” that is left by public art that makes use of technology as a material support, as in the  VideoWall’s CRTs and LaserDisc players, which are rarely understood in terms of their material properties? When considering the unique case of the  VideoWall, additional questions arise: Can the artwork’s original public setting can be reimagined in a creative way, perhaps online? Or should the  VideoWall be rebuilt physically, and installed in the city of Atlanta, and if so, where? (The original site has long been built over). Or should a recreated  VideoWall be incorporated into a museum’s collection, so that it can be benefit from institutional resources? But what would be lost by limiting community access?    Recovering the Rio VideoWall : The Digital Archive  The first phase of recovering the Rio VideoWall, as well as planning for its recreation, involves the creation of a public-facing digital archive that documents the remaining materials associated with the  VideoWall’s design, construction, and eventual demise. The archive includes Birnbaum’s original proposals and plans for the piece, her own 35mm slide documentation of the  VideoWall and her recently-recovered video footage of the artwork’s public opening, as well as correspondence, press clippings, and archival photographs of the site. The archive also features exhibits with demographic data and visualizations that illustrate the racial and economic makeup of the areas around the Rio Shopping Complex at the time of the mall’s opening in 1987, at the time of its destruction in 2000, and today. Eventually, the site will also feature oral histories of Atlanta citizens who experienced the work. These histories will provide access to lived and felt experiences often absent from the histories provided by critics and scholars, that are nevertheless an essential component of accounting for the impact of public art within a community.   Recovering the Rio VideoWall : The Digital Recreation  Following the completion of the digital archive, the project team will begin the second phase of the project—reimagining the  VideoWall in digital form. We are currently considering, and mocking up designs for, web-based, physical, and VR-based approaches to recreating the artwork. A web-based version might include visual overlays of the original site of the artwork on the current site. A physical recreation might involve a single, very large flat-screen display that could be separated into adjacent or tiling windows, drone footage of the chosen site, and touch-screen capabilities. A VR version of the work could be situated in a number of virtual locations, and would allow for diverse populations to interact with the artwork from around the globe. A workshop, currently being planned, will bring together scholars, conservators, designers, curators, and community organizers to discuss the computational and creative possibilities of each medium. In addition to describing the conceptual challenges associated with the piece, and highlighting certain key features of the digital archive, the paper presentation will present these mockups and solicit audience feedback in preparation for the final design and construction of the  VideoWall.   ", "article_title": "Media Preservation between the Analog and Digital: Recovering and Recreating the Rio VideoWall", "authors": [{"given": "Gregory", "family": "Zinman", "affiliation": [{"original_name": "Georgia Institute of Technology, United States of America", "normalized_name": "Georgia Institute of Technology", "country": "United States", "identifiers": {"ror": "https://ror.org/01zkghx44", "GRID": "grid.213917.f"}}]}], "publisher": "Name, Institution", "date": "2018", "keywords": ["repositories", "audio", "sustainability and preservation", "art and art history", "digitisation - theory and practice", "public humanities and community engaged scholarship", "film and media studies", "video", "archives", "English", "multimedia"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}