{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " The tricks of illumination and digital projection exploit the possibilities of contemporary technical tools—3D architectural mapping, sensors, software-enabled visual distortions, real-time image manipulation of the ever-growing, luminous flux of data—to introduce into public spaces a sense of the ‘technological uncanny’, a phantasmagorical urban world in which to the receptive viewer anything,  seemingly, is possible (Edensor, 2012, 1107).   For many creators of projection artworks, the topography of the built environment itself becomes a different kind of screen (Sassen, 2009, 29) to program and design to spectacular effect. But site-specific projection artworks can also be conceived not only as light and colour displays but as mixed-reality interventions that combine past and the present spaces in novel ways.  This paper will present on a set of public art interventions that seek to ‘surface’ archival recordings about a specific location using contemporary interfaces of projection design and acoustic installation. The paper will address two personal projects produced in 2014–2015 in Bathurst and Canberra that reflect intensive research into multiple film, sound, and image collections as resources through which to design and curate contemporary interpretative displays and events. These are presented alongside the projection work of artist Shimone Attie in Berlin during the early 1990s and the contemporary work of the Niño Viejo (‘Old Child’) collective in Valencia, Spain.  Reflecting across these different, site-specific projection pieces, the paper considers the use of digital projection as a form of ‘site-writing’, or writing a place as opposed to writing about it (Rendell, 2010). Where they draw from and recompose the ‘trace elements’ of past urban spaces, it reflects on how these different projection artworks might be understood to contribute to the ‘displacing forwards’ (Freud, 1901/1960) of contemporary memory practice, while opening up new territories for engaged digital humanities research.  ", "article_title": "Uncanny Projections / Site-Writing Places", "authors": [{"given": "Sarah", "family": "Barns", "affiliation": [{"original_name": "University of Western Sydney, Australia", "normalized_name": "Western Sydney University", "country": "Australia", "identifiers": {"ror": "https://ror.org/03t52dk35", "GRID": "grid.1029.a"}}]}], "publisher": "Paul Arthur, University of Western Sidney", "date": "2014", "keywords": ["repositories", "libraries", "archives", "museums", "video", "film and cinema studies", "sustainability and preservation", "archaeology", "audio", "multimedia", "English", "GLAM: galleries"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}