{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  Overview The Modern Art Iraq Archive (MAIA) project is a participatory content-management system to share, trace and enable community enrichment of the modern art heritage of Iraq. The focus of the project is thousands of works of art, many of them now lost, from the Iraqi Museum of Modern Art in Baghdad. MAIA is unique in that it not only documents the lost artworks, but also provides tools for community enhancement of those works, allowing contribution of stories, knowledge and documentation to the system, as well as syndication of the content elsewhere on the web.  For the past eight months, participants in this project have been building a comprehensive virtual archive of the works in the Museum's various galleries, including a database of images and information about the objects (artist name, title, date, dimensions, subject matter, medium, condition, current location, related works, etc). These significant national treasures are displayed in an open format that invites participation from users worldwide, including the Iraqi national and expatriate communities, and users will be encouraged to help identify and understand individual pieces. The MAIA system, which integrates two extant content management systems, Open Context and Omeka, will provide a valuable research tool for scholars, students, as well as the general public, but most importantly for Iraqis: these works of art form an important expression of the Iraqi national experience.    Project History The Iraqi Museum of Modern Art, formerly the Saddam Center for the Arts (Markaz Saddam lil Funun), was established in 1986 as Iraq's museum of modern and contemporary art. During the invasion of Baghdad in April 2003, the structure was severely damaged by fire and looters. Without security and protection from the occupying powers after the collapse of the Baath regime, its collections of approximately 8,000 modern and contemporary Iraqi paintings, sculptures, drawings and photography, dating from late 19th century until April 2003, were entirely looted. Prof. Nada Shabout's research based on sources inside of Iraq indicated that while some works were smuggled outside of the country, most works were still on the market for sale in Baghdad. At an early stage after the invasion, about 1,300 works were found at the National Gallery's basement. They have since been are stored at a facility administered by the Ministry of Culture, without restoration, authentication or archiving.  While the fate of the collection is tragic enough, what exasperated the situation further is that the Museum's inventory and documentation disappeared with the works as well, meaning that missing works cannot be traced or repatriated. Nada Shabout has spent the last three years collecting and digitizing all available information about the lost works through meetings with artists, gallery owners, and art educators. In this time, she has found that the situation is dire, with improper documentation and accessioning procedures, scant publication and recording in catalogs, and a lack of inventory for the two decades before the invasion. In the end, the richest available information is in fact in the recollections of individual people; hence, the imperative to develop ways for people to share their knowledge of these works.    Approach The MAIA prototype integrates two existing, open source, content delivery systems, Omeka and Open Context. Omeka (http://omeka.org/) is an open source, collections-based publishing platform that allows individuals and organizations to share collections, structure content into exhibits and write essays. It offers customizable themes and a suite of easy-to-install add-ons for customizing site appearance and functionality. Omeka brings Web 2.0 technologies and approaches to academic and cultural websites to foster user interaction and participation, while making design easy with a simple and flexible templating system. Robust open-source developer and user communities underwrite Omeka's stability and sustainability.This section has been adapted from: http://omeka.org/about/  Open Context (http://www.opencontext.org) is a web-based, open access data publication system that supports enhanced sharing of museum collections and field research data by enabling researchers and cultural heritage collections managers to publish their primary field data, notes and media (images, maps, drawings, videos) on the web. It is free and uses open source software built on common open source technologies (Apache-Solr, MySQL, PHP, and Dojo Ajax) widely accessible and supported by a vast global developer community. Open Context uses Apache-Solr to power a \"faceted browse\" tool, which allows for much more informed navigation and understanding of collections than the \"type and hope\" approach of simple key-word searches. This component also delivers web-services, enabling a feed-based approach to syndicating content and integrating collections distributed across the web. These web-services represent a powerful, scalable, and elegantly simple way to facilitate aggregation across multiple collections.  MAIA's approach integrates features of these two systems to maximize the collection's reach, discoverability and creative reuse. Omeka offers a user-friendly platform for building, customizing and organizing the MAIA collection, as well as allowing options for contributions and comments from the community. However, search functionality is limited and Omeka content is largely confined within each Omeka instance, despite its support of OAI/PMH and some feed capabilities. Finally, while Omeka offers stable URLs for every item, Omeka users need to make additional arrangements for archiving their collections. Open Context complements Omeka's capabilities with a faceted browse \"plugin,\" offering powerful web-service capabilities that enable distributed search and syndication of content. These capabilities make Open Context a more powerful platform for supporting aggregation and mashups. Open Context's faceted browse tool provides a much more informed overview of a collection, showing fields associated with content even for custom metadata, allowing exploration beyond simple searches. The Open Context plug in will also greatly expand Omeka's feed capabilities, allowing users to draw custom feeds tailored to their specific interests (such as a particular artist, time period and/or region). Any Omeka site implementing the Open Context faceted browse plug-in will be indexed by Open Context, opening up Omeka content to dynamic searching across multiple collections. Finally, Omeka collections using the Open Context plug-in will benefit from accessioning by the California Digital Library. Thus, Omeka's user-friendly collections management and publishing functions are joined with Open Context's powerful web services to increase the reach and potential for reuse of MAIA content.  Taking advantage of the flexibility in content-management and sharing provided by the integration of these two powerful, open source systems, the MAIA platform is available for free on the web and offers the following additional features:  Localization: All static content in the system is translated into Arabic. Participatory tagging and commentary features are also available in multiple languages. Community input: A tagging system allows users to comment on any item in the database, thus enriching the content and helping build a memory of the lost works. Users can also link to external content related to the works. Citation: Easy citation retrieval makes MAIA a useful research tool. Unique citations are generated for every single item in the system, and Omeka expresses bibliographic metadata in a format that the popular Zotero citation management tool can recognize. Copyright Pragmatism: The creators of many of the works included in the website are unknown, and it is not possible to get permissions from them to disseminate their work online. However, such dissemination is essential if these creators are ever to be identified. Therefore, this project hosts works even in cases where the creator is not known. A clear \"take-down\" policy ensures that artists can request that their work be removed from the website. In cases where copyright permissions can be obtained, a Creative Commons Attribution, Noncommercial, Share-alike license http://creativecommons.org/licenses/by-nc-sa/3.0/ is used.      Outcomes By archiving and documenting the known modern artistic works from the Iraqi Modern Art Museum, this project contributes to the preservation of Iraq's cultural heritage. However, the project's greater success lies in the amount of exposure and the quantity and quality of community participation that the project garners. That is, free global exposure of the known content is helpful and informative, but active community input that enriches the works, and perhaps locates some of the lost works, is ideal. We are currently working on maximizing the dissemination of MAIA content, through the use of blogs, interviews, publications and presentations. Our long-term vision for MAIA is that it will become a virtual museum, where visitors will navigate through a map-based interface, exploring galleries and viewing individual works of art, ideally in the place they stood before the museum was damaged and many of the works lost. In this way, the public will have a visual understanding of the number of works still missing or for which no documentation exists. The emotional impact of seeing blank sections of gallery walls is far greater than reading a number or percentage, and will give the public a more profound understanding of the loss of these works of modern Iraqi heritage. On a more positive note, a visualization of the rich, related content around many of these works will enrich the visitor's experience and understanding of any single work.   ", "article_title": "The Modern Art Iraq Archive (MAIA): Web tools for Documenting, Sharing and Enriching Iraqi Artistic Expressions", "authors": [{"given": " Sarah Whitcher", "family": "Kansa", "affiliation": [{"original_name": "The Alexandria Archive Institute USA", "normalized_name": "Alexandria Archive Institute", "country": "United States", "identifiers": {"ror": "https://ror.org/05691ev83", "GRID": "grid.446377.5"}}]}, {"given": " Nada", "family": "Shabout", "affiliation": [{"original_name": "The University of North Texas USA", "normalized_name": "University of North Texas", "country": "United States", "identifiers": {"ror": "https://ror.org/00v97ad02", "GRID": "grid.266869.5"}}]}, {"given": " Saleem", "family": "Al-Bahloly", "affiliation": [{"original_name": "University of California, Berkeley USA", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}], "publisher": "Centre for Computing in the Humanities, King's College London", "date": "2010", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}