{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  The authors of this paper have been involved in preparing a series of enhanced publications as part of a national initiative to introduce ‘enhanced publishing’ to scholars in the Netherlands. One of these publications is the scholarly monograph Virtual Knowledge, in production at MIT Press. This paper reviews different approaches to enhanced publications. In particular, it reports the intentions, challenges, achievements and tensions in the actual workflows in preparation of the Virtual Knowledge enhanced publication version of the manuscript. An enhanced publication can generally be described as scholarly text and related materials presented in a Web environment with interlinking of document ‘objects’ (Jankowski et al. 2011). These objects may include: research data, instrumentation, additional analyses, post-publication addendums, and exchanges between book authors and readers. These objects are often identified in a manner facilitating access and involving utilization of uniform standards of identification. Basic enhancements to this particular volume involve preparation of supplementary resources (e.g., links, blogs, appendices), chapter visualizations (e.g., animations, figures, tables), hyperlinks to materials in and external to the book, and opportunities for conducting searches within and external to the book. The enhancements also emphasize integration of informal scholarly communication (e.g., social media) with traditional academic publishing. The enhanced component also emphasizes integration of informal scholarly communication (e.g., social media) with traditional academic publishing, and the efforts to achieve this aspect are highlighted in the paper. The overall design strategy for this project was oriented toward introducing book content on the web with two primary objectives in mind: 1) to facilitate compatibility with contemporary Web-based discursive practices, and 2) to facilitate content interoperability in both Web 2.0 and Semantic Web formats. Challenges involved with the first objective are related to varied work practices among participating authors. In addition to variation in skills, competencies, and preferences in working with the web medium, the benefits from the required additional work remain uncertain. The individual career benefit from publishing a book is in most cases largely the same with or without the Web-based enhancements. The second objective entails integration of two distinct content structures. The resulting design is a hybrid platform that leverages Web 2.0 participatory modes of scholarly communication combined with formalized content structures imposed by Semantic Web formats. Differences in the affordances provided by these two content schemas brings into focus contemporary tensions related to scholarly communication in the digital era and raises interesting questions about the emerging role of digital media in scholarly communication. The expected contribution of this approach to enhanced publications pertains to consumption of the book content by both humans and machines. The platform facilitates situating a published book among related scholarship, institutional settings, and with regard to prior work from contributing authors. This is seen as particularly useful for interdisciplinary research, and especially within a still emerging field. This sort of contextualization is by itself envisioned as value added from the standpoint of consumers of book content and for those engaging in Web-based intertextual discourses. Another contribution is the ways in which the book content is structured in the Web environment. Facilitated through links, categories and tags, and the co-location of related materials, contextualization of content also creates object relationships, e.g. between an author and with regard to intertextual relationships, which are readable by search engines. Fundamental to achieving these objectives is an understanding of the Web as an environment that is dynamic and evolving, which is far removed from not only the printed book, but also from the environment of digital repositories. ", "article_title": "Promise and Practice of Enhanced Publications to Complement Conventionally-Published Scholarly Monographs", "authors": [{"given": " Clifford", "family": "Tatum", "affiliation": [{"original_name": "eHumanities Group, Royal Netherlands Academy of Arts and Sciences, The Netherlands", "normalized_name": "Royal Netherlands Academy of Arts and Sciences", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/043c0p156", "GRID": "grid.418101.d"}}]}, {"given": " Nicholas", "family": "Jankowski", "affiliation": [{"original_name": "eHumanities Group, Royal Netherlands Academy of Arts and Sciences, The Netherlands", "normalized_name": "Royal Netherlands Academy of Arts and Sciences", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/043c0p156", "GRID": "grid.418101.d"}}]}, {"given": " Andrea", "family": "Scharnhorst", "affiliation": [{"original_name": "eHumanities Group, Royal Netherlands Academy of Arts and Sciences, The Netherlands", "normalized_name": "Royal Netherlands Academy of Arts and Sciences", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/043c0p156", "GRID": "grid.418101.d"}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}