{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "    Fig. 1: Elizabeth Losh and members of Software Studies Initiative explore media visualization of 113 fffcvideo public addresses by U.S. President Barack Obama. Visualizations are available at http://lab.softwarestudies.com/2011/09/digging-into-global-news.html   Television news often serves as the first, most vivid draft of history and shapes the conventions of political speech and civic participation around the world, but undertaking systematic analysis of large digitized corpora of broadcast news video archives and even smaller corpora of government information videos in the public record presents a number of technical, methodological, and institutional challenges. Although a deeper understanding of how the news is represented in moving images promises to improve access to historical records, participation in public dialogue, and education at all levels, large corpora of video news programs are considerably more difficult to catalog, mine, and visualize than text news collections. Furthermore, new forms of dissemination, annotation, and commentary made possible by the Internet are rapidly transforming video news consumption on a global scale. At the same time, traditional newspapers of record are incorporating more multimedia content, so new computational methods such as video search will become increasingly necessary for researchers working with all news collections. By collaborating with archivists and computer scientists, it is possible to analyze visual rhetoric in very large video collections using media visualization  “Visualizing Global News” studies how excerpts from large collections of political speech videos with historically significant personages are remixed into even larger collections of news broadcasts. It applies new techniques in search and visualization to aid both humanities researchers and the greater public interested in exploring the visual details, aesthetic features, and narrative context of source footage that is reused in news broadcasts. The project focuses on materials from four political figures who appear in video news from 2001 to 2011 and tags and visualizes a rich set of intersecting corpora: newscasts from the US program Democracy Now!, the Qatar news channel Al Jazeera English, the top-rated Dutch news show NOS Journaal. This video corpus contains over 30,000 separate news programs, and over 2,000 videos of political speeches.  As participants in the Digital Media Analysis, Search and Management (DMASM) international workshops, we are well aware of the technical problems plaguing automatic systems and that even distinguishing foreground objects from backgrounds can be challenging. Nonetheless, the MediaMill technology has performed well in the yearly TRECVID benchmark competition, and ImagePlot can create compelling visualizations working with key frames. Our presentation aims to provide a policy overview of the opportunities and challenges of DH with global video news archives. Currently the “big data” problem of identifying heterogeneous sources in moving image archives has been largely funded by corporations interested in protecting intellectual property and state entities interested in surveillance. Without digital humanities scholars playing a larger role and generating research questions that merit publication, the most vivid aspects of the historical record are likely to remain under-theorized and analyzed without large- scale comparative study across nations and periods.     Visual rhetoric has a long tradition in the humanities that includes analysis of symbolic objects in portraits of world leaders or the choreography of their oratorical performances. However, contemporary news broadcasts present historical figures in the public record in increasingly visually complex ways that use massive collections of heterogeneous and frequently unsourced footage, motion graphics, and digital effects. In this project we use new computational and visualization techniques to foster new forms of humanities scholarship and public access to historical records. Political figures produce memoirs, letters, editorials, and other forms of written discourse, but the speeches they compose are also performed and thus can be analyzed as much more than written texts. Now that the speeches of contemporary political leaders are recorded and archived, humanists have a rich record of public rhetoric to analyze that includes facial expression, bodily gesture, vocal performance, and frequently the use of sets and props. In the era of digital video new editing and compositing techniques are also part of the “official version” of a given speech, and portions of these speeches may be further edited and composited when they appear as part of news broadcasts. Broadcasters may adopt (or reject) signature visual styles that brand their programs and even signal their political orientation, and these markers of visual rhetoric can be mapped over time or represented comparatively (Manovich, 2011b). Scholars in the fields of rhetoric, performance studies, history, journalism, film and media studies, and civic education can compare and contrast visual and verbal political messages and changes over time in large video collections.  While a transcript of a given speech may give humanities scholars information about word use and specific references to people, places, and events, much of the rhetoric of the news is actually nonverbal. For example, the use of slow motion, freeze frame, or replay techniques may change the meaning of a given rhetorical moment. Visual arguments in news programs are now often advanced by compelling editing, dazzling information graphics, or aesthetic choices that privilege aspects such as warm lighting or patriotic color schemes. At the same time, the size of digital collections of video news is growing rapidly in response to a number of trends: 1) cable television and satellite television, which spawned the twenty-four-hour news cycle, have become international phenomena, 2) television stations now create web-only content to draw Internet viewers to their programs online, 3) newspapers are incorporating multimedia content and interactive features in archives that once only indexed print news, and 4) bloggers and vloggers involved in citizen journalism have participated in a dramatic expansion of the scope and scale of independent media. The difficulty of humanities news analysis is exacerbated by the fact that a typical television news program is actually “database cinema” (Manovich 2005) composed of many different kinds of source footage, including studio shots of anchors, field reporting, tock footage, video news releases, government public relations materials, and witness journalism from cell phones and mobile devices. Source clips may not be attributed much less tagged with date, location, individuals shown, or person/organization behind the camera (Losh 2008, Gregory 2010), and the meaning of objects or gestures in the frame, as evidence of the intention or motivation of particular political actors, can be controversial (Losh 2011).  The UCSD project team created visualizations with the official digital video archive from the Obama administration at WhiteHouse.gov that focused on the collection of “Weekly Addresses” directly addressing an imagined American Internet viewer that includes extensive discussions about current events that range from repeated occurrences (economic boosterism, holiday celebrations, etc.) to one-time disasters and tragedies (the Deepwater Horizon oil spill, the shootings at Fort Hood, etc.). UCSD has also examined a significant subset of videos in the WhiteHouse.gov archive that are addressed to audiences abroad as part of U.S. public diplomacy campaigns, which are sometimes also remixed into global news broadcasts. Even a country with a relatively small population or one that is not usually considered critical to U.S. interests, such as Côte d'Ivoire, may have a designated Obama direct address. This dataset allows those studying the visual rhetoric of international relations to work with a particularly rich and dense corpus that includes acknowledgement of cultural exchanges and national holidays. For example, historians studying U.S. Iranian relations in the twenty first century could look closely at three separate annual addresses recorded by Barack Obama that were intended to go directly to the people of Iran on the occasion of Nowrūz, the Persian new year. Each address is fundamentally different in tone and diction, as the U.S.-Iranian diplomatic relationship seems to deteriorate, as well as in shot composition and White House location.  Media created by a sitting U.S. president are always historically significant, but media created by Barack Obama -- the first test case area in this project -- are especially interesting to humanities researchers. In addition to scholarship done by rhetoricians, historians, political scientists, and performance studies and communication scholars, Barack Obama has also generated significant scholarly attention worldwide from those who study American popular culture, race relations, religion, gender, class, civic participation, digital culture, and globalization. The volume of scholarly publication of peer-reviewed books and articles about Obama and the large number of conferences, panels, and talks reflect the potential importance of this collection to scholarly discourse.  The Obama official video corpus has also been significant for the international press, which often uses content from the weekly addresses and other WhiteHouse.gov speeches and public statements in news broadcasts shown worldwide. Researchers at UCSD have noted the presence of material from the official Obama corpus in global broadcasts that include shows from the BBC, PressTV in Iran, Al Arabiya in the United Arab Emirates, ABS-CBN in the Philippines, and many others. The expense of maintaining news bureaus abroad is an obvious reason to rebroadcast free HD footage, but stations often add their own visuals and editorial commentary. For example, the Indian television network NDTV cropped official U.S. government footage from “President Obama’s Statement on Credit Downgrade” and added its own corporate branding along with a skeptical digital banner that read “Obama Assures But Dow Plunges.”    Fig. 3: UCSD visualization of White House government records footage of an Obama speech to the Iranian people (top) and visualizations of how the same speech appears in Democracy Now! (middle) and Al Jazeera English (bottom). To create these visualizations, the UCSD team first used open source software to automatically detect shot boundaries in the video, and then applied media visualization tools to create a grid of images where each image is the first frame of each UCSD visualization of White House government records footage of an Obama speech to the Iranian people (top) and visualizations of how the same speech appears in Democracy Now! (middle) and Al Jazeera English (bottom). To create these visualizations, the UCSD team first used open source software to automatically detect shot boundaries in the video, and then applied media visualization tools to create a grid of images where each image is the first frame of each shot.  Working with a large set of news archives from different sources will also allow us to develop possible answers to a number of critical research questions for archivists: How can we build systems that allow users to compare historical world events from different national or political perspectives? How can we connect one nation’s collections to the collections of others, and how will those connected collections benefit users? Given the capabilities of new search tools, how can we best improve cataloging processes, which currently depend on costly manual input, to make collections broadly usable and accessible? How can we begin to trace the re-use and re-contextualization of primary materials, in particular, news materials?   Fig. 4: President Obama's 2009 Nowruz address to the Iranian people as excerpted by the TV news program Democracy Now! Each frame represents one shot of the program. The frames are arranged in the order of shots (left to right, top to bottom). Shot 19 (third column, third row) is the excerpt from President Obama'a video address.    Fig. 5: President Obama's 2009 Nowruz address excerpted by Al Jazeera TV broadcast. Each frame represents a sequential shot of the program. Shots 5 and 6 (first row) are excerpts from President Obama's video address.   ", "article_title": "Visualizing Global News", "authors": [{"given": "Elizabeth", "family": "Losh", "affiliation": [{"original_name": "University of California, San Diego, United States of America", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}, {"given": "Lev", "family": "Manovich", "affiliation": [{"original_name": "CUNY Graduate Center, New York, United States of America", "normalized_name": "The Graduate Center, CUNY", "country": "United States", "identifiers": {"ror": "https://ror.org/00awd9g61", "GRID": "grid.253482.a"}}]}], "publisher": "EPFL, Switzerland", "date": "2014", "keywords": ["corpora and corpus activities", "cultural studies", "sustainability and preservation", "repositories", "multilingual / multicultural approaches", "archives", "stylistics and stylometry"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}