{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "  Introduction  This presentation will focus on the results of the newest phase of the NEH-funded Livingstone Spectral Imaging Project (2010-present). This project seeks to apply spectral imaging and processing techniques to the study of some of the most damaged manuscripts produced by David Livingstone (1813-73), the famous Victorian traveler, abolitionist, geographer, and missionary. Our project asks whether spectral imaging can indeed restore erased or otherwise invisible portions of Livingstone’s writing. More recently, we also explore whether the technology can illuminate the specific circumstances of the production and preservation of Livingstone’s manuscripts, thereby better revealing the links between these manuscripts and the unique historical events that shaped the material dimensions of these manuscripts.   Methodology Spectral imaging, a technology beginning to make a significant impact in humanities research (see bibliography), relies on imaging an object, such as a manuscript, under multiple wavelengths of light, ranging from ultraviolet (UV) through the visible color spectrum to the near-infrared. A high-resolution monochromatic digital camera automatically photographs each illumination. Imaging scientists then manipulate this raw image data with computers by applying various processing algorithms with the goal of enhancing features of interest. Often these features are made more visible by creating pseudocolor (false-color) representations of the object that foreground or suppress other object elements. Our previous research (Wisnicki 2011) applied spectral imaging to recover the text of a diary that Livingstone had written over newspaper pages and that had become illegible because, first, the considerable fading of Livingstone’s ink (which he had concocted out of a local African clothing dye) and, second, the continuing prominence of the black newsprint over which Livingstone wrote his text. Using a combination of new and established spectral image processing techniques, our team successfully suppressed the newsprint so that it no longer interfered with Livingstone’s text. By enhancing his writing so that it could be read easily, we were able to recover some 99% of Livingstone’s words (up from about 40% before) and, in turn, use this technique to reveal important new information about Livingstone’s strategies for representing his experiences in interacting with local populations in Central Africa. Our current project takes our previous research in a new direction to suggest that spectral imaging can illuminate the production and preservation history of Livingstone’s fragmentary 1870 Field Diary. With spectral imaging, we have enhanced or revealed material features of this diary, such as overwriting, staining, and page topography, that are often not visible or difficult to discern with the naked eye. Our results represent an important advance in the study of manuscripts with spectral imaging, particularly because previous related research has generally focused on using of spectral imaging for the recovery of faded texts or illegible palimpsests such as the Dead Sea Scrolls (Shor 2012) and the Archimedes Palimpsest (Netz and Noel 2007).   Figure 1. Page XXXV of Livingstone’s 1870 Field Diary in natural light. Copyright National Library of Scotland. CC BY-NC 3.0    Historical and Scholarly Implications  Livingstone wrote the 1870 Field Diary in central Africa and carried it with him to his death in 1873 in what is now Zambia. Livingstone’s supporters then transported his manuscript (and his corpse) from the interior to the coast of Africa and back to Britain, where different repositories have since preserved the manuscript. The pages of the diary, therefore, bear the remnants of this complex history, from the changes and deletions that Livingstone made over time, to the marks left on the manuscript pages by the diverse local African environments through which the diary traveled, to the traces of modern curatorial methods used to preserve the diary’s pages.  Our efforts to study the material history of Livingstone’s diary with spectral imaging represent an important intervention in the field. Our work demonstrates new methods and frontiers for the use of spectral imaging in the humanities because it underscores that spectral imaging can do more than recover faded or invisible text. Spectral Imaging can provide crucial insights into the passage of a manuscript through time and into the relationship between a manuscript and the specific historical circumstances from which it emerged. By applying this technology to the 1870 Field Diary, we have gained key insights into the strategies by which Livingstone shaped his experiences and identity for public consumption and the impact of specific moments of handling in determining material features of the manuscript. These insights promise to enhance our understanding of Livingstone’s biography and the history of the many African cultures in which he worked.    Figure 2. Page XXXV of Livingstone’s 1870 Field Diary with topography illuminated by spectral image processing. Copyright National Library of Scotland. CC BY-NC 3.0  Moreover, the spectral image processing techniques we have developed for the 1870 Field Diary can now be applied to study other manuscripts with notable textual and material features or, indeed, other cultural objects such as paintings and sculptures whose surfaces retain their material history and bear the marks of the many people and events that have come to shape the objects we encounter today. Our project is helping us distinguish such marks, but, in our case, the project also sets the stage for future research in which we might use the spectral signatures of specific marks as a portal to defining tangible aspects of nineteenth-century African environments from which Livingstone’s manuscripts emerged and through which these manuscript circulated.  ", "article_title": "The Manuscripts of David Livingstone and New Frontiers for Spectral Imaging", "authors": [{"given": "Adrian S.", "family": "Wisnicki", "affiliation": [{"original_name": "University of Nebraska-Lincoln, United States of America", "normalized_name": "University of Nebraska–Lincoln", "country": "United States", "identifiers": {"ror": "https://ror.org/043mer456", "GRID": "grid.24434.35"}}]}, {"given": "Ashanka", "family": "Kumari", "affiliation": [{"original_name": "University of Louisville, United States of America", "normalized_name": "University of Louisville", "country": "United States", "identifiers": {"ror": "https://ror.org/01ckdn478", "GRID": "grid.266623.5"}}]}], "publisher": "Maciej Eder, Pedagogical University in Krakow", "date": "2016", "keywords": ["bibliographic methods / textual studies", "literary studies", "cultural studies", "interdisciplinary collaboration", "standards and interoperability", "digitisation, resource creation, and discovery", "historical studies", "audio, video, multimedia", "scholarly editing", "knowledge representation", "archives, repositories, sustainability and preservation", "authorship attribution / authority", "content analysis", "image processing", "English", "text analysis"], "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}