{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Alan Liu’s “Imagining the New Media Encounter” (2008) calls for “a poiesis of digital literary studies” through which we can renegotiate the relationships between new and old media as productive encounters rather than as something other than “conversion” encounters. Liu helps us open up a critical space in which to rethink how the problematic notion of “conversion,” with its implications of oppositional media, complete transformation, and religious fervor, shape our understandings of related pairs: writing and encoding, mimesis and creation, imagination and simulation. We suggest that our understanding of text markup is closely implicated in our reimagination of writing, and that the modes of modeling suggested by possible worlds scholars may destabilize our understanding of mimesis and its role in both literary composition and text markup. In short, we propose considering markup as a “world-constructing” (Doložel 1997) form of discourse.Our starting point of reference is the long-standing conceptual tension within the markup (and especially the TEI) community between two models of markup. The first is rooted in mimesis and surrogacy: the domain of transcriptional and editorial markup. The second is more concerned with meaning creation and the domain of annotation, interpretation, authoring. These two models have different textual commitments and establish different relationships between text, markup, reader, and encoder. In the first, the encoder uses markup to transact a connection between a text and a reader; it is understood that the markup is non-transparent, but its role is to communicate about the text and about its own role as transmission medium, so that the reader can (to the greatest extent possible) apprehend some truth of the text. The primary commitment, the goal of the exercise, is for the reader to have access to the text (that is, to some textual artifact that pre-existed the markup relationship). Some form of this approach is extremely common in current applications of the TEI Guidelines: for thematic research collections, scholarly editions, linguistic corpora, oral histories, digital archives, and the like.The second model, though much less common in practice, is of great importance theoretically as a counterpoise to the first, and its importance has been shadowed forth by a number of key interventions during recent years. Theorists like Renear (2000) and McGann (2004) in very different ways have suggested that the performative and illocutionary qualities of markup bear close scrutiny. Sperberg-McQueen and Huitfeldt (2000) explored how markup represents meaning (and by extension, suggest a shift of emphasis onto markup itself as a meaning-bearing system, apart from the text it marks). Flanders (2006) and Flanders and Fiormonte (2007) have turned attention to the rhetoric of authorial markup and to its significance for scholarly communication, thinking of markup as a discourse that is situated at the boundary of production and reproduction. In this more “authorial” model, the encoder uses markup to transact a connection between herself and a reader that concerns a text. The role of markup is to instantiate, to bring into communicative reality, the encoder’s ideas and beliefs about a textual ecology that is oriented towards a particular textual artifact but is not limited to representing that artifact. Rather, the markup may represent a much broader context of interpretation, related information, and argumentation for which the text itself is only the catalyst or point of inspiration. The most common examples in the present day include annotation, “interpretive” markup such as the association of themes and keywords with spans of text (e.g. using the TEI @ana and interp mechanism), and the creation of new documents such as articles using an XML markup language as an authoring system. But these examples do not really give us a field within which to consider what —in a radical sense—we might mean by “authorial markup”, or to pursue the full critical pressure of McGann’s challenge to the markup world: “No autopoietic process or form can be simulated under the horizon of a structural model like SGML” (McGann 2004, 201-2). The way these questions are framed within the digital humanities—as an opposition between mimetic representation and presentation on the one hand, and generative or creative authorship and interpretation on the other—has a correlate in literary history. As Doležel argues (1997), possible world texts, with their “world-constructing” features, contrast with the strongly mimetic and material world truth claims of “world-imaging” texts. We suggest that an exploration of a “possible worlds” ontology of non-mimetic discursive modes may offer a critical vocabulary for thinking about the relationship of authorial markup to other encoding models. It can also help us describe how authorial markup might leverage the formal tools of a structural model in order to enact a generative or poetic mode of markup.We focus in particular on the authoring, interpretation, and markup of texts from the early modern period that concern themselves with precisely this domain. While Gottfried Leibniz nominally inaugurated discussion of possible worlds (in Essays on the Goodness of God, the Freedom of Man and the Origin of Evil, 1710), early modern writers from Thomas More and Sir Philip Sidney to René Descartes and Margaret Cavendish were concerned with the ability of the written word or number to, as Descartes put it, write about that “which does not actually exist…but is capable of so doing” (Descartes, Writing, 332). Such propositional discourse refers less to a verifiable “real” than to a set of possibilities without a fixed ontological status. Instead, as Ruth Ronen suggests, “their state of being is confined to what meaning-units of the text reveal” (Ronen 1994, 98-9). The early modern romance in particular (of which Cavendish is a major exemplar) is the single prose genre most invested in explicit exploration of the mimetic/poetic distinction and in which narrative structures themselves enact the generative logic of world-construction. Cavendish herself argues in her 1667 A New World Called the Blazing World, that her “romancicall” tale offers readers a model by which “they may create worlds of their own, and govern themselves as they please\" (Cavendish 225). Her model of romantic poiesis draws on a poetic tradition exemplified by Sidney’s Defense of Poesie (1579), which refutes directly the critique that poiesis is a form of feigning, by suggesting an epistemological and ethical role for generative authoring.When we turn from Cavendish’s own authoring process to our own use of markup as a means of representing and interpreting her text—and of creating a new work of scholarship of which we are the authors—these arguments have a double impact. Within the world of an encoded text, the “meaning-units” include (for our purposes, most significantly) the markup itself. The markup itself becomes a world-generating mode of knowing that must carry several registers of meaning arising from different kinds of scholarly agency. There are also important questions which we will address in the full paper about how we can anchor and access the domain of meaning such a world establishes. Following Saul Kripke’s assertion that “possible worlds are stipulated, not discovered by telescopes,” we see in both Cavendish’s authoring and our reading and encoding of her text a series of generative or poetic “stipulations” that carry both epistemological and ethical implications (cited in Doložel 1998, 787). We stipulate that a given structure can be characterized as a poem, or that a new paragraph begins in this place. Because there is such agreement (e.g. on disciplinary grounds) about how we read and name literary structures, this stipulation reads like a statement of fact, but if we consider more unfamiliar genres (or genre-resistant texts, like the confounding recursive narratives of Mary Wroth’s Urania or entries in commonplace books), the contentiousness of the assertion becomes more apparent. Possible worlds theory elaborates on what such stipulations accomplish, and on the terms in which we can understand the truth-value of what is created thereby. In the full version of this paper, we will consider how schemas may operate as another way of modeling the possible worlds of texts and genres, and also how possible worlds theory may help us envision more radically authorial forms of markup that may push our ideas of text encoding as scholarly communication into new terrain.", "article_title": "Possible Worlds: Authorial Markup and Digital Scholarship", "authors": [{"given": "Jacqueline", "family": "Wernimont", "affiliation": [{"original_name": "Scripps College", "normalized_name": "Scripps College", "country": "United States", "identifiers": {"ror": "https://ror.org/00p55jd14", "GRID": "grid.421979.0"}}]}, {"given": "Julia", "family": "Flanders", "affiliation": [{"original_name": "Women Writers Project, Brown University, United States of America", "normalized_name": "Brown University", "country": "United States", "identifiers": {"ror": "https://ror.org/05gq02987", "GRID": "grid.40263.33"}}]}], "publisher": null, "date": "2011", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}