{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Monumenta frisingensia – the 10th century Freising Manuscripts (Slovenian: Brižinski spomeniki) – are the oldest written Slovenian text and also the oldest Slavic text written in the Latin alphabet. The manuscripts consist of three religious texts, comprised within the Codex latinus monacensis 6426 (Munich State Library). The Monumenta frisingensia (MF) were written in a script based on Carolingian minuscule after AD 972 (MF II and MF III probably before 1000) and before 1039 (MF I most probably by 1022 or 1023). The provenance of the MF is either Upper Carinthia or Freising (now in Austria or Germany respectively); in any case, they were used in the Carinthian estates of the Freising diocese. Slovenian historians, linguistic and literary scholars consider the MF to be the very first document of early Slovenian language. This is the reason why these manu scripts bear an outstanding importance not only for the scientific comprehension of the development of Slovenian language and literature but also for Slovenian national identity and historical consciousness. In this respect Monumenta frisingensia represent the genesis and the beginnings of Slovenian national individuality. The digital edition of the Monumenta is based upon a printed one (the critical edition by the Slovenian Academy of Sciences and Arts), which encompasses a complex apparatus with facsimile, diplomatic, critical and phonetic transcriptions, translations into Latin and five modern European languages, and a dictionary covering these transcriptions and translations (plus Old Church Slavonic). This edition furthermore contains introductory studies, apparatus, a bibliography and an index of names. The MF are preserved in one single manuscript only. For this reason, the traditional philological and critical task – to examine the ms. witnesses – is not possible in this case. On the contrary, it is of great importance that the edition is founded on the opposite concept: on that of reception. In what way the MF were studied, understood and published? What were the main differences between the transcriptions and editions? Can a digital edition grasp at least crucial points of their research during the two centuries from their discovery, 1806–2006? For this reason, besides all the components of the printed edition, the digital one contains a selection of earlier diplomatic and critical transcriptions (in full text) and enables parallel views to compare them. This is of considerable importance as the Frisingensia were often a subject of polemical scientific interpretations, especially with regard to the place of their origin and their linguistic genesis. The edition should, therefore, enable a pluralism of readings and understandings as well as a hierarchy of proofs and ascertainments. By inclusion of all major transcriptions of the Freising Manuscripts since the very first diplomatic transcription in 1827 (P. Koeppen), the e-edition offers a panoramic retrospective of 200 years of research of these precious manuscripts. Such a retrospective, evidenced by historical transcriptions themselves, can reveal cultural and philological history of the Frisingensia. As another extension, specific for digital edition, we decided to include the digitized audio recordings of the read manuscripts and integrate the segmented audio files to both phonetic transcription and modern Slovenian normalization. The scope of this audio extension is to offer a reconstruction (based on historical linguistics) of medieval Slovenian speech which can be sensibly juxtaposed and compared with transcriptions. We plan to publish a pedagogical adaptation of this e-edition as well, aimed for school-reading, where audio component with the archaic pronunciation can produce a clear image of historical development of the Slovenian language. Such materials present significant challenges for encoding, esp. the high density and variety of markup, extreme parallelism (per-line alignment between the text views), and special historic and phonetic characters used in the transcriptions. The paper details our methodology used to turn the printed edition (plus extensions) into a Web edition with a standardized encoding, extensive hyperlinking, and multimedia capabilities. We concentrate on the following issues: - Structuring of materials in a text editor - Adoption of standard solutions: Unicode/XML/XSLT/TEI-P4/ - Collaborative practices using fast prototyping and cyclical improvement: up-converting to XML–TEI --> down-converting to HTML --> proofs, corrections --> re-applying the up-conversion … Our presentation details these issues, and highlights the most challenging aspects of entire process, where the central goal is to enable a complex and lively communication with the 10th century Monumenta frisingensia.", "article_title": "Monumenta Frisingensia — a Digital Edition of the Oldest Slovenian Text", "authors": [{"given": "Tomaž ", "family": "ERJAVEC", "affiliation": [{"original_name": "Institute of Slovenian Literature,     Scientific Research Centre", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Matija ", "family": "OGRIN", "affiliation": [{"original_name": "Department of Knowledge Technologies,     Jožef Stefan Institute", "normalized_name": "Jožef Stefan International Postgraduate School", "country": "Slovenia", "identifiers": {"ror": "https://ror.org/01hdkb925", "GRID": "grid.445211.7"}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}