{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " The silences endemic to the archive of slavery have long presented a range of challenges to the literary scholar: How does one account for absences in the archival record, both those inscribed in the archive’s contents, and those introduced at the time of the archive’s construction? How does one account for the power dynamics at work in the relationships between the enslaved men and women who committed their narratives to paper, and the group of (mostly white) reformers who edited and published their works? How does one identify and extract meaning from the unique set of documents that do remain – letters, inventories, ledger books, and personal narratives – documents that, in the words of Susan Scott Parrish, the literary critic, we must struggle to make ‘mean something more?’ (2010). And how does one do so without reinforcing the damaging notion that African American voices from before emancipation – not just in the archival record, but the voices themselves, are silent, and irretrievably lost?    This final, critical challenge is what has prompted scholars from across the humanities, such as the literary critics Stephen Best (2009, 2011) and Saidiya Hartman (2008), the sociologist Avery Gordon (2008), the archivist Jeanette Bastian (2003), and the historian Jill Lepore (1998), to call for a shift away from what Best has identified as ‘a logic and ethic of recovery,’ to a new focus, instead, on animating the mysteries of the past (2011). However, each of these scholars proposes traditional methods of analysis and criticism for animating such mysteries.      This short paper will instead draw upon a set of tools and techniques associated with social network analysis and visualization in order to propose a new method for animating the mysteries of the past. While social network analysis and visualization tools have been applied to literary texts (Drouin 2006-), historical datasets (Wilder 2010-), and correspondence networks (Findlen et al. 2008-), these tools have not yet been applied to historical archives with the aim of illuminating the relationships among people mentioned in the archive’s content.     For this task, I employed a named entity recognizer (NER) developed at Stanford, and included in its suite of CoreNLP (Natural Language Processing) tools, in order to identify the names of the people mentioned in the archive’s content (Manning et al. 2010). I then developed my own co-appearance script, in Python, in order to determine which people were mentioned in the same document as each other, and how many times those people appeared together. I then formatted the data to be displayed using Protovis, a javascript-based visualization toolkit also developed at Stanford (Bostock & Heer 2010). Figure 1  My paper will focus on a subset of documents included in The Papers of Thomas Jefferson, those that make reference to members of the enslaved Hemings family (Figure 1). The descendants of Elizabeth Hemings, including Sally Hemings, the woman with whom, whether consensually or not, Jefferson maintained a lifelong relationship and bore six of his children; and James Hemings, who trained as a chef de cuisine in the high French style, and then worked as the head cook at Jefferson’s Monticello plantation until his emancipation, in 1796, function as an ideal test case both for assessing the limits of the computing methodologies employed, and for determining how the analysis and visualization of social networks can, in fact, animate the mysteries of the past – those that Best, Hartman, and others, have sought to identify and amplify through more traditional scholarly techniques.      A significant limit of employing NER software on this particular dataset is that enslaved men and women were most often referred to by first name alone. For instance, not only are there many Jameses mentioned in The Papers of Thomas Jefferson, but James Hemings was also called Jamie, Jimmy, and even Gimmé while in France. After running my co-appearance script, I was required to go through the results by hand in order to determine which names referred to the same individual, and in that event, combine the associated data. Because of the eighteenth-century style of the Jefferson Papers, I was also required to remain attentive to any NER errors, as well as to individuals clearly alluded to in the Papers, but not referred to by name at all.      The test case of the Hemings family also points to the limits of the ‘arc diagram’ model for visualizing complex relationships. While preferable to a force-directed layout, which obscures the distinct relationships among individuals, its layout implies a linearity that is not consistent with the web of relationships contained within the dataset. My paper will thus also propose how hive plots and chord diagrams might function as better models for visualizing such network data (Krzywinski 2009, 2011). In this way, I will suggest how contemporary data visualization research can have a direct impact on a range of literary and cultural investigations.     Furthermore, by demonstrating how a visualization of this particular social network allows us to see the historical traces of the Hemings family as presences, not absences, as scholars such as Best, Hartman, Gordon, Bastian, and Lepore, have each argued for, I begin to address an issue of mounting concern within the community of digital humanities scholars, as voiced by Johanna Drucker (2009) and Alan Liu (2011), among others, about the need to reinscribe humanistic inquiry as the central focus of digital humanities work. The presence of the Hemings family in The Papers of Thomas Jefferson, as unearthed by the methods described above, suggests not only how digital tools might be applied to a diverse set of cultural and literary questions, but also how these methods might expose – and animate – the diversity of experience embedded in significant records of early American cultural life.   ", "article_title": "Social Network Analysis and Visualization in ‘The Papers of Thomas Jefferson’", "authors": [{"given": " Lauren Frederica", "family": "Klein", "affiliation": [{"original_name": "Georgia Institute of Technology, USA", "normalized_name": "Georgia Institute of Technology", "country": "United States", "identifiers": {"ror": "https://ror.org/01zkghx44", "GRID": "grid.213917.f"}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}