{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Over a decade has passed since Ward Cunningham created his Portland Pattern Repository and coined the term “wiki” (from the Hawaiian word for “quick”) to describe the application that enabled its pathbreaking web-based collaborative editing capabilities. Since that time, wikis have flourished on the Web. There are now well over 100 freely available wiki software applications, in a wide variety of programming languages. Wikipedia, the best-known wiki instance, features 2.3 million articles written in over 200 languages by almost 90,000 individual contributors. Despite this popular success, wikis have been slow to catch on in the academic world, and in the humanities in particular -- surprising given their enormous potential to transform the nature of scholarly communication. Certainly this is due in part to the inherently solitary and linear nature of most academic writing; blogs seem a more intuitive fit for this type of writing, as evidenced by their much greater popularity among scholars. Yet even in the hands of an individual researcher working alone, a wiki can be a valuable tool for organizing and archiving complex scholarly material. In a passage that evokes Vannevar Bush and his mythical memex, Leuf and Cunningham invite scholars to imagine abandoning their scattered scraps of paper and Post-It notes and instead «directly asking your scattered notes where references to ‘thingamy’ are and having the appropriate bits of paper levitate into view, slide out of bookshelves, and be there at your fingertips ... eventually everything starts to interconnect: notes, files, e-mail, contacts, comments, relational cross-links, Internet resources, and so on ... the whole thing evolves almost organically in response to your growing body of notes” (84). Of course, the real fun with wikis begins when a complex knowledge representation like the one described above is opened up to a large community of contributors. By virtue of its inherent design, the wiki breaks down the process of text creation into component functions (structuring, drafting, revising, annotating) typically performed by a solitary author, and allows these to be performed by different persons. Wikis are highly unique in this regard. With blogs and discussion boards, earlier postings cannot be altered except by an administrator and the chronological or topical ordering of the content cannot be restructured. With wikis, however, content is continuously reorganized and revised, often by many different hands. This dispersed, depersonalized method of content creation explains certain rhetorical features of the typical wiki article, which is usually impersonal, unsigned, POV-neutral prose written in the 3rd person. When individual comments and suggestions about a wiki article, often signed and highly personal, are debated, voted upon, and gradually incorporated into the article itself, we see a polyphony of opinion slowly coalesce into a kind of collective understanding. The ideal wiki article would be a highly polished nugget of scholarly consensus, carefully crafted and continuously updated by an informed community, embedded in a dense associative web of related content. Clearly, there are roadblocks on the way to this ideal. A wiki must achieve a certain critical mass of content before it is truly useful, and without a dedicated core of regular contributors at the outset it is apt to languish unused. “Document mode” -- the anonymous, impartial style of the typical wiki article -- may be familiar from encyclopedias and other reference texts, but it is largely alien to writing in the humanities. Because the precise expression of ideas in words is the very essence of their work, humanities scholars may be particularly reluctant to subject their writing to revision by strangers. Conversely, they are more sensitive to the “legitimation crisis” that arises when text is not attributed in an obvious way (Barton). These problems might exist even if the wiki was restricted to a closed and vetted group of scholarly peers. The final paper will explore these issues through a series of case studies, and will suggest some optimal uses for wiki technology in an academic setting.", "article_title": "Exploring the Wiki as a Mode of Collaborative Scholarship", "authors": [{"given": "Christine ", "family": "RUOTOLO", "affiliation": [{"original_name": "University of Virginia", "normalized_name": "University of Virginia", "country": "United States", "identifiers": {"ror": "https://ror.org/0153tk833", "GRID": "grid.27755.32"}}]}], "publisher": null, "date": "2006", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}