{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " In this paper I will present an examination of the institutional and epistemological tensions between particular national ‘eResearch’ infrastructure agendas (or ‘eScience’, ‘cyber-infrastructure’) and particular aspects of the digital humanities. Whilst much of the digital humanities positions itself within the research ‘infrastructures’ of the humanities (journals, academic departments, conferences, libraries, and sober ethics committees) – and is partly responsible for building the ‘human capital’ to work in the humanities – eResearch has largely emerged outside of the perspectives and training of the digital humanities, primarily driven by a ‘big science’ agenda (ie. an emphasis on mass data storage and infrastructures that largely support scientific methods and ways of collaborating). This has created numerous complexities for the digital humanities, particularly in the UK and Australia where it may, for better or worse, be emerging as a competing set of discourses and practices to the digital humanities (Examples will be given in the presentation). Admittedly, the eResearch agenda has created many opportunities for research in the humanities, however, the way in which this agenda has been institutionalised in a number of countries means that it doesn’t always serve the needs of the humanities. This is because eResearch largely exists outside of humanities research structures and is principally measured and driven by different accountability metrics. Its technical development also sits within rarefied institutional hierarchies between ‘service staff and researcher’, and biases a mistaken industrial utility; neither of which seem particularly useful for the contemporary challenges of digital humanities nor humanities research. As Geoffrey Rockwell states: [there are] dangers in general and especially the issue of the turn from research to research infrastructure [...] we need to be careful about defining the difference and avoid moving into the realm of infrastructure [...] those things we are still studying (Rockwell 2010: 5). Through presenting key examples, in this presentation I will broadly explore the institutionalisation of eResearch-infrastructures in the humanities over the past decade, and in particular, reference the countries in which I have the most experience, Australia and the UK. The landscape in Australia is particularly problematic as unlike other countries, the eResearch agenda is still at its height whilst the digital humanities is still developing its own institutional addenda. The main tension appears to be a ‘two cultures’ one; it is the misunderstandings between applied computing, largely focused upon meeting the many practical needs of large-scale scientific endeavours, and the digital humanities that has its own particular understandings of the efficacy of computing within its heterogeneous research endeavours. Many infrastructure investors unavoidably claim a ‘research enabling’ or even a research pedigree for their work, but the exact nature of this research and how it helps us understand humans society and culture is, on occasions, yet to be determined (and this is far from an easy task and is largely an experimental practice; rarely a utilitarian one). Plus the institutional positioning of eResearch infrastructure in university service divisions, remote national services, and monolithic government and science-led programmes, means that the tradition of critique, and synthesis of eResearch infrastructure within contemporary digital humanities scholarship, is barely possible.  What can be done? As a trained historian and long-time digital humanities advocate who has benefited from investments in eResearch – and indeed, I am employed by a particularly flexible strategic eResearch programme in the State of Victoria in Australia – I caution against retreating too eagerly from the ‘infrastructure turn’ as there are still healthy opportunities in many countries between the cracks of otherwise clumsy agendas. However these opportunities need to be positioned within a research-led digital humanities agenda and not a science led-agenda (and there is a perhaps a dark side to the #alt-ac movement in the United States if new digital outputs are not well supported within a humanities research setting) (Nowviskie 2011).  Perhaps a better approach for the humanities than cambering to a science led ‘e-infrastructure’ funding model, along with its often abrasive tectonic plates of incongruous collaborations, would be to lobby for the funding model to strengthen digital humanities research. The digital humanities has a sophisticated international network of centres, undergraduate and graduate degrees, associations, conferences, journals, and research accountability structures that are largely internal to the humanities and is thus much better equipped to lead computing in the humanities than eResearch (and there are some positive institutional developments in this direction). And if led by the digital humanities, new research infrastructures such as data and text centres, virtual environments, and digital libraries would be more relevant to humanities research, thus insuring their long term sustainability. But this would require ‘e-infrastructure’ to be institutionalised in a much more responsive way; in a way that isn’t unequally coupled with the needs of science. Again Geoffrey Rockwell states: Perhaps things like the Text Encoding Initiative Guidelines are the real infrastructure of humanities computing, and the consortia like the TEI are the future of light and shared infrastructure maintenance (Rockwell 2010: 5). I would like to think that this is because the TEI and derivatives such as EpiDoc exist within a deeply scholarly and vibrant international research culture that is both embedded within and accountable to humanities research; this is not always the case with eResearch infrastructure. However, for the digital humanities to take a greater lead in terms of guiding the implementation of eResearch infrastructure, in its various institutional settings, would require the digital humanities to be strengthened institutionally to rise to the challenge, especially in countries where ‘eResearch’ is much stronger than the digital humanities. All infrastructure, despite its veneer of utilitarian simplicity, is ‘among the complex and expensive things that society creates’ (Hauser 2011). ‘e-Infrastructure’ for the humanities may provide opportunities, but aspects of the present model in various countries lacks a complex humanities research environment and is wedded to an empirical, engineering, and industrial instrumentalism that is often at odds or even hostile to the humanities. It is not that eResearch does not do some things very well, it is the promise of research that it doesn’t do particularly well. The goals of eResearch infrastructures are often so monumental; that they should perhaps be a set of research questions in themselves rather than practical goals. Based on my experience within eResearch and the digital humanities I will propose a number of alternative directions in this presentation and seek insight from others in the audience from various national and institutional contexts.   ", "article_title": "Opportunity and accountability in the ‘eResearch push’", "authors": [{"given": " Craig", "family": "Bellamy", "affiliation": [{"original_name": "Victorian eResearch Strategic Initiative (VeRSI), Australia", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Jan Christoph Meister, Universität Hamburg", "date": "2012", "keywords": null, "journal_title": "ADHO Conference Abstracts", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}