{"url": "http://dx.doi.org/10.1093/llc/fqh044", "identifier": {"string_id": "10.1093/llc/fqh044", "id_scheme": "DOI"}, "abstract": "This paper describes a pilot project to evaluate the use of Geographical Information System (GIS) and website technology to explore, integrate, and display quantative and qualitative information about forced migration in a region of Macedonia from 1880 to the present day. Approaches, techniques, and technologies that would be required for a potential large-scale project were explored and challenges that would be encountered and possible novel solutions that could be applied were identified. The project demonstrated that a great deal could be achieved in the visualization of spatial data at a relatively low cost in terms of finance, time and expertise. It concluded that current GIS technology has many weaknesses when applied to humanities data. However, there is considerable potential for applying existing methods in new and imaginative ways. The project gave an indication of some of this potential and the possible future development of Geographical Information Science approaches specifically for the humanities. The project is one of a new style of digital projects in the humanities that make use of image, spatial database, and text-based technologies. By taking a range of unpublished material and exploring ways of producing a digital museum of cultural heritage aimed primarily at the communities of its subject matter it exhibits the broader social role of humanities computing and the resources it develops.", "article_title": "The Application of a Geographical Information System to the Creation of a Cultural Heritage Digital Resource", "authors": [{"given": " Martyn", "family": "Jessop", "affiliation": [{"original_name": "King's College London, UK", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2005-02-23", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "20", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}