{"url": "http://dx.doi.org/10.1093/llc/fqi039", "identifier": {"string_id": "10.1093/llc/fqi039", "id_scheme": "DOI"}, "abstract": "In this article we describe an approach to the identification of ‘translationese’ based on monolingual comparable corpora and machine learning techniques for text categorization. The article reports on experiments in which support vector machines (SVMs) are employed to recognize translated text in a corpus of Italian articles from the geopolitical domain. An ensemble of SVMs reaches 86.7% accuracy with 89.3% precision and 83.3% recall on this task. A preliminary analysis of the features used by the SVMs suggests that the distribution of function words and morphosyntactic categories in general, and personal pronouns and adverbs in particular, are among the cues used by the SVMs to perform the discrimination task. A follow-up experiment shows that the performance attained by SVMs is well above the average performance of ten human subjects, including five professional translators, on the same task. Our results offer solid evidence supporting the translationese hypothesis, and our method seems to have promising applications in translation studies and in quantitative style analysis in general. Implications for the machine learning/text categorization community are equally important, both because this is a novel application and especially because we provide explicit evidence that a relatively knowledge-poor machine learning algorithm can outperform human beings in a text classification task.", "article_title": "A New Approach to the Study of Translationese: Machine-learning the Difference between Original and Translated Text", "authors": [{"given": " Marco", "family": "Baroni", "affiliation": [{"original_name": "SSLMIT, University of Bologna", "normalized_name": "University of Bologna", "country": "Italy", "identifiers": {"ror": "https://ror.org/01111rn36", "GRID": "grid.6292.f"}}]}, {"given": " Silvia", "family": "Bernardini", "affiliation": [{"original_name": "SSLMIT, University of Bologna", "normalized_name": "University of Bologna", "country": "Italy", "identifiers": {"ror": "https://ror.org/01111rn36", "GRID": "grid.6292.f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2005-08-06", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "21", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}