[
{"title": "Bridging the Gap: Enriching YouTube Videos with Jazz Music Annotations", "keywords": ["music information retrieval; Digital Humanities; Audio processing; Semantic Web; musicology"], "author": ["Balke, Stefan", "Dittmar, Christian", "Abeßer, Jakob", "Frieler, Klaus", "Pfleiderer, Martin", "Müller, Meinard"], "abstract": "Web services allow permanent access to music from all over the world. Especially in the case of web services with user-supplied content, e.g., YouTube(TM), the available metadata is often incomplete or erroneous. On the other hand, a vast amount of high-quality and musically relevant metadata has been annotated in research areas such as Music Information Retrieval (MIR). Although they have great potential, these musical annotations are ofter inaccessible to users outside the academic world. With our contribution, we want to bridge this gap by enriching publicly available multimedia content with musical annotations available in research corpora, while maintaining easy access to the underlying data. Our web-based tools offer researchers and music lovers novel possibilities to interact with and navigate through the content. In this paper, we consider a research corpus called the Weimar Jazz Database (WJD) as an illustrating example scenario. The WJD contains various annotations related to famous jazz solos. First, we establish a link between the WJD annotations and corresponding YouTube videos employing existing retrieval techniques. With these techniques, we were able to identify 988 corresponding YouTube videos for 329 solos out of 456 solos contained in the WJD. We then embed the retrieved videos in a recently developed web-based platform and enrich the videos with solo transcriptions that are part of the WJD. Furthermore, we integrate publicly available data resources from the Semantic Web in order to extend the presented information, for example, with a detailed discography or artists-related information. Our contribution illustrates the potential of modern web-based technologies for the digital humanities, and novel ways for improving access and interaction with digitized multimedia content.", "DOI": "10.3389/fdigh.2018.00001", "affiliation": ["International Audio Laboratories Erlangen, Germany", "International Audio Laboratories Erlangen, Germany", "Semantic Music Technologies Group, Fraunhofer IDMT, Germany", "Jazzomat Research Project, University of Music Franz Liszt, Germany", "Jazzomat Research Project, University of Music Franz Liszt, Germany", "International Audio Laboratories Erlangen, Germany"], "journal": "Frontiers in Digital Humanities", "issue": "5"}
]