[
    {
        "url": "http://www.zfdg.de/sb004_006",
        "identifier": {
            "string_id": "10.17175/sb004_006a",
            "id_scheme": "DOI"
        },
        "abstract": "This article aims to outline the challenge of uncertainty for the construction of computational models in the humanities. Since we can neither ignore nor eliminate uncertainty, we need to model it, and so we need computational models of uncertainty. Such models already exist and are being used in practical applications. There is ongoing fundamental research on uncertainty and its representation in mathematics, philosophy, and computer science. Some of these approaches may be suitable for modeling uncertainty in the humanities—but we are still lacking the »bridge« that could relate the uncertainty encountered in the humanities to such formal modeling frameworks. We argue that DH needs to go beyond project-specific models of uncertainty and consider uncertainty more generally; in particular, we must closely examine various types of uncertainty in the humanities and seek to develop more general frameworks for handling it.",
        "article_title": "Accepting and Modeling Uncertainty",
        "authors": [
            {
                "given": "Michael",
                "family": "Piotrowski",
                "affiliation": [
                    "Université de Lausanne, Section des sciences du langage et de l’information"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-07-31",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 4",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb004_004",
        "identifier": {
            "string_id": "10.17175/sb004_004",
            "id_scheme": "DOI"
        },
        "abstract": "In this article, we introduce a methodological proposal for modelling vagueness in graphs. In addition to the modelling, we also deal with the automatic generation of implicitly stored knowledge when considering vagueness. We use the ideas of algorithms designed for description logics and apply them on graph data. We also present our software development that implements the proposed methodology. We will demonstrate the use of our applications based on three use cases in humanities and cultural studies.",
        "article_title": "Academic Meta Tool. Ein Web-Tool zur Modellierung von Vagheit",
        "authors": [
            {
                "given": "Martin",
                "family": "Unold",
                "affiliation": [
                    "Hochschule Mainz University of Applied Sciences, Institut für Raumbezogene Informations- und Messtechnik"
                ]
            },
            {
                "given": "Florian",
                "family": "Thiery",
                "affiliation": [
                    "Römisch-Germanisches Zentralmuseum – Leibniz-Forschungsinstitut für Archäologie"
                ]
            },
            {
                "given": "Allard",
                "family": "Mees",
                "affiliation": [
                    "Römisch-Germanisches Zentralmuseum – Leibniz-Forschungsinstitut für Archäologie"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-02-28",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 4",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb004_001",
        "identifier": {
            "string_id": "10.17175/sb004_001",
            "id_scheme": "DOI"
        },
        "abstract": "This paper builds a bridge between XML and graphing technologies to examine references in a historical body of text, and explores the extent to which graph queries can facilitate the analysis of referentiality, considering fuzzy information in particular. Examples are chosen form a history research project which examines music critiques of the 19th century on the Messa    da Requiem by Giuseppe Verdi.",
        "article_title": "Referenzielle Varianz in Texten über Musik",
        "authors": [
            {
                "given": "Torsten",
                "family": "Roeder",
                "affiliation": [
                    "Leopoldina. Nationale Akademie der Wissenschaften"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-13",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 4",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2020_001",
        "identifier": {
            "string_id": "10.17175/2020_001",
            "id_scheme": "DOI"
        },
        "abstract": "This article explores how digital methods, such as the analysis of Facebook page like networks, can complement ethnographic fieldwork, especially in cases of difficult access to a field. Drawing from anthropology, geography, and media studies, we present two case studies where ethnographic access is challenging: one organic farm in Pakistan, and an NGO that circulates knowledge on psychoactive drugs. On a pragmatic level, we argue that network visualizations based on social media are insightful for difficult fields, but, like ›satellite images‹, they need ethnographic contextualization. On the conceptual level, we understand these networks as complex knowledge networks, where large-scale structures emerge through small-scale action.",
        "article_title": "Digital methods in difficult ethnographic fields: studying knowledge flows as complex networks through a Facebook analysis",
        "authors": [
            {
                "given": "Lisa",
                "family": "Krieg",
                "affiliation": [
                    "Rheinische Friedrich-Wilhelms-Universität Bonn"
                ]
            },
            {
                "given": "Julia",
                "family": "Poerting",
                "affiliation": [
                    "Rheinische Friedrich-Wilhelms-Universität Bonn"
                ]
            }
        ],
        "publisher": null,
        "date": "2020-02-26",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 5.2020",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb004_010",
        "identifier": {
            "string_id": "10.17175/sb004_010",
            "id_scheme": "DOI"
        },
        "abstract": "To facilitate the application of network analysis for the study of multi-sided Aegean seals, a graph database was implemented in Neo4j. Many of the seal’s attributes contain uncertainties, which require special attention if they are incorporated into the graph database. The article examines where the uncertainties originate from and presents how they can be modelled in the graph database. Finally, a practical example is presented, which focuses on depictions of creatures on seals and makes use of the created graph database.",
        "article_title": "A Graph Database of Aegean Seals with Uncertain Attributes",
        "authors": [
            {
                "given": "Martina",
                "family": "Trognitz",
                "affiliation": [
                    "Österreichische Akademie der Wissenschaften, Austrian Centre for Digital Humanities"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-04-10",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 4",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2020_003",
        "identifier": {
            "string_id": "10.17175/2020_003",
            "id_scheme": "DOI"
        },
        "abstract": "This study presents and tests a methodology with which the paratexts of a medium-sized text corpus are recorded and analysed. In the first part, the theory is introduced, then the separate methodical steps for the acquisition of the different paratextual and textual signals are explained in detail. Their quantification allows the clustering of the collected data and thus the grouping of the texts under study. A corpus of 103 scientific ethnographies is used as an example to demonstrate the results to which the analysis of paratexts can lead. This shows that ethnographic writing in the 20th century oscillates between a scientific presentation on the one hand, and an autobiographical presentation on the other. The analysis focuses both on the text corpus as a whole and on developments over time, which allows to trace the history of the discipline, that had initially conceived the subject of the researcher passively as a neutral observer. It has more recently been presented as an active personality acting and interacting in a social environment. The final part of the study discusses possibilities for automated data collection and the use of machine learning methods. The potential of paratextual analyses to provide insights into the functional differentiation of conventions of representation is thus outlined.",
        "article_title": "Analyse von Begleittexten am Beispiel von 103 Ethnografien",
        "authors": [
            {
                "given": "Fabienne",
                "family": "Kilchör",
                "affiliation": [
                    "Emphase Sàrl"
                ]
            },
            {
                "given": "Jörg",
                "family": "Lehmann",
                "affiliation": [
                    "Eberhard Karls Universität Tübingen"
                ]
            }
        ],
        "publisher": null,
        "date": "2020-07-17",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 5.2020",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb004_011",
        "identifier": {
            "string_id": "10.17175/sb004_011",
            "id_scheme": "DOI"
        },
        "abstract": " This contribution aims to demonstrate the importance of traceable provenance information within knowledge bases in the Digital Humanities. Besides presenting rather general aspects of how to model statements in an abstract and in an exemplary manner, the concept of fact provenance is introduced and integrated with statement expression models. Using so-called provenance chains, it is shown how provenance information that is captured within an information system can be utilized to handle contradictions and reduce the overall uncertainty of the knowledge base. ",
        "article_title": "Graphbasierte Modellierung von Faktenprovenienz als Grundlage für die Dokumentation von Zweifel und die Auflösung von Widersprüchen",
        "authors": [
            {
                "given": "Thomas",
                "family": "Efer",
                "affiliation": [
                    "Universität Leipzig, Institut für Informatik"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-08-14",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 4",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb004_008",
        "identifier": {
            "string_id": "10.17175/sb004_008",
            "id_scheme": "DOI"
        },
        "abstract": "This paper looks at how deep integration between text and data is attempted in The Codex project. Standoff properties are used to mediate between the plain text stream and entities modelled in the Neo4j graph database. A dynamic standoff property text editor was constructed to enable real-time changes to text and annotations without invalidating standoff property indexes. An examination of the multidimensional affordances offered by standoff properties is explored, with reference to how annotations and graph entities can combine to construct an ›atlas of history‹ using Codex.",
        "article_title": "The Codex – an Atlas of Relations",
        "authors": [
            {
                "given": "Iian",
                "family": "Neill",
                "affiliation": [
                    "Akademie der Wissenschaften und der Literatur, Mainz"
                ]
            },
            {
                "given": "Andreas",
                "family": "Kuczera",
                "affiliation": [
                    "Akademie der Wissenschaften und der Literatur, Mainz"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-05-08",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 4",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2019_005",
        "identifier": {
            "string_id": "10.17175/2019_005",
            "id_scheme": "DOI"
        },
        "abstract": "The focus of this contribution is the presentation and discussion of the conceptual design of an XML database of fairytales (expandable to other popular narrative genres) and the required digital infrastructure. The purpose is a worldwide systematization of archival material through a suitable database and the development of a content annotation standard (ConAS) for the typological-comparative analysis of the international fairytales.",
        "article_title": "Konzept für den digitalen Ausbau der typologisch-vergleichenden Märchenforschung",
        "authors": [
            {
                "given": "Elguja",
                "family": "Dadunashvili",
                "affiliation": [
                    "Friedrich-Schiller-Universität Jena"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-11-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 4.2019",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2019_003",
        "identifier": {
            "string_id": "10.17175/2019_003",
            "id_scheme": "DOI"
        },
        "abstract": "The term blockchain is well known to many, at least since the high of Bitcoin prices at the end of 2017. Its application potentials are discussed and tested in economy and science. Especially the transparency, traceability and unchangeability of the content stored in a blockchain and the decentralization are of particular interest. Potential areas of application that are also of interest for the humanities are discussed in this paper, especially the scientific publication of articles and research data as well as blockchain-based possibilities for signing published content. Based on the concrete example of a scientific journal, the functionality, potential application and caveats of blockchain will be explained and discussed. ",
        "article_title": "Blockchain für die Geisteswissenschaften?  Möglichkeiten des Einsatzes von Blockchain und verwandten Technologien für wissenschaftliche Publikationen",
        "authors": [
            {
                "given": "Anna",
                "family": "Neovesky",
                "affiliation": [
                    "Akademie der Wissenschaften und der Literatur, Mainz"
                ]
            },
            {
                "given": "Julius",
                "family": "Peinelt",
                "affiliation": [
                    "Futurice GmbH"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-07-04",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 4.2019",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb004_005",
        "identifier": {
            "string_id": "10.17175/sb004_005",
            "id_scheme": "DOI"
        },
        "abstract": "The paper approaches the problem of the loss of sources (deperdita) from three different perspectives: In a first section, deperdita are identified as a methodological area of uncertainty for historical research and possible categorisations are proposed. The following case study from the work of the Anton Webern Gesamtausgabe illustrates the consequences of such defects in cultural memory caused by missing sources, before proposals for graph-based modeling of negations and deperdita are presented in the last part. The aim of the discussion is to raise awareness of the challenges involved in dealing with historical material that is no longer available and for a constructive and productive approach to uncertainties.",
        "article_title": "Quellenverluste (Deperdita) als methodologischer Unsicherheitsbereich für Editorik und Datenmodellierung am Beispiel von Anton Weberns George-Lied op. 4 Nr. 5",
        "authors": [
            {
                "given": "Stefan",
                "family": "Münnich",
                "affiliation": [
                    "Universität Basel, Departement Künste, Medien, Philosophie"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-07-03",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 4",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2019_008",
        "identifier": {
            "string_id": "10.17175/2019_008",
            "id_scheme": "DOI"
        },
        "abstract": "Emotions are a crucial part of compelling narratives: literature tells us about people with goals, desires, passions, and intentions. In the past, the affective dimension of literature was mainly studied in the context of literary hermeneutics. However, with the emergence of the research field known as Digital Humanities (DH), some studies of emotions in a literary context have taken a computational turn. Given the fact that DH is still being formed as a field, this direction of research can be rendered relatively new. In this survey, we offer an overview of the existing body of research on sentiment and emotion analysis as applied to literature. The research under review deals with a variety of topics including tracking dramatic changes of a plot development, network analysis of a literary text, and understanding the emotionality of texts, among other topics. ",
        "article_title": "A Survey on Sentiment and Emotion Analysis for  Computational Literary Studies",
        "authors": [
            {
                "given": "Evgeny",
                "family": "Kim",
                "affiliation": [
                    "Universität Stuttgart, Institut für Maschinelle Sprachverarbeitung"
                ]
            },
            {
                "given": "Roman",
                "family": "Klinger",
                "affiliation": [
                    "Universität Stuttgart, Institut für Maschinelle Sprachverarbeitung"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-12-16",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 4.2019",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb003_012",
        "identifier": {
            "string_id": "10.17175/sb003_012",
            "id_scheme": "DOI"
        },
        "abstract": "The following article takes the interventions originating from the Digital Humanities as a starting point to analyse research practices in the humanities in general, and literary studies in particular, and to highlight their epistemic implications. Therefore, it sketches out the basic characteristics of praxeological ›science studies‹. On this basis, the dualism ›distant‹ versus ›close reading‹ often labelled as an analytical method is problematized and reconceptualised as the metaphorical description of various hierarchies of scholarly norms.",
        "article_title": "Objektumgangsnormen in der Literaturwissenschaft",
        "authors": [
            {
                "given": "Friederike",
                "family": "Schruhl",
                "affiliation": [
                    "Humboldt-Universität zu Berlin, Institut für Deutsche Literatur"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-06-27",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 3",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2019_002",
        "identifier": {
            "string_id": "10.17175/2019_002",
            "id_scheme": "DOI"
        },
        "abstract": "This article issues the changing textual working practices in the humanities and their interconnected medium of the digital monography. First, the requirements of research in the humanities and those of the format of the monography are analyzed. Then, the textual working practices are reconstructed as practices of reading and writing, which mutually determine the monography as primary representation of findings in the humanities. Finally, the current problems and future potentials of the digital monography are discussed in their design capabilities.",
        "article_title": "Nicht geeignet oder nur unzureichend gestaltet? Digitale Monographien in den Geisteswissenschaften",
        "authors": [
            {
                "given": "Axel",
                "family": "Kuhn",
                "affiliation": [
                    "Friedrich-Alexander-Universität Erlangen-Nürnberg, Institut für Buchwissenschaft"
                ]
            },
            {
                "given": "Svenja",
                "family": "Hagenhoff",
                "affiliation": [
                    "Friedrich-Alexander-Universität Erlangen-Nürnberg, Institut für Buchwissenschaft"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-05-08",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 4.2019",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb004_009",
        "identifier": {
            "string_id": "10.17175/sb004_009",
            "id_scheme": "DOI"
        },
        "abstract": "Despite many articles, reports and attention in the meantime in the mass media, blockchain technology is for most associated with bitcoin, risk, speculation, high volatility and also the dark side of the Internet. The potential of the technology is ignored in these sometimes emotional discussions. In order to make a small contribution to objectification, this following essay is written. It explains the environment in which this technology has been implemented, the ingenious approach behind the technology, the current state of development and how the blockchain technology can learn from other approaches to data storage and processing. For this the graph database is used and both approaches are compared. ",
        "article_title": "Blockchain – die etwas andere Datenbank",
        "authors": [
            {
                "given": "Katarina",
                "family": "Adam",
                "affiliation": [
                    "Hochschule für Technik und Wirtschaft Berlin"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-04-24",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 4",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2019_004",
        "identifier": {
            "string_id": "10.17175/2016_012",
            "id_scheme": "DOI"
        },
        "abstract": "The article presents an annotation system for narratological phenomena such as space, time, focalisation, reported speech,  narrator's speech, the relationship between the speech of a character/of the narrator and that of a certain character,  evaluative remarks, negation, figurative speech, and ambiguity. Guidelines for annotation are being developed in order to  enable different people to achieve consistent results when working with the same text (inter-annotator agreement). In doing  so, narratological models will be systematically reassessed and refined. The aim of this project is therefore to annotate  approximately 100 short German-language narratives. The corpus will be reusable for a variety of purposes. It permits systematic access to corpus segments annotated in the same way and supports quantifiable contributions in the fields of historical  narratology, cultural studies and the history of literary genres.",
        "article_title": "Narratologische Textauszeichnung in Märe und Novelle. Mit Annotationsbeispielen und exemplarischer Auswertung von Sperber und Häslein durch MTLD und Sozialer Netzwerkanalyse",
        "authors": [
            {
                "given": "Friedrich Michael",
                "family": "Dimpel",
                "affiliation": [
                    "Technische Universität Darmstadt, Institut für Sprach- und Literaturwissenschaft"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-06-26",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 4.2019",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2018_002",
        "identifier": {
            "string_id": "http://dx.doi.org/10.17175/2018_002",
            "id_scheme": "DOI"
        },
        "abstract": "Sonification is the transformation of data into sounds. In the natural sciences, it serves as a supplement to visual interfaces, as an alternative method of analysis, and as an instrument for communicating scientific phenomena. In the Digital Humanities, sonification and its wide range of possibilities has not yet been explored. This paper reports on methodological approaches to sonification, reflects on perceptive and epistemological aspects, and discusses examples from practice. In closing, several possibilities for generating sonification from data will be demonstrated.",
        "article_title": "Sonifikation. Vermittlungsansätze zwischen Klang und Information",
        "authors": [
            {
                "given": "Torsten",
                "family": "Roeder",
                "affiliation": [
                    "Universität Würzburg"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-08-03",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 3.2018",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb004_003",
        "identifier": {
            "string_id": "10.17175/sb004_003",
            "id_scheme": "DOI"
        },
        "abstract": "The focus of the imports of TEI documents from the German Text Archive (DTA) into a graph database (Neo4j) evaluated here is the marking of uncertain readings and editorial additions in manuscripts. In this context, we also briefly present the TEI guidelines for dealing with doubts and uncertainties. Since several people usually work in editing or transcription projects, we regard responsibility information at dubious points as central to the interoperability of data and the intersubjective traceability of individual decisions. This applies in particular if additional information on the degree of security of a resolution is possible. Graph technologies offer possibilities for modeling, visualization and analysis of uncertainty and responsibility. With a sufficiently large amount of data, personal labeling profiles of the respective editors can be created, for example.",
        "article_title": "Modellierung von Zweifel – Vorbild TEI im Graphen",
        "authors": [
            {
                "given": "Andreas",
                "family": "Kuczera",
                "affiliation": [
                    "Akademie der Wissenschaften und der Literatur, Mainz"
                ]
            },
            {
                "given": "Dominik",
                "family": "Kasper",
                "affiliation": [
                    "Akademie der Wissenschaften und der Literatur, Mainz"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-07-18",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 4",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2018_004",
        "identifier": {
            "string_id": "10.17175/2018_004",
            "id_scheme": "DOI"
        },
        "abstract": "For quantitative literary analysis, the Spanish Golden Age seems to be a perfect field of research. Many texts are provided by Virtual Libraries like the most known BVMC (Biblioteca Virtual Miguel de Cervantes) in various editions. Though for textual analysis like stylometry not only the text itself, but also the metadata should be complete and correct. As the contemporary editions of the Golden Age are themselves difficult to judge regarding the textual originality, additional information (usually called metadata) about the origin of text, author, date, place is needed. The following paper discusses the problem of existing textual basis for stylometric analysis using the example of authorship attribution for the apocryphal second volume of the Quijote by Avellaneda (pseudonym). The aim is not to discover the real identity of the author Avellaneda, but to test the method with various parameters (cosine Delta, selected wordlist, culling, rolling Delta) and to discuss the results in the context of other existing authorship attributional methods and in the context of traditional working literary history and studies.",
        "article_title": "Die Digitalisierung des goldenen Zeitalters – Editionsproblematik und stilometrische Autorschaftsattribution am Beispiel des Quijote",
        "authors": [
            {
                "given": "Nanette",
                "family": "Rißler-Pipka",
                "affiliation": [
                    "Universität Siegen"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-09-28",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 3.2018",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb004_002",
        "identifier": {
            "string_id": "10.17175/sb004_002",
            "id_scheme": "DOI"
        },
        "abstract": "The unique characteristics of Maya writing pose special challenges for research, from which contradictory and doubtful deciphering hypotheses emerge. The project  ›Text Database and Dictionary    of Classic Mayan‹ aims at creating a machine-readable corpus of all Maya texts and compiling a dictionary on this basis. An inventory of all hieroglyphs is an indispensable instrument for further decipherment. This paper describes the development of the digital Sign Catalogue with special consideration of the modelling of decipherment hypotheses and their qualitative evaluation. Furthermore, the article emphasises the role of knowledge representation in Digital Humanities projects.",
        "article_title": "Modellierung von Entzifferungshypothesen in einem digitalen Zeichenkatalog für die Maya-Schrift",
        "authors": [
            {
                "given": "Franziska",
                "family": "Diehr",
                "affiliation": [
                    "Niedersächsische Staats- und Universitätsbibliothek Göttingen"
                ]
            },
            {
                "given": "Sven",
                "family": "Gronemeyer",
                "affiliation": [
                    "Rheinische Friedrich-Wilhelms-Universität, Abteilung für Altamerikanistik"
                ]
            },
            {
                "given": "Christian",
                "family": "Prager",
                "affiliation": [
                    "Rheinische Friedrich-Wilhelms-Universität, Abteilung für Altamerikanistik"
                ]
            },
            {
                "given": "Elisabeth",
                "family": "Wagner",
                "affiliation": [
                    "Rheinische Friedrich-Wilhelms-Universität, Abteilung für Altamerikanistik"
                ]
            },
            {
                "given": "Katja",
                "family": "Diederichs",
                "affiliation": [
                    "Rheinische Friedrich-Wilhelms-Universität, Abteilung für Altamerikanistik"
                ]
            },
            {
                "given": "Maximilian",
                "family": "Brodhun",
                "affiliation": [
                    "Niedersächsische Staats- und Universitätsbibliothek Göttingen"
                ]
            },
            {
                "given": "Uwe",
                "family": "Sikora",
                "affiliation": [
                    "Niedersächsische Staats- und Universitätsbibliothek Göttingen"
                ]
            },
            {
                "given": "Nikolai",
                "family": "Grube",
                "affiliation": [
                    "Rheinische Friedrich-Wilhelms-Universität, Abteilung für Altamerikanistik"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-01-16",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 4",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb004_013",
        "identifier": {
            "string_id": "10.17175/sb004_013",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Die Modellierung des Zweifels – Schlüsselideen und -konzepte zur graphbasierten Modellierung von Unsicherheiten. Zur Einführung in diesen Band",
        "authors": [
            {
                "given": "Andreas",
                "family": "Kuczera",
                "affiliation": [
                    "Akademie der Wissenschaften und der Literatur | Mainz"
                ]
            },
            {
                "given": "Thorsten",
                "family": "Wübbena",
                "affiliation": [
                    "Deutsches Forum für Kunstgeschichte Paris"
                ]
            },
            {
                "given": "Thomas",
                "family": "Kollatz",
                "affiliation": [
                    "Akademie der Wissenschaften und der Literatur | Mainz"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-01-16",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 4",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb004_012",
        "identifier": {
            "string_id": "10.17175/sb004_012",
            "id_scheme": "DOI"
        },
        "abstract": "To represent research data from the realm of the humanities in a digital knowledge graph presents a double challenge: How is uncertain data to be stored, and what does that imply for retrieval and presentation? Which notions are conveyed through uncertain data, and how do they influence our concept of knowledge? The cultural history information system ZUCCARO created by the Bibliotheca Hertziana is a good example for a complex knowledge graph. Three cases of uncertainty or vagueness are to be distinguished: Precision, plausibility and positively negative assertions. Our contribution studies the three aspects with regard to the historic reality, the state of scientific research and the usability of the content data for scholars.",
        "article_title": "Genau, wahrscheinlich, eher nicht: Beziehungsprobleme in einem Wissensgraph",
        "authors": [
            {
                "given": "Martin",
                "family": "Raspe",
                "affiliation": [
                    "Bibliotheca Hertziana – Max Planck Institut für Kunstgeschichte, Rom"
                ]
            },
            {
                "given": "Georg",
                "family": "Schelbert",
                "affiliation": [
                    "Humboldt-Universität zu Berlin, Institut für Kunst- und Bildgeschichte"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-02-13",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 4",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb003_004",
        "identifier": {
            "string_id": "10.17175/sb003_004",
            "id_scheme": "DOI"
        },
        "abstract": "This paper is written based on workshop discussions and on my research paper presented at the University of Bayreuth’s DFG funded conference, entitled: »Wie Digitalität die Geisteswissenschaften verändert. Neue Forschungsgegenstände und Methoden« March 23–24, 2017. The paper aims to investigate the state of the art, issues, advantages and drawbacks of the use of digital technology for the research of Islamic Art and Architecture. Rather than being conclusive, this paper aspires to discuss research methodology of the History of Islamic Art and Architecture. This is of importance given the lack of such discussions in the given field. The paper is based on my ongoing PhD research of Aesthetics of Ilkhanid Architectural Revetment in Central Iran c. 1300 at the Otto-Friedrich-Universität Bamberg. It discusses the question of the use of digital technology for the benefit of the research. Its particular focus is an inquiry of use of digital technology for the research of stucco revetments and monumental architectural stucco inscriptions (Figures 1 and 2, 3) from 13-14th centuries in Central Iran. The paper argues that the use of digital technology is of key importance for the advancement of Islamic Art studies and for researchers to overcome the traditional approach of stylistic comparison. The paper also explains why Digitality cannot entirely substitute key primary sources stemming from research of museum collections and objects handling or field research of monuments, on which studies of Islamic Material Culture are based.",
        "article_title": "Islamic Stuccos made Digital. Digitality and Studies of Islamic Art and Architecture",
        "authors": [
            {
                "given": "Ana Marija",
                "family": "Grbanovic",
                "affiliation": [
                    "Otto-Friedrich-Universität Bamberg"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-06-27",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 3",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb004_007",
        "identifier": {
            "string_id": "10.17175/sb004_007",
            "id_scheme": "DOI"
        },
        "abstract": "Using a specific research project, this article presents an approach for displaying phenomena of uncertainty in humanities contexts – here, legal history – in a data model. In the proposal for modeling a research context, the core thesis depends on three levels that describe a) the historical phenomena, b) the traditional evidence for this phenomena, and c) the latest historical research. Although ambiguities and uncertainties will be present on all three levels, they will be modeled on the third level only since they can not be separated from the historical research. The following paper presents the research project ›Die Regierung der Universalkirche nach dem Konzil von Trient‹ with regard to uncertainties in data modeling (1.). The preliminary, at times unofficial, data model will then be described (2.); finally, this article will discuss future prospects for the further development of the model as well as challenges within the context of the project, such as in data entry and processing (3.).",
        "article_title": "Ambiguität und Unsicherheit: Drei Ebenen eines Datenmodells",
        "authors": [
            {
                "given": "Andreas",
                "family": "Wagner",
                "affiliation": [
                    "Akademie der Wissenschaften und der Literatur, Mainz"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-01-30",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 4",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb003_011",
        "identifier": {
            "string_id": "10.17175/sb003_011",
            "id_scheme": "DOI"
        },
        "abstract": "In October 2002 the project Virtualization of Sculpture.    Reconstruction, Presentation, Installation started in the context of the DFG-funded Special Research Area Media Upheavals at the University of Siegen. It ended in 2009. In this project, art history, media studies, and computer science cooperated in order to ‘virtualize’ the complex sculptural ensembles of Gianlorenzo Bernini at the Villa Borghese in Rome. With the help of the scanned sculptures, reconstructed in a virtual model of the Villa Borghese, research questions in art history as well as regarding the theory of images were to be answered experimentally. Although the term was never used in the project itself, it is an early example for the field that is now called Digital Humanities – in the sense that digital technologies were not only used for the scientific work, but were also developed in the course of the project.",
        "article_title": "»Virtualisierung von Skulptur«. Ein kurzer Erfahrungsbericht",
        "authors": [
            {
                "given": "Jens",
                "family": "Schröter",
                "affiliation": [
                    "Universität Bonn, Institut für Sprach-, Medien- und Musikwissenschaft, Abteilung Medienwissenschaft"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-06-27",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 3",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb003_014",
        "identifier": {
            "string_id": "10.17175/sb003_014",
            "id_scheme": "DOI"
        },
        "abstract": "What does it mean to practice art history with digital images? In the sense of Malraux, it would then be designated the history of the digitalisable. This essay explores how medial innovations influence the perception of the past and characterise this process as a feedback phenomenon. Modifications of the artistic canon are the consequences. These questions of canon are relevant for the discipline in as far as it orients itself to the currently valid definition of art. The utopia of a decanonisation or even a general availability of knowledge is closely linked to the idea of research based on data. In response to the core problem of the relationships expressed in this speech between digital and classical humanities, the concept of mechanical agency was introduced, which describes the interaction between human and computer-based acts. In addition to contemplation moored more strongly in media theory, this essay proposes to reopen foundational debates, such as on the relationship between visual culture and art history. With a view to the history of the discipline and in light of the digital turn, this essay advocates for stronger reflection on the concepts of knowledge, work-image-art and canon, as well as on the corresponding (digital) instruments as units that are not neutral.",
        "article_title": "Kunstgeschichte der digitalen Bilder",
        "authors": [
            {
                "given": "Maria",
                "family": "Männig",
                "affiliation": [
                    "Karlsruhe"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-06-27",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 3",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb003_010",
        "identifier": {
            "string_id": "10.17175/sb003_010",
            "id_scheme": "DOI"
        },
        "abstract": "Periodicals have not previously been a powerful object of research; they have been relevant only for certain disciplines with specific methods. Therefore, their mass digitisation and the application of computer-generated analysis can proceed without attracting conspicuous attention. This article focuses not on how the digital humanities change objects and their corresponding analytical methods, but on how they can contribute to the transformation of the journal into an important research object in the first place. I argue that the humanities cannot even conceptualize the journal in its specific multi-dimensionality and that digitisation now offers the chance to compensate for this deficiency. ",
        "article_title": "›Kleine Archive‹ in den Digital Humanities – Überlegungen zum Forschungsobjekt ›Zeitschrift‹",
        "authors": [
            {
                "given": "Madleen",
                "family": "Podewski",
                "affiliation": [
                    "Freie Universität Berlin, Institut für deutsche und niederländische Philologie"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-06-27",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 3",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb003_002",
        "identifier": {
            "string_id": "10.17175/sb003_002",
            "id_scheme": "DOI"
        },
        "abstract": "This paper presents the relationship between the disciplines involved in the digital humanities, focusing in particular on the role of computer science. Subsequently, requirements for a successful cooperation between scientists of different disciplinary backgrounds are presented, and finally, potentials arising from the digital context for the humanities are formulated. We understand digital humanities as a challenge and at the same time as an opportunity to bridge the separation of the sciences and humanities, which has been cultivated for too long.",
        "article_title": "Digital Humanities – Eine Herausforderung an die Informatik und an die Geisteswissenschaften",
        "authors": [
            {
                "given": "Klaus-Georg",
                "family": "Deck",
                "affiliation": [
                    "Duale Hochschule Baden-Württemberg, Digitalität und Data Science"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-06-27",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 3",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2018_003",
        "identifier": {
            "string_id": "10.17175/2018_003",
            "id_scheme": "DOI"
        },
        "abstract": "The article analyses the composition of colour in the mise-en-scène of the zombie-movies REC, 28 Days Later and World War Z via a computer based approach. It first evaluates some of the methodological problems of common colour-quantisation by using clustering-algorithms in the context of film studies, then a new developed process is presented which builds on the theory of colour contrasts by Johannes Itten. A simple statistical analysis of two contrast ratios for each of the movies demonstrates that this approach is capable of providing detailed insights into the composition of colour in movies in general. Furthermore, the analysis of the three movies reveals that the accentuation of colour contrast relations serves different functions: colours can support the narrative structure of the movie, emphasize repeating motifs or establish an autonomous aesthetic space.",
        "article_title": "Everything is Illuminated. Zur Numerischen Analyse von Farbigkeit in Filmen",
        "authors": [
            {
                "given": "Johannes",
                "family": "Pause",
                "affiliation": [
                    "Universität Luxemburg, Fakultät für Sprachwissenschaften und Literatur, Geisteswissenschaften, Kunst und Erziehungswissenschaften"
                ]
            },
            {
                "given": "Niels-Oliver",
                "family": "Walkowski",
                "affiliation": null
            }
        ],
        "publisher": null,
        "date": "2018-09-24",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 3.2018",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb002_007",
        "identifier": {
            "string_id": "10.17175/sb002_007",
            "id_scheme": "DOI"
        },
        "abstract": "Digital editions in the semantic web? This paper explores the question of the relevance and further development of semantic technologies in digital editions in the arts and humanities. The XML TEI-based editions of texts can be set on top of established publication structures. However, the widespread use of the TEI standard has led not to the interoperability of editions – despite the intentions of its creator—but rather to the increasingly strong specialization of the markup by discipline. This situation has led to the need for solutions for aggregation, re-usability, and the networking of editions as well as for encoding using a machine-readable semantic – one that is capable of generating other forms of connections using Linked Open Data (LOD), authority files, and other metadata.",
        "article_title": "Der nächste Schritt? Semantic Web und digitale Editionen.",
        "authors": [
            {
                "given": "Jörg",
                "family": "Wettlaufer",
                "affiliation": [
                    "Akademie der Wissenschaften zu Göttingen (ADWG)"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-03-15",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 2",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb003_013",
        "identifier": {
            "string_id": "10.17175/sb003_013",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Dimensionen Digitaler Geisteswissenschaften. Zur Einführung in diesen Band",
        "authors": [
            {
                "given": "Sybille",
                "family": "Krämer",
                "affiliation": [
                    "Freie Universität Berlin, Institut für Philosophie "
                ]
            },
            {
                "given": "Martin",
                "family": "Huber",
                "affiliation": [
                    "Universität Bayreuth, Lehrstuhl für Neuere deutsche Literaturwissensschaft"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-06-27",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 3",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb002_003",
        "identifier": {
            "string_id": "10.17175/sb002_003",
            "id_scheme": "DOI"
        },
        "abstract": "The article explores some of the continuities and discontinuities that mark the ongoing change in international editorial ventures from a nondigital to a digital framework. Placing collaboration at the centre of the editorial work, it is assumed that reading is the minimal act of collaboration which lies at the basis of the one-language/one-literature model, i.e., the national philology paradigm. Such a paradigm appealed to international cooperation in a number of ways (archives, journals, publishing houses, etc.), but it also came to promote the idea of trans-national abstract goals (e.g., in Lachmann’s ideal of recension without interpretation or in Gaston Paris’s utopian cité des sciences). These goals favoured the progressive establishment of the digital paradigm, which in turn encouraged (or facilitated) a change of direction, from the study of in situ textual specificities to taxonomies aiming at a representation of the general structure of texts. Against the backdrop of the new paradigm, international collaboration has been intensified, but, it is argued, the new medium does not take the place of the old medium, rather interacts with it. In the end, the article touches upon some of the challenges faced by digital initiatives, namely regarding sustainability and political issues.",
        "article_title": "International/global networking against the backdrop of nondigital and digital editorial ventures",
        "authors": [
            {
                "given": "João",
                "family": "Dionísio",
                "affiliation": [
                    "Universität Lissabon, Philosophische Fakultät"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-03-15",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 2",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb002_009",
        "identifier": {
            "string_id": "10.17175/sb002_009",
            "id_scheme": "DOI"
        },
        "abstract": "Using an examination of the orthography of a print by the printer Georg Stüchs from 1508, this paper demonstrates how modern digital editions can be used for historio-linguistic research. After an overview of the letters/graphemes and abbreviations used by the print shop, this analysis concentrates on the following aspects: the spelling of diphthongs and of /œ, ø:/ und /ʏ, y:/; writing variations for /ɪ, i:/, /ʊ, u:/, /f/ und /t/; the distribution of the letters &lt;S, ſ, ß, s&gt;; and the capitalization of nouns. By comparing the text [A]bschrieffte eines Sandtbriefes with a contemporary print of the same text published independently, also attributed to Georg Stüchs, this paper explores the extent to which the language of a printer’s workshop can be considered homogeneous.",
        "article_title": "»Newe landte« in der historischen Sprachwissenschaft: Ein Beitrag zur Druckersprache der Nürnberger Offizin Georg Stüchs auf Grundlage der Digitaledition Paesi novamente retrovati - Newe unbekanthe landte.",
        "authors": [
            {
                "given": "Norbert",
                "family": "Ankenbauer",
                "affiliation": [
                    "Universidade Federal de Minas Gerais, Belo Horizonte/Brasilien"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-03-15",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 2",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb002_004",
        "identifier": {
            "string_id": "10.17175/sb002_004",
            "id_scheme": "DOI"
        },
        "abstract": "Scholarly editions were one of the first engines for introducing digital methods into the humanities and social sciences. The digital infrastructures developed for creating individual editions could lead to a new type of edition, if the data were prepared in such a way as to make them usable in multiple editions. The reuse of data is playing an increasingly important role, but it also generates new problems. This essay describes the opportunities and risks of overlapping editions using the example of the AMIE infrastructure.",
        "article_title": "Von der Raupe zum Schmetterling oder Wie fliegen lernen – Editionsphilologie zwischen Infrastruktur und Semantic Web",
        "authors": [
            {
                "given": "Roland S.",
                "family": "Kamzelak",
                "affiliation": [
                    "Deutsches Literaturarchiv Marbach"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-03-15",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 2",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb002_005",
        "identifier": {
            "string_id": "10.17175/sb002_005",
            "id_scheme": "DOI"
        },
        "abstract": "Next to the primary goal of encoding and the systematic markup of the autobiographical documents in the manuscript collection of the Herzog August Library (HAB), it is of central importance for the project Selbstzeugnisse‹ der Frühen Neuzeit in der HAB (›Autobiographical writings of the early modern age in the Herzog August Library‹) to evaluate the options for producing and compiling texts and research results. In comparison with print-based methods, and using the group of autobiographical texts, the opportunities, advantages, and disadvantages of the scholarly distribution of information and communication should be explored. The Selbstzeugnisse in this project are defined as autobiographical writings, such as diaries, travel journals, or autobiographies, although the term is intentionally left open and is under discussion. The project results will be a finding aid to the Selbstzeugnisse using autoptic analysis of the manuscripts, a digital critical edition of the diary of Duke August the Younger of Braunschweig-Wolfenbuettel, and the presentation of the project results in a research portal.",
        "article_title": "Selbstzeugnisse digital – Erschließung, Präsentation und Benutzbarkeit",
        "authors": [
            {
                "given": "Inga Hanna",
                "family": "Ralle",
                "affiliation": [
                    "Herzog August Bibliothek Wolfenbüttel"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-03-15",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 2",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb002_006",
        "identifier": {
            "string_id": "10.17175/sb002_006",
            "id_scheme": "DOI"
        },
        "abstract": "The first recommendations for the classification and evaluation of digital editions were already published in the process of establishing the WWW as the primary medium of publication for digital content in the late 1990s. However, owing in part to methodological and technical developments, basic questions about the evaluation of digital editions are still being discussed. This article explores the review process as a means of evaluating scholarly digital editions, building on the background of the evaluation criteria that provide the basis for reviewing and the broader context of evaluating digital research results as a whole. In this way, many aspects can be worked out for the evaluation of digital editions: the appropriate representation of the edited object in digital data, for example, through text encoding; the innovative interaction with the digital medium; a meaningful consensus between content and form in the presentation of the edited material, etc. Despite the future changes in scholarly communication, the review as an ›evaluative genre with tradition‹ remains an ideal tool for discussing the quality of digital editions.",
        "article_title": "Reviewing von digitalen Editionen im Kontext der Evaluation digitaler Forschungsergebnisse",
        "authors": [
            {
                "given": "Ulrike",
                "family": "Henny",
                "affiliation": [
                    "Universität Würzburg, Institut für Deutsche Philologie"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-03-15",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 2",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb003_001",
        "identifier": {
            "string_id": "10.17175/sb003_001",
            "id_scheme": "DOI"
        },
        "abstract": "In his contribution to the first Symposium on Digitalität in den Geisteswissenschaften Martin Warnke took up and expandend the distinction between »digitality« and »digitalisation« previously introduced by Claus Pias for art history. According to this distinction, a practice in the humanities is digitalized if it is today computer-aided, but already existed previously in non-digitalized form. Digital activites are instead those that have only become possible thanks to new digital methods. In my contribution will argue that the history of science is today facing the challenge of becoming not just digitalized, but digital, if it wished to invesitgate the transformation which took place in science due to digitalities.",
        "article_title": "Wissenschaftsgeschichte zwischen Digitalität und Digitalisierung",
        "authors": [
            {
                "given": "Arianna",
                "family": "Borrelli",
                "affiliation": [
                    "Technische Universität Berlin, Institut für Philosophie, Literatur-, Wissenschafts- und Technikgeschichte"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-06-27",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 3",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb002_001",
        "identifier": {
            "string_id": "10.17175/sb002_001",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Digitale Metamorphose: Digital Humanities und Editionswissenschaft",
        "authors": [
            {
                "given": "Roland S.",
                "family": "Kamzelak",
                "affiliation": [
                    "Deutsches Literaturarchiv Marbach"
                ]
            },
            {
                "given": "Timo",
                "family": "Steyer",
                "affiliation": [
                    "Forschungsverbund Marbach Weimar Wolfenbüttel"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-03-15",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 2",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb003_003",
        "identifier": {
            "string_id": "10.17175/sb003_003",
            "id_scheme": "DOI"
        },
        "abstract": "This essay questions whether digital literary studies can still be meaningfully regarded as part of literary studies. This heretical question is motivated by a praxeological view of a research project for the network analysis of dramatic texts, in particular by reflecting on the project’s underlying ›epistemic thing‹, which in this case consists of specifically-formatted structural data (and not the actual primary texts themselves). What does this corpus of structural data, which was extracted from 465 plays spanning the period from 1730 to 1930, have to do with the ›epistemic things‹ of literary studies? We explore this question by providing insight into our analyses, which describe the structural evolution of the ›plays‹, try to locate ›small world‹ properties in our corpus, and develop new metrics for plot analysis. The results show not only how digital methods can supplement or enrich literary studies; they also raise questions about how digital the field of literary studies already is, since its research objects are increasingly available in digital forms.",
        "article_title": "Literaturwissenschaft als Hackathon. Zur Praxeologie der Digital Literary Studies und ihren epistemischen Dingen",
        "authors": [
            {
                "given": "Peer",
                "family": "Trilcke",
                "affiliation": [
                    "Universität Potsdam, Institut für Germanistik"
                ]
            },
            {
                "given": "Frank",
                "family": "Fischer",
                "affiliation": [
                    "National Research University Higher School of Economics Moscow Russia"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-06-27",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 3",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2017_002",
        "identifier": {
            "string_id": "10.17175/2017_002",
            "id_scheme": "DOI"
        },
        "abstract": "Who is cleverer, man or machine? Since the 1950s, the answer to this question has been linked to Alan Turing and the Turing test he devised. This paper builds upon this foundation with its comparison of two analyses of a historical collection of correspondence: one created by humans using ›close reading‹ and the application of subject terms, and one generated by machines with the help of topic modeling. In addition to concrete evaluation of the topic modeling process, this paper investigates whether, and, if so, to what extent, it is feasible and justifiable to use methods that can hardly be understood without in-depth knowledge of probability calculations and statistics. ",
        "article_title": "Turing Test für das Topic Modeling. Von Menschen und Maschinen erstellte inhaltliche Analysen der Korrespondenz von Leo von Thun-Hohenstein im Vergleich",
        "authors": [
            {
                "given": "Peter",
                "family": "Andorfer",
                "affiliation": [
                    "Österreichische Akademie der Wissenschaften (OAW), Austrian Centre for Digital Humanities (ACDH)"
                ]
            }
        ],
        "publisher": null,
        "date": "2017-04-25",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 2.2017",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2016_010",
        "identifier": {
            "string_id": "10.17175/2016_010",
            "id_scheme": "DOI"
        },
        "abstract": "The main tasks of contemporary digital philology are the digitization of texts, the development of complex digital editions, and the creation of text corpora that can be analyzed by machines. These activities build on methods and findings that have been explored in computer linguistics for decades. There is, however, a need to adapt those procedures to the requirements of literary analysis, such as in their granularity. This paper outlines possible approaches for the digital processing of large volumes of text and for the development of complex annotation processes. These methods change the very basis of literary analysis, especially if the texts are available on the internet. The next step, therefore, is to discuss the new possibilities for the analysis of literary text that arise from this situation. These possibilities go beyond the mere development of procedures for systematic and verifiable literary analysis of large text corpora. One new step, for example, would be the representation of multi-dimensional qualities of literary texts by data linkage in the Semantic Web, which could make literary texts available for other disciplines as well.",
        "article_title": "Die Vernetzung des Textes: Im Möglichkeitsraum digitaler Literaturanalyse",
        "authors": [
            {
                "given": "Christine",
                "family": "Ivanovic",
                "affiliation": [
                    "Abteilung für Vergleichende Literaturwissenschaft an der Universität Wien, Institut für Corpuslinguistik und Texttechnologien (ICLTT) der Österreichischen Akademie der Wissenschaften (ÖAW)"
                ]
            }
        ],
        "publisher": null,
        "date": "2017-02-10",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 2.2017",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2018_001",
        "identifier": {
            "string_id": "10.17175/2018_001",
            "id_scheme": "DOI"
        },
        "abstract": "The Perthes collection represents the survival of one of the few completely preserved archives of a cartographic publisher. This publishing house significantly contributed to the scientific exploration, mapping, and surveying of the earth in the 19th and early 20th centuries. In addition to the maps as end products, the collection contains unique and closely interconnected archival materials that document the process of mapping and map-making at all stages. The following article presents a new prototype of a virtual map laboratory that was developed in the first project phase, which will allow these materials to be studied within the context of their different connections.",
        "article_title": "Mehr als nur Karten. Das Virtuelle Kartenlabor (GlobMapLab) als Zugang zur Sammlung Perthes",
        "authors": [
            {
                "given": "Norman",
                "family": "Henniges",
                "affiliation": [
                    "Forschungszentrum Gotha der Universität Erfurt"
                ]
            },
            {
                "given": "Susanne",
                "family": "Rau",
                "affiliation": [
                    "Universität Erfurt"
                ]
            },
            {
                "given": "René",
                "family": "Smolarski",
                "affiliation": [
                    "Forschungszentrum Gotha der Universität Erfurt"
                ]
            },
            {
                "given": "Heiko",
                "family": "Tzschach",
                "affiliation": [
                    "Technische Universität Ilmenau"
                ]
            }
        ],
        "publisher": null,
        "date": "2016-07-08",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 3.2018",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2017_005",
        "identifier": {
            "string_id": "10.17175/2017_005",
            "id_scheme": "DOI"
        },
        "abstract": "Within the discipline of history, digital approaches, tools, and research methods are taking on increasing importance as both a research topic in its own right and as a way to support the field of history as a whole. In spite of this broad interest, projects that make use of new digital tools and methods such as topic modeling continue to be reviewed very critically. Using two projects as examples, this article therefore demonstrates how topic modeling can be used and further developed in order to support historical research. Both projects deal with bodies of knowledge from the 19th century, one in the context of the scholarly implementation of spectral analysis and the other within the context of historical education during the period of the German Emperor Wilhelm II. Through these examples, this article shows where topic modeling can still be improved and what role traditional hermeneutics must have as a central component in the application of topic modeling in the field of history, and thus the boundaries and capabilities of the use of topic modeling in historical research.",
        "article_title": "Einsatz von Topic Modeling in den Geschichtswissenschaften: Wissensbestände des 19. Jahrhunderts",
        "authors": [
            {
                "given": "Martin",
                "family": "Fechner",
                "affiliation": [
                    "Berlin-Brandenburgische Akademie der Wissenschaften"
                ]
            },
            {
                "given": "Andreas",
                "family": "Weiß",
                "affiliation": [
                    "Berlin-Brandenburgische Akademie der Wissenschaften"
                ]
            }
        ],
        "publisher": null,
        "date": "2017-12-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 2.2017",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2017_003",
        "identifier": {
            "string_id": "10.17175/2017_003",
            "id_scheme": "DOI"
        },
        "abstract": "Digital analyses of literary genres are often based on the assumption that genres can be identified through constant and unvarying features. However, genres always reveal themselves as historically-based constructs with features that change and evolve over time. This paper illustrates how such historical developments in genres can be retraced with digital methods by means of a prominent example from Middle High German literature, Minnesang. With the help of frequency analysis and topic modeling, a research question which has been much debated will be discussed: whether there was an historical shift in genre during the development of Minnesang that differentiates the lyric poetry of the later period from ›classical‹ Sang. ",
        "article_title": "Digitale Gattungsgeschichten. Minnesang zwischen generischer Konstanz und Wende",
        "authors": [
            {
                "given": "Gabriel",
                "family": "Viehhauser",
                "affiliation": [
                    "Universität Stuttgart, Institut für Literaturwissenschaft, Digital Humanities."
                ]
            }
        ],
        "publisher": null,
        "date": "2017-12-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 2.2017",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2017_006",
        "identifier": {
            "string_id": "10.17175/2017_006",
            "id_scheme": "DOI"
        },
        "abstract": "In this article, we present current stylometric studies on Delta. (1) We discuss why the use of cosine similarity improves the rate of success; our experiments on vector normalization lead to a better understanding of how Delta works. (2) Based on a corpus of Middle High German texts, we show that metrical properties can also be used for authorship attribution. The degree to which Delta is influenced by non-normalized medieval spellings is also investigated. (3) Using a corpus of Arabic-Latin translations, we explore how selective feature elimination can be used to separate the translator signal from the genre signal.",
        "article_title": "»Delta« in der stilometrischen Autorschaftsattribution",
        "authors": [
            {
                "given": "Andreas",
                "family": "Büttner",
                "affiliation": [
                    "Universität Würzburg, Institut für Philosophie"
                ]
            },
            {
                "given": "Friedrich Michael",
                "family": "Dimpel",
                "affiliation": [
                    "FAU Erlangen-Nürnberg, Department Germanistik und Komparatistik"
                ]
            },
            {
                "given": "Stefan",
                "family": "Evert",
                "affiliation": [
                    "FAU Erlangen-Nürnberg, Department Germanistik und Komparatistik"
                ]
            },
            {
                "given": "Fotis",
                "family": "Jannidis",
                "affiliation": [
                    "Universität Würzburg, Institut für Deutsche Philologie "
                ]
            },
            {
                "given": "Steffen",
                "family": "Pielström",
                "affiliation": [
                    "Universität Würzburg, Institut für Deutsche Philologie"
                ]
            },
            {
                "given": "Thomas",
                "family": "Proisl",
                "affiliation": [
                    "FAU Erlangen-Nürnberg, Department Germanistik und Komparatistik"
                ]
            },
            {
                "given": "Isabella",
                "family": "Reger",
                "affiliation": [
                    "Universität Würzburg, Institut für Deutsche Philologie"
                ]
            },
            {
                "given": "Christof",
                "family": "Schöch",
                "affiliation": [
                    "Universität Trier, Fachbereich II / Computerlinguistik und Digital Humanities"
                ]
            },
            {
                "given": "Thorsten",
                "family": "Vitt",
                "affiliation": [
                    "Universität Würzburg, Institut für Deutsche Philologie"
                ]
            }
        ],
        "publisher": null,
        "date": "2017-12-20",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 2.2017",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb001_023",
        "identifier": {
            "string_id": "10.17175/sb001_023",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Die Digital Humanities im deutschsprachigen Raum. Methoden - Theorien - Projekte",
        "authors": [
            {
                "given": "Constanze",
                "family": "Baum",
                "affiliation": null
            },
            {
                "given": "Thomas",
                "family": "Stäcker",
                "affiliation": [
                    "Institution: Herzog August Bibliothek Wolfenbüttel"
                ]
            }
        ],
        "publisher": null,
        "date": "2016-03-22",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb002_010",
        "identifier": {
            "string_id": "10.17175/sb002_010",
            "id_scheme": "DOI"
        },
        "abstract": "This article deals with questions about interactive annotations of Robert Musils writings on MUSIL ONLINE. In this way, problem areas and approaches are described to show the development of structures of commentating.",
        "article_title": "Vom Livre irréalisé zum Texte hyperréalisé?",
        "authors": [
            {
                "given": "Artur R.",
                "family": "Boelderl",
                "affiliation": [
                    "Alpen-Adria-Universität Klagenfurt"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-03-15",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 2",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb002_002",
        "identifier": {
            "string_id": "10.17175/sb002_002",
            "id_scheme": "DOI"
        },
        "abstract": "This paper explores the concept of the ›edited text‹ and how it developed in the historical scholarly context. It describes the origins of objections that seek to deny the necessity of the ›edited text‹, and to frame it solely as a form of supplementary aid for the reader, while simultaneously insisting, with equally great emphasis, on the primacy of the ›edited text‹ as the cornerstone of the edition. In addition, this paper will also explain how modern editions interact with the construction of the ›edited text‹ as well as review the current state of debate in the field.",
        "article_title": "Der ›edierte‹ Text: Grundpfeiler der Edition oder ›Zugeständnis‹ an den Leser?",
        "authors": [
            {
                "given": "Bodo",
                "family": "Plachta",
                "affiliation": [
                    ""
                ]
            }
        ],
        "publisher": null,
        "date": "2018-03-15",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 2",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb002_008",
        "identifier": {
            "string_id": "10.17175/sb002_008",
            "id_scheme": "DOI"
        },
        "abstract": "The act of digital editing is permanently in flux, and it is currently located between medial experimentation, the text-critical attachment to tradition, and standardization. This experimental character can be subsumed under keywords such as multiperspectivity, multidisciplinarity, and trans- or multimediality. These keywords serve as the (re)productive power driving the permanent pursuit of more, which was initiated by the shift in format, with its changing research interests and goals. However, the corresponding medial and material metamorphoses produce the dilemma of a documentary level of detail in the digital edition that requires new strategies for use. As these new possibilities take digital editing to its limits, the next question is where its future direction will lead.",
        "article_title": "(Be)Ständige digitale Metamorphosen?! – »perhaps there will always be something more«",
        "authors": [
            {
                "given": "Carina",
                "family": "Hoff",
                "affiliation": [
                    "Universität Trier"
                ]
            }
        ],
        "publisher": null,
        "date": "2018-03-15",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 2",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb001_016",
        "identifier": {
            "string_id": "10.17175/sb001_016",
            "id_scheme": "DOI"
        },
        "abstract": "How would you measure color? The software Redcolor-Tool enables redness in images to be quantified for the first time. The technology attributes values of redness to any given color. This paper explores the methodological implications of color analysis for stylometric and historical approaches to visual studies. Furthermore, it examines the potential of new categories for the humanities which could emerge from quantitative feature metrics. The stylometry section is devoted to red color frequencies and color sums. A ›theory of coordination‹ based in stylometry is proposed as the methodological key. The historical section analyses red as the symbol of power and authority. Portraits from Titian´s Charles V to Bush´s portrait of Angela Merkel are analysed, taking the color red as the interpretational basis of traditional and contemporary political iconography. ",
        "article_title": "Rot rechnen",
        "authors": [
            {
                "given": "Waltraud",
                "family": "von Pippich",
                "affiliation": null
            }
        ],
        "publisher": null,
        "date": "2016-04-14",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2016_002",
        "identifier": {
            "string_id": "10.17175/2016_002",
            "id_scheme": "DOI"
        },
        "abstract": "In recent years, Automatic Writer Identification (AWI) has received a lot of attention in the document analysis community. However, most research has been conducted on contemporary benchmark sets. These datasets typically do not contain any noise or artefacts caused by the conversion methodology. This article analyses how current state-of-the-art methods in writer identification perform on historical documents. In contrast to contemporary documents, historical data often contain artefacts such as holes, rips, or water stains which make reliable identification error-prone. Experiments were conducted on two large letter collections with known authenticity and promising results of 82% and 89% TOP-1 accuracy were achieved.",
        "article_title": "Automatic Writer Identification in Historical Documents: A Case Study",
        "authors": [
            {
                "given": "Vincent",
                "family": "Christlein",
                "affiliation": [
                    "Pattern Recognition Lab, Friedrich-Alexander-Universität Erlangen-Nürnberg"
                ]
            },
            {
                "given": "Markus",
                "family": "Diem",
                "affiliation": [
                    "Computer Vision Lab, TU Wien"
                ]
            },
            {
                "given": "Florian",
                "family": "Kleber",
                "affiliation": [
                    "Computer Vision Lab, TU Wien"
                ]
            },
            {
                "given": "Günter",
                "family": "Mühlberger",
                "affiliation": [
                    "Digitisation and Digital Preservation (DEA), German Language and Literature, Innsbruck University"
                ]
            },
            {
                "given": "Verena",
                "family": "Schwägerl-Melchior",
                "affiliation": [
                    "Institut für Sprachwissenschaft, Karl-Franzens-Universität Graz"
                ]
            },
            {
                "given": "Esther",
                "family": "van Gelder",
                "affiliation": [
                    "Descartes Centre (Universiteit Utrecht)", "Huygens ING (KNAW)"
                ]
            },
            {
                "given": "Andreas",
                "family": "Maier",
                "affiliation": [
                    "Pattern Recognition Lab, Friedrich-Alexander-Universität Erlangen-Nürnberg"
                ]
            }
        ],
        "publisher": null,
        "date": "2016-07-05",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 1.2016",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2016_006",
        "identifier": {
            "string_id": "10.17175/2016_006",
            "id_scheme": "DOI"
        },
        "abstract": "The paper deals with linguistic transformation processes from ancient Greek sources which were translated into classical Arabic from the 9th to 11th century AD. The database Glossarium    Graeco-Arabicum concentrates on this topic and utilizes visualizations to develop an understanding of the still growing corpus of about 100,000 word records. Various examples demonstrate possible visualization methods for corpus structures, lexical differentiation, grammatical transformation and translation processes for single lexemes.",
        "article_title": "Mapping the Words. Experimentelle Visualisierungen von Übersetzungsstrukturen zwischen Altgriechisch und Hocharabisch",
        "authors": [
            {
                "given": "Torsten",
                "family": "Roeder",
                "affiliation": [
                    "Universität Würzburg"
                ]
            }
        ],
        "publisher": null,
        "date": "2016-09-12",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 1.2016",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2016_003",
        "identifier": {
            "string_id": "10.17175/2016_003",
            "id_scheme": "DOI"
        },
        "abstract": "This article describes the development of a service portfolio for a research data centre in the humanities; in particular, it explores which services are necessary to support the long-term preservation and re-use of the results of humanities research. First, the fundamental characteristics of digital research data in the humanities are examined. In addition to file-based research data – such as texts, images, videos, and so on – complex data structures become more prominent and pose new challenges for institutions working with research (data) infrastructures. Next, this paper describes the results of the test ingests using three types of research data – database, digital edition, and interactive visualisation – that were carried out during the design phase of the Humanities Data Centre (HDC), followed by a discussion of their implications for the HDC’s initial modular service portfolio, which could be expanded in the future in coordination with other research data centres. This article reflects the developments in the HDC project as of January 2016. Information about new developments can be found on the website: http://humanities-data-centre.de/.",
        "article_title": "Angebotsgenese für ein geisteswissenschaftliches Forschungsdatenzentrum",
        "authors": [
            {
                "given": "Stefan",
                "family": "Buddenbohm",
                "affiliation": [
                    "Max-Planck-Institut zur Erforschung multireligiöser und multiethnischer Gesellschaften"
                ]
            },
            {
                "given": "Claudia",
                "family": "Engelhardt",
                "affiliation": [
                    "Niedersächsische Staats- und Universitätsbibliothek Göttingen"
                ]
            },
            {
                "given": "Ulrike",
                "family": "Wuttke",
                "affiliation": [
                    "Akademie der Wissenschaften zu Göttingen"
                ]
            }
        ],
        "publisher": null,
        "date": "2016-08-03",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 1.2016",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2016_009",
        "identifier": {
            "string_id": "10.17175/2016_009",
            "id_scheme": "DOI"
        },
        "abstract": "One common assumption in the Digital Humanities is that one of its functions is to develop and apply new, computer-supported methods to address research topics in literary studies. Research questions in literary studies, however, are historically variable and highly dependent upon what one understands as the object of analysis: what is a text, and what is the point of investigating it? Such formulations are always the effect of media cultures, however. Using four characteristics as examples, this paper discusses the semantic transformation of the literary studies research object in connection with digitisation, and it advocates for an understanding of the Digital Humanities as the location of a fundamental methodological discussion about the nature of the literary object.",
        "article_title": "Was bedeutet die Digitalisierung für den Gegenstand der Literaturwissenschaft? ",
        "authors": [
            {
                "given": "Mirco",
                "family": "Limpinsel",
                "affiliation": [
                    "Universität Stuttgart"
                ]
            }
        ],
        "publisher": null,
        "date": "2016-09-26",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 1.2016",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/2016_004",
        "identifier": {
            "string_id": "10.17175/2016_004",
            "id_scheme": "DOI"
        },
        "abstract": "The concept of the metaphor is handled critically in poetics on a theoretical level and by means of literary examples. In the process of developing an annotation schema, the ePoetics project differentiates between the significant components of the explication of the metaphor concept, and, in addition, reveals the discourse and reference structures linked to them. Thus, it becomes clear which recognition possibilities and boundaries appear in the collaborative-discursive markup process before the data evaluation – with the digital algorithmic paradigm as foil – and how hermeneutics and algorithms interact – in the tradition of Stephen Ramsay’s ›algorithmic criticism‹.",
        "article_title": "Auf der Suche nach dem »goldnen Baum« – Digitale Annotation des Metaphernbegriffs in Poetiken: Erkenntnisprozess, diskursive Praktik und ›tertium comparationis‹",
        "authors": [
            {
                "given": "Stefan",
                "family": "Alscher",
                "affiliation": [
                    "Universität Stuttgart"
                ]
            },
            {
                "given": "Michael",
                "family": "Bender",
                "affiliation": [
                    "Technische Universität Darmstadt"
                ]
            }
        ],
        "publisher": null,
        "date": "2016-09-02",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 1.2016",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_006",
        "identifier": {
            "string_id": "10.17175/sb001_006",
            "id_scheme": "DOI"
        },
        "abstract": "This paper discusses the methodological effects of the interdisciplinary cooperation between humanities scholars and computer scientists in the context of the project heureCLÉA. The goal of heureCLÉA is to develop a ›digital heuristic‹ that supports the narratological analysis of literary texts by (1) performing automatically annotation tasks up to a certain level of complexity that previously could only be carried out manually, and by (2) identifying statistically salient text phenomena for the subsequent detailed analysis by the human user.In this project, it was essential to devote special attention to the specific disciplinary approaches. In this paper, we illustrate the ways in which the tensions between (non-deterministic) hermeneutics in the humanities and (deterministic) computer science can be productively employed and thus have an effect beyond the concrete research question.",
        "article_title": "Informatik und Hermeneutik. Zum Mehrwert interdisziplinärer Textanalyse",
        "authors": [
            {
                "given": "Evelyn",
                "family": "Gius",
                "affiliation": null
            },
            {
                "given": "Janina",
                "family": "Jacke",
                "affiliation": [
                    "Universität Hamburg"
                ]
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_021",
        "identifier": {
            "string_id": "10.17175/sb001_021",
            "id_scheme": "DOI"
        },
        "abstract": "Open review projects and wikis are changing academic knowledge production, just as academic blogs and social media are influencing scholarly communication. These digital forms of publishing challenge the usual practices of publishing and the concepts of authorship within the humanities, both practically and categorically. Therefore, it is necessary to revise the concept of ›scholarly authorship‹ by differentiating new forms of academic collaborative writing and to reflect on the academic quality of the new media formats within the humanities. This can be shown when analyzing self-curated digital publishing infrastructures and open license models of intellectual property.",
        "article_title": "Vom Urheber zur Crowd, vom Werk zur Version, vom Schutz zur Öffnung? Kollaboratives Schreiben und Bewerten in den Digital Humanities",
        "authors": [
            {
                "given": "Thomas",
                "family": "Ernst",
                "affiliation": null
            }
        ],
        "publisher": null,
        "date": "2015-09-15",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/2016_011",
        "identifier": {
            "string_id": "10.17175/2016_011",
            "id_scheme": "DOI"
        },
        "abstract": "In the Digital Humanities, the dominant belief is that the use of generic ›tools‹ could or should serve as a bridge between the different disciplines and their methodologies. Differences in cognitive interests and in hermeneutics between literary studies and history are too easily overlooked, and therefore both disciplines require the use of adapted and specialized digital tools. This paper investigates the hermeneutic suitability of current digital methods for the humanities and demonstrates their applicability by means of three examples: digital handwriting recognition, historical network analysis, and historical semantics informed by computational linguistics.",
        "article_title": "Neue Erkenntnisse durch digitalisierte Geschichtswissenschaft(en)? Zur hermeneutischen Reichweite aktueller digitaler Methoden in informationszentrierten Fächern",
        "authors": [
            {
                "given": "Jörg",
                "family": "Wettlaufer",
                "affiliation": [
                    "Göttingen Centre for Digital Humanities (GCDH)"
                ]
            }
        ],
        "publisher": null,
        "date": "2016-10-04",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Heft 1.2016",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1358",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_014",
        "identifier": {
            "string_id": "10.17175/sb001_014",
            "id_scheme": "DOI"
        },
        "abstract": "›Mixed Reality‹ describes the combination of virtual environments and natural user interfaces. Here, the user's field of vision is controlled by natural head movements via a head mounted display. Data gloves allow direct interaction with virtual objects and omnidirectional floors enable unrestricted navigation through virtual worlds with natural walking movements. A quasi-experimental study showed that ›mixed reality‹ had a positive effect, particularly on affective and motivational levels. The results are interpreted in the context of the new possibilities for pedagogy offered by such innovative technologies.",
        "article_title": "Neue Perspektiven für die Erziehungswissenschaften – Das                    Potenzial von Mixed Reality für Lehr- und Lernprozesse",
        "authors": [
            {
                "given": "Katharina",
                "family": "Schuster",
                "affiliation": null
            },
            {
                "given": "Anja",
                "family": "Richert",
                "affiliation": [
                    "RWTH-Aachen"
                ]
            },
            {
                "given": "Sabine",
                "family": "Jeschke",
                "affiliation": [
                    "RWTH-Aachen"
                ]
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_018",
        "identifier": {
            "string_id": "10.17175/sb001_018",
            "id_scheme": "DOI"
        },
        "abstract": "In this paper, we discuss the possibilities as well as the added value of using a web-based databank for video annotation (Pan.do/ra) in cultural studies research on film. The first part demonstrates a variety of potential uses through the example of a music video, and the second part introduces the software on a more general level. ",
        "article_title": "»Losing My Religion« – Einsatz der Videoannotationsdatenbank Pan.do/ra in der kunstgeschichtlichen Analyse von Musikvideos",
        "authors": [
            {
                "given": "Thorsten",
                "family": "Wübbena",
                "affiliation": null
            },
            {
                "given": "Eric",
                "family": "Decker",
                "affiliation": [
                    "Universität Heidelberg"
                ]
            },
            {
                "given": "Matthias",
                "family": "Arnold",
                "affiliation": [
                    "Universität Heidelberg"
                ]
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_015",
        "identifier": {
            "string_id": "10.17175/sb001_015",
            "id_scheme": "DOI"
        },
        "abstract": " This paper provides an overview of spatially oriented epigraphic research in medieval and early modern churches as part of the Spatial Humanities research project Inschriften im    Bezugssystem des Raumes (IBR). With the help of a custom made capturing software, this field uses geometric point cloud data from terrestrial laser scans as a primary source for spatial analysis. This data, in combination with epigraphic text sources and annotations, forms the basis for research on various symbolic and functional relations between objects in church interiors.",
        "article_title": "Semantisch angereicherte 3D-Messdaten von Kirchenräumen als Quellen für die geschichtswissenschaftliche Forschung",
        "authors": [
            {
                "given": "Felix",
                "family": "Lange",
                "affiliation": null
            },
            {
                "given": "Martin",
                "family": "Unold",
                "affiliation": [
                    "Hochschule Mainz"
                ]
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_017",
        "identifier": {
            "string_id": "10.17175/sb001_017",
            "id_scheme": "DOI"
        },
        "abstract": "Especially in the early modern period, musicians were a highly mobile group that traveled throughout Europe and beyond. Accordingly, they significantly stimulated the formation of a common European cultural identity. Two successive, international music research projects are exploring this topic with different emphases. Each project database uses the same database system in a different way and with different objectives. Using case studies, appropriate research data visualizations are discussed, which will be further developed in the ongoing projects.",
        "article_title": "MUSICI und MusMig. Kontinuitäten und Diskontinuitäten",
        "authors": [
            {
                "given": "Berthold",
                "family": "Over",
                "affiliation": null
            },
            {
                "given": "Torsten",
                "family": "Roeder",
                "affiliation": [
                    "Universität Würzburg"
                ]
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_008",
        "identifier": {
            "string_id": "10.17175/sb001_008",
            "id_scheme": "DOI"
        },
        "abstract": "For Digital Humanities in medieval studies and early modern studies, the digitization of manuscripts is a central field. Since each manuscript displays its own unique characteristics, the automatic generation of a machine-readable text using Optical Character Recognition (OCR) as applied to digital images leads, in most cases, to error-prone results. However, characteristics of handwriting such as the size of letters and spacing, slope, and so on can be used to identify the scribe or scribes. This paper demonstrates how the analysis of manuscript images can be used to identify the scribe or scribes. An algorithym will support additional paleographic and codicological findings and provide evidence for the verification or falsification of uncertain attributions.",
        "article_title": "Vom Zeichen zur Schrift:                    Mit Mustererkennung zur automatisierten Schreiberhanderkennung in mittelalterlichen und frühneuzeitlichen Handschriften                ",
        "authors": [
            {
                "given": "Daniel",
                "family": "Fecker",
                "affiliation": null
            },
            {
                "given": "Volker",
                "family": "Märgner",
                "affiliation": [
                    "Technische Universität Braunschweig"
                ]
            },
            {
                "given": "Torsten",
                "family": "Schaßan",
                "affiliation": [
                    "Herzog August Bibliothek Wolfenbüttel"
                ]
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_009",
        "identifier": {
            "string_id": "10.17175/sb001_009",
            "id_scheme": "DOI"
        },
        "abstract": "The debate on medieval textuality is shaped by an obvious reservation about the category of authorship. Therefore, the conditions for the acceptance of stylometric methods in the field of Middle High German literature might not seem too favorable. However, it is exactly this tension between tradition and individuality, which bears great significance for those texts, that offers opportunities for the application of stylometric methods, which can lead to a mutual elucidation of method and discipline. The paper provides examples of the ways in which Middle High German texts are influenced by individual as well as genre-specific style factors. Furthermore, it elaborates on the issues that must be addressed for a proper quantification of these categories.",
        "article_title": "Historische Stilometrie? Methodische Vorschläge für eine                    Annäherung textanalytischer Zugänge an die mediävistische                    Textualitätsdebatte.",
        "authors": [
            {
                "given": "Gabriel",
                "family": "Viehhauser",
                "affiliation": null
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_020",
        "identifier": {
            "string_id": "10.17175/sb001_020",
            "id_scheme": "DOI"
        },
        "abstract": "Traditional approaches to data integration are typically based on the harmonization of heterogeneous data with respect to the constraints of a globally integrative data structure, such as a global schema or ontology. This paper illustrates the limitations of such a harmonization-based approach in the specific context of the Digital Humanities and shows how a research-oriented and case-based data federation can be facilitated by the DARIAH-DE federation architecture. Based on the collection, schema, and crosswalk registries, collections and the data schemata they utilize can be registered and flexibly associated – resulting in the ability to create broad and comprehensive as well as discipline-specific views of research data.",
        "article_title": "Heterogene Daten in den Digital Humanities: Eine Architektur                    zur forschungsorientierten Föderation von Kollektionen",
        "authors": [
            {
                "given": "Tobias",
                "family": "Gradl",
                "affiliation": null
            },
            {
                "given": "Andreas",
                "family": "Henrich",
                "affiliation": [
                    "Otto-Friedrich-Universität Bamberg"
                ]
            },
            {
                "given": "Christoph",
                "family": "Plutte",
                "affiliation": [
                    "Berlin-Brandenburgische Akademie der Wissenschaften"
                ]
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_007",
        "identifier": {
            "string_id": "10.17175/sb001_007",
            "id_scheme": "DOI"
        },
        "abstract": "Medieval and early modern account books are well suited for computer analysis, since they can be easily converted to tabullar data formats. Scholarly research and the creation of critical editions have simultaneously demonstrated that research interest on this type of textual material is so diverse that they should ideally be digitally edited. However, this paper can only point to one single digital edition that also allows the numeric analysis of account books. While previous research on digital editions has concentrated on philologic and paleographic problems, this paper proposes an edition model that also includes the contents of the accounts themselves. Based on the Resource Description Framework (RDF), this model of references between the different forms of representation can be serialized with the encoding guidelines of the Text Encoding Initiative (TEI). Finally, this paper will demonstrate that extensive collections can also be efficiently be digitally edited in this way.",
        "article_title": "Warum werden mittelalterliche und frühneuzeitliche Rechnungsbücher eigentlich nicht digital ediert?",
        "authors": [
            {
                "given": "Georg",
                "family": "Vogeler",
                "affiliation": null
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_010",
        "identifier": {
            "string_id": "10.17175/sb001_010",
            "id_scheme": "DOI"
        },
        "abstract": "The first women's movement of the 19th and early 20th centuries was one of the major social movements which produced an immense body of texts. In this paper, we explore the ways in which research into the history of language use, topic development, and forms of communication in the first women's movement can be supported by Digital Humanities methods. We present an integrated documentation system that combines lexical documentation, a full-text corpus and linguistic investigations (such as on argumentation, word usage, etc.), and we show how this type of research activity can be integrated into a large infrastructure project (CLARIN-D).",
        "article_title": "Kontroverse Kommunikation im Umkreis der ersten Frauenbewegung.                     Wie können digitale Ressourcen die sprachliche Untersuchung und die Ergebnisdokumentation verbessern?                ",
        "authors": [
            {
                "given": "Kerstin",
                "family": "Wolff",
                "affiliation": null
            },
            {
                "given": "Alexander",
                "family": "Geyken",
                "affiliation": [
                    "BBAW/CLARIN-D"
                ]
            },
            {
                "given": "Thomas",
                "family": "Gloning",
                "affiliation": [
                    "JLU Gießen/BBAW/CLARIN-D"
                ]
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://www.zfdg.de/sb001_002",
        "identifier": {
            "string_id": "10.17175/sb001_002",
            "id_scheme": "DOI"
        },
        "abstract": "This paper outlines the historical development and methodical challenges of digital visual studies. Although it was argued early on that the strength of the computer lay in formal rather than iconographic analysis, in practice the iconographic encoding of images and the collection of metadata dominated for a long time. However, scholars and practitioners of digital visual studies soon demanded a thorough ›Ideologiekritik‹ (›critique of ideology‹) of its methods. Today, the field encompasses a broad spectrum of formal and iconographical, as well as reception-based studies. Furthermore, it can help to establish the critical reflection on methodical implications as a core issue for the digital humanities.",
        "article_title": "Vom Bild zum Bild – Digital Humanities jenseits des Textes",
        "authors": [
            {
                "given": "Katja",
                "family": "Kwastek",
                "affiliation": null
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_019",
        "identifier": {
            "string_id": "10.17175/sb001_019",
            "id_scheme": "DOI"
        },
        "abstract": "This paper presents the digital edition of an important text in German literary history. The satirical magazine Die Fackel (The Torch) was published by the satirist and language critic Karl Kraus in Vienna from 1899 until 1936. The digital edition of the AAC-Fackel was developed by researchers, scholars, programmers, and designers within the framework of the AAC-Austrian Academy Corpus, operated by the Institute for Corpus Linguistics and Text Technology at the Austrian Academy of Sciences in Vienna, and went online on 1 January 2007. The AAC-Fackel offers free online access to the 37 volumes, 415 issues, and 922 issues, comprising 22,586 pages and more than 6 million word forms of Die Fackel and contains a fully searchable database of the entire journal with indexes and search and navigation tools in a functionally designed interface, in which all pages of the original journal are available as digital texts and as facsimile images. The general principles of this scholarly digital edition, and its concept and design considerations, are based on a corpus-based methodological approach and are decisive for addressing questions of critical editions and philological access to this key text in German literary history.",
        "article_title": "AAC-Fackel. Das Beispiel einer digitalen Musteredition",
        "authors": [
            {
                "given": "Hanno",
                "family": "Biber",
                "affiliation": null
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_003",
        "identifier": {
            "string_id": "10.17175/sb001_003",
            "id_scheme": "DOI"
        },
        "abstract": "The title of this paper indirectly refers to the theme of the 2014 Conference on Digital Humanities in German-Speaking Areas (»Digital Humanities – methodischer Brückenschlag oder ›feindliche Übernahme‹?«). I assume from this title that computer science is viewed as the originator of such a deliberate conquest. The first section of this paper explores how computer science, the headquarters of the »enemy« threatening to conquer our disciplines, also experienced and overcame an uncertain period of early development. The history of this discipline could serve as a source of inspiration or, at the very least, courage. The following section explores—as indicated by the title of this paper—how computer science could be viewed as a humanities discipline, including a historical perspective on the foundation of both disciplines or disciplinary fields. The historical dimension, but also the uncertainty, that is reflected in the conference theme serves as my starting point to present ten theses in the following section that explain the necessary factors for success if we wish to succeed with the Digital Humanities.",
        "article_title": "Die Informatik als Geisteswissenschaft",
        "authors": [
            {
                "given": "John",
                "family": "Nerbonne",
                "affiliation": null
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_013",
        "identifier": {
            "string_id": "10.17175/sb001_013",
            "id_scheme": "DOI"
        },
        "abstract": "Theory-driven research in the social sciences is confronting the Digital Humanities with new challenges. Here, text analysis can not be built directly on linguistic features, but rather the research questions require access to more complex concepts and their meaning. Our methodological contribution to DH argues that it is possible to develop hermeneutically sensitive methods for corpus analysis when the tool components remain transparent for the target discipline and allow for interactive exploration of the underlying data. We provide an overview of interactive tools for text processing and analysis that can be flexibly adjusted to specific disciplinary theories and research questions in the target disciplines, with an underlying architecture that is generic and therefore broadly applicable. ",
        "article_title": "Computerlinguistische Werkzeuge zur Erschließung und Exploration großer Textsammlungen aus der Perspektive fachspezifischer Theorie",
        "authors": [
            {
                "given": "André",
                "family": "Blessing",
                "affiliation": null
            },
            {
                "given": "Fritz",
                "family": "Kliche",
                "affiliation": [
                    "Institut für Informationswissenschaft und Sprachtechnologie, Universität Hildesheim"
                ]
            },
            {
                "given": "Ulrich",
                "family": "Heid",
                "affiliation": [
                    "Institut für Informationswissenschaft und Sprachtechnologie, Universität Hildesheim"
                ]
            },
            {
                "given": "Cathleen",
                "family": "Kantner",
                "affiliation": [
                    "Institut für Sozialwissenschaften, Universität Stuttgart"
                ]
            },
            {
                "given": "Jonas",
                "family": "Kuhn",
                "affiliation": [
                    "Institut für Maschinelle Sprachverarbeitung, Universität Stuttgart"
                ]
            }
        ],
        "publisher": null,
        "date": "2015-06-30",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_004",
        "identifier": {
            "string_id": "10.17175/sb001_004",
            "id_scheme": "DOI"
        },
        "abstract": "The Digital Humanities are either a field of research or an academic discipline, possibly both. In any case, they are embedded in an extensive infrastructure in regard to organization, information, and communication and build upon long traditions in various areas of research. Furthermore, as a link between the humanities and computer science, the field seems to be highly attractive, not only to these areas, but also to neighboring disciplines as well as to the research funding agencies. Outside of the academic context, the mass media have discovered the digital humanities in recent years. While this attractiveness has several positive integrative effects, the current DH hype is not without certain risks, ranging from the mere misappropriation of the term to explicitly defensive or negative attitudes, and even ignorance and denial: »DH? But there is no such thing!«",
        "article_title": "Digital Humanities? Gibt’s doch gar nicht!",
        "authors": [
            {
                "given": "Patrick",
                "family": "Sahle",
                "affiliation": null
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://zfdg.de/sb001_001",
        "identifier": {
            "string_id": "10.17175/sb001_001",
            "id_scheme": "DOI"
        },
        "abstract": "Traditionally, ontology engineering is based on the presumption that the meaning of a proposition results from the combination of the meaning of its elements (concepts) and its syntactical structure. The reach of this ›principle of compositionality‹ is, however, a contested topic in semantics. Its opponents defend the primacy of propositional meaning and derive the meaning of concepts from their contribution to propositional meaning. In this situation, this paper argues for an approach to ontology design that does not presuppose a stance in this debate. The proposed ›minimal doxographical ontology‹ is intended as a heuristic tool charting unknown or complex domains. It regards propositional meaning as atomic and relates it to a bearer of propositional content (persons or texts). The strengths of such an approach are first discussed in a simplified example, the analysis of legal stipulations on alcoholic beverages. A more complex use case concerns the doxographical analysis of debates in the history of early modern philosophy. In closing, the paper sketches briefly how this approach may be extended using ontologies as hermeneutic tools in the interpretation of sources from the history of philosophy.",
        "article_title": "What People Said: The Theoretical Foundations of a Minimal Doxographical Ontology and Its Use in the History of Philosophy",
        "authors": [
            {
                "given": "Stefan",
                "family": "Heßbrüggen-Walter",
                "affiliation": null
            }
        ],
        "publisher": null,
        "date": "2015-02-19",
        "keywords": null,
        "journal_title": "Zeitschrift für digitale Geisteswissenschaften",
        "volume": "Sonderband 1",
        "issue": null,
        "ISSN": [
            {
                "value": "2510-1366",
                "type": "electronic"
            }
        ]
    }
]