{"url": "http://dx.doi.org/10.1093/llc/fqm010", "identifier": {"string_id": "10.1093/llc/fqm010", "id_scheme": "DOI"}, "abstract": "The present article is concerned with the problem of automatic database population via information extraction (IE) from web pages obtained from heterogeneous sources, such as those retrieved by a domain crawler. Specifically, we address the task of filling single multi-field templates from individual documents, a common scenario that involves free-format documents with the same communicative goal such as job adverts, CVs, or meeting/seminar announcements. We discuss challenges that arise in this scenario and propose solutions to them at different levels of the processing of web page content. Our main focus is on the issue of information extraction, which we address with a two-step machine learning approach that first aims to determine segments of a page that are likely to contain relevant facts and then delimits specific natural language expressions with which to fill template fields. We also present a range of techniques for the enrichment of web pages with semantic annotations, such as recognition of named entities, domain terminology and coreference resolution, and examine their effect on the information extraction method. We evaluate the developed IE system on the task of automatically populating a database with information on language resources available on the web.", "article_title": "Discovery of Language Resources on the Web: Information Extraction from Heterogeneous Documents", "authors": [{"given": " Viktor", "family": "Pekar", "affiliation": [{"original_name": "School of Humanities, Languages, and Social Sciences, University of Wolverhampton, Stafford Street, Wolverhampton, WV1 1SB, UK", "normalized_name": "University of Wolverhampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01k2y1055", "GRID": "grid.6374.6"}}]}, {"given": " Richard", "family": "Evans", "affiliation": [{"original_name": "School of Humanities, Languages, and Social Sciences, University of Wolverhampton, Stafford Street, Wolverhampton, WV1 1SB, UK", "normalized_name": "University of Wolverhampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01k2y1055", "GRID": "grid.6374.6"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2007-04-20", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "22", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}