{"url": "http://dx.doi.org/10.1093/llc/fqm026", "identifier": {"string_id": "10.1093/llc/fqm026", "id_scheme": "DOI"}, "abstract": "We introduce a systematic approach to language change quantification by studying unconsciously used language features in time-separated parallel translations. For this purpose, we use objective style markers such as vocabulary richness and lengths of words, word stems and suffixes, and employ statistical methods to measure their changes over time. In this study, we focus on the change in Turkish in the second half of the twentieth century. To obtain word stems, we first introduce various stemming techniques and show that they are highly effective. Our statistical analyses show that over time, for both text and lexicon, the length of Turkish words has become significantly longer, and word stems have become significantly shorter. We also show that suffix lengths have become significantly longer for types and the vocabulary richness based on word stems has shrunk significantly. These observations indicate that in contemporary Turkish one would use more suffixes to compensate for the fewer stems to preserve the expressive power of the language at the same level. Our approach can be adapted for quantifying the change in other languages.", "article_title": "Language Change Quantification Using Time-separated Parallel Translations", "authors": [{"given": " Kemal", "family": "Altintas", "affiliation": [{"original_name": "Computer Science Department, University of California, Irvine, Irvine, CA 92612, USA", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}, {"given": " Fazli", "family": "Can", "affiliation": [{"original_name": "Computer Science and Systems Analysis Department, Miami University, Oxford, OH 45056, USA", "normalized_name": "Miami University", "country": "United States", "identifiers": {"ror": "https://ror.org/05nbqxr67", "GRID": "grid.259956.4"}}]}, {"given": " Jon M.", "family": "Patton", "affiliation": [{"original_name": "Information Technology Services, Miami University, Oxford, OH 45056, USA", "normalized_name": "Miami University", "country": "United States", "identifiers": {"ror": "https://ror.org/05nbqxr67", "GRID": "grid.259956.4"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2007-09-22", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "22", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}