{"url": "http://dx.doi.org/10.1093/llc/fqi028", "identifier": {"string_id": "10.1093/llc/fqi028", "id_scheme": "DOI"}, "abstract": "This article is concerned with the study of register variation, the process of focusing on the similarities and dissimilarities between register categories in terms of various linguistic phenomena. The British National Corpus World Edition, which is a 100 million word collection of British English, will be used to study the characterization of register variation by identifying their linguistic characteristics. By means of multivariate analysis, the variation of the occurrence of selected linguistic features among registers will be classified. A multivariate analysis holds out the promise of being able to systematize the register categories in the corpus while also revealing the characteristic linguistic features of the groups classified.In this article, by focusing on a sociolinguistic variable which is fairly systematically associated with ‘social class’ in the British National Corpus, the dimensions revealed by the multivariate analysis were interpreted linguistically. That is, the linguistic dimension concerned with ‘formal style’ versus ‘casual style’ proved the validity of the social variable in the British National Corpus and enabled its characterization in the light of linguistic features. Furthermore, several words which pertain to interjection, filler, modal auxiliary verb, and negation, i.e. hmm, ay, may, ’d, not, nae, and so on turned out to be crucial markers to characterize the register in which texts are used.", "article_title": "A Study of Register Variation in the British National Corpus", "authors": [{"given": " Kaoru", "family": "Takahashi", "affiliation": [{"original_name": "Toyota National College of Technology, Japan", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2005", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "21", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}