{"url": "http://dx.doi.org/10.1093/llc/fqs064", "identifier": {"string_id": "10.1093/llc/fqs064", "id_scheme": "DOI"}, "abstract": "This research-in-progress report describes ongoing work on a doctoral dissertation, which attempts to model the prototypical structure of the tourist brochure as a multimodal artefact. By using a multimodal corpus based on the Genre and Multimodality model, the dissertation investigates how the brochures use both language and image to fulfil their communicative function. This article focuses on a specific aspect of the prototypical structure, that is, how the brochures organize the content in the layout and signal its interrelations. The article suggests that the layout and the rhetorical relations between the content are intertwined in what may be called the ‘rhetoric-layout interface’. By drawing on a sample of three brochures published in 1984, 1988, and 2006, the article explores how this interface shapes the multimodal structure of the tourist brochures. The relationship between the rhetorical and the layout structure is suggested to be reciprocal: adopting a particular configuration in the rhetorical structure also affects the range of choices available in the layout structure and vice versa.The article concludes that the interface between the rhetorical and the layout structure warrants attention in modeling the prototypical structure, and suggests that certain structural signals related to the use of two-dimensional space require specific attention in corpus analysis. Moreover, extensive cross-layer analyses with larger corpora will be required to tease out the range of different configurations in the tourist brochures, and to create a prototypical model of the multimodal artefact.", "article_title": "The interface between rhetoric and layout in multimodal artefacts", "authors": [{"given": " Tuomo", "family": "Hiippala", "affiliation": [{"original_name": "University of Helsinki, Finland", "normalized_name": "University of Helsinki", "country": "Finland", "identifiers": {"ror": "https://ror.org/040af2s02", "GRID": "grid.7737.4"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}