{"url": "http://dx.doi.org/10.1145/3376925", "identifier": {"string_id": "10.1145/3376925", "id_scheme": "DOI"}, "abstract": "The increase of multidisciplinary research in the field of architectural history has led to the need to set up new experiences and solutions for the handling and integration of the information extracted from historical documents. These solutions seek to support diverse users of the research community with the aim of solving challenges directly related with the digitalisation, structuring, standardisation, and management of historical information. These challenges include, for example, the creation of a digital support that enables a collaborative growth and management of information, the normalisation of terms and vocabularies to make its analysis efficient, the elaborating of a conceptual model, and the development of a metadata support that allows its more expanded dissemination and reuse. This article describes a case study project in which the documents of archives, of research, and of projects previously carried out by the Late Gothic Network (Red Tardogótica) are the raw material for the proposal of an event-oriented historical database (e-database). This e-database means to record and systematise the information about the artistic transfers related with the architectural production in the transition of the Modern Age, a period also known as the Late Gothic. The e-database's design has considered the possibility of its use for the analysis of social networks (abstract-relational model, a Graph model) and the spatiotemporal analysis of the events (geo-temporal model, GIS). The main section of this article describes the architecture of the database, with a view to addressing the questions of the relations between the datasets and the matter of implementing the thesauri and controlled vocabularies that must be respected for the standardisation, recording, and later analysis of the data. Next, we contribute quantitative and qualitative analyses to evaluate the database's important gaps of information. This proposal initially covers the geographical framework of the western Andalusian territory, but it can be expanded to other areas and adapted to other case studies. Finally, the article summarises the learning achieved in this first phase of the case study project and describes the perspectives to broaden its use in the community of architectural history researchers.", "article_title": "A Data-driven Approach for Architectural History Knowledge. Capturing Buildings’ Construction Events for Historical Research Collaboration", "authors": [{"given": "Prof. Patricia", "family": "Ferreira-Lopes", "affiliation": [{"original_name": "IUACC, DEGA Escuela Técnica Superior de Arquitectura de la Universidad de Sevilla, Seville, Spain, 41012, Andalusian Institute of Historical Heritage (IAPH), Seville, Spain, 41092", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2020", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "13", "issue": "2", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}