{"url": "http://dx.doi.org/10.1093/llc/fqs036", "identifier": {"string_id": "10.1093/llc/fqs036", "id_scheme": "DOI"}, "abstract": "This study investigates the problem of appropriate choice of texts for the training set in machine-learning classification techniques. Although intuition suggests picking the most typical texts (whatever ‘typical’ means) by the authors studied, any arbitrary choice might substantially affect the final results. Thus, to eschew cherry picking, we introduce a method of verification of the choice of ‘typical’ samples, inspired by k-fold cross-validation procedures. Namely, we use a bootstrap-like approach to choose randomly, in 500 iterations, the samples for the training and the test sets. Next, we examine the obtained 500 attribution accuracy scores: if the density function shows widespread results, the corpus is assumed to be very sensitive to the permutations of the training set. To test this methodology empirically, we have selected roughly similar corpora in five languages: English, French, German, Italian, and Polish. The results show considerable resistance of the English corpus to permutations, while the other corpora turned out to be more dependent on the choice of the samples; the Polish corpus produces both accuracy and consistency below any acceptable standards.", "article_title": "Do birds of a feather really flock together, or how to choose training samples for authorship attribution", "authors": [{"given": " Maciej", "family": "Eder", "affiliation": [{"original_name": "Pedagogical University of Kraków, Poland", "normalized_name": "Pedagogical University of Kraków", "country": "Poland", "identifiers": {"ror": "https://ror.org/030mz2444", "GRID": "grid.412464.1"}}]}, {"given": " Jan", "family": "Rybicki", "affiliation": [{"original_name": "Jagiellonian University, Kraków, Poland", "normalized_name": "Jagiellonian University", "country": "Poland", "identifiers": {"ror": "https://ror.org/03bqmcz70", "GRID": "grid.5522.0"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012-08-12", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}