{"url": "http://dx.doi.org/10.1093/llc/fqx066", "identifier": {"string_id": "10.1093/llc/fqx066", "id_scheme": "DOI"}, "abstract": "This article looks at the case of Elena Ferrante, the (presumed) pseudonym of an internationally successful Italian novelist, and has two objectives: first, to observe how her novels are positioned in the panorama of modern Italian literature (represented by an ad hoc reference corpus—composed of 150 novels by forty different authors) and, second, to attempt to understand whether, amongst the authors in the corpus, there are any that can be considered candidates for involvement in the writing of the novels signed Ferrante. Consistent with these two objectives, the analyses also use two methods: correspondence analysis for the content mapping of the novels and Labbé’s intertextual distances to establish a measure of similarity between the novels. In the results, we do not see the expected similarities with writers from the Naples area as Elena Ferrante distinguishes herself with original literary products that, both in terms of theme and style, show her strong individuality. Amongst the authors included, Domenico Starnone, who has been previously identified by other investigations as the possible hand behind this pen name, is the author who has written novels most similar to those of Ferrante and which, over time, has become progressively more similar.", "article_title": "What is Elena Ferrante? A comparative analysis of a secretive bestselling Italian writer", "authors": [{"given": " Arjuna", "family": "Tuzzi", "affiliation": [{"original_name": "Dipartimento di Filosofia, Sociologia, Pedagogia e Psicologia Applicata (FISPPA), University of Padova, Italy", "normalized_name": "University of Padua", "country": "Italy", "identifiers": {"ror": "https://ror.org/00240q980", "GRID": "grid.5608.b"}}]}, {"given": " Michele A", "family": "Cortelazzo", "affiliation": [{"original_name": "Dipartimento di Studi linguistici e letterari (DISLL), University of Padova, Italy", "normalized_name": "University of Padua", "country": "Italy", "identifiers": {"ror": "https://ror.org/00240q980", "GRID": "grid.5608.b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}