{"url": "http://dx.doi.org/10.1145/3283253", "identifier": {"string_id": "10.1145/3283253", "id_scheme": "DOI"}, "abstract": "Cultural heritage institutions are spending considerable effort and resources to provide online access to their collection catalogues and collection management systems, usually through their institutional websites. This improves accessibility and supports research and engagement by diverse user groups, as well as meeting the increasing expectation by audiences that this type of information will be freely and easily available online. However, cultural organisations have not responded to these needs in the same way and have been employing different web tools and features to present their collections online. In this article, we argue that the technological implementation choices and the type of content provided reflect also the philosophy of communication of the institution itself. We used the constructivist approach's learning theory and theory of knowledge and combined these interrelated epistemological and cognitive perspectives to analyse the communication philosophy of a large number of museum online catalogues. The article presents the research carried out initially in 2007 through 2009 and then again in 2017, studying the provision of collections information online by different types of museums across Europe and in the United States. This enabled us to establish categories of presentation types and study the changes over time. The results highlighted the major shift towards participatory practices which have been transforming the cultural heritage world over the past years.", "article_title": "Communicating Museum Collections Information Online", "authors": [{"given": "Ion", "family": "Gil-Fuentetaja", "affiliation": [{"original_name": "University of Deusto, Donostia/San Sebastian, Spain", "normalized_name": "University of Deusto", "country": "Spain", "identifiers": {"ror": "https://ror.org/00ne6sr39", "GRID": "grid.14724.34"}}]}, {"given": "Maria", "family": "Economou", "affiliation": [{"original_name": "University of Glasgow, Glasgow, United Kingdom", "normalized_name": "University of Glasgow", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vtgdb53", "GRID": "grid.8756.c"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2019-02-14", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "12", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}