{"url": "http://dx.doi.org/10.1093/llc/fqm003", "identifier": {"string_id": "10.1093/llc/fqm003", "id_scheme": "DOI"}, "abstract": "This article reports on experiments performed with a large corpus, aiming at separating texts according to the author style. The study initially focusses on whether the classification accuracy regarding the author identity may be improved, if the text topic is known in advance. The experimental results indicate that this kind of information contributes to more accurate author recognition. Furthermore, as the diversity of a topic set increases, the classification accuracy is reduced. In general, the experimental results indicate that taking into account knowledge regarding the text topic can lead to the construction of specialized models for each author with higher classification accuracy. For example, by focussing on a specific topic, the accuracy with which the author identity is determined increases, the exact amount depending on the specific topic. This also applies when the topic of the text is more broadly determined, as a set of topic categories.In an associated task, the most salient parameters within an 85-parameter vector are studied, for a number of subsets of the corpus, where each subset contains speeches from a single topic. These studies indicate that the salient parameters are the same for the different subsets. Two fixed data vectors have been defined, using 16 and 25 parameters, respectively. The classification accuracy obtained, even with the smallest data vector, is only 5% less than with the complete vector. This indicates that the parameters retained in the reduced vectors bear a large amount of discriminatory information and suffice for an accurate classification of the corpus.", "article_title": "Employing Thematic Variables for Enhancing Classification Accuracy Within Author Discrimination Experiments", "authors": [{"given": " George", "family": "Tambouratzis", "affiliation": [{"original_name": "Institute for Language and Speech Processing, Greece", "normalized_name": "Institute for Language and Speech Processing", "country": "Greece", "identifiers": {"ror": "https://ror.org/00z24kr14", "GRID": "grid.424851.e"}}]}, {"given": " Marina", "family": "Vassiliou", "affiliation": [{"original_name": "Institute for Language and Speech Processing, Greece", "normalized_name": "Institute for Language and Speech Processing", "country": "Greece", "identifiers": {"ror": "https://ror.org/00z24kr14", "GRID": "grid.424851.e"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2007-03-19", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "22", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}