{"url": "http://dx.doi.org/10.1093/llc/fqw005", "identifier": {"string_id": "10.1093/llc/fqw005", "id_scheme": "DOI"}, "abstract": "Many complex systems are naturally described through graph theory, and different kinds of systems described as networks present certain important characteristics in common. One of these features is the so-called scale-free distribution for its node’s connectivity, which means that the degree distribution for the network’s nodes follows a power law. Scale-free networks are usually referred to as small-world because the average distance between their nodes do not scale linearly with the size of the network, but logarithmically. Here we present a mathematical analysis on linguistics: the word frequency effect for different translations of the ‘Le Petit Prince’ in different languages. Comparison of word association networks with random networks makes evident the discrepancy between the random Erdös-Rény model for graphs and real-world networks.", "article_title": "The Small-World of ‘Le Petit Prince’: Revisiting the Word Frequency Distribution", "authors": [{"given": " Daniel", "family": "Gamermann", "affiliation": [{"original_name": "Department of Physics, Universidade Federal do Rio Grande do Sul (UFRGS), Instituto de Física Av. Bento Gonçalves 9500, Brasil", "normalized_name": "Federal University of Rio Grande do Sul", "country": "Brazil", "identifiers": {"ror": "https://ror.org/041yk2d64", "GRID": "grid.8532.c"}}]}, {"given": " Carmen", "family": "Moret-Tatay", "affiliation": [{"original_name": "Departamento de Neuropsicobiología, Metodología y Psicología Social, Universidad Católica de Valencia (San Vicente Mártir), Spain", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Esperanza", "family": "Navarro-Pardo", "affiliation": [{"original_name": "Department of Developmental and Educational Psychology, Universitat de València. Av. Blasco Ibáñez, Spain", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Pedro", "family": "Fernandez de Córdoba Castellá", "affiliation": [{"original_name": "Instituto Universitario de Matemática Pura y Aplicada, Universitat Politècnica de València, Spain", "normalized_name": "Universitat Politècnica de València", "country": "Spain", "identifiers": {"ror": "https://ror.org/01460j859", "GRID": "grid.157927.f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}