{"url": "http://dx.doi.org/10.1093/llc/fqx017", "identifier": {"string_id": "10.1093/llc/fqx017", "id_scheme": "DOI"}, "abstract": "The ongoing dispute in literary studies concerned with gender and writing style is wide and varied. Our preliminary analyses lend evidence to the claims that such gender differences are evident in writing across periods. While we follow in the methodological footsteps of such studies, particular those completed by Hoover (Textual analysis. In Price, K. M. and Siemens, R. (eds), Literary Studies in the Digital Age. Modern Language Association of America, 2013) and Rybicki (2016), we have shifted the focus of our investigation away from style, in the macro-analytical sense, to period and its relation to gender-differentiable terminology. Doing so recognizes the limitations of approaches like Zeta and Delta, while simultaneously benefiting from their affordances. Accepting that one can never have too large or robust a data set for this type of macro-analytic case study, we attempt to build on the foundations set down by Hoover and Rybicki, analyzing gender markers across a selection of male and female authors, and doing so crucially with a concern for the evolution of gender markers over specified canonical literary periods.", "article_title": "The limits of distinctive words: Re-evaluating literature’s gender marker debate", "authors": [{"given": " Sean G", "family": "Weidman", "affiliation": [{"original_name": "Pennsylvania State University, USA", "normalized_name": "Pennsylvania State University", "country": "United States", "identifiers": {"ror": "https://ror.org/04p491231", "GRID": "grid.29857.31"}}]}, {"given": " James", "family": "O’Sullivan", "affiliation": [{"original_name": "University of Sheffield, UK", "normalized_name": "University of Sheffield", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/05krs5044", "GRID": "grid.11835.3e"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}