{"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/72071", "identifier": {"string_id": "10.11588/dah.2019.4.72071", "id_scheme": "DOI"}, "abstract": "Technology is used to compress time and space but at the cost of ‘nearness’. This means it maintains a distance and disjoint between qualitative and quantitative techniques, and therefore between humanists and technology. The knowledge representations that humanists require to investigate a given subject are not the same as those mandated by technologists and database systems more concerned with scale and the efficiency of data processing and retrieval, rather than context and meaning. This perpetuates a humanist perception of information systems as either, useful but ancillary, or problematic. This paper describes an intervention that seeks to combine the qualitative with the quantitative through collaborative research, expressive structured data, and a human-centered and participatory approach to the ‘knowledge graph’. Its design is based on an understanding of the history of historical textual narrative and the benefit of approaching quantitative issues from the bottom up, or qualitatively, incorporating different levels of generalisation, perspectives (different vantage point on reality), and approaches to connections across time and space. A specialist question based on the designs of the artist, Katsushika Hokusai is used as a basis to illustrate how ‘micro’ research questions contribute, in part, to bigger questions and higher quality quantitative analysis.", "article_title": "The problem of distance in digital art history", "authors": [{"given": "Dominic", "family": "Oldman", "affiliation": [{"original_name": "British Museum", "normalized_name": "British Museum", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00pbh0a34", "GRID": "grid.29109.33"}}]}, {"given": "Diana", "family": "Tanase", "affiliation": [{"original_name": "British Museum", "normalized_name": "British Museum", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00pbh0a34", "GRID": "grid.29109.33"}}]}, {"given": "Stephanie", "family": "Santschi", "affiliation": [{"original_name": "British Museum", "normalized_name": "British Museum", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00pbh0a34", "GRID": "grid.29109.33"}}]}], "publisher": null, "date": "2020-03-20", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}