{"url": "http://dx.doi.org/10.1093/llc/fqv072", "identifier": {"string_id": "10.1093/llc/fqv072", "id_scheme": "DOI"}, "abstract": "Modernist authors such as Virginia Woolf and James Joyce greatly expanded the use of ‘free indirect discourse’, a form of third-person narration that is strongly influenced by the language of a viewpoint character. Unlike traditional approaches to analyzing characterization using common words, such as those based on Burrows (1987), the nature of free indirect discourse and the sparseness of our data require that we understand the stylistic connotations of rarer words and expressions which cannot be gleaned directly from our target texts. To this end, we apply methods introduced in our recent work to derive information with regards to six stylistic aspects from a large corpus of texts from Project Gutenberg. We thus build high-coverage, finely grained lexicons that include common multiword collocations. Using this information along with student annotations of two modernist texts, Woolf’s To The Lighthouse and Joyce’s The Dead, we confirm that free indirect discourse does, at a stylistic level, reflect a mixture of narration and direct speech, and we investigate the extent to which social attributes of the various characters (in particular age, class, and gender) are reflected in their lexical stylistic profile.", "article_title": "Using Models of Lexical Style to Quantify Free Indirect Discourse in Modernist Fiction", "authors": [{"given": " Julian", "family": "Brooke", "affiliation": [{"original_name": "Department of Computing and Information Systems, University of Melbourne, Australia", "normalized_name": "University of Melbourne", "country": "Australia", "identifiers": {"ror": "https://ror.org/01ej9dk98", "GRID": "grid.1008.9"}}]}, {"given": " Adam", "family": "Hammond", "affiliation": [{"original_name": "Department of English and Comparative Literature, San Diego State University, USA", "normalized_name": "San Diego State University", "country": "United States", "identifiers": {"ror": "https://ror.org/0264fdx42", "GRID": "grid.263081.e"}}]}, {"given": " Graeme", "family": "Hirst", "affiliation": [{"original_name": "Department of Computer Science, University of Toronto, Canada", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}