{"url": "http://dx.doi.org/10.1093/llc/fqz016", "identifier": {"string_id": "10.1093/llc/fqz016", "id_scheme": "DOI"}, "abstract": "Reliable high-quality transcription and/or annotation (a.k.a. ‘coding’) is essential for research in a variety of areas in Humanities and Social Sciences which make use of qualitative data such as interviews, focus groups, classroom observations, or any other audio/video recordings. A good tool can facilitate the work of transcription and annotation because the process is notoriously time-consuming and challenging. However, our survey indicates that few existing tools can accommodate the requirements for transcription and annotation (e.g. audio/video playback, spelling checks, keyboard shortcuts, adding tags of annotation) in one place so that a user does not need to constantly switch between multiple windows, for example, an audio player and a text editor. ‘Transcribear’ (https://transcribear.com) is therefore developed as an easy-to-use online tool which facilitates transcription and annotation on the same interface while this web tool operates offline so that a user’s recordings and transcripts can remain secure and confidential. To minimize human errors, the functionality of tag validation is also added. Originally designed for a multimodal corpus project UNNC CAWSE (https://www.nottingham.edu.cn/en/english/research/cawse/), this browser-based application can be customized for individual users’ needs in terms of the annotation scheme and corresponding shortcut keys. This article will explain how this new tool can make tedious and repetitive manual work faster and easier and at the same time improve the quality of outputs as the process of transcription and annotation tends to be prone to human errors. The limitations of Transcribear and future work will also be discussed.", "article_title": "Transcribear – Introducing a secure online transcription and annotation tool", "authors": [{"given": " Yu-Hua", "family": "Chen", "affiliation": [{"original_name": "School of English, University of Nottingham Ningbo China, Ningbo, China", "normalized_name": "University of Nottingham Ningbo China", "country": "China", "identifiers": {"ror": "https://ror.org/03y4dt428", "GRID": "grid.50971.3a"}}]}, {"given": " Radovan", "family": "Bruncak", "affiliation": [{"original_name": "Independent Computer Scientist, London, UK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "35", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}