{"url": "http://dx.doi.org/10.1145/2964911", "identifier": {"string_id": "10.1145/2964911", "id_scheme": "DOI"}, "abstract": "By bringing together the most prominent European institutions and archives in the field of Classical Latin and Greek epigraphy, the EAGLE project has collected the vast majority of the surviving Greco-Latin inscriptions into a single readily-searchable database. Text-based search engines are typically used to retrieve information about ancient inscriptions (or about other artifacts). These systems require that the users formulate a text query that contains information such as the place where the object was found or where it is currently located. Conversely, visual search systems can be used to provide information to users (like tourists and scholars) in a most intuitive and immediate way, just using an image as query. In this article, we provide a comparison of several approaches for visual recognizing ancient inscriptions. Our experiments, conducted on 17, 155 photos related to 14, 560 inscriptions, show that BoW and VLAD are outperformed by both Fisher Vector (FV) and Convolutional Neural Network (CNN) features. More interestingly, combining FV and CNN features into a single image representation allows achieving very high effectiveness by correctly recognizing the query inscription in more than 90% of the cases. Our results suggest that combinations of FV and CNN can be also exploited to effectively perform visual retrieval of other types of objects related to cultural heritage such as landmarks and monuments.", "article_title": "Visual Recognition of Ancient Inscriptions Using Convolutional Neural Network and Fisher Vector", "authors": [{"given": "Giuseppe", "family": "Amato", "affiliation": [{"original_name": "ISTI-CNR, Pisa, Italy", "normalized_name": "Institute of Information Science and Technologies", "country": "Italy", "identifiers": {"ror": "https://ror.org/05kacka20", "GRID": "grid.451498.5"}}]}, {"given": "Fabrizio", "family": "Falchi", "affiliation": [{"original_name": "ISTI-CNR, Pisa, Italy", "normalized_name": "Institute of Information Science and Technologies", "country": "Italy", "identifiers": {"ror": "https://ror.org/05kacka20", "GRID": "grid.451498.5"}}]}, {"given": "Lucia", "family": "Vadicamo", "affiliation": [{"original_name": "ISTI-CNR, Pisa, Italy", "normalized_name": "Institute of Information Science and Technologies", "country": "Italy", "identifiers": {"ror": "https://ror.org/05kacka20", "GRID": "grid.451498.5"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2016", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "9", "issue": "4", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}