{"url": "http://dx.doi.org/10.1093/llc/16.2.189", "identifier": {"string_id": "10.1093/llc/16.2.189", "id_scheme": "DOI"}, "abstract": "Any project in the electronic medium that lays claim to scholarly authority will require adaptations in both the presentation and the dissemination of its materials. Work in progress on an electronic edition of Lyrical Ballads illustrates how these changes may be realized, and brings home the lesson that the evolution of electronic publishing will necessitate innovations that are not just technological but also institutional. A new method of marshalling scholarly apparatus called ‘dynamic collation’ has been employed in this project, which reconceptualizes how variant readings can be presented in the digital medium. The real challenge for online publication, however, is what might be called the lack of mature institutional structures on the Internet. So long as anyone can publish anything on WWW, the quality of its materials remains questionable; furthermore, in the absence of independent web-based publishing houses, personal postings are all too often ephemeral. The imprimatur of an established publisher (in this case, the Cambridge University Press) would be a guarantee of the reliability and durability of these immaterial texts, but entails the development of new publication partnerships. It seems the future of electronic publishing depends upon asking questions about more than technical standards. Online scholarly archives must also meet standards of peer evaluation, editorial practice, and institutional backing that have traditionally ensured the quality of print publications.", "article_title": "New models for electronic publishing", "authors": [{"given": " Ronald", "family": "Tetreault", "affiliation": [{"original_name": "Dalhousie UniversityHalifax, N.S., Canada", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2001", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "16", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}