{"url": "http://dx.doi.org/10.1093/llc/fqx034", "identifier": {"string_id": "10.1093/llc/fqx034", "id_scheme": "DOI"}, "abstract": "This article presents an epistemological rationale, intellectual justification, and design outline for a non-representational approach to modeling interpretation in a graphical environment. It begins with a brief critical discussion of the representational approaches that are the common form of information visualizations and suggests that the less familiar non-representational approach could be used to augment these existing visualizations by supporting interpretative work that is closer to the practice of humanistic hermeneutic traditions. Representational display, based on large-scale processing, surrogates, and conventional visualizations, and non-representational modeling at the level of the individual interpretative act operate at very different scales to support intellectual work. In a representational approach, data precede display. Display is a surrogate produced according to automated protocols and algorithms. These cannot be altered or intervened except through rewriting their code, and the display, though interpretative and subject to interpretation, cannot be used as a means by which interpretation is actually modeled. While all visualizations express a model, they do not all provide a modeling environment. In the non-representational approach proposed here, graphical input serves as a primary means of interpretative work. More significantly, a graphical environment that supports direct modeling of interpretation allows traditional humanistic approaches, close reading, and marking of texts, documents, artifacts, or images, to be integrated with computationally produced visualizations. This research was developed as part of the 3DH (three-dimensional/digital humanities) project hosted at the University of Hamburg, between April and June 2016.", "article_title": "Non-representational approaches to modeling interpretation in a graphical environment", "authors": [{"given": " Johanna", "family": "Drucker", "affiliation": [{"original_name": "University of California, Los Angeles, USA", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2017", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}