{"url": "http://dx.doi.org/10.1093/llc/fqr038", "identifier": {"string_id": "10.1093/llc/fqr038", "id_scheme": "DOI"}, "abstract": "The Chymistry of Isaac Newton project, an online scholarly edition of Newton's alchemical manuscripts, has engaged in a process to include a number of core alchemical symbols into the Unicode standard, a standard for digital representation of characters and symbols from the world's languages, scripts, and writing systems. Our article explores the relationship between information technology standardization and humanities research. We discuss Newton's engagement with alchemy and explore the graphic dimensions of alchemical discourse. We illustrate this discussion with examples of Newton's use of alchemical symbols. We examine Unicode itself, particularly a core Unicode principle distinguishing between the abstract character and the image or glyph of the character, and we discuss the tensions between this core principle and the representation of graphic, symbolic, and pictorial discourse. We describe our experience with the Unicode proposal process and illustrate again—this time with an organizational scheme for the symbols—how the technical standardization process forced a reexamination of our historical materials. Our conclusions reemphasize the potential for mutually beneficial relationships between certain types of information technology standardization and humanities research and suggest that study of the graphic qualities of alchemical discourse, especially in light of competing theories of text represented by standards like Unicode, may contribute to our understanding of the increasingly graphic, iconic, and pictorial nature of information and communication.", "article_title": "The liberty of invention: alchemical discourse and information technology standardization", "authors": [{"given": " John A.", "family": "Walsh", "affiliation": [{"original_name": "School of Library and Information Science, Indiana University, Bloomington, Indiana, USA", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}, {"given": " Wallace Edd", "family": "Hooper", "affiliation": [{"original_name": "History and Philosophy of Science, Indiana University, Bloomington, Indiana, USA", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2011-12-10", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "27", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}