{"url": "http://dx.doi.org/10.1093/llc/fqz022", "identifier": {"string_id": "10.1093/llc/fqz022", "id_scheme": "DOI"}, "abstract": "Although the digital humanities have traditionally been conceived as a text-based discipline, both digital visualization techniques as well as visual analysis are increasingly used for research in various humanities disciplines. Since there are several overlaps in epistemic cultures of visually oriented and digitally supported research in art and architectural history studies, museology, and archaeology, as well as cultural heritage, we introduce ‘visual digital humanities’ as novel ‘umbrella’ term to cover research approaches in the digital humanities that are dependent on both consuming and producing pictorial, rather than textual, information to answer their humanities research questions. This article aims to determine this particular field of research in terms of (1) research topics, (2) disciplinary standards, and (3) a scholarly culture as well as (4) researchers’ habits and backgrounds. This study is intended to highlight a scope of phenomena and aspects of relevance. Information is gathered by interviews with researchers at London universities and workshops held in Germany and Sweden.", "article_title": "The visual side of digital humanities: a survey on topics, researchers, and epistemic cultures", "authors": [{"given": " Sander", "family": "Münster", "affiliation": [{"original_name": "Media Center, Technische Universität Dresden, Dresden, Germany", "normalized_name": "TU Dresden", "country": "Germany", "identifiers": {"ror": "https://ror.org/042aqky30", "GRID": "grid.4488.0"}}]}, {"given": " Melissa", "family": "Terras", "affiliation": [{"original_name": "College of Arts, Humanities and Social Sciences, University of Edinburgh, Edinburgh, UK", "normalized_name": "University of Edinburgh", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01nrxwf90", "GRID": "grid.4305.2"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "35", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}