{"url": "http://dx.doi.org/10.1145/3344383", "identifier": {"string_id": "10.1145/3344383", "id_scheme": "DOI"}, "abstract": "Folk dances often reflect the socio-cultural influences prevailing in different periods and nations; each dance produces a meaning, a story with the help of music, costumes and dance moves. However, dances have no borders; they have been transmitted from generation to generation, along different countries, mainly due to movements of people carrying and disseminating their civilization. Studying the contextual correlation of dances along neighboring countries, unveils the evolution of this unique intangible heritage in time, and helps in understanding potential cultural similarities. In this work we present a method for contextually motion analysis that organizes dance data semantically, to form the first digital dance ethnography. Firstly, we break dance motion sequences into some narrow temporal overlapping feature descriptors, named motion and style words, and then cluster them in a high-dimensional features space to define motifs. The distribution of those motion and style motifs creates motion and style signatures, in the content of a bag-of-motifs representation, that implies for a succinct but descriptive portrayal of motions sequences. Signatures are time-scale and temporal-order invariant, capable of exploiting the contextual correlation between dances, and distinguishing fine-grained difference between semantically similar motions. We then use quartet-based analysis to organize dance data into a categorization tree, while inferred information from dance metadata descriptions are then used to set parent-child relationships. We illustrate a number of different organization trees, and portray the evolution of dances over time. The efficiency of our method is also demonstrated in retrieving contextually similar dances from a database.", "article_title": "Digital Dance Ethnography", "authors": [{"given": "Andreas", "family": "Aristidou", "affiliation": [{"original_name": "University of Cyprus and RISE Research Center, Nicosia, Cyprus", "normalized_name": "University of Cyprus", "country": "Cyprus", "identifiers": {"ror": "https://ror.org/02qjrjx09", "GRID": "grid.6603.3"}}]}, {"given": "Ariel", "family": "Shamir", "affiliation": [{"original_name": "The Interdisciplinary Center Herzliya, Herzliya, Israel", "normalized_name": "Interdisciplinary Center Herzliya", "country": "Israel", "identifiers": {"ror": "https://ror.org/01px5cv07", "GRID": "grid.21166.32"}}]}, {"given": "Yiorgos", "family": "Chrysanthou", "affiliation": [{"original_name": "University of Cyprus and RISE Research Center, Nicosia, Cyprus", "normalized_name": "University of Cyprus", "country": "Cyprus", "identifiers": {"ror": "https://ror.org/02qjrjx09", "GRID": "grid.6603.3"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2019-11-18", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "12", "issue": "4", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}