{"url": "http://dx.doi.org/10.1093/llc/fqz027", "identifier": {"string_id": "10.1093/llc/fqz027", "id_scheme": "DOI"}, "abstract": "Eye-tracking—the process of capturing and measuring human eye movement—is becoming an increasingly prevalent tool in the cultural heritage sector to understand visual processing and audience behaviours. Yet, most applications to date have focused on individual artworks and distinctions between representative/non-representative topics, with little prior work on the effects of differing written interpretations on the visual exploration of collections of artworks, particularly with devotional themes. This article reports on an eye-tracking study that explored responses to the unique collection of Francisco de Zurbarán paintings in County Durham. Using eye-tracking technology in a laboratory setting, we evaluated the viewing behaviour of three participant groups to determine whether the accompanying written context influences how digital reproductions are experienced. In addition to demonstrating statistically significant variations in aesthetic appreciation, the experiments showed that the gaze can be redirected towards areas of conceptual significance. Most importantly, we were able to challenge the assumption that viewers always look at faces (Bindemann et al., 2005). Our findings make an important new contribution to the scholarly understanding of how audiences view, appreciate, and understand artworks and to museum and heritage practices relevant to the display of art.", "article_title": "Aesthetic appreciation and Spanish art: insights from eye-tracking", "authors": [{"given": " Claire", "family": "Bailey-Ross", "affiliation": [{"original_name": "School of Creative Technologies, University of Portsmouth, UK", "normalized_name": "University of Portsmouth", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/03ykbk197", "GRID": "grid.4701.2"}}]}, {"given": " Andrew M", "family": "Beresford", "affiliation": [{"original_name": "School of Modern Languages and Cultures, Durham University, UK", "normalized_name": "Durham University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01v29qb04", "GRID": "grid.8250.f"}}]}, {"given": " Daniel T", "family": "Smith", "affiliation": [{"original_name": "Department of Psychology, Durham University, UK", "normalized_name": "Durham University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01v29qb04", "GRID": "grid.8250.f"}}]}, {"given": " Claire", "family": "Warwick", "affiliation": [{"original_name": "Department of English Studies, Durham University, UK", "normalized_name": "Durham University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01v29qb04", "GRID": "grid.8250.f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "Supplement_1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}