{"url": "http://dx.doi.org/10.17928/jjadh.3.1_1", "identifier": {"string_id": "10.17928/jjadh.3.1_1", "id_scheme": "DOI"}, "abstract": "Historians have traditionally relied on close readings of select primary sources to evaluate linguistic and discursive changes over time, but this approach can be limiting in its scope. Numeric representations of language allow us to statistically quantify and compare the significance of discursive changes and capture linguistic relationships over time. Here, we compare two deep learning methods of quantitatively identifying the chronology of linguistic shifts: RNN classification and RNN language modeling. In particular, we examine deep learning methods of isolating stylistic from topical changes, generating “decade embeddings,” and charting the changing average perplexity in a language model trained on chronologically sorted data. We apply these models to a historical diplomatic corpus, finding that the two world wars proved to be notable moments of linguistic change in American foreign relations. With this example we show applications of text-based deep learning methods for digital humanities usages.", "article_title": "The Long Arc of History: Neural Network Approaches to Diachronic Linguistic Change", "authors": [{"given": "Eun Seo", "family": "Jo", "affiliation": [{"original_name": "Department of History, Stanford University", "normalized_name": "Stanford University", "country": "United States", "identifiers": {"ror": "https://ror.org/00f54p054", "GRID": "grid.168010.e"}}]}, {"given": "Mark", "family": "Algee-Hewitt", "affiliation": [{"original_name": "Department of English, Stanford University", "normalized_name": "Stanford University", "country": "United States", "identifiers": {"ror": "https://ror.org/00f54p054", "GRID": "grid.168010.e"}}]}], "publisher": "Japanese Association for Digital Humanities", "date": "2018-10-21", "keywords": null, "journal_title": "Journal of the Japanese Association for Digital Humanities", "volume": "3", "issue": "1", "ISSN": [{"value": "2188-7276", "type": "electronic"}]}