{"url": "http://dx.doi.org/10.1093/llc/fqs001", "identifier": {"string_id": "10.1093/llc/fqs001", "id_scheme": "DOI"}, "abstract": "Old Chinese phonology is considered one of the most difficult branches of learning in Chinese philology. The traditional methodology has been empirical and its conclusions are very hard to understand and remember for modern people who do not use Old Chinese any more. This article, based on the theories and findings in Old Chinese phonology studies, uses the graph model in mathematics as the method to describe the initial-rhyme relationships of Old Chinese, and the Euclidean distance on two-dimensional plane to represent the similarity of the sounds in Chinese words (or characters) in the phonological harmony. It provides a more intuitive method of quantitative analysis, which makes the qualitative phonological relationships of Old Chinese easier to be measured and compared. Although the model is still in its infancy and there is room for refinement, it may bring insights to Chinese study, such as the research of Xiesheng series in Chinese characters, or Chinese etymology.", "article_title": "Graph model of Old Chinese phonological system and computing", "authors": [{"given": " Jiajia", "family": "Hu", "affiliation": [{"original_name": "School of Computer Science and Engineering, Beihang University, China", "normalized_name": "Beihang University", "country": "China", "identifiers": {"ror": "https://ror.org/00wk2mp56", "GRID": "grid.64939.31"}}]}, {"given": " Ning", "family": "Wang", "affiliation": [{"original_name": "School of Chinese Language and Literature, Beijing Normal University, China", "normalized_name": "Beijing Normal University", "country": "China", "identifiers": {"ror": "https://ror.org/022k4wk35", "GRID": "grid.20513.35"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "27", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}