{"url": "http://dx.doi.org/10.1145/3383314", "identifier": {"string_id": "10.1145/3383314", "id_scheme": "DOI"}, "abstract": "This article describes a method for early detection of disaster-related damage to cultural heritage. It is based on data from social media, a timely and large-scale data source that is nevertheless quite noisy. First, we collect images posted on social media that may refer to a cultural heritage site. Then, we automatically categorize these images according to two dimensions: whether they are indeed a photo in which a cultural heritage resource is the main subject, and whether they represent damage. Both categorizations are challenging image classification tasks, given the ambiguity of these visual categories; we tackle both tasks using a convolutional neural network. We test our methodology on a large collection of thousands of images from the web and social media, which exhibit the diversity and noise that is typical of these sources, and contain buildings and other architectural elements, heritage and not-heritage, damaged by disasters as well as intact. Our results show that while the automatic classification is not perfect, it can greatly reduce the manual effort required to find photos of damaged cultural heritage by accurately detecting relevant candidates to be examined by a cultural heritage professional.", "article_title": "Detection of Disaster-Affected Cultural Heritage Sites from Social Media Images Using Deep Learning Techniques", "authors": [{"given": "Pakhee", "family": "Kumar", "affiliation": [{"original_name": "IMT School for Advanced Studies Lucca, Piazza San Francesco, Lucca, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Ferda", "family": "Ofli", "affiliation": [{"original_name": "Qatar Computing Research Institute, HBKU, Doha, Qatar", "normalized_name": "Qatar Computing Research Institute", "country": "Qatar", "identifiers": {"ror": "https://ror.org/01w58xz62", "GRID": "grid.466961.a"}}]}, {"given": "Muhammad", "family": "Imran", "affiliation": [{"original_name": "Qatar Computing Research Institute, HBKU, Doha, Qatar", "normalized_name": "Qatar Computing Research Institute", "country": "Qatar", "identifiers": {"ror": "https://ror.org/01w58xz62", "GRID": "grid.466961.a"}}]}, {"given": "Carlos", "family": "Castillo", "affiliation": [{"original_name": "Universitat Pompeu Fabra, Boronat, Barcelona, Spain", "normalized_name": "Pompeu Fabra University", "country": "Spain", "identifiers": {"ror": "https://ror.org/04n0g0b29", "GRID": "grid.5612.0"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2020", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "13", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}