{"url": "http://dx.doi.org/10.1093/llc/fqt063", "identifier": {"string_id": "10.1093/llc/fqt063", "id_scheme": "DOI"}, "abstract": "Hildegard of Bingen (1098–1179) is one of the most influential female authors of the Middle Ages. From the point of view of computational stylistics, the oeuvre attributed to Hildegard is fascinating. Hildegard dictated her texts to secretaries in Latin, a language of which she did not master all grammatical subtleties. She therefore allowed her scribes to correct her spelling and grammar. Especially Hildegard’s last collaborator, Guibert of Gembloux, seems to have considerably reworked her works during his secretaryship. Whereas her other scribes were only allowed to make superficial linguistic changes, Hildegard would have permitted Guibert to render her language stylistically more elegant. In this article, we focus on two shorter texts: the Visio ad Guibertum missa and Visio de Sancto Martino, both of which Hildegard allegedly authored during Guibert’s secretaryship. We analyze a corpus containing the letter collections of Hildegard, Guibert, and Bernard of Clairvaux using a number of common stylometric techniques. We discuss our results in the light of the Synergy Hypothesis, suggesting that texts resulting from collaboration can display a style markedly different from that of the collaborating authors. Finally, we demonstrate that Guibert must have reworked the disputed visionary texts allegedly authored by Hildegard to such an extent that style-oriented computational procedures attribute the texts to Guibert.", "article_title": "Collaborative authorship in the twelfth century: A stylometric study of Hildegard of Bingen and Guibert of Gembloux", "authors": [{"given": " Mike", "family": "Kestemont", "affiliation": [{"original_name": "Institute for the Study of Literature in the Low Countries & CLiPS Computational Linguistics Group, University of Antwerp, Belgium", "normalized_name": "University of Antwerp", "country": "Belgium", "identifiers": {"ror": "https://ror.org/008x57b05", "GRID": "grid.5284.b"}}]}, {"given": " Sara", "family": "Moens", "affiliation": [{"original_name": "History Department, Ghent University, Belgium", "normalized_name": "Ghent University", "country": "Belgium", "identifiers": {"ror": "https://ror.org/00cv9y106", "GRID": "grid.5342.0"}}]}, {"given": " Jeroen", "family": "Deploige", "affiliation": [{"original_name": "History Department, Ghent University, Belgium", "normalized_name": "Ghent University", "country": "Belgium", "identifiers": {"ror": "https://ror.org/00cv9y106", "GRID": "grid.5342.0"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "30", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}