{"url": "http://dx.doi.org/10.1093/llc/fql038", "identifier": {"string_id": "10.1093/llc/fql038", "id_scheme": "DOI"}, "abstract": "In the period between 1999 and 2002, Jørn Almberg and Kristian Skarbø compiled a database which consists of recordings and phonetic transcriptions of translations of the fable ‘The North Wind and the Sun’ in about fifty Norwegian dialects. On the basis of fifteen of these recordings, Charlotte Gooskens carried out a perception experiment (Gooskens and Heeringa, 2004). In this experiment she investigated the distances between the fifteen dialects as perceived by the speakers themselves.On the basis of the phonetic transcriptions, Wilbert Heeringa (2004) measured computational linguistic distances between the fifteen Norwegian varieties (Gooskens and Heeringa, 2004). Distances were calculated by means of Levenshtein distance, which finds the minimum cost of changing one pronunciation into another by inserting, substituting or deleting phonetic segments. Gooskens and Heeringa (2004) correlated the perceptual distances with these computational distances and found a significant correlation of r = 0.67. In the computational distances, pronunciational, lexical, and morphological variation is processed, but these levels are not studied separately.The contribution of this article is that we measure pronunciational, lexical, and prosodic distances separately. Within pronunciational distances we distinguish between consonants and vowels on the one hand, and between substitutions and insertions/deletions on the other hand. When correlating the separate levels with perception and using multiple linear regression analyses we found that pronunciation is most important in perception and especially vowel substitutions play a major role.", "article_title": "The Relative Contribution of Pronunciational, Lexical, and Prosodic Differences to the Perceived Distances between Norwegian Dialects", "authors": [{"given": " Charlotte", "family": "Gooskens", "affiliation": [{"original_name": "Scandinavian Languages and Cultures, University of Groningen, Groningen, The Netherlands", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}, {"given": " Wilbert", "family": "Heeringa", "affiliation": [{"original_name": "Humanities Computing, University of Groningen, Groningen, The Netherlands", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2006", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "21", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}