{"url": "http://dx.doi.org/10.16995/dscn.295", "identifier": {"string_id": "10.16995/dscn.295", "id_scheme": "DOI"}, "abstract": "This essay demonstrates how topic modeling can be fruitfully applied to TEI-encoded plays, which allows scholars to analyze speeches by individual characters. Our analysis centers on Shakespeare’s corpus and characters who reappear in multiple plays. Specifically, we use topic models to show that young Prince Hal (in  and 2 Henry IV) does not speak the same language as his later self, Henry V (in his titular play): his linguistic shift mirrors his shift in status. Hal himself announces, “I have turned away my former self”—his change in diction bears out his assertion. Conversely, topic models reveal that Falstaff is Falstaff across multiple plays and genres (notably,  and 2 Henry IV and The Merry Wives of Windsor), despite scholarly claims to that the Falstaff of comedy is a watered-down version of the braggart drunk of the history plays. Ultimately, we hope that this algorithmically-informed analysis of Shakespeare’s plays is not taken as a final answer, but, instead, as a prompt. As this research reveals, topic modeling plays with attention to each speaker opens the door for new comparisons, and in turn, expands on previous interpretations of literature.", "article_title": "Is Falstaff Falstaff? Is Prince Hal Henry V?: Topic Modeling Shakespeare’s Plays", "authors": [{"given": "Laura", "family": "Estill", "affiliation": [{"original_name": "Texas A&M University (TAMU)", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Luis", "family": "Meneses", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}], "publisher": "Open Library of the Humanities", "date": "2018-01-23", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "8", "issue": "1", "ISSN": [{"value": "1918-3666", "type": "electronic"}]}