{"url": "http://dx.doi.org/10.1093/llc/fqy010", "identifier": {"string_id": "10.1093/llc/fqy010", "id_scheme": "DOI"}, "abstract": "In the present study 2,180 papers related to embodied cognition in the framework of linguistics were reviewed by using the bibliometric approach. The bibliographic records were collected from the Web of Science (Thomson Reuters) from 1992 to 2016 and were composed of a core data set and an expanded data set by topic searching and citation expansion. Document co-citation analysis, citation burst detection, and betweenness centrality measurement were conducted to explore and determine the thematic patterns, emerging trends, and critical articles of the knowledge domain. The results indicate that the study concerning language comprehension is the most prominent cluster. In addition, the labels as conceptual metaphor and conversational analysis are active clusters in a certain period. Meanwhile, the bursts of detected papers demonstrate that the present focus on language comprehension is a process of mental simulation of sensorimotor and other related experiences, and the topic of meaning construction is the product of interactive embodiment and cognitive processing, highlighting the role of simulation in language comprehension in emerging trends and future directions.", "article_title": "Visualizing the knowledge domain of embodied language cognition: A bibliometric review", "authors": [{"given": " Huili", "family": "Wang", "affiliation": [{"original_name": "School of Foreign Languages, Dalian University of Technology, China", "normalized_name": "Dalian University of Technology", "country": "China", "identifiers": {"ror": "https://ror.org/023hj5876", "GRID": "grid.30055.33"}}]}, {"given": " Xiaoli", "family": "Yan", "affiliation": [{"original_name": "School of Foreign Languages, Dalian University of Technology, China", "normalized_name": "Dalian University of Technology", "country": "China", "identifiers": {"ror": "https://ror.org/023hj5876", "GRID": "grid.30055.33"}}]}, {"given": " Hanning", "family": "Guo", "affiliation": [{"original_name": "School of International Education, Dalian University of Technology, China", "normalized_name": "Dalian University of Technology", "country": "China", "identifiers": {"ror": "https://ror.org/023hj5876", "GRID": "grid.30055.33"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-06-11", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}