{"url": "http://dx.doi.org/10.1145/2307723.2307726", "identifier": {"string_id": "10.1145/2307723.2307726", "id_scheme": "DOI"}, "abstract": "Analysis of visual art is a highly complex cognitive task that depends on the very many aspects of the art as well as complex brain connectivity, and the examination of visual art and the analysis of influential links between artists and artistic movements require the trained eye of knowledgeable art historians. However, while the human eye and brain can perceive visual art and notice the differences, similarities, and influential links between painters, computers employing artificial intelligence find this task far more challenging. In this article we show that computers can automatically analyze paintings of different artists and different schools of art in an unsupervised fashion. Experimental results show that the automatic computer analysis can group artists by their artistic movements, and provide a map of similarities and influential links that is largely in agreement with the analysis of art historians. These results demonstrate that machine vision and pattern recognition algorithms are able to mimic the complex cognitive task of the human perception of visual art, and can be used to measure and quantify visual similarities between paintings, painters, and schools of art.", "article_title": "Computer analysis of art", "authors": [{"given": "Lior", "family": "Shamir", "affiliation": [{"original_name": "Lawrence Technological University, Southfield, MI", "normalized_name": "Lawrence Technological University", "country": "United States", "identifiers": {"ror": "https://ror.org/04d52ej85", "GRID": "grid.258979.8"}}]}, {"given": "Jane A.", "family": "Tarakhovsky", "affiliation": [{"original_name": "Lawrence Technological University, Southfield, MI", "normalized_name": "Lawrence Technological University", "country": "United States", "identifiers": {"ror": "https://ror.org/04d52ej85", "GRID": "grid.258979.8"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2012-08-01", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "5", "issue": "2", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}