{"url": "http://dx.doi.org/10.1093/llc/16.4.467", "identifier": {"string_id": "10.1093/llc/16.4.467", "id_scheme": "DOI"}, "abstract": "Many stemmatological methods require estimates of pairwise distances between manuscripts, where distance is some measure of the number of changes that have occurred during copying along the path linking the two manuscripts. If a pair of manuscripts are separated from their common ancestor by more than one copy, more than one change may have occurred at some locations in the text, and the observed distance between two manuscripts may underestimate the actual number of changes. We derive a simple estimate of the actual number of changes given the observed number of changes, using a mathematical model for copying errors. This estimate is little affected by the size of the lexicon, the average rate at which copying errors are made, and the number of words for which a given word might be mistaken. Variation in error rates among scribes has no effect, and variation in error rates among words is probably unimportant. We recommend the routine use of this formula. However, variation in error rates among locations in the text can strongly affect the relationships between observed and actual distances. Such variation might easily arise in poetry because of the constraints of rhyme. Two priorities for future work are testing the underlying model for copying errors, and determining patterns of variation in error rates among locations.", "article_title": "Estimating Distances between Manuscripts Based on Copying Errors", "authors": [{"given": " Matthew", "family": "Spencer", "affiliation": [{"original_name": "University of CambridgeCambridge, UK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Christopher J.", "family": "Howe", "affiliation": [{"original_name": "University of CambridgeCambridge, UK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2001", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "16", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}