{"url": "http://dx.doi.org/10.1093/llc/15.4.445", "identifier": {"string_id": "10.1093/llc/15.4.445", "id_scheme": "DOI"}, "abstract": "The paper describes a method of collecting phonetic and linguistic data while maximizing the efficient use of resources. A speech database of Welsh was recorded and hand-annotated at the level of acoustic phonetic units and intonational units. This annotation file formed the input to a semi-automatic hierarchical annotation at higher linguistic levels. The method used rules to build the structure, followed if necessary by manual editing. The annotated database was then queried for linguistically significant sets of units. The query output was analysed statistically to derive basic descriptive data and answers to phonological questions. A small amount of data yielded answers to a long-standing stress-related question: stress in polysyllabic words does not affect the duration of (non-schwa) monophthongs, which are affected far more by word-final position. In addition, it was found that an intervocalic consonant after a stressed penult vowel was longer than a consonant in other positions. This confirmed earlier measurements and established three durational categories for non-cluster consonants. Finally, it was found that place of articulation and voicing factor both have an effect on voice onset time. It is hoped that this method will be of use to minority language researchers, in facilitating the swift gathering of basic phonetic and linguistic data, and speech technology resources.", "article_title": "A practical method for deriving phonetic and linguistic data for minority languages", "authors": [{"given": " B", "family": "Williams", "affiliation": [{"original_name": " Centre for Speech Technology Research, University of Edinburgh, 80 South Bridge, Edinburgh EH1 1HN, UK briony.cstr.ed.ac.uk ", "normalized_name": "University of Edinburgh", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01nrxwf90", "GRID": "grid.4305.2"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2000", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "15", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}