{"url": "http://dx.doi.org/10.1093/llc/16.3.205", "identifier": {"string_id": "10.1093/llc/16.3.205", "id_scheme": "DOI"}, "abstract": "American authorities, persuaded by Donald Foster's stylometric evidence, believe that Funeral Elegy by W. S. (FE) is at least possibly, and perhaps indisputably by Shakespeare. British authorities disagree sharply. Brian Vickers, Richard Kennedy, and Gilles Monsarrat argue that John Ford wrote the Elegy. We examine both ascriptions by applying to Ford's poems the same kind of common-authorship, exclusionary-evidence tests that we previously applied to Shakespeare's poems and play verse. We conclude that the odds are strongly against the Americans. If W. S. is either Ford or Shakespeare, Ford seems by far the more likely candidate. Counting firm rejections only, the Elegy fails sixteen of thirty-three Shakespeare tests and only one of twenty-nine Ford tests. If the distinguishing traits of both authors are Poisson-distributed—as some seem to be—the odds that the Elegy's scores could have arisen by chance from one corpus or the other are about 3,000 times better for Ford than they are for Shakespeare.", "article_title": "Smoking guns and silver bullets: could John Ford have written the Funeral Elegy?", "authors": [{"given": " Ward E. Y.", "family": "Elliott", "affiliation": [{"original_name": "Claremont McKenna College, Claremont, California, USA", "normalized_name": "Claremont McKenna College", "country": "United States", "identifiers": {"ror": "https://ror.org/04n1me355", "GRID": "grid.254272.4"}}]}, {"given": " Robert J.", "family": "Valenza", "affiliation": [{"original_name": "Claremont McKenna CollegeClaremont, California, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "16", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}