{"url": "http://dx.doi.org/10.1093/llc/fqaa027", "identifier": {"string_id": "10.1093/llc/fqaa027", "id_scheme": "DOI"}, "abstract": "Local historical documents originated from daily life of people belong to special collection resources that were not published publicly. They are valuable assets of universities and libraries. At present, most documents had only finished digitalization or partial datalization work. However, the requirements of deep knowledge mining in documents data, providing visual analysis, and effectively supporting the research of historic humanities scholars had not been fully met. Taking the local historical documents project of Shanghai Jiao Tong University as an example, using relevant techniques of digital humanities (DH), the in-depth analysis and utilization research of documents data were carried out. On the one hand, the core database of the documents was established based on standardizing metadata cataloguing and establishing metadata association. On the other hand, based on the core database, an intelligent DH system platform was constructed. The platform is to realize full-field retrieval and display of the documents, text analysis, association analysis, statistics, and visual presentation of knowledge. In addition, in the process of using the platform for research, humanities scholars can continuously expand the data dimensions and the relationships between data, achieve intelligent supplementation of documents data and platform self-learning. The concept of DH has led to a new direction of database construction and platform development. In the exploration and practice of DH, libraries should continue to widen thinking, improve service and innovation capabilities, and provide better research perspectives, research environments, research support, and research experience for humanities scholars.", "article_title": "From collection resources to intelligent data: Construction of intelligent digital humanities platform for local historical documents of Shanghai Jiao Tong University", "authors": [{"given": " Yin", "family": "Qian", "affiliation": [{"original_name": "Shanghai Jiao Tong University, China", "normalized_name": "Shanghai Jiao Tong University", "country": "China", "identifiers": {"ror": "https://ror.org/0220qvk04", "GRID": "grid.16821.3c"}}]}, {"given": " Zhuoyuan", "family": "Xing", "affiliation": [{"original_name": "Shanghai Jiao Tong University, China", "normalized_name": "Shanghai Jiao Tong University", "country": "China", "identifiers": {"ror": "https://ror.org/0220qvk04", "GRID": "grid.16821.3c"}}]}, {"given": " Xiaohua", "family": "Shi", "affiliation": [{"original_name": "Shanghai Jiao Tong University, China", "normalized_name": "Shanghai Jiao Tong University", "country": "China", "identifiers": {"ror": "https://ror.org/0220qvk04", "GRID": "grid.16821.3c"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}