{"url": "http://dx.doi.org/10.1093/llc/fqz054", "identifier": {"string_id": "10.1093/llc/fqz054", "id_scheme": "DOI"}, "abstract": "Multispectral (MSI) imaging of historical documents can recover lost features, such as text or drawings. This technique involves capturing multiple images of a document illuminated using different wavelengths of light. The images created must be registered in order to ensure optimal results are produced from any subsequent image processing techniques. However, the images may be misaligned due to the presence of optical elements such as filters, or because they were acquired at different times or because the images were captured from different copies of the documents . There is little prior work or information available about which image registration techniques are most appropriate. Image registration of multispectral images is challenging as the illumination changes for each image and the features visible in images captured at different wavelengths may not appear consistently throughout the image sequence. Here, we compare three image registration techniques: two based on similarity measures and a method based on phase correlation. These methods are characterized by applying them to realistic surrogate images and then assessed on three different sets of real multispectral images. Mutual information is recommended as a measure for affine image registration when working with multispectral images of documentary material as it was proven to be more robust than the other techniques tested.", "article_title": "Affine registration of multispectral images of historical documents for optimized feature recovery", "authors": [{"given": " Cerys", "family": "Jones", "affiliation": [{"original_name": "UCL Department of Medical Physics and Biomedical Engineering, London, UK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " William A", "family": "Christens-Barry", "affiliation": [{"original_name": "Equipoise Imaging LLC, Ellicott City, MD, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Melissa", "family": "Terras", "affiliation": [{"original_name": "College of Arts, Humanities and Social Sciences, University of Edinburgh, Edinburgh, UK", "normalized_name": "University of Edinburgh", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01nrxwf90", "GRID": "grid.4305.2"}}]}, {"given": " Michael B", "family": "Toth", "affiliation": [{"original_name": "R.B. Toth Associates, Oakton, VA, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Adam", "family": "Gibson", "affiliation": [{"original_name": "UCL Department of Medical Physics and Biomedical Engineering, London, UK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}