{"url": "http://dx.doi.org/10.1093/llc/fql036", "identifier": {"string_id": "10.1093/llc/fql036", "id_scheme": "DOI"}, "abstract": "The two West-Germanic languages Dutch and Afrikaans are so closely related that they can be expected to be mutually intelligible to a large extent. The present investigation focuses on written language. Comprehension was established by means of cloze tests on the basis of two newspaper articles. Results suggest that it is easier for Dutch subjects to understand written Afrikaans than it is for South African subjects to understand written Dutch. In order to explain the results, attitudes as well as several types of linguistic distances were assessed. The relations between attitude scales and intelligibility scores were few and weak. Asymmetries in the linguistic relationships between the two languages are probably more important, especially the asymmetries in the number of noncognates and the opacity of the relatedness of cognates. These asymmetries are caused by historical developments in Dutch and Afrikaans, with respect to the lexicon, grammar, and spelling.", "article_title": "Mutual Comprehensibility of Written Afrikaans and Dutch: Symmetrical or Asymmetrical?", "authors": [{"given": " Charlotte", "family": "Gooskens", "affiliation": [{"original_name": "Department of Scandinavian Studies, University of Groningen, Groningen, The Netherlands", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}, {"given": " Renée", "family": "van Bezooijen", "affiliation": [{"original_name": "Department of Linguistics, Radboud University Nijmegen, Nijmegen, The Netherlands", "normalized_name": "Radboud University Nijmegen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/016xsfp80", "GRID": "grid.5590.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2006", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "21", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}