{"url": "http://dx.doi.org/10.1093/llc/fqu063", "identifier": {"string_id": "10.1093/llc/fqu063", "id_scheme": "DOI"}, "abstract": "Theorists of technology adoption have demonstrated that successful technologies rely on social resources. This article takes up social tensions involved in designing digital resources for scholarship, at the centre of which stand editing tools. These are (1) individualism versus collaboration in relation to credit; (2) the shift towards dynamism versus stability in resources; (3) simplicity versus complexity in data models and interfaces; (4) swift dissemination versus scholarly quality control; and (5) the benefits of standards versus disciplinary resistance to systematization. With particular reference to editing and publication software, it argues that interfaces are the contact zones within which such tensions will necessarily be mediated. The onus is on the scholarly community to address the social implications of new editing environments, but we can navigate future possibilities only through a deep respect for the embodied and socially situated experience of the user or subject of textuality and a profound recognition of the power of our printed past.", "article_title": "Tensions and tenets of socialized scholarship", "authors": [{"given": " Susan", "family": "Brown", "affiliation": [{"original_name": "School of English and Theatre Studies, University of Guelph, Canada", "normalized_name": "University of Guelph", "country": "Canada", "identifiers": {"ror": "https://ror.org/01r7awg59", "GRID": "grid.34429.38"}}, {"original_name": "Department of English and Film Studies, University of Alberta, Canada", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2015", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "31", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}