{"url": "http://zfdg.de/sb003_003", "identifier": {"string_id": "10.17175/sb003_003", "id_scheme": "DOI"}, "abstract": "This essay questions whether digital literary studies can still be meaningfully regarded as part of literary studies. This heretical question is motivated by a praxeological view of a research project for the network analysis of dramatic texts, in particular by reflecting on the project’s underlying ›epistemic thing‹, which in this case consists of specifically-formatted structural data (and not the actual primary texts themselves). What does this corpus of structural data, which was extracted from 465 plays spanning the period from 1730 to 1930, have to do with the ›epistemic things‹ of literary studies? We explore this question by providing insight into our analyses, which describe the structural evolution of the ›plays‹, try to locate ›small world‹ properties in our corpus, and develop new metrics for plot analysis. The results show not only how digital methods can supplement or enrich literary studies; they also raise questions about how digital the field of literary studies already is, since its research objects are increasingly available in digital forms.", "article_title": "Literaturwissenschaft als Hackathon. Zur Praxeologie der Digital Literary Studies und ihren epistemischen Dingen", "authors": [{"given": "Peer", "family": "Trilcke", "affiliation": [{"original_name": "Universität Potsdam, Institut für Germanistik", "normalized_name": "University of Potsdam", "country": "Germany", "identifiers": {"ror": "https://ror.org/03bnmw459", "GRID": "grid.11348.3f"}}]}, {"given": "Frank", "family": "Fischer", "affiliation": [{"original_name": "National Research University Higher School of Economics Moscow Russia", "normalized_name": "National Research University Higher School of Economics", "country": "Russia", "identifiers": {"ror": "https://ror.org/055f7t516", "GRID": "grid.410682.9"}}]}], "publisher": null, "date": "2018-06-27", "keywords": null, "journal_title": "Zeitschrift für digitale Geisteswissenschaften", "volume": "Sonderband 3", "issue": null, "ISSN": [{"value": "2510-1366", "type": "electronic"}]}