{"url": "http://dx.doi.org/10.1093/llc/18.4.341", "identifier": {"string_id": "10.1093/llc/18.4.341", "id_scheme": "DOI"}, "abstract": "This paper investigates style variation in George Orwell's Nineteen Eighty-Four and William Golding's The Inheritors using multivariate analysis, specifically, cluster analysis of the frequencies of frequent words. Baseline tests on a corpus including these and four other novels show that traditional authorship attribution techniques correctly distinguish all sections of each novel from all sections of the other five and correctly cluster all sections of each novel. They are also very successful in distinguishing the section of Nineteen Eighty-Four that purports to be a political tract by Emmanuel Goldstein from the rest of the novel. They are less successful in distinguishing the style of the final chapter of The Inheritors, where critics have argued that a sudden shift of point of view leads to a radical variation in style. The nature of this stylistic variation suggests a modification in the way that frequent words are selected for analysis—a modification that gives improved results for both novels and sharply distinguishes the final chapter from the rest of The Inheritors. A further test of the modified technique on an unusual section of The Picture of Dorian Gray suggests that it may be more widely useful in studies of style variation.", "article_title": "Multivariate Analysis and the Study of Style Variation", "authors": [{"given": " David L.", "family": "Hoover", "affiliation": [{"original_name": " New York University, New York, NY, USA ", "normalized_name": "New York University", "country": "United States", "identifiers": {"ror": "https://ror.org/0190ak572", "GRID": "grid.137628.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004-11-11", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "18", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}