{"url": "http://dx.doi.org/10.1093/llc/16.2.179", "identifier": {"string_id": "10.1093/llc/16.2.179", "id_scheme": "DOI"}, "abstract": "What will be the critical editions in the electronic era? Hubert de Phalèse, a research centre in La Sorbonne-Nouvelle University (Paris III), in accordance with its pragmatic approach to literary computing problems, decided to launch this debate by putting on line a critical edition of the complete works of Lautréamont/Isidore Ducasse (http://www.cavi.univ-paris3.fr/phalese). This edition is an integral hypertext (in which nearly every word of the text is linked with a comment), which gathers all that one usually finds in critical editions, but on a scale that does not have equivalents on paper: variants, philological, literary and encyclopedic comments, biography, bibliography, iconography, index, etc. This prototype poses, concretely, a certain number of problems, on several levels:Technical: Which interface is to be used? The purely automatic search engines (including the uses of Java and other script languages) appeared unsuited and a new device of computer-assisted indexing was developed. It makes it possible to provide for the user a lemmatized index and, especially, lexical cards, which can be enriched at will. The current solution of setting on-line presents some inconveniences but it has the advantage of proposing to the greatest number of users the consultation of the edition and of inviting them to take part in it.Contents: The new support is, virtually, infinite. What is a critical edition to contain now that we are no longer concerned with its volume? All the versions of the text, for example, can now be proposed with the reading. But are we to publish the intertexts, contemporary works, criticism, etc. ? How can the interconnection, in a network, of several resources enrich a critical edition? Under which scientific and legal conditions?Validation: Can this type of edition be regarded as more reliable than the paper editions? According to which protocols will such editions be judged? One of the risks is the appearance of a great quantity of work without scientific guarantee. How will the possibilities of collective work and permanent updating modify our design of what a philological work should be?Publication: Who will deal with the building and the diffusion expenses of such electronic products? Will the redistribution of the budget headings in this type of edition lead academics to transform themselves into diffusers, or will traditional editors change their practice? In addition, new prospects open with the critical edition, which it will be necessary to evaluate and explore to determine their real potentialities.Work in group: data processing and. the Internet support the participation of a growing number of speakers around an intellectual work. What will be the roles of each of these (project director, data-processing specialists, humanists, students, active readers, etc.)? The concepts even of authors and readers will no longer have the same direction.Real time: the possibility of permanent update offered by an Internet site makes it possible to revalue the traditional concepts. Indeed, it is no longer essential to put on-line a totally completed work, and the noted errors can be immediately corrected. In addition, this type of edition makes it possible to account for the topicality of research in the field, which connects it with a review (of which the periodicity is much higher than that of any scientific review).Interactivity: the possibility of putting creators and users of electronic publishing in contact by means of electronic mail also connects this type of edition to a permanent conference. It is possible, in the long, term, that scientific communities (specialists in an author, for example) will gather around great electronic projects, which they would make live by publishing the results of their work there.Cost: the very low cost of setting on-line such an edition (I except the working time of researchers) makes it possible at the same time to consider some undertakings that traditional editors would not consider (very large corpus, work of interest only for few specialists) and to allow researchers to publish in good working conditions works of small size or that do not fit the framework of current university editions.Multimedia: what can be the contribution of multimedia to a scientific work like a critical edition? Everything in this field remains to be invented, because the traditional edition accustomed us to purely textual tools, primarily for reasons of cost. The sound and visual illustrations will bring to the literary text a very interesting dimension (publication of manuscripts, interpretations, inconographics documents, contemporary pieces of music, etc.), from the teaching point of view as well as in the research field, but it is necessary to be wary of the easy effects that have accustomed us, the general public, to electronic publishing. It is very urgent to answer these questions because the share of electronic documentation in literary studies would have, as in the other documentary fields, to increase until gradually replacing the traditional supports. Consequently, the survival of the texts and their formal characteristics will be closely related to the devices that will ensure their transmission, their conservation, and their reading.", "article_title": "The FALMER Project: an electronic critical edition", "authors": [{"given": " Michel", "family": "Bernard", "affiliation": [{"original_name": "Université de la Sorbonne-NouvelleParis, France", "normalized_name": "New Sorbonne University", "country": "France", "identifiers": {"ror": "https://ror.org/03z6jp965", "GRID": "grid.17689.31"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004-11-11", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "16", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}