{"url": "http://dx.doi.org/10.1093/llc/fqt044", "identifier": {"string_id": "10.1093/llc/fqt044", "id_scheme": "DOI"}, "abstract": "This article demonstrates that the history of computing in the humanities is an almost uncharted research topic. It argues that this oversight must be remedied as a matter of urgency so that the evolutionary model of progress that currently dominates the field can be countered. We describe the ‘Hidden Histories’ pilot project and explore the origins and practice of oral history; in the corresponding issue of Digital Humanities Quarterly, five oral history interviews that we carried out during the project are presented. We conclude that the selection of interviews presented here demonstrate that oral history is an important and productive methodology in such research. The five oral history interviews form primary sources, which can be used in the writing of a history of computing in the humanities; furthermore, they contain new information and interpretations, which cannot be gleaned from published scholarly articles, for example, information about the varied entry routes into the field that have existed and the interrelationship between myth and history in the narratives we create about the emergence of digital humanities.", "article_title": "Oral History and the Hidden Histories project: towards histories of computing in the humanities", "authors": [{"given": " Julianne", "family": "Nyhan", "affiliation": [{"original_name": "Department of Information Studies, University College London, UK", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Andrew", "family": "Flinn", "affiliation": [{"original_name": "Department of Information Studies, University College London, UK", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Anne", "family": "Welsh", "affiliation": [{"original_name": "Department of Information Studies, University College London, UK", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "30", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}