{"url": "http://dx.doi.org/10.1093/llc/fqn040", "identifier": {"string_id": "10.1093/llc/fqn040", "id_scheme": "DOI"}, "abstract": "Mormon prophet Joseph Smith (1805–44) claimed that more than two-dozen ancient individuals (Nephi, Mormon, Alma, etc.) living from around 2200 BC to 421 AD authored the Book of Mormon (1830), and that he translated their inscriptions into English. Later researchers who analyzed selections from the Book of Mormon concluded that differences between selections supported Smith's claim of multiple authorship and ancient origins. We offer a new approach that employs two classification techniques: ‘delta’ commonly used to determine probable authorship and ‘nearest shrunken centroid’ (NSC), a more generally applicable classifier. We use both methods to determine, on a chapter-by-chapter basis, the probability that each of seven potential authors wrote or contributed to the Book of Mormon. Five of the seven have known or alleged connections to the Book of Mormon, two do not, and were added as controls based on their thematic, linguistic, and historical similarity to the Book of Mormon. Our results indicate that likely nineteenth century contributors were Solomon Spalding, a writer of historical fantasies; Sidney Rigdon, an eloquent but perhaps unstable preacher; and Oliver Cowdery, a schoolteacher with editing experience. Our findings support the hypothesis that Rigdon was the main architect of the Book of Mormon and are consistent with historical evidence suggesting that he fabricated the book by adding theology to the unpublished writings of Spalding (then deceased).", "article_title": "Reassessing authorship of the Book of Mormon using delta and nearest shrunken centroid classification", "authors": [{"given": " Matthew L.", "family": "Jockers", "affiliation": [{"original_name": "Department of English, Stanford University, Stanford, CA 94305, USA", "normalized_name": "Stanford University", "country": "United States", "identifiers": {"ror": "https://ror.org/00f54p054", "GRID": "grid.168010.e"}}]}, {"given": " Daniela M.", "family": "Witten", "affiliation": [{"original_name": "Department of Statistics, Stanford University, Stanford, CA 94305, USA", "normalized_name": "Stanford University", "country": "United States", "identifiers": {"ror": "https://ror.org/00f54p054", "GRID": "grid.168010.e"}}]}, {"given": " Craig S.", "family": "Criddle", "affiliation": [{"original_name": "Department of Civil and Environmental Engineering, Stanford University, Stanford, CA 94305, USA", "normalized_name": "Stanford University", "country": "United States", "identifiers": {"ror": "https://ror.org/00f54p054", "GRID": "grid.168010.e"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2008", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "23", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}