{"url": "http://dx.doi.org/10.16995/dscn.44", "identifier": {"string_id": "10.16995/dscn.44", "id_scheme": "DOI"}, "abstract": "Stylometry has got a lot of interest during these recent years because it solved many authorship problems and disputes that were difficult to handle. Author discrimination consists in checking whether two texts are written by the same author or not. In this investigation, we try to make an author discrimination between the Quran (The holy words and statements of God in the Islamic religion) and the Hadith (statements said by the prophet Muhammad) in a segmental form. In fact, 14 text segments are extracted from the Quran book and 11 text segments are extracted from the Bukhari Hadith. These segments have more or less the same size in terms of words and the medium size is about 2080 words per text segment. The Quran is taken in its entirety, whereas for the Prophet’s statements, we chose only the certified texts of the Bukhari book. That is, four series of experiments are done and commented. The first series of experiments concerns several experiments of authorship attribution using different state of the art features and classifiers, the second series of experiments analyses the different texts by using a new parameter called COST, the third series of experiments consists in an authorship discrimination using the frequency of a particular word (“الذين ” meaning those/who in English) and the fourth series of experiments performs a hierarchical clustering on the 25 text segments, in order to assess the real number of clusters (author styles) and to see if the hypothesis of a unique author is possible. This investigation, which represents the continuation of a previous research work on the same topic [Sayoud 2012-a], has further clarified an old enigma, which was impossible to solve for fourteen centuries: all the results of this investigation show unanimously that the two books should have two different authors.", "article_title": "Segmental Analysis-Based Authorship Discrimination between the Holy Quran and Prophet’s Statements", "authors": [{"given": "Halim", "family": "Sayoud", "affiliation": [{"original_name": "USTHB University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Open Library of the Humanities", "date": "2015", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "0", "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}