{"url": "http://dx.doi.org/10.1093/llc/fqi032", "identifier": {"string_id": "10.1093/llc/fqi032", "id_scheme": "DOI"}, "abstract": "The article studies the interaction between technical choices in virtual reality (VR) models and approaches to cultural history, for teaching and research. It is based on an ongoing project undertaken by ‘Cultures Anglophones et Technologies de l'Information’ at Paris-Sorbonne: ‘Montmartre in the jazz age’, a model of Montmartre in the late 1920s, when African-American musicians brought jazz to cabarets. Integrating it into the curriculum modifies the research/teaching interaction: it involves students in projects in progress; it encourages them to undertake interdisciplinary studies, involving computing skills and research in topography or music history. The issues that arise in the authoring of the project are a contribution to the problematics of cultural history; modelling the Montmartre environment from early documents (maps, photographs, which have to be edited with specialized software) shows how relative and incomplete they are—and thus how relative and composite our own modelling is. This composite character is in keeping with the ‘spirit of place’ of a multicultural area; VR is an elaborate structure, starting from a 3D model, with interior and exterior views, wireframes and textures; the medium is suited to the message: the recreation of a complex environment of spaces and subspaces throwing into focus contact points between French traditional songs and American jazz. The VR projects underline issues in the humanities; involving students increases their awareness of new problematics. The present article shows how new methods in humanities computing, in the field of visualization, alter and enrich humanities disciplines. It documents the authoring of a VR model, and the introduction of an Information Technology research project into the university teaching process: ‘Montmartre in the jazz age’, a multidisciplinary humanities adventure involving a digital reconstruction of part of this famous Paris area, the ‘Lapin Agile’ cabaret in the first instance. It argues that the involvement of research students in such projects not only gives them IT skills, but also adds to their critical understanding of humanities issues.", "article_title": "‘VR “Montmartre in the Jazz Age” ’: The Problematics of Virtual Reality in Researching and Teaching Multicultural History", "authors": [{"given": " Liliane", "family": "Gallet-Blanchard", "affiliation": [{"original_name": "Université Paris-Sorbonne (Paris IV), France", "normalized_name": "University of Paris-Sud", "country": "France", "identifiers": {"ror": "https://ror.org/028rypz17", "GRID": "grid.5842.b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2005-07-23", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "20", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}