{"url": "http://dx.doi.org/10.1093/llc/fqw006", "identifier": {"string_id": "10.1093/llc/fqw006", "id_scheme": "DOI"}, "abstract": "For most of the world’s 7,000 languages, there are few records available via the Internet. Recognizing this digital divide and the consequential underrepresentation of most languages in any linked open data efforts is a motivation for some solutions offered in this article. Efforts to increase the documentation of the world’s small languages have led to the development of tools and repositories over the past decade. However, as not all digital language archives currently provide metadata in standard formats, their collections are invisible to aggregated searches. Other repositories (including many institutional repositories—national libraries and archives, mission archives, and so on) have language content that is not noted in the collection’s catalog, so is impossible to locate at all via a search based on language names. Finally, there are collections still held by their creators and not in a repository at all, completely hidden from other potential users. This article suggests that it is a digital humanities project to make more information about the world’s small languages more freely available, and identifies several means by which this could be accomplished, including a survey to locate more collections; a register to announce their existence; and a documentation index to provide an overview of what is known for each language.", "article_title": "What Remains to be Done—Exposing Invisible Collections in the other 7,000 Languages and Why it is a DH Enterprise", "authors": [{"given": " Nick", "family": "Thieberger", "affiliation": [{"original_name": "School of Languages and Linguistics, University of Melbourne, Australia", "normalized_name": "University of Melbourne", "country": "Australia", "identifiers": {"ror": "https://ror.org/01ej9dk98", "GRID": "grid.1008.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}