{"url": "http://dx.doi.org/10.1093/llc/fqw061", "identifier": {"string_id": "10.1093/llc/fqw061", "id_scheme": "DOI"}, "abstract": "Digitizing Lefebvre’s Spatial Triad is conceived as a seed project for an interdisciplinary analysis of the built environment via digital media. Two social housing projects in İzmir are chosen as case studies as an initial step to be developed toward a potentially international digital platform. The theoretical premises of the project are based on the renowned cultural theorist Henri Lefebvre’s Spatial Triad, which distinguishes between representations of space, representational spaces or spaces of representation, and spatial practices. Following this framework, the collected data are organized in three sections, which are reflected in the digital interface. These are respectively titled, ‘implementations’, which contains architectural drawings and visual recordings of interviews with the chief architect of the projects; ‘perceptions’, which includes related texts that are scanned from Web sites, newspapers, journals, and conference proceedings; and ‘lived experiences’, which contains photographs and visual records of on-site interviews with the users of the two housing estates. Users of the digital interface are enabled access to data in each category by means of choosing one of eighty-three related keywords. The latter are derived from the digital analyses of discursive material. By enabling the comparison of the sections of spatial data for each settlement and between the two settlements, the digital platform has the potential to inform decision-making processes in future social housing projects.", "article_title": "Digitizing Lefebvre’s Spatial Triad", "authors": [{"given": " Gülsüm", "family": "Baydar", "affiliation": [{"original_name": "Department of Architecture, Yaşar University, Turkey", "normalized_name": "Yaşar University", "country": "Turkey", "identifiers": {"ror": "https://ror.org/00dz1eb96", "GRID": "grid.439251.8"}}]}, {"given": " Murat", "family": "Komesli", "affiliation": [{"original_name": "Department of Software Engineering, Yaşar University, Turkey", "normalized_name": "Yaşar University", "country": "Turkey", "identifiers": {"ror": "https://ror.org/00dz1eb96", "GRID": "grid.439251.8"}}]}, {"given": " Ahenk", "family": "Yılmaz", "affiliation": [{"original_name": "Department of Architecture, Yaşar University, Turkey", "normalized_name": "Yaşar University", "country": "Turkey", "identifiers": {"ror": "https://ror.org/00dz1eb96", "GRID": "grid.439251.8"}}]}, {"given": " Kıvanç", "family": "Kılınç", "affiliation": [{"original_name": "Department of Architecture, Yaşar University, Turkey", "normalized_name": "Yaşar University", "country": "Turkey", "identifiers": {"ror": "https://ror.org/00dz1eb96", "GRID": "grid.439251.8"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}