{"url": "http://dx.doi.org/10.1093/llc/fqr001", "identifier": {"string_id": "10.1093/llc/fqr001", "id_scheme": "DOI"}, "abstract": "Hongloumeng by Xueqin Cao (Hsueh-ch‘in Ts'ao) is generally considered one of the greatest classical Chinese novel. Of all nine published English translations known today, the one translated by Hawkes and Minford (the Story of the Stone, Penguin, 1973–86) and the other by Yang and Yang (A Dream of Red Mansions1, Foreign Languages Press in Beijing, 1978–80) are the best known among translators and literary scholars. Over the years, both have been carefully scrutinized and much critiqued. Translators and translation scholars have been engaged in heated debates over salient features of the translations, strategies employed by the translators, the possible effects of the two translations and so on [cf. Liu and Gu (1997) On translation of cultural contents in Hong Lou Meng [in Chinese]. Chinese Translators Journal, 1: 16–19; Wang (2001) A Comparative Study of the English Translations of Poetry in Hong Lou Meng. Xi’an: Shanxi Normal University Press; Feng (2006) On the Translation of Hong Lou Meng [in Chinese]. Shanghai: Shanghai Foreign Language Education Press; Liu (2008), Translating tenor: With reference to the English versions of Hong Lou Meng. Meta, 53(3): 528–48], with the eventual aim to determine which translation better captures the style of the original text or author. Like many debates of similar nature, no definitive conclusions have been reached despite such an intense interest. We believe a corpus-assisted examination [Baker, M. (2000). Towards a methodology for investigating the style of a literary translator. Target, 12(2): 241–66; Baker, M. (1993). Corpus linguistics and translation studies: Implications and applications. In Gill, F., Baker, M., and Tognini-Bonelli, E. (eds), Text and Technology: In Honour of John Sinclair. Amsterdam: Benjamins, pp. 233–50] of the two translations will provide more convincing analysis and can better describe the differences in the translation style of the two famous translations. A particular effort is further made to interpret the reasons for the different strategies adopted by the two different pairs of translators in the social, political, and ideological context of the translations.", "article_title": "Translation Style and Ideology: a Corpus-assisted Analysis of two English Translations of Hongloumeng", "authors": [{"given": " Defeng", "family": "Li", "affiliation": [{"original_name": "Centre for Translation Studies, SOAS, University of London", "normalized_name": "University of London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04cw6st05", "GRID": "grid.4464.2"}}]}, {"given": " Chunling", "family": "Zhang", "affiliation": [{"original_name": "Department of Linguistics, University of Alberta", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}, {"given": " Kanglong", "family": "Liu", "affiliation": [{"original_name": "Shue Yan University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2011", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "26", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}