{"url": "http://dx.doi.org/10.1093/llc/fqp039", "identifier": {"string_id": "10.1093/llc/fqp039", "id_scheme": "DOI"}, "abstract": "Although vast amounts of authentic materials are now available online to help language learners build up vocabulary and language skills in many languages, the consumer is almost ‘spoiled for choice’, and often at a loss where to begin. This article aims to provide an overall menu of language- learning and teaching websites, to help both students and teachers select more useful Computer-Assisted Language Learning (CALL) sites and programs, showing how to combine them into an effective online reading and vocabulary learning program for either classroom- or self-access. It will help both kinds of users to be able to better filter through the rivers of online data, to find and focus on what we will refer to as the ‘CALL or ESL/EFL gold’, meaning websites most content- and media-rich for English as a Second/Foreign Language teaching or learning. Though our discussion will be in English mostly about using these sites to improve English learning, many of the sites included in this framework can be used for learning as many as 140 major languages of the world. While most language learners are still using more traditional classrooms and textbooks, CALL-based instruction is growing rapidly. The practical problem for both teachers and students who have such resources, however, is to find some practical tool to plow through the plethora of online data, useful in helping schools to make a sensible CALL system to help students learn language and vocabulary most enjoyably and effectively. This article begins to suggest how to construct such an integrated CALL program, including many well-designed sites that combine the advantages of using authentic materials with online tools to help simplify them and provide various kinds of language learning support that can aid both students and teachers. Ten established research-based goals for L2 reading are integrated into a proposed framework for using online reading programs in a way that follows a clear ‘Taxonomy of Vocabulary Development (Deeper Lexical Processing)’.", "article_title": "Constructing a roadmap to more systematic and successful online reading and vocabulary acquisition", "authors": [{"given": " John Paul", "family": "Loucky", "affiliation": [{"original_name": "Seinan JoGakuin University, Fukuokaken, Japan", "normalized_name": "Seinan Gakuin University", "country": "Japan", "identifiers": {"ror": "https://ror.org/03jqhsn85", "GRID": "grid.443473.3"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2009", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "25", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}