{"url": "http://dx.doi.org/10.1093/digitalsh/fqz013", "identifier": {"string_id": "10.1093/digitalsh/fqz013", "id_scheme": "DOI"}, "abstract": "In this article we establish a methodological and theoretical framework for the study of large collections of visual materials. Our framework, distant viewing, is distinguished from other approaches by making explicit the interpretive nature of extracting semantic metadata from images. In other words, one must ‘view’ visual materials before studying them. We illustrate the need for the interpretive process of viewing by simultaneously drawing on theories of visual semiotics, photography, and computer vision. Two illustrative applications of the distant viewing framework to our own research are draw upon to explicate the potential and breadth of the approach. A study of television series shows how facial detection is used to compare the role of actors within the narrative arcs across two competing series. An analysis of the Farm Security Administration–Office of War Information corpus of documentary photography is used to establish how photographic style compared and differed amongst those photographers involved with the collection. We then aim to show how our framework engages with current methodological and theoretical conversations occurring within the digital humanities.", "article_title": "Distant viewing: analyzing large visual corpora", "authors": [{"given": " Taylor", "family": "Arnold", "affiliation": [{"original_name": "Department of Mathematics and Computer Science, University of Richmond, Richmond, VA, USA", "normalized_name": "University of Richmond", "country": "United States", "identifiers": {"ror": "https://ror.org/03y71xh61", "GRID": "grid.267065.0"}}]}, {"given": " Lauren", "family": "Tilton", "affiliation": [{"original_name": "Department of Rhetoric and Communication Studies, University of Richmond, Richmond, VA, USA", "normalized_name": "University of Richmond", "country": "United States", "identifiers": {"ror": "https://ror.org/03y71xh61", "GRID": "grid.267065.0"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}