{"url": "http://dx.doi.org/10.1093/llc/fqz043", "identifier": {"string_id": "10.1093/llc/fqz043", "id_scheme": "DOI"}, "abstract": "Experience through sight has been recognized as a contributing factor in the shaping of historic landscapes, where humans could express themselves in response to their aesthetic and intellectual qualities. What was experienced, however, was not only dependent on the ‘prospect’, or landscape view, but also on the individual ‘perspective’ of the spectator. Three-dimensional Geographical Information Systems (3D GIS) has enabled investigations into landscape visibility within digitized historic environments and can therefore assist the analysis and understanding of this phenomenon. This article applies 3D GIS to a currently under-researched area of landscape history, English designed landscapes of the 16th and 17th centuries. From country houses and gardens to parks and working estates, these landscapes were manipulated in response to the landowners’ ‘perspectives’ towards the landscape, which subsequently determined the visibility or invisibility of features within certain ‘prospects’. This concept was dubbed ‘The Royaltie of Sight’ by Henry Wotton in 1624. By using 3D GIS to recreate a designed landscape that poses challenges which have previously hindered its analysis, the characteristics of ‘prospects’ can be ascertained using viewshed analysis and the individual ‘perspective’ of the landowner interpreted using phenomenology and reception theory. The results presented in this article demonstrate how 3D GIS has benefited studies into English designed landscapes and improved knowledge of how perception influenced landscape change. ", "article_title": "3D GIS and ‘The Royaltie Of Sight’: Recreating ‘Prospects’ and ‘Perspectives’ within an English designed landscape c. 1550–1660", "authors": [{"given": " Elizabeth", "family": "Stewart", "affiliation": [{"original_name": "School of History, University of East Anglia, Norwich, UK", "normalized_name": "University of East Anglia", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/026k5mg93", "GRID": "grid.8273.e"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}