{"url": "http://dx.doi.org/10.16995/dscn.299", "identifier": {"string_id": "10.16995/dscn.299", "id_scheme": "DOI"}, "abstract": "From a digital historian’s point of view, Ancien Régime French texts suffer from obsolete grammar, unreliable spelling, and poor optical character recognition, which makes these texts ill-suited to digital analysis. This paper summarizes methodological experiments that have allowed the author to extract useful quantitative data from such unlikely source material. A discussion of the general characteristics of hand-keyed and OCR’ed historical corpora shows that they differ in scale of difficulty rather than in nature. Behavioural traits that make text mining certain eighteenth century corpora particularly challenging, such as error clustering, a relatively high cost of acquisition relative to salience, outlier hiding, and unpredictable patterns of error repetition, are then explained. The paper then outlines a method that circumvents these challenges. This method relies on heuristic formulation of research questions during an initial phase of open-ended data exploration; selective correction of spelling and OCR errors, through application of Levenshtein’s algorithm, that focuses on a small set of keywords derived from the heuristic project design; and careful exploitation of the keywords and the corrected corpus, either as raw data for algorithms, as entry points from which to construct valuable data manually, or as focal points directing the scholar’s attention to a small subset of texts to read. Each step of the method is illustrated by examples drawn from the author’s research on the hand-keyed Encyclopédie and Bibliothèque Bleue and on collections of periodicals obtained through optical character recognition.", "article_title": "How to Extract Good Knowledge from Bad Data: An Experiment with Eighteenth Century French Texts", "authors": [{"ORCID": "http://orcid.org/0000-0001-5542-3754", "authenticated-orcid": false, "given": "François Dominic", "family": "Laramée", "affiliation": [{"original_name": "Université de Montréal", "normalized_name": "University of Montreal", "country": "Canada", "identifiers": {"ror": "https://ror.org/0161xgx34", "GRID": "grid.14848.31"}}]}], "publisher": "Open Library of the Humanities", "date": "2019", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "9", "issue": "1", "ISSN": [{"value": "1918-3666", "type": "electronic"}]}