{"url": "http://dx.doi.org/10.17928/jjadh.1.1_44", "identifier": {"string_id": "10.17928/jjadh.1.1_44", "id_scheme": "DOI"}, "abstract": "To support the automatic semantic analysis of texts in the humanities, it is not sufficient to analyze words and evaluate word pairs, because it is necessary to process larger units, such as phrases, sentences, and paragraphs. This study proposes the introduction of intratextuality into a digital archive system. In the future, this method will be developed as the basis for semantic analysis of larger units. Classical literary structures that are used frequently in the Old and New Testaments were digitized as a case study. A literary structure data format for a relational database was also implemented. The literary structures of 39 books in the Old Testament and 27 books in the New Testament were digitized. The total number of digitized literary structures was 1,507 and the elements of these structures comprised 7,715 pairs. These data were stored in a Java-based relational database system and a web-based viewer program for rhetorical structures was implemented as a JSP servlet. This web-based program will be combined with an existing digital archive system that can manage intertextuality data. The Java-based relational database system and the JSP servlet will facilitate numerical analyses of the intertextuality and intratextuality of digital archive systems of classical texts, thus making it much easier to conduct scientific analyses of the meanings of texts.", "article_title": "Database System for Archiving the Literary Structure of the Bible", "authors": [{"given": "Hajime", "family": "Murai", "affiliation": [{"original_name": "Graduate School of Decision Science and Technology Tokyo Institute of Technology", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Japanese Association for Digital Humanities", "date": "2015", "keywords": null, "journal_title": "Journal of the Japanese Association for Digital Humanities", "volume": "1", "issue": "1", "ISSN": [{"value": "2188-7276", "type": "electronic"}]}