{"url": "http://dx.doi.org/10.1093/llc/fqy016", "identifier": {"string_id": "10.1093/llc/fqy016", "id_scheme": "DOI"}, "abstract": "Elena Ferrante is a pen name known worldwide, authoring novels such as the bestseller My Brilliant Friend. A recent study indicates that the true author behind these books is probably Domenico Starnone. This study aims to select a set of approved authorship methods and appropriate feature sets to prove, with as much certainty as possible, that this conclusion is correct. To achieve this, a corpus of contemporary Italian novels has been generated, containing 150 books written by forty authors (including seven by Ferrante). Six authorship identification models have been applied to this data set (Delta, Labbé’s distance, nearest shrunken centroids (NSC), naïve Bayes, k-nearest neighbors, and character n-grams). Using either an instance- or profile-based matching technique, the same result (Starnone) appears very often in first place. Modifying the feature set to include between 50 and 2,000 of the most frequent tokens or lemmas does not change this result. When removing Starnone’s novels from the corpus, all approved attribution methods tend to indicate different names as the most probable author. This result confirms not only that the outputs of these methods are independent but also that the true author is certainly Starnone. Finally, a lexical analysis reveals the reasons justifying this conclusion.", "article_title": "Is Starnone really the author behind Ferrante?", "authors": [{"given": " Jacques", "family": "Savoy", "affiliation": [{"original_name": "University of Neuchatel, Switzerland", "normalized_name": "University of Neuchâtel", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/00vasag41", "GRID": "grid.10711.36"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "4", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}