{"url": "http://dx.doi.org/10.1093/llc/fqu023", "identifier": {"string_id": "10.1093/llc/fqu023", "id_scheme": "DOI"}, "abstract": "The article focuses on two related issues: authorship distinction and the analysis of characters’ voices in fiction. It deals with the case of Elisabeth Wolff and Agatha Deken, two women writers from the Netherlands who collaboratively published several epistolary novels at the end of the 18th century. First, the task division between the two authors will be analysed based on their usage of words and their frequencies. Next, any stylistic differences between the characters (letter writers) will be dealt with. The focus lies on Wolff’s and Deken’s first joint novel, Sara Burgerhart (1782). As to the authorship, nothing clearly showed a clear task division, which implies that Deken’s and Wolff’s writing styles are very much alike. This confirms findings of other scholars, who found that collaborating authors jointly produce a style that is distinguishable from both authors’ personal styles. As to stylistic differences in the voices of the characters in Sara Burgerhart, it was found that only a couple of the letter writers are clearly distinguishable compared with the main characters in the novel. I experimented with two possible tools to zoom in on the exact differences between those characters, but the methods are still too subjective to my taste. In the follow-up research, I will look further than words and their frequencies as building stones of literary style.", "article_title": "Epistolary voices. The case of Elisabeth Wolff and Agatha Deken", "authors": [{"given": " Karina", "family": "van Dalen-Oskam", "affiliation": [{"original_name": "Huygens Institute for the History of the Netherlands (KNAW), NL-2509 LT The Hague, The Netherlands", "normalized_name": "Huygens Institute for the History of the Netherlands", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/04x6kq749", "GRID": "grid.450092.a"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014-05-22", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}