{"url": "http://dx.doi.org/10.1093/llc/fqy078", "identifier": {"string_id": "10.1093/llc/fqy078", "id_scheme": "DOI"}, "abstract": "The question of why Pablo Picasso dedicated a considerable amount of his time to writing around 1935 is open to speculation. Many have cited, among possible causes: the Spanish artist’s emotional crisis, the political turmoil in Europe in the period between the two wars, and the menace of a confrontation in Spain. All of these views are predicated on an assumed irreducible conflict between visual composition and verbal expression. However, we cannot forget that Picasso’s interest in alternative methods of expression might have started with his fascination for linguistic structure as a whole during his cubist period. In this article, we explore the possibility that the transition into poetry that we observe in Picasso is simply one more manifestation of his pursuit of alternative approaches to language as a means of representation. In this sense, one thing that remained to be determined was how concrete concepts in both languages cluster into representative semantic categories and how these categories interact with each other in semantic networks.", "article_title": "Semantic domains in Picasso’s poetry", "authors": [{"given": " Luis", "family": "Meneses", "affiliation": [{"original_name": "Electronic Textual Cultures Laboratory, University of Victoria, Canada", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": " Enrique", "family": "Mallen", "affiliation": [{"original_name": "Department of Foreign Languages, Sam Houston State University, USA", "normalized_name": "Sam Houston State University", "country": "United States", "identifiers": {"ror": "https://ror.org/00yh3cz06", "GRID": "grid.263046.5"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "Supplement_1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}