{"url": "http://dx.doi.org/10.1093/llc/fqy081", "identifier": {"string_id": "10.1093/llc/fqy081", "id_scheme": "DOI"}, "abstract": "The course of reprocessing knowledge and information about social sciences and humanities using digital technology is taking root as a new field of academia called the ‘digital humanities’ (DH). While the social sciences and humanities in South Korea have shown a marked reluctance toward the integration of digital technology, the perception of its necessity as a new methodology for developing these fields in the digital age is growing. Until recently, analytical studies on the status and contents of DH were conducted on data from the western world. Despite their late start, however, Asian countries have begun conducting research on DH with enthusiasm. In order for DH to be properly established in each country, it is essential to set the direction by investigating the pre-requisites for DH studies in that country, as well as the current and future demands. As such, this study discusses the current status and issues regarding DH in South Korea by analyzing the trends of DH research published in South Korea, as well as by examining the status and perception of DH among actual scholars. Based on this study’s findings, we present strategies for improving education programs on DH in South Korea and promulgate the necessity of using DH methodologies in the study of social sciences and humanities to develop global networks and academic communication.", "article_title": "Digital humanities and new directions in South Korea", "authors": [{"given": " Jisu", "family": "Lee", "affiliation": [{"original_name": "Research Institution of Korean Studies, Korea University, Seoul, Korea", "normalized_name": "Korea University", "country": "South Korea", "identifiers": {"ror": "https://ror.org/047dqcg40", "GRID": "grid.222754.4"}}]}, {"given": " Hye-Eun", "family": "Lee", "affiliation": [{"original_name": "Department of Library and Information Science, Sookmyung Women’s University, Seoul, Korea", "normalized_name": "Sookmyung Women's University", "country": "South Korea", "identifiers": {"ror": "https://ror.org/00vvvt117", "GRID": "grid.412670.6"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-12-03", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "4", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}