{"url": "http://dx.doi.org/10.17928/jjadh.2.1_1", "identifier": {"string_id": "10.17928/jjadh.2.1_1", "id_scheme": "DOI"}, "abstract": "Below we develop a method to determine whether the use of grammatical particles in Chinese Buddhist scriptures is characteristic for the period of their translation. The corpus consists of three different Chinese translations of an early Indian Mahāyāna text from two different periods. We use the results of Principal Component Analysis (PCA) to discern if the samples of texts from different periods cluster together. We found that PCA used on common grammatical particles that exhibit great variance between texts, but occur evenly distributed within the texts, does in this case indeed yield distinctive patterns that distinguish the translations from different time periods. This is relevant for historical Chinese linguistics and Buddhist studies. It allows us to identify grammatical particles the use of which differs between translations from different periods. This in turn is an important basis for further research into Buddhist Hybrid Chinese translation idioms and the better attribution and dating of Chinese Buddhist texts.", "article_title": "Stylometric Analysis of Chinese Buddhist texts - Do different Chinese translations of the Gaṇḍavyūha reflect stylistic features that are typical for their age?", "authors": [{"given": "Marcus", "family": "BINGENHEIMER", "affiliation": [{"original_name": "Temple University", "normalized_name": "Temple University", "country": "United States", "identifiers": {"ror": "https://ror.org/00kx1jb78", "GRID": "grid.264727.2"}}]}, {"given": "Jen-Jou", "family": "HUNG", "affiliation": [{"original_name": "Dharma Drum Institute of Liberal Arts", "normalized_name": "Dharma Drum Institute of Liberal Arts", "country": "Taiwan", "identifiers": {"ror": "https://ror.org/05hkpfm52", "GRID": "grid.501594.c"}}]}, {"given": "Cheng-en", "family": "HSIEH", "affiliation": [{"original_name": "Dharma Drum Institute of Liberal Arts", "normalized_name": "Dharma Drum Institute of Liberal Arts", "country": "Taiwan", "identifiers": {"ror": "https://ror.org/05hkpfm52", "GRID": "grid.501594.c"}}]}], "publisher": "Japanese Association for Digital Humanities", "date": "2017-09-06", "keywords": null, "journal_title": "Journal of the Japanese Association for Digital Humanities", "volume": "2", "issue": "1", "ISSN": [{"value": "2188-7276", "type": "electronic"}]}