{"url": "http://dx.doi.org/10.1093/llc/fqn019", "identifier": {"string_id": "10.1093/llc/fqn019", "id_scheme": "DOI"}, "abstract": "As the use of data mining and machine learning methods in the humanities becomes more common, it will be increasingly important to examine implicit biases, assumptions, and limitations these methods bring with them. This article makes explicit some of the foundational assumptions of machine learning methods, and presents a series of experiments as a case study and object lesson in the potential pitfalls in the use of data mining methods for hypothesis testing in literary scholarship. The worst dangers may lie in the humanist's; ability to interpret nearly any result, projecting his or her own biases into the outcome of an experiment—perhaps all the more unwittingly due to the superficial objectivity of computational methods. We argue that in the digital humanities, the standards for the initial production of evidence should be even more rigorous than in the empirical sciences because of the subjective nature of the work that follows. Thus, we conclude with a discussion of recommended best practices for making results from data mining in the humanities domain as meaningful as possible. These include methods for keeping the the boundary between computational results and subsequent interpretation as clearly delineated as possible.", "article_title": "Meaning and mining: the impact of implicit assumptions in data mining for the humanities", "authors": [{"given": " D.", "family": "Sculley", "affiliation": [{"original_name": "Tufts University, Somerville, MA, USA", "normalized_name": "Tufts University", "country": "United States", "identifiers": {"ror": "https://ror.org/05wvpxv85", "GRID": "grid.429997.8"}}]}, {"given": " Bradley M.", "family": "Pasanek", "affiliation": [{"original_name": "University of Virginia, Charlottesville, VA, USA", "normalized_name": "University of Virginia", "country": "United States", "identifiers": {"ror": "https://ror.org/0153tk833", "GRID": "grid.27755.32"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2008", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "23", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}