{"url": "http://dx.doi.org/10.1145/3230675", "identifier": {"string_id": "10.1145/3230675", "id_scheme": "DOI"}, "abstract": "Technologies such as the Internet of Things (IoT) and Social Computing offer promising opportunities to envision and shape augmented experiences in a wide variety of cultural spaces. Such interactive technologies act as a hook to attract visitor's attention, but if they do not provide opportunities to engage people in a more personal and meaningful way, they can be soon discarded. Augmented experiences need to be motivating and connect with values and expectations of visitors and institutions. In a world that is becoming more and more connected and moving towards a participatory culture, the need to participate actively to co-produce knowledge and meaning can be exploited as a powerful intrinsic motivator. In this article, we describe how the Social Display Environment (SDE) promotes participation in cultural spaces whilst keeping the physical connection with the exhibition objects. The SDE makes use of Augmented Reality (AR) technology to augment physical artifacts in an exhibition with overlays of digital information that is generated by the end user (e.g., the visitor). The prototype was exhibited in a cultural center over a weekend to investigate different dynamics in terms of content generation, visitors’ interactions and perceptions with respect to the interplay of digital information and physical artifacts. The prototype was assessed as easy to learn and useful and showed potential to promote a number of meaningful social interactions around the objects involved in the exhibition.", "article_title": "Augmented Experiences in Cultural Spaces through Social Participation", "authors": [{"given": "Paloma", "family": "Díaz", "affiliation": [{"original_name": "Interactive Systems Lab, Department of Informatics, Universidad Carlos III de Madrid, Leganés, Spain", "normalized_name": "Carlos III University of Madrid", "country": "Spain", "identifiers": {"ror": "https://ror.org/03ths8210", "GRID": "grid.7840.b"}}]}, {"given": "Andrea", "family": "Bellucci", "affiliation": [{"original_name": "Interactive Systems Lab, Department of Informatics, Universidad Carlos III de Madrid, Leganés, Spain", "normalized_name": "Carlos III University of Madrid", "country": "Spain", "identifiers": {"ror": "https://ror.org/03ths8210", "GRID": "grid.7840.b"}}]}, {"given": "Chien-Wen", "family": "Yuan", "affiliation": [{"original_name": "Fu Jen University, New Taipei City, Taiwan", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Ignacio", "family": "Aedo", "affiliation": [{"original_name": "Interactive Systems Lab, Department of Informatics, Universidad Carlos III de Madrid, Leganés, Spain", "normalized_name": "Carlos III University of Madrid", "country": "Spain", "identifiers": {"ror": "https://ror.org/03ths8210", "GRID": "grid.7840.b"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2018", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "11", "issue": "4", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}