{"url": "http://dx.doi.org/10.1093/llc/fqw007", "identifier": {"string_id": "10.1093/llc/fqw007", "id_scheme": "DOI"}, "abstract": "Deliberate differences in how authors represent characters has been a core area of literary investigation since the dawn of literary theory. Here, we focus on epistolary literature, where authors consciously attempt to create different character styles through series of documents like letters. Previous studies suggest that the linguistic gestalt of an author’s style—the author’s ‘writeprint’—can be extracted from the various characters of an epistolary novel, but it is unclear whether individual characters themselves also have distinct writeprints. We examine Samuel Richardson’s Clarissa, lauded as a watershed example of the epistolary novel, using a recently developed and highly successful authorship attribution technique to determine (1) whether Richardson can construct distinct character writeprints, and (2) if so, which linguistic features he manipulated to do so. We find that while there are not as many distinct character writeprints as characters, Richardson does appear to have signature features he alters to create distinct character styles—and few of these features are the function word or abstract syntactic features typically comprising author writeprints. We discuss implications for other questions about character identity in Clarissa and character writeprint analysis more generally.", "article_title": "The Character in the Letter: Epistolary Attribution in Samuel Richardson’sClarissa", "authors": [{"given": " Lisa", "family": "Pearl", "affiliation": [{"original_name": "Department of Cognitive Sciences, 3151 Social Science Plaza, University of California", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}, {"given": " Kristine", "family": "Lu", "affiliation": [{"original_name": "Department of Cognitive Sciences, 3151 Social Science Plaza, University of California", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}, {"given": " Anousheh", "family": "Haghighi", "affiliation": [{"original_name": "Department of Cognitive Sciences, 3151 Social Science Plaza, University of California", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016-03-19", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}