{"url": "http://dx.doi.org/10.1093/llc/fql037", "identifier": {"string_id": "10.1093/llc/fql037", "id_scheme": "DOI"}, "abstract": "Within the scope of the dialectometry project at Salzburg University, a windows application was developed that implements algorithms to support the dialectometric evaluation of altas data. Visual DialectoMetry (VDM) covers all the steps of the dialectometric evaluation procedure: management of preclassified atlas data, calculation of matrices, visualizations using different types of maps, and cluster analysis. This article assumes basic knowledge of VDMs features, but differs from the linguistic interpretations given in Goebl's article by concentrating on the application technology. VDM is written in C++ and uses the Microsoft Foundation Classes (MFC), a library that wraps the Windows application programming interface (API) and the JET library in C++ classes. It holds the data for every project in one MS ACCESS database file which is accessible via MFC. Users can choose from different projects—different linguistic atlases—or they may evaluate their own data with VDM after having converted and imported their data into the VDM database format. This article outlines the design of the VDM database as far as the storage of the data matrix is concerned. It discusses possibilities of performance optimization by distinguishing calculations that can be done in real time from calculations that have to be performed off-line (ahead of time). Despite the large number of geographical information systems (GIS) on the market the generation of thematic maps in real time is not a trivial task. The technical solution implemented in VDM generates maps from two layers: a Windows Meta File (WMF) and a view of polygon objects whose color is recalculated as response to user actions.", "article_title": "Database Design and Technical Solutions for the Management, Calculation, and Visualization of Dialect Mass Data", "authors": [{"given": " Edgar", "family": "Haimerl", "affiliation": [{"original_name": "Salzburg University, Dialectometry Project", "normalized_name": "University of Salzburg", "country": "Austria", "identifiers": {"ror": "https://ror.org/05gs8cd61", "GRID": "grid.7039.d"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2006", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "21", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}