{"url": "http://dx.doi.org/10.1145/3340936", "identifier": {"string_id": "10.1145/3340936", "id_scheme": "DOI"}, "abstract": "This article presents VISE, an interface that enables VIsual Search and Exploration across collections of approximately 836,000 museum objects extracted from the websites of the National Museums Scotland and the Rijksmuseum in the Netherlands. VISE provides an interactive visual summary of information relating to the museum to address online users with no domain knowledge challenges of exploring large museum collection. User satisfaction evaluation was conducted to measure the user satisfaction level for using VISE as the interface for search and exploration of information from large museum collection when compared to non-visual search interface. The evaluation of the visual interface revealed that users are more satisfied and attracted to explore museum objects via VISE than via the system with no visual search interface. Users with little or no domain knowledge find it easier to explore collections and find objects of interest while using VISE in contrast to the system with no visual interface.", "article_title": "VISE", "authors": [{"given": "Mahmud Ahmed", "family": "Usman", "affiliation": [{"original_name": "Pattern Recognition and Image Analysis (PRImA) Research Lab, University of Salford, Greater Manchester, United Kingdom", "normalized_name": "University of Salford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01tmqtf75", "GRID": "grid.8752.8"}}]}, {"given": "Apostolos", "family": "Antonacopoulos", "affiliation": [{"original_name": "Pattern Recognition and Image Analysis (PRImA) Research Lab, University of Salford, Greater Manchester, United Kingdom", "normalized_name": "University of Salford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01tmqtf75", "GRID": "grid.8752.8"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2019-12-09", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "12", "issue": "4", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}