{"url": "http://dx.doi.org/10.1093/llc/fqs076", "identifier": {"string_id": "10.1093/llc/fqs076", "id_scheme": "DOI"}, "abstract": "This article will explain the structure and function of a digital research environment for Buddhist studies entitled Research Base for Indian and Buddhist Studies (RBIB). In the field of Buddhist studies (and especially in the area of Indian Buddhism), scholars face various obstacles in their efforts to share materials—in both paper and digital media. In establishing the RBIB, we have considered it to be of paramount importance to preserve the continuity of the prior tradition of studies within the paper medium, while at the same time developing a methodology that takes best advantage of the digital medium. After identifying six basic conditions that will satisfy the demands of both approaches, we have implemented a Web collaboration system that fulfills these conditions. Our system also makes functional parts of the RBIB that enable the presentation of the relationships between arbitrary fragments of related texts in various canonical languages through a user-friendly interface, which in turn allows users to learn how to edit and browse relationship data. Our system has thus far been highly evaluated by testers, and it has been further facilitated by recent developments in Information Communications Technology. Humanities digitization has a deep mutual relationship with this new technology.", "article_title": "Towards a digital research environment for Buddhist studies", "authors": [{"given": " Kiyonori", "family": "Nagasaki", "affiliation": [{"original_name": "International Institute for Digital Humanities", "normalized_name": "International Institute for Digital Humanities", "country": "Japan", "identifiers": {"ror": "https://ror.org/0454arg59", "GRID": "grid.474291.d"}}]}, {"given": " Toru", "family": "Tomabechi", "affiliation": [{"original_name": "International Institute for Digital Humanities", "normalized_name": "International Institute for Digital Humanities", "country": "Japan", "identifiers": {"ror": "https://ror.org/0454arg59", "GRID": "grid.474291.d"}}]}, {"given": " Masahiro", "family": "Shimoda", "affiliation": [{"original_name": "University of Tokyo", "normalized_name": "University of Tokyo", "country": "Japan", "identifiers": {"ror": "https://ror.org/057zh3y96", "GRID": "grid.26999.3d"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013-01-17", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}