{"url": "http://dx.doi.org/10.16995/dscn.258", "identifier": {"string_id": "10.16995/dscn.258", "id_scheme": "DOI"}, "abstract": "The following article describes a simple technique to identify lexically-similar passages in large collections of text using sequence alignment algorithms. Primarily used in the field of bioinformatics to identify similar segments of DNA in genome research, sequence alignment has also been employed in many other domains, from plagiarism detection to image processing. While we have applied this approach to a wide variety of diverse text collections, we will focus our discussion here on the identification of similar passages in the famous 18th-century Encyclopédie of Denis Diderot and Jean d’Alembert. Reference works, such as encyclopedias and dictionaries, are generally expected to “reuse” or “borrow” passages from many sources and Diderot and d’Alembert’s Encyclopédie was no exception. Drawn from on an immense variety of source material, both French and non-French, many, if not most, of the borrowings that occur in the Encyclopédie are not sufficiently identified (according to our standards of modern citation), or are only partially acknowledged in passing. The systematic identification of recycled passages can thus offer us a clear indication of the sources the philosophes were exploiting as well as the extent to which the intertextual relations that accompanied its composition and subsequent reception can be explored. In the end, we hope this approach to “Encyclopedic intertextuality” using sequence alignment can broaden the discussion concerning the relationship of Enlightenment thought to previous intellectual traditions as well as its reuse in the centuries that followed.", "article_title": "Something Borrowed: Sequence Alignment and the Identification of Similar Passages in Large Text Collections", "authors": [{"given": "Mark", "family": "Olsen", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Russell", "family": "Horton", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Glenn", "family": "Roe", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Open Library of the Humanities", "date": "2017-10-19", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "2", "issue": "1", "ISSN": [{"value": "1918-3666", "type": "electronic"}]}