{"url": "http://dx.doi.org/10.1093/llc/fqy087", "identifier": {"string_id": "10.1093/llc/fqy087", "id_scheme": "DOI"}, "abstract": "Vossian antonomasia is a prolific stylistic device, in use since antiquity. It can compress the introduction or description of a person or another named entity into a terse, poignant formulation and can best be explained by an example: When Norwegian world champion Magnus Carlsen is described as ‘the Mozart of chess’, it is Vossian antonomasia we are dealing with. The pattern is simple: A source (Mozart) is used to describe a target (Magnus Carlsen), the transfer of meaning is reached via a modifier (‘of chess’). This phenomenon has been discussed before (as ‘metaphorical antonomasia’ or, with special focus on the source object, as ‘paragons’), but no corpus-based approach has been undertaken as yet to explore its breadth and variety. We are looking into a full-text newspaper corpus (The New York Times, 1987–2007) and describe a new method for the automatic extraction of Vossian antonomasia based on Wikidata entities. Our analysis offers new insights into the occurrence of popular paragons and their distribution.", "article_title": "‘The Michael Jordan of greatness’—Extracting Vossian antonomasia from two decades ofThe New York Times, 1987–2007", "authors": [{"given": " Frank", "family": "Fischer", "affiliation": [{"original_name": "National Research University Higher School of Economics, Moscow", "normalized_name": "National Research University Higher School of Economics", "country": "Russia", "identifiers": {"ror": "https://ror.org/055f7t516", "GRID": "grid.410682.9"}}]}, {"given": " Robert", "family": "Jäschke", "affiliation": [{"original_name": "Humboldt University of Berlin, Germany", "normalized_name": "Humboldt University of Berlin", "country": "Germany", "identifiers": {"ror": "https://ror.org/01hcx6992", "GRID": "grid.7468.d"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}