{"url": "http://dx.doi.org/10.1093/llc/fqy018", "identifier": {"string_id": "10.1093/llc/fqy018", "id_scheme": "DOI"}, "abstract": "Cultural analysts are currently faced with an ecosystem of heterogeneous, globally distributed, and mass-scale sources that cannot be ignored in the research process. In addition to that, cultural analysts need to deal with the emergence of a knowledge economy which is no longer based on the value of the information entities contained in one or more documents, but on the potential for heterogeneous data to be recombined to generate previously unknown knowledge. Therefore, the challenge of accessing a set of heterogeneous, mass-scale, dynamic, and globally distributed sources has been joined to that of transforming the content of these sources into reusable data for the creation of knowledge and value. To the traditional question—What sources should be consulted or selected?—must now be added: What tools should be built and what work procedures should be designed to access those sources on a mass basis and analyze them as data? This article aims to provide some possible answers through the work carried out within the Exhibitium Project. This included the design and implementation of the Expofinder system, which is a technological device meant to examine the mechanisms for dissemination of digital information about art exhibitions and reuse this information as data to generate new knowledge and new interpretations about them. We believe that one of the best ways to strengthen the paths of digital research is to make the methodologies and mechanisms that govern decision-making transparent in order to be discussed or to be adopted by other projects. This is the ultimate goal of this article.", "article_title": "Development of technological ecosystems for cultural analysis: The case of Expofinder system and art exhibitions", "authors": [{"given": " Nuria", "family": "Rodríguez-Ortega", "affiliation": [{"original_name": "Art History Department, University of Málaga, Spain", "normalized_name": "University of Malaga", "country": "Spain", "identifiers": {"ror": "https://ror.org/036b2ww28", "GRID": "grid.10215.37"}}]}, {"given": " Antonio", "family": "Cruces Rodríguez", "affiliation": [{"original_name": "Art History Department, University of Málaga, Spain", "normalized_name": "University of Malaga", "country": "Spain", "identifiers": {"ror": "https://ror.org/036b2ww28", "GRID": "grid.10215.37"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}