{"url": "http://dx.doi.org/10.1145/1613672.1613674", "identifier": {"string_id": "10.1145/1613672.1613674", "id_scheme": "DOI"}, "abstract": "In this article, the wind flow over one of the most important Egyptian historical heritage sites, the Giza Plateau, was investigated using the Computational Fluid Dynamics (CFD) state-of-the-art techniques. The present study addresses the influences of wind flow structure, as an important denudation factor, on the site and its famous monuments: the Pyramids and the Great Sphinx. Three-dimensional CFD simulations have been performed based on the Reynolds Averaged Navier-Stokes (RANS) equations for the cases of the northwest wind, at the average wind speed over the year, and the southwest windstorms. In addition, the wind-driven sand was considered for the same cases. Particular attention was paid to the Great Sphinx and the Pyramids to investigate their parts most vulnerable to the wind, which is contributing to the erosion of these monuments. The Great Sphinx was buried by sand and it was cleared several times throughout its history. In this study, we also address the less understood, yet important, burial mechanism of the Great Sphinx. The present work may give more insight to the effect of wind around the Giza Plateau when developing a global plan for conserving and protecting the site.", "article_title": "Wind flow modeling and simulation over the Giza Plateau cultural heritage site in Egypt", "authors": [{"given": "Ashraf S.", "family": "Hussein", "affiliation": [{"original_name": "Ain Shams University, Egypt", "normalized_name": "Ain Shams University", "country": "Egypt", "identifiers": {"ror": "https://ror.org/00cb9w016", "GRID": "grid.7269.a"}}]}, {"given": "Hisham", "family": "El-Shishiny", "affiliation": [{"original_name": "IBM Center for Advanced Studies in Cairo, Egypt", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2009", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "2", "issue": "2", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}