{"url": "http://dx.doi.org/10.1093/llc/fqs067", "identifier": {"string_id": "10.1093/llc/fqs067", "id_scheme": "DOI"}, "abstract": "TextGrid’s Text-Image-Link-Editor is used to link segments of text with sections on the corresponding image. A typical application is the linking of scans of facsimiles with their transcriptions, though these texts can also be created during the linking process, which allows also for image annotations. The information on the linking between manuscript fragments and the corresponding transcription is itself stored in TEI P5. TextGrid is a virtual research environment for the humanities disciplines dealing with texts in a wide sense (philologies, epigraphy, linguistics, musicology, art history, etc.). The joint research project TextGrid is part of the D-Grid initiative and is funded by the German Federal Ministry of Education and Research (BMBF) for the period starting from 1 June 2009 to 31 May 2012 (reference number: 01UG0901A). TextGrid consists of two principal building blocks, the grid-based back-end TextGridRep that hosts both infrastructure services and the repository layer for access to research data and long-term archiving, and the user-facing TextGrid Laboratory (TextGridLab). The TextGridLab, a single point of entry to the virtual research environment, provides integrated access to both new and existing tools and services via user-friendly software based on the eclipse framework [TG]. TBLE is a key component of the TextGridLab that has been under continuous development since 2008 and is by now in practical use.", "article_title": "The text-image-link-editor: A tool for linking facsimiles and transcriptions, and image annotations", "authors": [{"given": " Yahya Ahmed Ali", "family": "Al-Hajj", "affiliation": [{"original_name": "Worms University of Applied Sciences, Germany", "normalized_name": "University of Applied Sciences Worms", "country": "Germany", "identifiers": {"ror": "https://ror.org/031ph8d53", "GRID": "grid.440515.1"}}]}, {"given": " Marc Wilhelm", "family": "Küster", "affiliation": [{"original_name": "Worms University of Applied Sciences, Germany", "normalized_name": "University of Applied Sciences Worms", "country": "Germany", "identifiers": {"ror": "https://ror.org/031ph8d53", "GRID": "grid.440515.1"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}