{"url": "http://dx.doi.org/10.1145/2983918", "identifier": {"string_id": "10.1145/2983918", "id_scheme": "DOI"}, "abstract": "In musicology and music research generally, the increasing availability of digital music, storage capacities, and computing power enable and require new and intelligent systems. In the transition from traditional to digital musicology, many techniques and tools have been developed for the analysis of individual pieces of music, but large-scale music data that are increasingly becoming available require research methods and systems that work on the collection-level and at scale. Although many relevant algorithms have been developed during the past 15 years of research in Music Information Retrieval, an integrated system that supports large-scale digital musicology research has so far been lacking. In the Digital Music Lab (DML) project, a collaboration among music librarians, musicologists, computer scientists, and human-computer interface specialists, the DML software system has been developed that fills this gap by providing intelligent large-scale music analysis with a user-friendly interactive interface supporting musicologists in their exploration and enquiry. The DML system empowers musicologists by addressing several challenges: distributed processing of audio and other music data, management of the data analysis process and results, remote analysis of data under copyright, logical inference on the extracted information and metadata, and visual web-based interfaces for exploring and querying the music collections. The DML system is scalable and based on Semantic Web technology and integrates into Linked Data with the vision of a distributed system that enables music research across archives, libraries, and other providers of music data. A first DML system prototype has been set up in collaboration with the British Library and I Like Music Ltd. This system has been used to analyse a diverse corpus of currently 250,000 music tracks. In this article, we describe the DML system requirements, design, architecture, components, and available data sources, explaining their interaction. We report use cases and applications with initial evaluations of the proposed system.", "article_title": "The Digital Music Lab", "authors": [{"given": "Samer", "family": "Abdallah", "affiliation": [{"original_name": "University College London, UK", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": "Emmanouil", "family": "Benetos", "affiliation": [{"original_name": "Queen Mary University of London, UK", "normalized_name": "Queen Mary University of London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/026zzn846", "GRID": "grid.4868.2"}}]}, {"given": "Nicolas", "family": "Gold", "affiliation": [{"original_name": "University College London, UK", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": "Steven", "family": "Hargreaves", "affiliation": [{"original_name": "Queen Mary University of London, UK", "normalized_name": "Queen Mary University of London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/026zzn846", "GRID": "grid.4868.2"}}]}, {"given": "Tillman", "family": "Weyde", "affiliation": [{"original_name": "City, University of London, UK", "normalized_name": "University of London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04cw6st05", "GRID": "grid.4464.2"}}]}, {"given": "Daniel", "family": "Wolff", "affiliation": [{"original_name": "City, University of London, UK", "normalized_name": "University of London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04cw6st05", "GRID": "grid.4464.2"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2017-01-03", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "10", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}