{"url": "http://dx.doi.org/10.1093/llc/fqaa022", "identifier": {"string_id": "10.1093/llc/fqaa022", "id_scheme": "DOI"}, "abstract": "Although most would agree that the future of the scholarly edition lies in the digital medium, it is the print scholarly edition that is still more often cited and read. The production of digital scholarly editions (DSEs) is still seen as an experimental field whose methodology has not yet settled to the extent that a digital editing project can be approached with the same confidence as the making of a print edition. This article describes an experimental conversion of a print scholarly edition—Giacomo Leopardi’s Idilli by Paola Italia (2008)—into a DSE. This posed a challenge due to the complexity of its internal evidence, but was also relatively short and suitable for an experimental edition. Our objective was to assimilate into a web-based DSE all the information contained in the text and apparatus of the print edition. We also sought to discover whether the making of a DSE today that could fully utilize the affordances of the web, would necessarily place a significant technical load on editors who are more accustomed to solving textual problems. We review briefly a number of generic tools for making DSEs and describe two attempts at making our own DSE of Leopardi’s Idilli: a wiki edition whose primary purpose was pedagogical and a DSE based on the software used to make the Charles Harpur Critical Archive (Eggert, 2019, Charles Harpur Critical Archive. http://charles-harpur.org). We compare these experiences and draw conclusions about the prospects of making DSEs today.", "article_title": "From print to digital: A web edition of Giacomo Leopardi’s Idilli", "authors": [{"given": " Milena", "family": "Giuffrida", "affiliation": [{"original_name": "University of Catania, Italy", "normalized_name": "University of Catania", "country": "Italy", "identifiers": {"ror": "https://ror.org/03a64bh57", "GRID": "grid.8158.4"}}]}, {"given": " Paola", "family": "Italia", "affiliation": [{"original_name": "University of Bologna, Italy", "normalized_name": "University of Bologna", "country": "Italy", "identifiers": {"ror": "https://ror.org/01111rn36", "GRID": "grid.6292.f"}}]}, {"given": " Simone", "family": "Nieddu", "affiliation": [{"original_name": "Sapienza University of Rome, Italy", "normalized_name": "Sapienza University of Rome", "country": "Italy", "identifiers": {"ror": "https://ror.org/02be6w209", "GRID": "grid.7841.a"}}]}, {"given": " Desmond", "family": "Schmidt", "affiliation": [{"original_name": "Charles Harpur Critical Archive", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020-04-08", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}