{"identifier": {"string_id": "10.16995/dm.48", "id_scheme": "DOI"}, "abstract": "In 2006, the École nationale des chartes launched a research project whose main purpose was to edit and publish the almost entirely unedited medieval series of charters of the Abbey of Saint-Denis. Because of the great quantity and dissemination of those charters, the critical edition is a progressive digital work based not on the original documents but on the richest medieval cartulary that has been kept, the Cartulaire blanc (i.e. the “White Cartulary”), which contains 2,600 copies of charters. Olivier Guyotjeannin is the scientific leader of the project, Florence Clavaud is the IT leader. In order to provide quick access to the entire content of the cartulary, the edition integrates images of the manuscript, images and an edition of one of the inventories of the charters (the Inventaire général, i.e. the General Inventory), which was established between 1680 and 1720. This digital corpus now includes about 4,370 images and several XML files (EAD files for the edition of the Inventaire général, TEI files for the ongoing edition of the Cartulaire blanc, METS files to express the relations between the components of the corpus), whose models are explained and discussed. The website has been built by using and adapting open source preexisting tools. It was released in June 2010 (see http://saint-denis.enc.sorbonne.fr), and its content and functionalities are evolving. At this stage of the project, this article includes a prospective assessment of the results obtained.", "article_title": "The digital edition of the medieval charters of the Abbey of Saint-Denis: first results and prospects", "authors": [{"given": "Florence", "family": "Clavaud", "affiliation": [{"original_name": "École nationale des chartes (Paris, France)", "normalized_name": "École Nationale des Chartes", "country": "France", "identifiers": {"ror": "https://ror.org/013xvg556", "GRID": "grid.462175.3"}}]}], "publisher": "Open Library of the Humanities", "date": "2013", "keywords": null, "journal_title": "Digital Medievalist", "volume": "8", "issue": null, "ISSN": [{"value": "1715-0736", "type": "electronic"}], "url": "http://dx.doi.org/10.16995/dm.48"}