{"url": "http://dx.doi.org/10.1093/llc/fqw047", "identifier": {"string_id": "10.1093/llc/fqw047", "id_scheme": "DOI"}, "abstract": "In this article we discuss the heuristic capabilities that the process of generating, processing, and integrating cultural heritage linked data may afford, including its potential for enhancing arts and humanities research. More specifically, we report on our current work on detecting and assigning gender properties to person entities and semantically enriching a set of Linked Open Data (LOD) in the domain of history of jazz. Linked Jazz—an ongoing project that experiments with the application of LOD principles and techniques to cultural heritage materials—provided the context for this research. Linked Jazz aims to uncover meaningful connections between data and documents from digital archives of jazz history. It employs oral histories as the main source of named entities to be represented as linked data. The entities are then semantically connected and visualized as social graphs. Using the assignment of gender properties, this article describes how the data development process itself offers new and unanticipated paths of research inquiry and engagement with heritage data.", "article_title": "Accidental discovery, intentional inquiry: Leveraging linked data to uncover the women of jazz", "authors": [{"given": " M Cristina", "family": "Pattuelli", "affiliation": [{"original_name": "Pratt Institute, School of Information, USA", "normalized_name": "Pratt Institute", "country": "United States", "identifiers": {"ror": "https://ror.org/007m3p006", "GRID": "grid.262107.0"}}]}, {"given": " Karen", "family": "Hwang", "affiliation": [{"original_name": "New York Public Library, USA", "normalized_name": "New York Public Library", "country": "United States", "identifiers": {"ror": "https://ror.org/02eysy271", "GRID": "grid.429888.7"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016-10-11", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}