{"url": "http://dx.doi.org/10.1093/llc/fqh049", "identifier": {"string_id": "10.1093/llc/fqh049", "id_scheme": "DOI"}, "abstract": "An increasing number of scholars think a new instrument to publish academic work is needed. In fact, the scientific journals are in a monopoly market that makes access to scientific information very expensive. The richest university libraries use 80–90% of their budgets for the purchase of scientific journals and nevertheless are able to afford only a small part of academic literature. For scholarly publications in the Humanities there is not a monopoly market—there is no market at all. Public libraries have less and less money for monographs. The Humanities are in constant crisis as far as the publication of scholarly editions is concerned. This is especially true of genetic and facsimile editions, but it is also the case for all projects where the requirements of scholarly work are in conflict with the realities of the book market. Furthermore, the access to libraries and archives holding the primary sources for scholarly work is often difficult, expensive and unsatisfactory. The HyperLearning project is an extension of the HyperNietzsche project, which tries to solve the difficulties outlined above. This short research report describes the HyperLearning project, focusing on its technological activities. In the first part we will delineate the path from HyperNietzsche to HyperLearning. The following parts are an overview of three major technical research areas of HyperLearning.", "article_title": "The HyperLearning Project: Towards a Distributed and Semantically Structured e-research and e-learning Platform", "authors": [{"given": " Michele", "family": "Barbera", "affiliation": [{"original_name": "Projekt HyperNietzsche, Ludwig-Maximilians-Universität München, Germany", "normalized_name": "Ludwig-Maximilians-Universität München", "country": "Germany", "identifiers": {"ror": "https://ror.org/05591te55", "GRID": "grid.5252.0"}}, {"original_name": "Net7 – Internet Open Solutions–, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2005-04-13", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "21", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}