{"url": "http://dx.doi.org/10.1093/llc/fqx057", "identifier": {"string_id": "10.1093/llc/fqx057", "id_scheme": "DOI"}, "abstract": "Searching for articles of interest in a digital archive need not be through a free-form text search. In fact, many authors have suggested that the best way to find relevant items in an archive is to browse its contents rather than to search for specific keywords. The University of Central Florida’s Regional Initiative for Collecting Histories, Experiences and Stories (RICHES) project uses a multi-criteria Connections algorithm to make item selection recommendations and browse through the RICHES Mosaic Interface (RICHES MI)—an archive of digitized historical documents, imagery, and audio. The Connections algorithm allows researchers to examine a selected artifact and nearest related items in the archive based on multiple criteria from the metadata contained in the artifact of interest. To determine how effective the Connections algorithm was at presenting relevant material, it was compared to random selections and single criteria keyword searches. In this article we will show that the multi-criteria approach is not only better than randomly selected results it also selects more relevant items than single criteria keyword searches. In addition, the multi-criteria algorithm achieves a secondary benefit: it returns unanticipated relevant results that potentially yield new insights for the researcher.", "article_title": "Evaluating multi-criteria Connection mechanisms: A new algorithm for browsing digital archives", "authors": [{"given": " Amy Larner", "family": "Giroux", "affiliation": [{"original_name": "Center for Humanities and Digital Research, University of Central Florida (UCF), Orlando, FL, USA", "normalized_name": "University of Central Florida", "country": "United States", "identifiers": {"ror": "https://ror.org/036nfer12", "GRID": "grid.170430.1"}}]}, {"given": " Connie", "family": "Harper", "affiliation": [{"original_name": "RICHES, Department of History, University of Central Florida (UCF), Orlando, FL, USA", "normalized_name": "University of Central Florida", "country": "United States", "identifiers": {"ror": "https://ror.org/036nfer12", "GRID": "grid.170430.1"}}]}, {"given": " R Paul", "family": "Wiegand", "affiliation": [{"original_name": "Institute for Simulation and Training, University of Central Florida (UCF)), Orlando, FL, USA", "normalized_name": "University of Central Florida", "country": "United States", "identifiers": {"ror": "https://ror.org/036nfer12", "GRID": "grid.170430.1"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}