{"url": "http://dx.doi.org/10.16995/dscn.5", "identifier": {"string_id": "10.16995/dscn.5", "id_scheme": "DOI"}, "abstract": "Though the publication of the Complete works of Dutch novelist Willem Frederik Hermans (1992-1995) is a challenge in itself, nowadays the aim of the mere publishing of 24 printed volumes is far from enough. Operating within an academic field of literary theory and criticism, in which a detailed and conscious use of scholarly edited texts is all but obvious, much more effort should be spent to communicate the merits of textual scholarship. With Hermans, an author known for the ongoing revisions of his texts, academic awareness on the textual process and textual fluidity can be raised, by developing digital editions of some of his works, and by integrating genetic criticism's notion of the creative process. But a range of other dissemination strategies should be developed as well. For a project like the Complete works of Willem Frederik Hermans, that almost exclusively takes place within a national context, with a comparatively small group of interested academics, students and other specialists, well-chosen, tailored initiatives should be deployed to reach new and diverse groups of audiences within the general reading public. Within the contexts of an emerging digital culture and a thoroughly changing literary culture and book market, new challenges are abundant. This article focuses on a range of past and future initiatives, all of which were developed in close cooperation with other partners working within the fields of technology and digital culture, literary education and cultural heritage.", "article_title": "Chapter 6 Beyond the Great Divide: New explorations in editing the Complete Works of Dutch Novelist Willem Frederik Hermans", "authors": [{"given": "Peter", "family": "Kegel", "affiliation": [{"original_name": "The Huygens Institute for the History of the Netherlands of the Royal Netherlands Academy of Arts and Sciences", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Open Library of the Humanities", "date": "2017", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "6", "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}