{"url": "http://dx.doi.org/10.1093/llc/fqu035", "identifier": {"string_id": "10.1093/llc/fqu035", "id_scheme": "DOI"}, "abstract": "The work of theoretical linguistics rarely focuses on poetry. This is far from surprising, as poetic language, especially in modern and contemporary literature, seems to defy the general rules of syntax and semantics, as observed in ordinary language. This article assumes, however, that linguistic theories should ideally be able to account for creative uses of language, down to their most difficult incarnations. It proposes that at the semantic level, what distinguishes poetry from other uses of language may be its ability to trace conceptual patterns which do not belong to everyday discourse but are latent in our shared language structure. Distributional semantics provides a theoretical and experimental basis for this exploration. First, the notion of a specific ‘semantics of poetry’ is discussed, with some help from literary criticism and philosophy. Then, distributionalism is introduced as a theory supporting the notion that the meaning of poetry comes from the meaning of ordinary language. In the second part of the article, experimental results are provided showing that (i) distributional representations can model the link between ordinary and poetic language, (ii) a distributional model can experimentally distinguish between poetic and randomized textual output, regardless of the complexity of the poetry involved, and (iii) there is a stable, but not immediately transparent, layer of meaning in poetry, which can be captured distributionally, across different levels of poetic complexity.", "article_title": "The semantics of poetry: A distributional reading", "authors": [{"given": " Aurélie", "family": "Herbelot", "affiliation": [{"original_name": "University of Cambridge, UK", "normalized_name": "University of Cambridge", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/013meh722", "GRID": "grid.5335.0"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "30", "issue": "4", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}