{"url": "http://dx.doi.org/10.1093/llc/fqv010", "identifier": {"string_id": "10.1093/llc/fqv010", "id_scheme": "DOI"}, "abstract": " This article introduces a new stylometric method that combines supervised machine-learning classification with the idea of sequential analysis. Unlike standard procedures, aimed at assessing style differentiation between discrete text samples, the new method, supported with compact visualization, tries to look inside a text represented as a set of linearly sliced chunks, in order to test their stylistic consistency. Three flavors of the method have been introduced: (1) Rolling SVM, relying on the support vector machines (SVM) classifier, (2) Rolling NSC, based on the nearest shrunken centroids method, and (3) Rolling Delta, using the classic Burrowsian measure of similarity. The technique is primarily intended to assess mixed authorship; however, it can be also used as a magnifying glass to inspect works with unclear stylometric signal. To demonstrate its applicability, three different examples of collaborative work have been briefly discussed: (1) the 13th-century French allegorical poem Roman de la Rose , (2) a 15th-century translation of the Bible into Polish known as Queen Sophia’s Bible , and (3) The Inheritors , a novel collaboratively written by Joseph Conrad and Ford Madox Ford in 1901. ", "article_title": "Rolling stylometry", "authors": [{"given": " Maciej", "family": "Eder", "affiliation": [{"original_name": "Polish Academy of Sciences, Institute of Polish Language, and Pedagogical University of Kraków, Kraków, Poland", "normalized_name": "Pedagogical University of Kraków", "country": "Poland", "identifiers": {"ror": "https://ror.org/030mz2444", "GRID": "grid.412464.1"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2015", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "31", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}