{"url": "http://dx.doi.org/10.1093/llc/fqs003", "identifier": {"string_id": "10.1093/llc/fqs003", "id_scheme": "DOI"}, "abstract": "We describe a new supervised machine learning approach for detecting authorship deception, a specific type of authorship attribution task particularly relevant for cybercrime forensic investigations, and demonstrate its validity on two case studies drawn from realistic online data sets. The core of our approach involves identifying uncharacteristic behavior for an author, based on a writeprint extracted from unstructured text samples of the author's writing. The writeprints used here involve stylometric features and content features derived from topic models, an unsupervised approach for identifying relevant keywords that relate to the content areas of a document. One innovation of our approach is to transform the writeprint feature values into a representation that individually balances characteristic and uncharacteristic traits of an author, and we subsequently apply a Sparse Multinomial Logistic Regression classifier to this novel representation. Our method yields high accuracy for authorship deception detection on the two case studies, confirming its utility.", "article_title": "Detecting authorship deception: a supervised machine learning approach using author writeprints", "authors": [{"given": " Lisa", "family": "Pearl", "affiliation": [{"original_name": "University of California, Irvine", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}, {"given": " Mark", "family": "Steyvers", "affiliation": [{"original_name": "University of California, Irvine", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012-03-09", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "27", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}