{"url": "http://dx.doi.org/10.1093/llc/fqy040", "identifier": {"string_id": "10.1093/llc/fqy040", "id_scheme": "DOI"}, "abstract": "In ‘Christopher Marlowe: Hype and Hoax’(2018), Hartmut Ilsemann implies that his application of the Rolling Delta feature of R Stylo is sufficiently robust that a century and a half of traditional scholarship should be overturned, and Marlowe stripped of the majority of his canon, including Doctor Faustus and Edward II. The article concludes that ‘Marlowe is totally overrated in his influence on modern English drama’ (p. 26), the natural consequence of stripping away 5/7ths of his canon. In this response, I demonstrate that the assumptions underlying this application of the Delta method, and the application itself, are fundamentally flawed, leading to predictably erroneous conclusions. Problems with the study include a poorly designed test environment, incorrect preparation of texts, assuming that ‘Marlowe’s style’ can be determined by a single early play, selecting and constructing Shakespeare’s comparison texts in a manner likely to prejudice results, ignoring the effect upon style of a play’s date and genre, failing to consider the effect of different-length comparison texts, and dismissing external evidence of authorship that conflicts with the test outcomes. I argue that in the light of these issues, the results and conclusions must be dismissed. Further, the question is raised as to whether the current methods of computational stylistics, even when more rigorously applied, are equipped to challenge the attribution of the accepted Marlowe canon.1", "article_title": "Marlowe and overreaching: A misuse of stylometry", "authors": [{"given": " Ros", "family": "Barber", "affiliation": [{"original_name": "Department of English and Comparative Literature, Goldsmiths, University of London, UK", "normalized_name": "University of London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04cw6st05", "GRID": "grid.4464.2"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}