{"url": "http://dx.doi.org/10.1093/llc/fqaa025", "identifier": {"string_id": "10.1093/llc/fqaa025", "id_scheme": "DOI"}, "abstract": "The experiences of murdered victims of Nazi persecutions perished with them. This article discusses how text and data mining technology has helped to recover fragments of these lost experiences out of 2,500 oral history interviews with survivors. This gave rise to Let them Speak, a data edition of Holocaust testimonies. The first part situates the challenge of revealing lost experiences in historiography, and argues that the experience of murdered victims can be reconstructed through the collective experience. The second part shows how text and data mining techniques assisted the author to identify some pieces of the collective experience. The third part presents how web technology and visualization are used to render pieces of the collective experience as testimonial fragments of the Holocaust. ", "article_title": "Recovering and rendering silenced experiences of genocides: testimonial fragments of the Holocaust", "authors": [{"given": " Gábor", "family": "Mihály Tóth", "affiliation": [{"original_name": "USC Shoah Foundation", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}, {"original_name": "Signal Analysis and Interpretation Laboratory (SAIL), Viterbi School of Engineering, University of Southern California, USA", "normalized_name": "University of Southern California", "country": "United States", "identifiers": {"ror": "https://ror.org/03taz7m60", "GRID": "grid.42505.36"}}, {"original_name": "Yale University, Digital Humanities Laboratory and Fortunoff Video Archive for Holocaust Testimonies", "normalized_name": "Yale University", "country": "United States", "identifiers": {"ror": "https://ror.org/03v76x132", "GRID": "grid.47100.32"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020-04-12", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}