{"url": "http://dx.doi.org/10.1145/1551676.1551678", "identifier": {"string_id": "10.1145/1551676.1551678", "id_scheme": "DOI"}, "abstract": "The article reports the interdisciplinary project of the virtualization of the Great Inscription of Gortyna, Crete, for 3D documentation, structural studies, and physical replica purposes. The digitization of the longest epigraphic text of the Greek civilization (6 m long and 1.75 m high, with approximately 2--3 mm-depth engraved letters) and its surrounding heritage area (around 30 × 30 m), required long planning and the construction of a dedicated acquisition system to speed up the surveying time, limited to few hours per day. Primarily, range sensors were employed in a multi-resolution way, digitizing detailed parts in high resolution and less smoothed areas with lower geometric resolution. Some selected areas were also modeled with our multiphoto geometrically constrained image matching approach to demonstrate that the same accuracy and details can be achieved using either scanners or photogrammetry. The derived 3D model of the heritage is now the basis for further archaeological studies on the incision techniques and a deeper structural analysis on the monument. The challenges of the work stay in the acquisition, processing, and integration of the multi-resolution data as well as their interactive visualization.", "article_title": "3D modeling of complex and detailed cultural heritage using multi-resolution data", "authors": [{"given": "Fabio", "family": "Remondino", "affiliation": [{"original_name": "3D Optical Metrology Group, FBK Trento, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Stefano", "family": "Girardi", "affiliation": [{"original_name": "3D Optical Metrology Group, FBK Trento, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Alessandro", "family": "Rizzi", "affiliation": [{"original_name": "3D Optical Metrology Group, FBK Trento, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Lorenzo", "family": "Gonzo", "affiliation": [{"original_name": "3D Optical Metrology Group, FBK Trento, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2009", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "2", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}