{"url": "http://dx.doi.org/10.1145/2948069", "identifier": {"string_id": "10.1145/2948069", "id_scheme": "DOI"}, "abstract": "We address the problem of the statistical description of 3D surfaces with the purpose of automatic classification and retrieval of archaeological potsherds. These are particularly interesting problems in archaeology, as pottery comprises a great volume of findings in archaeological excavations. Indeed, the analysis of potsherds brings relevant cues for understanding the culture of ancient groups. In particular, we develop a new local shape descriptor for 3D surfaces, called the histogram of spherical orientations (HoSO), which we use in combination with a bag-of-words approach to compute visual similarity between 3D surfaces. Given a point of interest on a 3D surface, its local shape descriptor (HoSO) captures the distribution of the spherical orientations of its neighboring points. In turn, those spherical orientations are computed with respect to the point of interest itself, both in the azimuth and the zenith axis. The proposed HoSO is invariant to scale transformations and highly robust to rotation and noise. In addition, it is efficient, as it only exploits the information of the position of the 3D points and disregards other types of information like faces or normals. We performed experiments on a set of 3D surfaces representing potsherds from the Teotihuacan civilization and further validations on a set of 3D models of generic objects. Our results show that our methodology is effective for describing 3D models and that it improves classification performance with respect to previous local descriptors.", "article_title": "Classification and Retrieval of Archaeological Potsherds Using Histograms of Spherical Orientations", "authors": [{"given": "Edgar", "family": "Roman-Rangel", "affiliation": [{"original_name": "CVMLab, University of Geneva, Geneva, Switzerland", "normalized_name": "University of Geneva", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/01swzsf04", "GRID": "grid.8591.5"}}]}, {"given": "Diego", "family": "Jimenez-Badillo", "affiliation": [{"original_name": "National Institute of Anthropology and History of Mexico, Mexico City, Mexico", "normalized_name": "National Institute of Anthropology and History", "country": "Mexico", "identifiers": {"ror": "https://ror.org/0509e3289", "GRID": "grid.462439.e"}}]}, {"given": "Stephane", "family": "Marchand-Maillet", "affiliation": [{"original_name": "CVMLab, University of Geneva, Geneva, Switzerland", "normalized_name": "University of Geneva", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/01swzsf04", "GRID": "grid.8591.5"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2016-09-20", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "9", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}