{"url": "http://dx.doi.org/10.1145/3352590", "identifier": {"string_id": "10.1145/3352590", "id_scheme": "DOI"}, "abstract": "An immersive experience brought about by virtual reality can potentially enhance the appreciation of classical Chinese poetry, which is difficult to describe clearly in everyday language or ordinary media. However, making 3-dimensional illustrations for a 360-degree display in virtual reality is usually a labor-intensive and time-consuming procedure and hard to master for non-professional media creators, such as teachers. Motivated by the homology theory of classical Chinese poetry and painting, we propose an image-based approach of building 2.5-dimensional immersive stories to visualize classical Chinese poetry. Specifically, using Chinese shadow play as a metaphor, we have designed and implemented ShadowPlay2.5D, a sketch-based authoring tool to help novices create 360-degree videos of classical Chinese poetry easily. To ensure coverage of the diverse themes in Chinese poetry and preserve the sense of culture, we build a Chinese ink-painting style image repository of essential poetic elements identified via crowdsourcing. To facilitate construction of 2.5-dimensional scenes, we design features that support puppet-like animation, instancing, and camera organization in a 3-dimensional environment. Through two user studies, we show that ShadowPlay2.5D can help novices make a short 360-degree video in about 10--15 minutes, and the 2.5D stylized illustrations created can bring about a better immersive experience for poetry appreciation.", "article_title": "ShadowPlay2.5D", "authors": [{"given": "Zhenjie", "family": "Zhao", "affiliation": [{"original_name": "Hong Kong University of Science and Technology, Hong Kong SAR, China", "normalized_name": "Hong Kong University of Science and Technology", "country": "China", "identifiers": {"ror": "https://ror.org/00q4vv597", "GRID": "grid.24515.37"}}]}, {"given": "Xiaojuan", "family": "Ma", "affiliation": [{"original_name": "Hong Kong University of Science and Technology, Hong Kong SAR, China", "normalized_name": "Hong Kong University of Science and Technology", "country": "China", "identifiers": {"ror": "https://ror.org/00q4vv597", "GRID": "grid.24515.37"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2020-02-25", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "13", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}