{"url": "http://dx.doi.org/10.1093/llc/fqq006", "identifier": {"string_id": "10.1093/llc/fqq006", "id_scheme": "DOI"}, "abstract": "In this article, we review the process of building ODIN, the Online Database of Interlinear Text (http://odin.linguistlist.org) a multilingual repository of linguistically analyzed language data. ODIN is built from interlinear text that has been harvested from scholarly linguistic documents posted on the web. At the time of this writing, ODIN holds nearly 190,000 instances of interlinear text representing annotated language data for more than 1,000 languages (representing data from >10% of the world's languages). ODIN's charter has been to make these data available to linguists and other language researchers via search, providing the facility to find instances of language data and related resources (i.e. the documents from which data were extracted) by language name, language family, and even annotations used to markup the data (e.g. NOM, ACC, ERG, PST, 3SG). Further, we have sought to enrich the data we have collected and extract ‘knowledge’ from the enriched content. To enrich the data, we use a variety of statistical tagging and parsing methods applied in the English translations. An enhanced search facility allows users to find data across languages for a variety of syntactic constructions and constituent orders, facilitating unprecedented automated and online discovery of language data.", "article_title": "Developing ODIN: A Multilingual Repository of Annotated Language Data for Hundreds of the World's Languages", "authors": [{"given": " William D.", "family": "Lewis", "affiliation": [{"original_name": "Microsoft Research, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Fei", "family": "Xia", "affiliation": [{"original_name": "Department of Linguistics, University of Washington, USA", "normalized_name": "University of Washington", "country": "United States", "identifiers": {"ror": "https://ror.org/00cvxb145", "GRID": "grid.34477.33"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2010", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "25", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}