{"url": "http://dx.doi.org/10.1145/3084547", "identifier": {"string_id": "10.1145/3084547", "id_scheme": "DOI"}, "abstract": "Global reconstruction of two-dimensional wall paintings (frescoes) from fragments is an important problem for many archaeological sites. The goal is to find the global position and rotation for each fragment so that all fragments jointly “reconstruct” the original surface (i.e., solve the puzzle). Manual fragment placement is difficult and time-consuming, especially when fragments are irregularly shaped and uncolored. Systems have been proposed to first acquire 3D surface scans of the fragments and then use computer algorithms to solve the reconstruction problem. These systems work well for small test cases and for puzzles with distinctive features, but fail for larger reconstructions of real wall paintings with eroded and missing fragments due to the complexity of the reconstruction search space. We address the search problem with an unsupervised genetic algorithm: we evolve a pool of partial reconstructions that grow through recombination and selection over the course of generations. We introduce a novel algorithm for combining partial reconstructions that is robust to noise and outliers, and we provide a new selection procedure that balances fitness and diversity in the population. In experiments with a benchmark dataset, our algorithm is able to achieve larger and more accurate global reconstructions than previous automatic algorithms.", "article_title": "Wall Painting Reconstruction Using a Genetic Algorithm", "authors": [{"given": "Elena", "family": "Sizikova", "affiliation": [{"original_name": "Princeton University, Princeton, NJ", "normalized_name": "Princeton University", "country": "United States", "identifiers": {"ror": "https://ror.org/00hx57361", "GRID": "grid.16750.35"}}]}, {"given": "Thomas", "family": "Funkhouser", "affiliation": [{"original_name": "Princeton University, Princeton, NJ", "normalized_name": "Princeton University", "country": "United States", "identifiers": {"ror": "https://ror.org/00hx57361", "GRID": "grid.16750.35"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2018", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "11", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}