{"url": "http://dx.doi.org/10.1093/llc/fqn032", "identifier": {"string_id": "10.1093/llc/fqn032", "id_scheme": "DOI"}, "abstract": "Immersive multimedia performances, especially in the theater, installation art, and computer games, suggest to us interesting models for reconceiving the possibilities of textual editing in digital media. Traditionally, textual editions have taken different forms for different audiences of readers. Editing protocols, including the critical apparatus, are determined in part by those forms. Mostly this has meant conceiving of a given text as produced for a scholarly, classroom, or popular audience. However different these types of editions, they share familiar textual ontologies, developed primarily over the past 200 years and based on print technology. We suggest instead that editors begin thinking of digital editions primarily as ‘editorial environments’, with spatial, temporal, procedural, performative, and participatory properties. An electronic edition is always already a virtual world. A digital edition is an electronic environment. Citing as an example our experiment in the MOO with Shelley's sonnet ‘Ozymandias’, we imagine the role of the editor as textual ecologist/dramaturge/gamemaster, maximizing the resources of digital environments.", "article_title": "Editing Environments: The Architecture of Electronic Texts", "authors": [{"given": " Neil", "family": "Fraistat", "affiliation": [{"original_name": "Maryland Institute for Technology in the Humanities (MITH), University of Maryland", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Steven E.", "family": "Jones", "affiliation": [{"original_name": "Department of English, Loyola University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2008", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "24", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}