{"url": "http://dx.doi.org/10.1093/llc/fqs060", "identifier": {"string_id": "10.1093/llc/fqs060", "id_scheme": "DOI"}, "abstract": "‘Dialectal stratigraphy’ aims to focus on the cartography of ancient lexicon. It seeks to represent cartographically how the diatopic variation of a sample of sixty words has evolved. The project begins with the earliest period of written Catalan and indicates the words’ geographical location and their graphic form and semantic progression over time. Unlike conventional atlases which use only a single axis, two axes of linguistic representation are used in dialectal stratigraphy, those of space and time. The distribution of words in the map is represented in layers depicting linguistic change over time. From a methodological point of view, a number of dynamic maps have been created. The maps have a chronological axis that: (1) allows the words to be traced to their initial geographical place; (2) shows their evolution over the passage of the centuries; and (3) makes it possible to observe its geographical movement. In addition, this comprehensive overview allows us to track the course of Eastern and Western Catalan dialects which have been subject of so much controversy of late and also provides information about transitional areas. The aim of this article is to show the potential of this technique for exploring the reasons for changes in lexicon.", "article_title": "Dynamic cartography with diachronic data: Dialectal stratigraphy", "authors": [{"given": " Maria-Pilar", "family": "Perea", "affiliation": [{"original_name": "Universitat de Barcelona, Spain", "normalized_name": "University of Barcelona", "country": "Spain", "identifiers": {"ror": "https://ror.org/021018s57", "GRID": "grid.5841.8"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012-12-18", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}