{"url": "http://dx.doi.org/10.1093/llc/17.2.133", "identifier": {"string_id": "10.1093/llc/17.2.133", "id_scheme": "DOI"}, "abstract": "In this essay I explore a variety of experimental poetic tendencies produced in Spain during the twentienth century. Some of the most popular experimental poetic practices are visual poetry, sound poetry, phonetic poetry, computer poetry, video poetry, and mail art. Because these tendencies were not born in Spain we have to take into consideration international and historical avantgarde practices such as concretism, phonetic poetry, and others. I also study the different interests between multiple artistic languages employed in historical avant‐garde poetry and in more recent experimental poetry. Another aspect studied is the political background especially in the sixties and seventies in Spain and how it conditioned the development and durability of different groups and artistic expressions. Another important factor taken into consideration is the use and development of the different technologies available. Technology is not a medium in this kind of poetry but part of the message and for that purpose it can be used in different ways in the construction of a poem. Because of the complexity of the subject, and the difficulty of getting access to rare books and materials I give a panoramic view – with special attention to selected poems and authors – of the most visible experimental poetic manifestations produced in Spain. But there is a need to do more specialized studies in order to gain a better comprehension of these alternative poetic practices that are becoming more and more popular today.", "article_title": "Experimental Poetic Practices in Spain", "authors": [{"given": "L. L.", "family": "Fernandez", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004-11-11", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "17", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}