{"url": "http://dx.doi.org/10.1093/llc/fqt065", "identifier": {"string_id": "10.1093/llc/fqt065", "id_scheme": "DOI"}, "abstract": "When evaluating machine translation outputs, linguistics is usually taken into account implicitly. Annotators have to decide whether a sentence is better than another or not, using, for example, adequacy and fluency criteria or, as recently proposed, editing the translation output so that it has the same meaning as a reference translation, and it is understandable. Therefore, the important fields of linguistics of meaning (semantics) and grammar (syntax) are indirectly considered. In this study, we propose to go one step further towards a linguistic human evaluation. The idea is to introduce linguistics implicitly by formulating precise guidelines. These guidelines strictly mark the difference between the sub-fields of linguistics such as: morphology, syntax, semantics, and orthography. We show our guidelines have a high inter-annotation agreement and wide-error coverage. Additionally, we examine how the linguistic human evaluation data correlate with: among different types of machine translation systems (rule and statistical-based); and with adequacy and fluency.", "article_title": "Towards human linguistic machine translation evaluation", "authors": [{"given": " Marta R.", "family": "Costa-jussà", "affiliation": [{"original_name": "Institute for Infocomm Research. 1 Fusionopolis Way, 21-01 Connexis (South Tower) Singapore 138632", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Mireia", "family": "Farrús", "affiliation": [{"original_name": "Pompeu Fabra University. C/ Tanger/Roc Boronat, 08018 Barcelona", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "30", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}