{"url": "http://dx.doi.org/10.1093/llc/fqm039", "identifier": {"string_id": "10.1093/llc/fqm039", "id_scheme": "DOI"}, "abstract": "As digital libraries have expanded to absorb existing collections as well as to create new ones, it has become clear that cross collection discovery is not simply desirable, but is increasingly a necessity demanded by users. Similarly, in the digital humanities community, thematic research collections once distinct from one another now would seem to benefit from interoperability. However, efforts to aggregate disparate resources are often stymied by differing metadata schema and controlled vocabulary. Using the lessons learned from the Thomas MacGreevy Archive, The University of Maryland Libraries designed its digital repository to provide for discovery across object types and collections using Fedora as the underlying architecture. To facilitate access to multiple collections within one repository, University of Maryland developed a flexible metadata standard. This metadata schema is used to describe varying types of materials at varying levels of granularity, while allowing for controlled vocabularies appropriate to specific collections.", "article_title": "Cross-collection Searching: A Pandora's Box or the Holy Grail?", "authors": [{"given": " Susan", "family": "Schreibman", "affiliation": [{"original_name": "University of Maryland Libraries, University of Maryland, College Park, MD, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Jennifer", "family": "O’Brien Roper", "affiliation": [{"original_name": "University of Maryland Libraries, University of Maryland, College Park, MD, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Gretchen", "family": "Gueguen", "affiliation": [{"original_name": "University of Maryland Libraries, University of Maryland, College Park, MD, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2007-12-11", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "23", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}