{"url": "http://dx.doi.org/10.1093/llc/fqy085", "identifier": {"string_id": "10.1093/llc/fqy085", "id_scheme": "DOI"}, "abstract": "Digital humanities research has focused primarily on the analysis of texts. This emphasis stems from the availability of technology to study digitized text. Optical character recognition allows researchers to use keywords to search and analyze digitized texts. However, archives of digitized sources also contain large numbers of images. This article shows how convolutional neural networks (CNNs) can be used to categorize and analyze digitized historical visual sources. We present three different approaches to using CNNs for gaining a deeper understanding of visual trends in an archive of digitized Dutch newspapers. These include detecting medium-specific features (separating photographs from illustrations), querying images based on abstract visual aspects (clustering visually similar advertisements), and training a neural network based on visual categories developed by domain experts. We argue that CNNs allow researchers to explore the visual side of the digital turn. They allow archivists and researchers to classify and spot trends in large collections of digitized visual sources in radically new ways.", "article_title": "The visual digital turn: Using neural networks to study historical images", "authors": [{"given": " Melvin", "family": "Wevers", "affiliation": [{"original_name": "DHLab, KNAW Humanities Cluster, Amsterdam, The Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Thomas", "family": "Smits", "affiliation": [{"original_name": "Department of Cultural Studies, Radboud University, Nijmegen, The Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}