{"url": "http://dx.doi.org/10.16995/dscn.277", "identifier": {"string_id": "10.16995/dscn.277", "id_scheme": "DOI"}, "abstract": "Founders Online, a digital initiative of the National Historical Publications and Records Commission (NHPRC) of the U.S. National Archives, launched in June 2013. Since its debut, the site has attracted over a million visitors interested in learning more about the creation of the United States of America in the words of six of its Founding Fathers. Founders Online contains 177,000 letters or other writings of these men and their contemporaries. Widely used by academics and the general public, the site has demonstrated the value of digital humanities’ emphasis on free access. As a former assistant editor at Documents Compass, a program of the Virginia Foundation of the Humanities, I served as a project manager on the Early Access portion of the project. We worked directly with the staffs of the currently active Founding Fathers documentary editing projects to make preliminary versions of unpublished documents available for early viewing on Founders Online. These Early Access documents will eventually be replaced by fully vetted and annotated versions to be completed later by the documentary editing projects. Relying on a large staff of over thirty people, we transcribed or proofread over 50,000 Early Access documents from 2012 to 2015. My Early Access experience demonstrated the need to give employees constant feedback, to reward them for good work, and to encourage specialization among project staff. My experience also reemphasized the need for unified metadata standards when aggregating different sets of data from multiple projects into a single digital platform.", "article_title": "Founders Online: Early Access: Reflections on Open Access, Crowd Sourcing, and Metadata Standards", "authors": [{"given": "William B.", "family": "Kurtz", "affiliation": [{"original_name": "University of Virginia", "normalized_name": "University of Virginia", "country": "United States", "identifiers": {"ror": "https://ror.org/0153tk833", "GRID": "grid.27755.32"}}]}], "publisher": "Open Library of the Humanities", "date": "2017-10-13", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "7", "issue": "1", "ISSN": [{"value": "1918-3666", "type": "electronic"}]}