{"url": "http://dx.doi.org/10.1093/llc/fqm008", "identifier": {"string_id": "10.1093/llc/fqm008", "id_scheme": "DOI"}, "abstract": "The model described here relies on the key concepts of topology, i.e. neighbourhood and equivalence of shape. A linguistic object L is studied in text T by means of one or several local questions Q. The set of successive local answers is processed so as to provide a global function characterizing the textual space under scrutiny. We begin with short sequences of tenses to illustrate the way in which to explore originally Emile Benveniste's concepts of history and discourse.1 We then supply life-size examples of other objects selected for their heuristic value. We go on to demonstrate the model at work on the distribution of strings of finite (F) and non-finite (n) verbal forms in the LOB Corpus of English. A topological chart is produced as the synthetic image mirroring the locations of the relevant linguistic entities throughout the text. All the individual strings concatenating any number of F and n are classified in a table. Alternatively, individual full-text strings can be extracted. We then proceed to refine the notion of lexical distribution in ‘rafales’ in a lemmatized corpus of Latin texts, the purpose being to test the stability of the distributions in individual texts of selected verbs and assess whether a verb's behaviour is related to its semantic status. The final section is devoted to other Latin texts. The use of segments of equal length makes it possible to draw up the narrative profile of each author as revealed by his handling of tenses in main clauses.", "article_title": "Trees and After: The Concept of Text Topology. Some Applications to Verb-Form Distributions in Language Corpora", "authors": [{"given": " Xuan", "family": "Luong", "affiliation": [{"original_name": "Université de Nice-Sophia Antipolis, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Michel", "family": "Juillard", "affiliation": [{"original_name": "Université de Nice-Sophia Antipolis, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Sylvie", "family": "Mellet", "affiliation": [{"original_name": "Université de Nice-Sophia Antipolis, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Dominique", "family": "Longrée", "affiliation": [{"original_name": "Université de Liège, UMR 6039 Bases, Corpus et Langage, Belgium", "normalized_name": "University of Liège", "country": "Belgium", "identifiers": {"ror": "https://ror.org/00afp2z80", "GRID": "grid.4861.b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2007", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "22", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}