{"url": "http://dx.doi.org/10.1093/llc/fqm017", "identifier": {"string_id": "10.1093/llc/fqm017", "id_scheme": "DOI"}, "abstract": "This paper reports the completion of the first expansion phase of the Sheffield Corpus of Chinese (SCC). We describe the major improvements we made in expanding the corpus. They involve the coverage of time periods, choice of text types and categories, and selection of individual texts; the mark up scheme and the integral search and analysis tool. We use the developing SCC to examine Li and Thompson's; (1974, 1975, 1976) controversial postverbal predominance hypothesis for prepositional phrases (PPs) in Archaic Chinese and their word order change hypothesis for PPs in general in the history of the Chinese language. Our study provides no evidence for the postverbal predominance hypothesis for PPs in Archaic Chinese and the word order change hypothesis for PPs in general from postverbal in Archaic Chinese to preverbal in Modern Chinese. Our findings show that postverbal and preverbal PPs have been in coexistence and there have always been more occurrences of preverbal PPs than postverbal PPs in all the time periods covered in the current SCC. Although use of some PPs declined in some time periods and use of others emerged in other time periods, there was never a predominant position for PPs in any time period in the history of Chinese. We show differences in the distribution of PPs in different time periods and provide an account of the syntactic positions of PPs in those time periods.", "article_title": "Syntactic Positions of Prepositional Phrases in the History of Chinese: Using the Developing Sheffield Corpus of Chinese for Diachronic Linguistic Studies", "authors": [{"given": " Xiaoling", "family": "Hu", "affiliation": [{"original_name": "University of Sheffield, UK", "normalized_name": "University of Sheffield", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/05krs5044", "GRID": "grid.11835.3e"}}]}, {"given": " Jamie", "family": "McLaughlin", "affiliation": [{"original_name": "University of Sheffield, UK", "normalized_name": "University of Sheffield", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/05krs5044", "GRID": "grid.11835.3e"}}]}, {"given": " Nigel", "family": "Williamson", "affiliation": [{"original_name": "Sheffield Hallam University, UK", "normalized_name": "Sheffield Hallam University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/019wt1929", "GRID": "grid.5884.1"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2007-09-14", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "22", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}