{"url": "http://dx.doi.org/10.1093/llc/fqw014", "identifier": {"string_id": "10.1093/llc/fqw014", "id_scheme": "DOI"}, "abstract": " By comparing the results obtained through traditional qualitative stemmatics with those obtained through computer-assisted quantitative stemmatology, when both approaches are applied to two authentic data sets (the Old English Anglo-Saxon Chronicle and a Latin epitome of Marco Polo’s Devisement dou Monde ), this study aims at bringing to the fore the advantages and the disadvantages of some recent methods for the automatic grouping of witnesses, most of which are based on phylogenetic models. The analysis will show that not all the methods provide results which can be considered reliable in light of the evidence offered by a thorough scrutiny of the documentary history of the texts under inspection. In particular, the majority of computer-assisted methods succeed in providing very good information for detecting the grouping of witnesses, as well as for a preliminary evaluation of their variant readings. Yet, few offer some valuable guidance as to define the sub-groups. This limitation becomes crucial when the existence of more than one codex interpositus  has to be postulated, i.e. when the historical evidence makes it clear that the actual textual transmission cannot conform to the mathematical ideal of cladistic parsimony. The latter case is particularly evident with ‘closed’ recensions, where mechanical reconstruction plays a heavier role, and the choice of variants follows rigorous stemmatic steps. On the other hand, the application of computer-assisted methods to ‘open’ recensions seems to give better results. ", "article_title": "Open versus closed recensions (Pasquali): Pros and cons of some methods for computer-assisted stemmatology", "authors": [{"given": " Marina", "family": "Buzzoni", "affiliation": [{"original_name": "Department of Linguistics and Comparative Cultural Studies, Ca’ Foscari University of Venice, Italy", "normalized_name": "Ca Foscari University of Venice", "country": "Italy", "identifiers": {"ror": "https://ror.org/04yzxz566", "GRID": "grid.7240.1"}}]}, {"given": " Eugenio", "family": "Burgio", "affiliation": [{"original_name": "Department of Humanities, Ca’ Foscari University of Venice, Italy", "normalized_name": "Ca Foscari University of Venice", "country": "Italy", "identifiers": {"ror": "https://ror.org/04yzxz566", "GRID": "grid.7240.1"}}]}, {"given": " Martina", "family": "Modena", "affiliation": [{"original_name": "Department of Humanities, Ca’ Foscari University of Venice, Italy", "normalized_name": "Ca Foscari University of Venice", "country": "Italy", "identifiers": {"ror": "https://ror.org/04yzxz566", "GRID": "grid.7240.1"}}]}, {"given": " Samuela", "family": "Simion", "affiliation": [{"original_name": "Department of Humanities, Ca’ Foscari University of Venice, Italy", "normalized_name": "Ca Foscari University of Venice", "country": "Italy", "identifiers": {"ror": "https://ror.org/04yzxz566", "GRID": "grid.7240.1"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016-03-18", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "31", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}