{"url": "http://dx.doi.org/10.17928/jjadh.3.1_33", "identifier": {"string_id": "10.17928/jjadh.3.1_33", "id_scheme": "DOI"}, "abstract": "The Song Dynasty was a decisive period of transformation in ancient China, during which relationships between scholars and politicians are thought to have become closer and closer, and this change is considered part of the “Tang–Song transition.” In the Song Dynasty, the Yuanyou 元祐 era (1086–94) was a critical and complex period with regard to its political environment. The major purpose of this paper is to investigate the relationships between scholars and politicians during this period. The connections between figures collected from the CBDB (China Biographical Database) include both literary relations and political relations. Two scholars have a literary relation when both of them write to a common third figure, and a political relation between two politicians is demonstrated through such connections as political support associations, recommendation sponsorship, and oppositional political affiliations. In the present study, two matrices are respectively constructed according to literary and political relations among figures and a Poisson-Gamma factorization model is adopted to obtain the key factors of the matrices. According to calculated results and literary history, the scholars can be clearly classified into three groups. We identified two groups of the politicians with this method, while we found other politicians to have steered a course between them. Furthermore, the figures engaged in common literary pursuits are more likely to share common political goals. As a result, the observation that scholars and politicians are related closely in the Yuanyou era confirms that this period must have featured literati politics.", "article_title": "Investigating the Relationships between Scholars and Politicians in Ancient China: Taking the Yuanyou Era as an Example", "authors": [{"given": "Wenyi", "family": "Shang", "affiliation": [{"original_name": "Department of Information Management, Peking University, Beijing, China", "normalized_name": "Peking University", "country": "China", "identifiers": {"ror": "https://ror.org/02v51f717", "GRID": "grid.11135.37"}}]}, {"given": "Winbin", "family": "Huang", "affiliation": [{"original_name": "Department of Information Management, Peking University, Beijing, China", "normalized_name": "Peking University", "country": "China", "identifiers": {"ror": "https://ror.org/02v51f717", "GRID": "grid.11135.37"}}]}], "publisher": "Japanese Association for Digital Humanities", "date": "2018", "keywords": null, "journal_title": "Journal of the Japanese Association for Digital Humanities", "volume": "3", "issue": "1", "ISSN": [{"value": "2188-7276", "type": "electronic"}]}