{"url": "http://dx.doi.org/10.1093/llc/fqv034", "identifier": {"string_id": "10.1093/llc/fqv034", "id_scheme": "DOI"}, "abstract": "Weighted Gene Co-Expression Network Analysis (WGCNA) is a technique developed for analysing gene co-expression microarray data. This article demonstrates the adaption of WGCNA to mine an entire genre of literature, describing its dominant features, exposing its evolution through time, and dissecting its plot structures. WGCNA not only finds these large-scale structures, but exposes the fine-grained contribution of individual words. Romance accounts for 16.7% of all novels sold in the USA, and is the most popular form of genre literature (Romance Writers of America, 2013; Industry Statistics. http://www.rwa.org/p/cm/ld/fid=580 (accessed 13 June 2013)). Selling into 111 different markets and thirty-one languages, Harlequin is the largest publisher of romance worldwide, and its most successful category line, Harlequin Presents, offers the reader ‘pure romantic fantasy’ (Harlequin Presents Writing Guidelines)—romance in an almost archetypal sense. Despite the popularity, ubiquity and profitability of category romance, there is relatively little study to date on the phenomenon. Using WGCNA together with all electronically available Harlequin Presents novels—some 1,400 from 1999 to 2013—this article demonstrates that the genre’s fundamental architecture is a choir of authorial voices, that its evolution is dominated by sudden shifts due to financial pressures on the publisher, and that the order in which elements appear—the plot—is largely fixed.", "article_title": "Whole Genre Sequencing", "authors": [{"given": "Jack", "family": "Elliott", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2015", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}