{"url": "http://dx.doi.org/10.1145/3131610", "identifier": {"string_id": "10.1145/3131610", "id_scheme": "DOI"}, "abstract": "In this article, we propose Multi-Entity Bayesian Networks (MEBNs) as the probabilistic ontological framework for the analysis of the Tsamiko and Salsa dances. More specifically, our analysis has the objective of the dancer assessment with respect to both choreography execution accuracy and the synchronization of the dance movements with the musical rhythm. For this task, we make use of the explicit, expert-provided knowledge on dance movements and their relations to the musical beat. Due to the complexity of this knowledge, the MEBNs were used as the probabilistic ontological framework in which the knowledge is formalized. The reason we opt for MEBNs for this task is that they combine Bayesian and formal (first-order) logic into a single model. In this way, the Bayesian probabilistic part of MEBNs was used to capture, using example data and training, the implicit part of the expert knowledge about dances, i.e., this part of the knowledge that cannot be formalized and explicitly defined accurately enough, while the logical maintains the explicit knowledge representation in the same way ontologies do. Moreover, we present in detail the MEBN models we built for Tsamiko and Salsa, using expert-provided explicit knowledge. Last, we conduct experiments that demonstrate the effectiveness of the proposed MEBN-based methodology we employ to achieve our analysis objectives. The results of the experiments demonstrate the superiority of MEBNs to conventional models, such as BNs, in terms of the dancer assessment accuracy.", "article_title": "A Probabilistic, Ontological Framework for Safeguarding the Intangible Cultural Heritage", "authors": [{"given": "Giannis", "family": "Chantas", "affiliation": [{"original_name": "Information Technologies Institute, Centre of Research and Technology Hellas, Thessaloniki, Greece", "normalized_name": "Information Technologies Institute", "country": "Greece", "identifiers": {"ror": "https://ror.org/0069akp70", "GRID": "grid.435101.2"}}]}, {"given": "Sotiris", "family": "Karavarsamis", "affiliation": [{"original_name": "Information Technologies Institute, Centre of Research and Technology Hellas, Thessaloniki, Greece", "normalized_name": "Information Technologies Institute", "country": "Greece", "identifiers": {"ror": "https://ror.org/0069akp70", "GRID": "grid.435101.2"}}]}, {"given": "Spiros", "family": "Nikolopoulos", "affiliation": [{"original_name": "Information Technologies Institute, Centre of Research and Technology Hellas, Thessaloniki, Greece", "normalized_name": "Information Technologies Institute", "country": "Greece", "identifiers": {"ror": "https://ror.org/0069akp70", "GRID": "grid.435101.2"}}]}, {"given": "Ioannis", "family": "Kompatsiaris", "affiliation": [{"original_name": "Information Technologies Institute, Centre of Research and Technology Hellas, Thessaloniki, Greece", "normalized_name": "Information Technologies Institute", "country": "Greece", "identifiers": {"ror": "https://ror.org/0069akp70", "GRID": "grid.435101.2"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2018", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "11", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}