{"url": "http://dx.doi.org/10.1093/llc/fqp032", "identifier": {"string_id": "10.1093/llc/fqp032", "id_scheme": "DOI"}, "abstract": "There has been dramatic growth in information communication technologies (ICT) infrastructure for the arts and humanities research community in recent years in the UK and elsewhere. No domain-wide survey of how researchers are using ICT and what they perceive their future needs to be has been undertaken previously and consequently what is needed in terms of a generic ICT infrastructure to support arts and humanities research is not well understood. The RePAH (Research Portals for the Arts and Humanities) Project is an AHRC funded study into the user needs for information portals to support research in the Arts and Humanities. It uses a combination of questionnaires, focus groups and Delphi opinion gathering, combined with server log-analysis data, to identify users’ information discovery strategies, Internet usage patterns, awareness and attitudes towards current services and technologies and responses to what future portal developments can deliver. Responsibility for funding this kind of infrastructure is split between a number of different agencies. This makes sector-wide information gathering for strategic planning and development difficult. The results of this study may help providers to understand where the priorities lie for the arts and humanities research community and help users to appreciate some of the possibilities within their grasp.", "article_title": "Research portals in the arts and humanities", "authors": [{"given": " Stephen", "family": "Brown", "affiliation": [{"original_name": "Knowledge Media Design, De Montfort University, The Gateway, Leicester LE1 9BH, UK", "normalized_name": "De Montfort University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0312pnr83", "GRID": "grid.48815.30"}}]}, {"given": " Mark", "family": "Greengrass", "affiliation": [{"original_name": "Humanities Research Institute, Sheffield University, 34 Gell Street, Sheffield S3 7QY, UK", "normalized_name": "University of Sheffield", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/05krs5044", "GRID": "grid.11835.3e"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2009", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "25", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}