{"url": "http://dx.doi.org/10.1353/dph.2012.0004", "identifier": {"string_id": "10.1353/dph.2012.0004", "id_scheme": "DOI"}, "abstract": "Globalization is a “hot topic.” While language figures prominently in debates, its complexity defies descriptions of globalization adequate for other subjects. Increasingly diverse ethnicity in nation states alters the status of once dominant vernaculars—what Dante called the parlar materno—as factors of cultural and social cohesion. Language and religion, rather than nation, now serve as elective markers of identity. Inevitably, however, to assert global status for a language conveys overtones of linguistic, and thus cultural, hegemony. From this perspective, Carl Schmitt’s dictum that “all significant concepts of the modern theory of the state are secularized theological concepts,” resonates in the sphere of language. For when Schmitt refers to modern concepts of state as theological in origin, his thought speaks directly to the concept of global language. For “global” is only a slightly attenuated variant of “universal,” whose totalizing connotation we find somewhat embarrassing today. And yet, historically, the myth of a lost universal language has played an important role in traditional cultures that value creation accounts. The latter evoke a mythic moment, in illo tempore, when all humans spoke a common language for the simple reason that the origin of the one implicated the emergence of the other. Perhaps no one thought so profoundly about the question of global or universal language in this sense as Dante Alighieri in his philosophical treatise on the illustrious vernacular, the De vulgari eloquentia (c. 1304 CE, DVE). Unlike proponents of global language today who seek to extrapolate a (pre)dominant language from among hundreds of dialects, Dante recognized multilingualism as an historical contingency, a product of the linguistic fall at Babel. At that point, universal language—the speech co-created by God and the first man in Genesis—disappeared, fractured into linguistic shards representing the diversity of human culture. Dante’s anthropology of language thus imitates the division of the first human into an infinite series, each unit different from others, but all containing an originary “DNA,” identified in Genesis 1:26–27 as divine similitude. Likewise, Dante proposes that all human language possess a common “deep structure,” a set of principles for a universal grammar that act as the formal cause of language. Dante calls this capacity for language the forma locutionis, the innate capacity for speech, which defines humans. For Dante, only the vernacular or mother tongue can embody this essence. Jointly created by God and the first man, it has the potential to incarnate the highest aspiration of human speech, the volgare illustre or illustrious vernacular. Although Dante lays out his anthropology of the vernacular in De vulgare eloquentia—arguing that one must look to the most refined vernacular poetry for examples—he defers demonstrating the concept fully until Purgatorio and Paradiso. There he deploys text networks invoking Hebrew, Greek, Latin, and diverse vernacular poets and philosophers to showcase the volgare illustre as a universal vernacular—a forma locutionis in which the meaning, aura, and affect of speaking take precedence over language of origin.", "article_title": "Global Language or Universal Language?: From Babel to the Illustrious Vernacular", "authors": [{"given": "Stephen G.", "family": "Nichols", "affiliation": [{"original_name": "Johns Hopkins University", "normalized_name": "Johns Hopkins University", "country": "United States", "identifiers": {"ror": "https://ror.org/00za53h95", "GRID": "grid.21107.35"}}]}], "publisher": "Johns Hopkins University Press", "date": "2012", "keywords": null, "journal_title": "Digital Philology: A Journal of Medieval Cultures", "volume": "1", "issue": "1", "ISSN": [{"value": "2162-9552", "type": "electronic"}]}