{"url": "http://dx.doi.org/10.1093/llc/fqy026", "identifier": {"string_id": "10.1093/llc/fqy026", "id_scheme": "DOI"}, "abstract": "The present study exemplifies an action research-based approach to developing learner autonomy in learning productive vocabulary in an English as a foreign language (EFL) setting. We conducted two cycles of teaching actions as interventions to solve immediate learning problems. These actions involved Evernote-aided learning and activities of word guessing, gap noticing, and phonetic drilling. The results of vocabulary tests and interviews were analysed to measure and verify the outcomes of the interventions. Our results reveal that, by the end of the research, learners took initiative in learning productive vocabulary. They became more self-conscious of the knowledge involved in a productive word and more capable of managing vocabulary learning independently. Reflections upon the teachers’ role, their actions in the teaching practice, and the relationship between learner autonomy and vocabulary learning are discussed.", "article_title": "Autonomous learning of productive vocabulary in the EFL context: An action research approach", "authors": [{"given": " Yubin", "family": "Qian", "affiliation": [{"original_name": "School of International Studies, University of International Business and Economics, China", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Ya", "family": "Sun", "affiliation": [{"original_name": "Foreign Languages Department, University of Chinese Academy of Sciences, China", "normalized_name": "University of Chinese Academy of Sciences", "country": "China", "identifiers": {"ror": "https://ror.org/05qbk4x57", "GRID": "grid.410726.6"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}