{"identifier": {"string_id": "10.16995/dm.6", "id_scheme": "DOI"}, "abstract": "The Illustrated Incunable Short Title Catalog on CD-ROM (IISTC), now in its second edition, provides an unrivaled wealth of information on fifteenth-century printing and, as a computer database, allows for rapid searching that would not be possible with printed reference works. However, the database's search interface suffers from numerous problems, as Paul Needham described in a thorough review essay. This article presents a solution to those problems that can be implemented by the end user, and also shows what kind of useful information can be obtained from the IISTC by doing so. The solution entails exporting all records to a very large text file, analyzing the file with scripts written in Perl, importing the information into a full-featured database application, and conducting queries with the database application's more robust and better documented interface. With the IISTC data directly accessible, the database fields can be manipulated to implement features missing in the original IISTC, including separate fields for each part of the imprint data and a count of recorded copies. Query-generated output demonstrated here include a table of incunables with the highest number of copies recorded in the IISTC; printers of Ulm, the number of their signed editions, and their dates; and the number of signed editions printed each year through the end of the fifteenth century. Sample scripts for recreating the results described here, as well as instructions for implementing them and a discussion of points to consider when doing so, are found in the appendices.", "article_title": "Opening the Illustrated Incunable Short Title Catalog on CD-ROM: an end-user’s approach to an essential database", "authors": [{"given": "Jonathan", "family": "Green", "affiliation": [{"original_name": "College of Charleston", "normalized_name": "College of Charleston", "country": "United States", "identifiers": {"ror": "https://ror.org/00390t168", "GRID": "grid.254424.1"}}]}], "publisher": "Open Library of the Humanities", "date": "2005", "keywords": null, "journal_title": "Digital Medievalist", "volume": "1", "issue": null, "ISSN": [{"value": "1715-0736", "type": "electronic"}], "url": "http://dx.doi.org/10.16995/dm.6"}