{"url": "http://dx.doi.org/10.1093/llc/fql017", "identifier": {"string_id": "10.1093/llc/fql017", "id_scheme": "DOI"}, "abstract": "The text ontology debates inspired by the descriptive encoding practices of the Text Encoding Initiative (TEI) community have been conducted between literary theorists concerned with the adequacy of such encoding to capture the interpretative and playful aspects of literary appreciation on the one hand, and those who regard encoding as one of the formal sciences and seek greater disambiguation in the interests of more efficient machine processing. We argue for a practice-oriented view that has not been represented adequately by either of these poles. Our position has received unexpected support from the systematic realist philosophy of John Anderson which we encountered in digitizing his lecture notes held by the University of Sydney Archives. The process of encoding the lecture notes informed our understanding of the problems of encoding primary source materials, but Anderson's realism also located the space we sought to occupy in the TEI debates between the technical, formal model of encoding and the anti-realist preferences of many literary scholars. In this article, we argue on the basis of our reflections the need for further empirical studies of real world encoding practices as these new documentary forms are integrated into existing institutional and informational processes.", "article_title": "In the Philosophy Room: Australian Realism and Digital Content Development", "authors": [{"given": " Creagh", "family": "Cole", "affiliation": [{"original_name": "Scholarly Electronic Text & Image Service, The University of Sydney", "normalized_name": "University of Sydney", "country": "Australia", "identifiers": {"ror": "https://ror.org/0384j8v12", "GRID": "grid.1013.3"}}]}, {"given": " Paul", "family": "Scifleet", "affiliation": [{"original_name": "Discipline of Information Systems, Faculty of Economics & Business, The University of Sydney", "normalized_name": "University of Sydney", "country": "Australia", "identifiers": {"ror": "https://ror.org/0384j8v12", "GRID": "grid.1013.3"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2006", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "21", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}