{"url": "http://dx.doi.org/10.1093/llc/fqs009", "identifier": {"string_id": "10.1093/llc/fqs009", "id_scheme": "DOI"}, "abstract": "The remarkable advances in the field of ICT have led to the appearance of interesting innovations in literature classrooms, one of which is multimedia. Multimedia has been proven to be a powerful learning tool as it is able to provide extensive learning opportunities, thus breaking away from the traditional and restrictive ‘chalk and talk’ type of teaching. This study examined the incorporation of an after-reading assignment called ‘The Multimedia Project’ in a literature classroom. It involved ninety-six students taking English literature courses at the Faculty of Modern Languages and Communication, Universiti Putra Malaysia. Multimedia can be defined in a variety of ways, but for this project multimedia refers to a literary text presentation, primarily made using sound and images. Through this project, the students had opportunities to explore and develop their knowledge and critically analyze the literary texts covered in class. This study relied on two types of analysis: an evaluation of the students’ multimedia presentations and a survey of the students’ opinions regarding the project. The findings indicate that the multimedia project proved to be effective in advancing students’ literary experience and critical appreciation. The students’ opinions also confirmed the viability of multimedia as a practical application tool in teaching literature as well as in promoting visual literacy.", "article_title": "Advancing aesthetic literary experience through a multimedia project", "authors": [{"given": " Zainor Izat", "family": "Zainal", "affiliation": [{"original_name": "Universiti Putra Malaysia, Malaysia", "normalized_name": "Universiti Putra Malaysia", "country": "Malaysia", "identifiers": {"ror": "https://ror.org/02e91jd64", "GRID": "grid.11142.37"}}]}, {"given": " Ann Rosnida", "family": "Mohd Deni", "affiliation": [{"original_name": "Sunway University, Malaysia", "normalized_name": "Sunway University", "country": "Malaysia", "identifiers": {"ror": "https://ror.org/04mjt7f73", "GRID": "grid.430718.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "27", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}