{"url": "http://dx.doi.org/10.1093/llc/fqx033", "identifier": {"string_id": "10.1093/llc/fqx033", "id_scheme": "DOI"}, "abstract": "Medieval literary traditions provide a particularly challenging test case for textual alignment and the visualization of variance. Whereas the editors of medieval traditions working with the printed page struggle to illustrate the complex phenomena of textual instability, research in screen-based visualization has made significant progress, allowing for complex textual situations to be captured at the micro- and the macro-level. This article uses visualization and a computational approach to identifying variance to allow the analysis of different medieval poetic works using the transcriptions of how they are found in particular manuscripts. It introduces the notion of a meso-level visualization, a visual representation of aligned text providing for comparative reading on the screen, all the while assembling non-contradictory, intuitive solutions for the visual exploration of multi-scalar variance. Building upon the literary notion of mouvance, it delves into medieval French literature and, in particular, different visualizations of three versions of the Chanson de Roland (the Oxford, the Châteauroux, and the Venice 4 manuscripts). The article presents experimental prototypes for such meso-level visualization and explores how they can advance our understanding of formulaically rich medieval poetry.", "article_title": "Visualizing Mouvance: Toward a visual analysis of variant medieval text traditions", "authors": [{"given": " Stefan", "family": "Jänicke", "affiliation": [{"original_name": "Institut für Informatik, Leipzig University, Germany", "normalized_name": "Leipzig University", "country": "Germany", "identifiers": {"ror": "https://ror.org/03s7gtk40", "GRID": "grid.9647.c"}}]}, {"given": " David", "family": "Joseph Wrisley", "affiliation": [{"original_name": "Digital Humanities, New York University Abu Dhabi, UAE", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2017", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "32", "issue": "suppl_2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}