{"url": "http://dx.doi.org/10.1093/llc/fqx036", "identifier": {"string_id": "10.1093/llc/fqx036", "id_scheme": "DOI"}, "abstract": "Certain problems in the design of digital systems for use in cultural heritage and the humanities have proved to be unexpectedly difficult to solve. For example, Why is it difficult to locate ourselves and understand the extent and shape of digital information resources? Why is digital serendipity still so unusual? Why do users persist in making notes on paper rather than using digital annotation systems? Why do we like to visit and work in a library, and browse open stacks, even though we could access digital information remotely? Why do we still love printed books, but feel little affection for digital e-readers? Why are vinyl records so popular? Why is the experience of visiting a museum still relatively unaffected by digital interaction? The article argues that the reasons these problems persist may be due to the very complex relationship between physical and digital information and information resources. I will discuss the importance of spatial orientation, memory, pleasure, and multi-sensory input, especially touch, in making sense of, and connections between physical and digital information. I will also argue that, in this context, we have much to learn from the designers of early printed books and libraries, such as the Priory Library and that of John Cosin, a seventeenth-century bishop of Durham, which is part of the collections of Durham University library.", "article_title": "Beauty is truth: Multi-sensory input and the challenge of designing aesthetically pleasing digital resources", "authors": [{"given": " Claire", "family": "Warwick", "affiliation": [{"original_name": "Department of English Studies, Durham University, UK", "normalized_name": "Durham University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01v29qb04", "GRID": "grid.8250.f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2017-10-14", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "32", "issue": "suppl_2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}