{"url": "http://dx.doi.org/10.1093/llc/fqx065", "identifier": {"string_id": "10.1093/llc/fqx065", "id_scheme": "DOI"}, "abstract": "The Whitechapel murders that terrorized London in 1888 are still remembered to this day, thanks to the legend of its unapprehended perpetrator, Jack the Ripper. In addition to the gruesomeness of the murders, the name and the persona of the killer have been popularized by the over 200 letters signed as ‘Jack the Ripper’ that have been received following the murders. The most supported theory on the authorship of these letters is that some of the earliest key texts were written by journalists to sell more newspapers and that the same person is responsible for writing the two most iconic earliest letters. The present article reports on an authorship clustering/verification analysis of the Jack the Ripper letters with a view to detect the presence of one writer for the earliest and most historically important texts. After compiling the ‘Jack the Ripper Corpus’ consisting of the 209 letters linked to the case, a cluster analysis of the letters is carried out using the Jaccard distance of word 2-grams. The quantitative results and the discovery of certain shared distinctive lexicogrammatical structures support the hypothesis that the two most iconic texts responsible for the creation of the persona of Jack the Ripper were written by the same person. In addition, there is also evidence that a link exists between these texts and another of the key texts in the case, the Moab and Midian letter.", "article_title": "An authorship analysis of the Jack the Ripper letters", "authors": [{"given": " Andrea", "family": "Nini", "affiliation": [{"original_name": "Linguistics and English Language, University of Manchester, UK", "normalized_name": "University of Manchester", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/027m9bs27", "GRID": "grid.5379.8"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}