{"url": "http://dx.doi.org/10.1093/llc/fql033", "identifier": {"string_id": "10.1093/llc/fql033", "id_scheme": "DOI"}, "abstract": "Aristotle long ago divided kinds of study into technē and epistēmē, which we can roughly translate into the modern terms ‘art’ and ‘science’. It is certainly the case that computational dialectologists do well with the Art (technē), in our technical construction and execution of statistical experiments, and we have two different prominent models to choose from, each one corresponding to a mode of scientific discovery, either to deductive or to inductive scientific procedure. But that in itself should not be the whole story. The Science (epistēmē) of computational dialectology lies in the creation of arguments from our statistical results that are appropriate to the scientific procedure that motivates us. It is not so clear that computational dialectologists have done so well with their Science. What do the results of the technical work really mean? In what way are they associated with particular choices of linguistic theory? Is it the case that, after all of our technical hard work, we find only what we are looking for? In this paper, I will suggest that an appropriate use of the technical results of computational dialectology requires that practitioners take a more subtle approach to the theory that motivates the study in the first place, especially to the relationship between perception and production of language.", "article_title": "Art and Science in Computational Dialectology", "authors": [{"given": "W. A.", "family": "Kretzschmar", "affiliation": [{"original_name": "University of Georgia, Athens, GA, USA", "normalized_name": "University of Georgia", "country": "United States", "identifiers": {"ror": "https://ror.org/00te3t702", "GRID": "grid.213876.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2006-09-07", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "21", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}