{"url": "http://dx.doi.org/10.1093/llc/fqy043", "identifier": {"string_id": "10.1093/llc/fqy043", "id_scheme": "DOI"}, "abstract": "In the summer of 2012, the Institute of Fine Arts, New York University Selinunte Mission began to explore the interior of the cella of Temple R. This excavation showed that the classical and archaic layers had been sealed by a deep fill of the Hellenistic period and left untouched by earlier archaeological research at the site. Among the discoveries were a series of votive depositions positioned against the walls, dating to the sixth century BCE. One of the most striking finds among those votive depositions was the discovery of two parts of a bone aulos, which can be dated to 570 BCE. The virtual reconstruction of the aulos found in Temple R at Selinunte aims to increase and improve its scientific investigation, overcoming the limitations caused by the fragility of the instrument. Digital technology has allowed us to produce a three-dimensional (3D) model of the aulos. This digital model has been translated into a 3D artificial copy, using polymer as a material. Our goal is to reconstruct the aulos, after analysing its organological characteristics. We also hope that this new study of the aulos will increase our knowledge of Ancient Greek music.", "article_title": "Towards a new approach in the study of Ancient Greek music: Virtual reconstruction of an ancient musical instrument from Greek Sicily", "authors": [{"given": " Angela", "family": "Bellia", "affiliation": [{"original_name": "Institute for Archaeological and Monumental Heritage, National Research Council of Italy", "normalized_name": "Institute for Archaeological and Monumental Heritage", "country": "Italy", "identifiers": {"ror": "https://ror.org/00x5wpm25", "GRID": "grid.503058.b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}