{"url": "http://dx.doi.org/10.1145/3359590", "identifier": {"string_id": "10.1145/3359590", "id_scheme": "DOI"}, "abstract": "The visualisation of historical information and storytelling in museums is a crucial process for transferring knowledge by directly and simplistically engaging the museum audience. Until recently, technological limitations meant museums were limited to 2D and 3D screen-based information displays. However, advancements in Mixed Reality (MR) devices permit the propagation of a virtual overlay that amalgamates both real-world and virtual environments into a single spectrum. These holographical devices project a 3D space around the user which can be augmented with virtual artefacts, thus potentially changing the traditional museum visitor experience. Few research studies focus on utilising this virtual space to generate objects that do not visually inhibit or distract the operator. Therefore, this article aims to introduce the Ambient Information Visualisation Concept (AIVC) as a new form of storytelling, which can enhance the communication and interactivity between museum visitors and exhibits by measuring and sustaining an optimum spatial environment around the user. Furthermore, this article investigates the perceptual influences of AIVC on the users’ level of engagement in the museum. This article utilises the Microsoft HoloLens, which is one of the most cutting-edge imagining technologies available to date, in order to deploy the AIVC in a historical storytelling scene “The Battle” in the Egyptian department at The Manchester Museum. This research further seeks to measure the user acceptance of the MR prototype by adopting the Technology Acceptance Model (TAM). The operational approaches investigated in this study include personal innovativeness (PI), enjoyment (ENJ), usefulness (USF), ease of use (EOU), and willingness of future use (WFU). The population sampling methodology utilised 47 participants from the museum's daily visitors. Results of this research indicate that the WFU construct is the primary outcome of this study, followed by the usefulness factor. Further findings conclude that the majority of users found this technology highly engaging and easy to use. The combination of the proposed system and AIVC in museum storytelling has extensive applications in museums, galleries, and cultural heritage places to enhance the visitor experience.", "article_title": "Ambient Information Visualisation and Visitors’ Technology Acceptance of Mixed Reality in Museums", "authors": [{"given": "Ramy", "family": "Hammady", "affiliation": [{"original_name": "School of Media Arts and Technology, Solent University, UK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}, {"original_name": "Faculty of Applied Arts, Helwan University, Egypt", "normalized_name": "Helwan University", "country": "Egypt", "identifiers": {"ror": "https://ror.org/00h55v928", "GRID": "grid.412093.d"}}]}, {"given": "Minhua", "family": "Ma", "affiliation": [{"original_name": "Falmouth University, UK", "normalized_name": "Falmouth University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/022gstf70", "GRID": "grid.43086.39"}}]}, {"given": "Carl", "family": "Strathearn", "affiliation": [{"original_name": "School of Computing and Digital Technology, Staffordshire University, UK", "normalized_name": "Staffordshire University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00d6k8y35", "GRID": "grid.19873.34"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2020-06-16", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "13", "issue": "2", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}