{"url": "http://dx.doi.org/10.1093/llc/fqp023", "identifier": {"string_id": "10.1093/llc/fqp023", "id_scheme": "DOI"}, "abstract": "Translation, adaptation, and other forms of appropriation of literary works can result in bodies of parallel texts. For the purpose of studying appropriation strategies, it is important to be able to annotate digital representations of these parallel text structures. This article uses early modern emblem culture (books of engravings or woodcuts, accompanied by mottos and explanatory texts) to investigate the forms this text parallelism may take. It defines requirements for annotation definition and proposes a TEI (Text Encoding Initiative) extension to implement these requirements. In the proposed encoding scheme, TEI feature structures will be used for storing annotation information. This scheme should be useful for annotating parallel text structures as well as for other annotation tasks. The annotation scheme assumes the annotated texts are available in XML. If this is not the case (there is no electronic version of the text at all or perhaps only a facsimile) the article suggests the definition of a TEI proxy document. A TEI proxy document contains enough of the structural aspects of the texts to serve as a basis for attaching annotations to the text. Outside of the annotation context, proxy documents may serve as a basis for adding functionality to image-based editions.", "article_title": "Towards a TEI-based encoding scheme for the annotation of parallel texts", "authors": [{"given": " Peter", "family": "Boot", "affiliation": [{"original_name": "Huygens Institute, Royal Netherlands Academy of Arts and Sciences, The Hague, The Netherlands", "normalized_name": "Royal Netherlands Academy of Arts and Sciences", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/043c0p156", "GRID": "grid.418101.d"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2009", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "24", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}