{"url": "http://dx.doi.org/10.16995/dscn.47", "identifier": {"string_id": "10.16995/dscn.47", "id_scheme": "DOI"}, "abstract": "This essay considers the viability of pornography marketed as resistant or revolutionary within hegemonic capitalist and heteronormative contexts. It focuses on three contemporary porn websites: Pornhub, Treasure Island Media, and TROUBLEfilms. In its current context, internet pornography represents a complex web of content owners, producers, distributors, licensees, users, uploaders, downloaders, actors, web hosts, and advertisers, and notions of intellectual property often come into play as porn companies try to make money in an environment in which customers do not want to pay. Using the Salish method of \"storying up\" a phenomenon (Maracle 2007), I narrate the history of obscenity and intellectual property and discuss survival strategies employed by the three exemplary netporn sites. Beginning with copyright's and obscenity's legal foundations in the eighteenth century, the story of porn and intellectual property includes the use of easily-copied porn to create sexual publics in the twentieth century and technological and legal changes to porn's distribution in the twenty-first century. I examine three strategies netporn businesses use to stay afloat in the post-industrial economy. These strategies are the re-intermediation of the industry, management of the pornographer's \"author function,\" and regulation of porn consumption through the sale of identity to viewers. As netporn businesses struggle for control over porn distribution and consumption, they facilitate their own survival by generating new sexual, social and economic norms. These norms mediate between the \"pirate\" culture promised by technology and the culture industry's interest in legitimising and entrenching intellectual property rights.", "article_title": "Pornographers and Pirates: Intellectual Property and Netporn", "authors": [{"given": "Sarah", "family": "Mann", "affiliation": [{"original_name": "Department of Geography, Brock University", "normalized_name": "Brock University", "country": "Canada", "identifiers": {"ror": "https://ror.org/056am2717", "GRID": "grid.411793.9"}}]}], "publisher": "Open Library of the Humanities", "date": "2017", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "0", "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}