{"url": "http://dx.doi.org/10.1093/llc/fqu056", "identifier": {"string_id": "10.1093/llc/fqu056", "id_scheme": "DOI"}, "abstract": "This article presents an approach to using cognitive models of narrative discourse comprehension to define an explicit computational model of a reader’s comprehension process during reading, predicting aspects of narrative focus and inferencing with precision. This computational model is employed in a narrative discourse generation system to select and sequence content from a partial plan representing story world facts, objects, and events, creating discourses that satisfy comprehension criteria. Cognitive theories of narrative discourse comprehension define explicit models of a reader’s mental state during reading. These cognitive models are created to test hypotheses and explain empirical results about reader comprehension, but do not often contain sufficient precision for implementation on a computer. Therefore, they have not previously been suitable for computational narrative generation. The results of three experiments are presented and discussed, exhibiting empirical support for the approach presented. This work makes a number of contributions that advance the state-of-the-art in narrative discourse generation: a formal model of narrative focus, a formal model of online inferencing in narrative, a method of selecting narrative discourse content to satisfy comprehension criteria, and both implementation and evaluation of these models.", "article_title": "Cognitive models of discourse comprehension for narrative generation", "authors": [{"given": " James", "family": "Niehaus", "affiliation": [{"original_name": "Charles River Analytics Inc, USA", "normalized_name": "Charles River Analytics (United States)", "country": "United States", "identifiers": {"ror": "https://ror.org/03z47zw42", "GRID": "grid.455283.d"}}]}, {"given": " R. Michael", "family": "Young", "affiliation": [{"original_name": "North Carolina State University, USA", "normalized_name": "North Carolina State University", "country": "United States", "identifiers": {"ror": "https://ror.org/04tj63d06", "GRID": "grid.40803.3f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014-10-14", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}