{"url": "http://dx.doi.org/10.1093/llc/fqi051", "identifier": {"string_id": "10.1093/llc/fqi051", "id_scheme": "DOI"}, "abstract": "Te Ara, the Encyclopedia of New Zealand was launched in 2005, funded by the New Zealand government. It was designed from the beginning to be published online, perhaps the first national encyclopedia to be born digital. It complements the works of M. McKinnon (1997, The New Zealand Historical Atlas. Auckland: David Bateman Ltd.) and W. H. Oliver and C. Orange (1990–2000, The Dictionary of New Zealand Biography, five volumes. Wellington: Allen & Unwin and Department of Internal Affairs). The encyclopedia is designed to be the first port of call for reliable information about New Zealand and a gateway to the country's natural and cultural treasures. Its digital form allows searchability, linking to other sites, cumulative publication (one ‘theme’ a year), regular updating, and a parallel publication of a digitized 1966 encyclopedia, as well as multimedia content and interactive aspects such as user-defined graphs. In addition, it allows material to be layered for different audiences, from younger school children to scholars and researchers, and with sections in Maori as well as English. Eventually, as attitudes change and new discoveries are made, some of the earliest entries will need rewriting. The encyclopedia will mutate and be in a constant state of revision and self-criticism. The online encyclopedia of a nation is a project full of promise, which it is hoped others will soon emulate.", "article_title": "Planning an Online Encyclopedia of a Nation: The Example of Te Ara, the Encyclopedia of New Zealand", "authors": [{"given": " Jock", "family": "Phillips", "affiliation": [{"original_name": "Ministry for Culture and Heritage, Wellington, New Zealand", "normalized_name": "Ministry for Culture and Heritage", "country": "New Zealand", "identifiers": {"ror": "https://ror.org/04600bt44", "GRID": "grid.453502.5"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2005-10-01", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "20", "issue": "4", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}