{"url": "http://dx.doi.org/10.1093/llc/fqx041", "identifier": {"string_id": "10.1093/llc/fqx041", "id_scheme": "DOI"}, "abstract": "While Gallo-Italic varieties clearly belong to the Romance language family, their subgrouping as either Gallo-Romance or Italo-Romance has been the source of disagreement in the classificatory literature. While earlier analyses tended to classify Gallo-Italic as Gallo-Romance (notably Schmid, 1956; Bec, 1970–1971), later work has either argued for or tacitly assumed a classification of Gallo-Italic as part of the Italo-Romance branch, a view that is both different from as well as irreconcilable with the earlier Gallo-Romance classifications. In this article, we aim to contribute to the development of an empirically based classification of Gallo-Italic through the use of dialectometry applied to atlas corpora, and specifically through the measurement of Levenshtein distance. Using three wordlists (Swadesh 100, Swadesh 200, Leipzig–Jakarta) and comparing twenty-six linguistic varieties across Italy and south-eastern France, we show that Gallo-Italic is best classified as a third subgroup within the Gallo-Romance branch. Our results also clearly identify all the major bundles of isoglosses established through traditional dialectological methods and confirm Gallo-Italic as a relatively homogenous group distinct from Italo-Romance.", "article_title": "Revisiting the classification of Gallo-Italic: a dialectometric approach", "authors": [{"given": " Marco", "family": "Tamburelli", "affiliation": [{"original_name": "School of Linguistics and English Language, Bangor University, Bangor, UK", "normalized_name": "Bangor University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/006jb1a24", "GRID": "grid.7362.0"}}]}, {"given": " Lissander", "family": "Brasca", "affiliation": [{"original_name": "School of Linguistics and English Language, Bangor University, Bangor, UK", "normalized_name": "Bangor University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/006jb1a24", "GRID": "grid.7362.0"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}