{"url": "http://dx.doi.org/10.1093/llc/fqv052", "identifier": {"string_id": "10.1093/llc/fqv052", "id_scheme": "DOI"}, "abstract": "How do humanities scholars make sense of new or otherwise unfamiliar archives? Is there a role for computational text analysis in the process of sensemaking? We propose that topic modeling, when conceived as a process of thematic exploration, can provide a new entry point into this process. To this end, we present research on a new software tool called TOME: Interactive TOpic Model and MEtadata Visualization, designed to support the exploratory thematic analysis of digitized archival collections. TOME is centered around a set of visualizations intended to facilitate the interpretation of the topic model and its incorporation into extant humanities research practices. In contrast to other topic model browsers, which present the model on its own terms, ours is informed by the process of conducting early-stage humanities research. Our article thus also demonstrates the conceptual conversions—in terms of both design and process—that interdisciplinary collaboration necessarily entails. In making these conversions explicit, and exploring the implications of their successes and failures, we take up the call, as voiced by Johanna Drucker (Humanities approaches to graphical display. Digital Humanities Quarterly, 5(1), 2011), to resist the ‘intellectual Trojan horse’ of visualization. We seek to model a new mode of interdisciplinary inquiry, one that brings the methodological emphasis of the digital humanities to bear on the practices of humanities research and computer science alike.", "article_title": "Exploratory Thematic Analysis for Digitized Archival Collections", "authors": [{"given": " Lauren F.", "family": "Klein", "affiliation": [{"original_name": "Georgia Institute of Technology, School of Literature, Media, and Communication, USA", "normalized_name": "Georgia Institute of Technology", "country": "United States", "identifiers": {"ror": "https://ror.org/01zkghx44", "GRID": "grid.213917.f"}}]}, {"given": " Jacob", "family": "Eisenstein", "affiliation": [{"original_name": "Georgia Institute of Technology, School of Interactive Computing, USA", "normalized_name": "Georgia Institute of Technology", "country": "United States", "identifiers": {"ror": "https://ror.org/01zkghx44", "GRID": "grid.213917.f"}}]}, {"given": " Iris", "family": "Sun", "affiliation": [{"original_name": "Georgia Institute of Technology, School of Literature, Media, and Communication, USA", "normalized_name": "Georgia Institute of Technology", "country": "United States", "identifiers": {"ror": "https://ror.org/01zkghx44", "GRID": "grid.213917.f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2015", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "30", "issue": "suppl 1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}