{"url": "http://dx.doi.org/10.1093/llc/fqx008", "identifier": {"string_id": "10.1093/llc/fqx008", "id_scheme": "DOI"}, "abstract": "Universities around the world have increasingly turned to digital infrastructures as a way to revamp the arts and humanities. This article contributes a fresh understanding by examining the material development of HumlabX, a research laboratory for digital humanities at Umeå University, Sweden. Specifically, we approach the empirical case as a timeline of research funding, projects, events, and deliverables to examine how the research laboratory as an organizational and material space developed and evolved in relation to new technology investments. Based on our analysis, we argue that while digital research infrastructures can, indeed, stimulate innovation in and around research, aimed to produce new knowledge, digital technologies carry social and material implications that affect organizational processes. We show that while knowledge production processes at HumlabX were highly influenced by the infrastructural legacy of the past, they indeed directed scholars toward innovation. By discussing these implications in detail, we move beyond the debate of humanities qua digital, and demonstrate the need for scholars of digital humanities to engage in the development of policies for digital research infrastructures. Using a Swedish case study, we argue that research laboratories for the digital humanities must be scrutinized and should be fully exposed as socio-material organizations that develop, and should develop, over time. In particular, we stress the need to ensure that digital humanities laboratories are sustainable and open for redevelopment.", "article_title": "Beyond humanities qua digital: Spatial and material development for digital research infrastructures in HumlabX1", "authors": [{"given": " Anna", "family": "Foka", "affiliation": [{"original_name": "Humlab, Umeå University, Sweden", "normalized_name": "Umeå University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/05kb8h459", "GRID": "grid.12650.30"}}, {"original_name": "Pufendorf Institute, Lund University, Sweden", "normalized_name": "Lund University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/012a77v79", "GRID": "grid.4514.4"}}]}, {"given": " Anna", "family": "Misharina", "affiliation": [{"original_name": "Humlab, Umeå University, Sweden", "normalized_name": "Umeå University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/05kb8h459", "GRID": "grid.12650.30"}}]}, {"given": " Viktor", "family": "Arvidsson", "affiliation": [{"original_name": "Department of Informatics, University of Oslo, Norway", "normalized_name": "University of Oslo", "country": "Norway", "identifiers": {"ror": "https://ror.org/01xtthb56", "GRID": "grid.5510.1"}}]}, {"given": " Stefan", "family": "Gelfgren", "affiliation": [{"original_name": "Humlab, Umeå University, Sweden", "normalized_name": "Umeå University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/05kb8h459", "GRID": "grid.12650.30"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}