{"url": "http://dx.doi.org/10.1093/llc/fqu001", "identifier": {"string_id": "10.1093/llc/fqu001", "id_scheme": "DOI"}, "abstract": "We describe, evaluate, and improve the automatic annotation of diachronic corpora at the levels of word-class, lemma, chunks, and dependency syntax. As corpora we use the ARCHER corpus (texts from 1600 to 2000) and the ZEN corpus (texts from 1660 to 1800). Performance on Modern English is considerably lower than on Present Day English (PDE). We present several methods that improve performance. First we use the spelling normalization tool VARD to map spelling variants to their PDE equivalent, which improves tagging. We investigate the tagging changes that are due to the normalization and observe improvements, deterioration, and missing mappings. We then implement an optimized version, using VARD rules and preprocessing steps to improve normalization. We evaluate the improvement on parsing performance, comparing original text, standard VARD, and our optimized version. Over 90% of the normalization changes lead to improved parsing, and 17.3% of all 422 manually annotated sentences get a net improved parse. As a next step, we adapt the parser’s grammar, add a semantic expectation model and a model for prepositional phrases (PP)-attachment interaction to the parser. These extensions improve parser performance, marginally on PDE, more considerably on earlier texts—2—5% on PP-attachment relations (e.g. from 63.6 to 68.4% and from 70 to 72.9% on 17th century texts). Finally, we briefly outline linguistic applications and give two examples: gerundials and auxiliary verbs in the ZEN corpus, showing that despite high noise levels linguistic signals clearly emerge, opening new possibilities for large-scale research of gradient phenomena in language change.", "article_title": "Parsing early and late modern English corpora", "authors": [{"given": " Gerold", "family": "Schneider", "affiliation": [{"original_name": "English Department, University of Zurich, Switzerland", "normalized_name": "University of Zurich", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02crff812", "GRID": "grid.7400.3"}}]}, {"given": " Hans Martin", "family": "Lehmann", "affiliation": [{"original_name": "English Department, University of Zurich, Switzerland", "normalized_name": "University of Zurich", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02crff812", "GRID": "grid.7400.3"}}]}, {"given": " Peter", "family": "Schneider", "affiliation": [{"original_name": "English Department, University of Zurich, Switzerland", "normalized_name": "University of Zurich", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02crff812", "GRID": "grid.7400.3"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014-02-07", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "30", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}