{"url": "http://dx.doi.org/10.1093/llc/fqx005", "identifier": {"string_id": "10.1093/llc/fqx005", "id_scheme": "DOI"}, "abstract": "This article highlights shared methods, questions, and challenges between Research Through Design (RtD) and Digital Humanities (DH) through the discussion of an archival research project. In DH, debates continue e.g. in (Gold, Debates in the Digital Humanities. University of Minnesota Press, 2012) regarding the impact of digital technologies on epistemology, methodology, and our professional identities as researchers, scholars, academics, and teachers. Our reading of this debate is that there is a tripartite relationship between the kind of work we should call DH (and aspire to produce), the nature of DH knowledge, research and scholarship (particularly regarding the role of artefacts produced), and issues of disciplinary orientation or professional identity. We could phrase these as the what, how, and who of DH and, of course, RtD. The discussion of our project is in no sense intended to provide an exclusive answer to those questions, but to give one snapshot of what DH and RtD may look like when they come together. We emphasize that this relationship can and will be productive for both disciplines and point to the lack of significant discussion hereto.", "article_title": "Research through design and digital humanities in practice: What, how and who in an archive research project", "authors": [{"given": " Tom", "family": "Schofield", "affiliation": [{"original_name": "Culture Lab, School of Arts and Cultures, Newcastle University, UK", "normalized_name": "University of Newcastle Australia", "country": "Australia", "identifiers": {"ror": "https://ror.org/00eae9z71", "GRID": "grid.266842.c"}}]}, {"given": " Mitchell", "family": "Whitelaw", "affiliation": [{"original_name": "School of Art and Design, Australian National University, Canberra, Australia", "normalized_name": "Australian National University", "country": "Australia", "identifiers": {"ror": "https://ror.org/019wvm592", "GRID": "grid.1001.0"}}]}, {"given": " David", "family": "Kirk", "affiliation": [{"original_name": "Faculty of Engineering and Environment, Northumbria University, UK", "normalized_name": "Northumbria University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/049e6bc10", "GRID": "grid.42629.3b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2017", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "32", "issue": "suppl_1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}