{"url": "http://dx.doi.org/10.1145/2499931.2499933", "identifier": {"string_id": "10.1145/2499931.2499933", "id_scheme": "DOI"}, "abstract": "Digital gaming and digital technologies have their own unique cultural history while at the same time, the cultural heritage of digital technology is emerging. Digital technology has been understood as merely an apparatus that can be utilized for transferring nondigital historical content to novel digital products. These products, including types such as multimedia shows, games, Web sites, and online course environments, are targeted at juvenile audiences, who are typically considered to be the primary users of such new media forms. For decades, the changes and new continuities in both mediated content and the technology of mediation were mostly hidden in the shadow of educational goal-attainment. This article draws inspiration from ideas on media archaeology and the cultures of history. In this article we suggest an approach of internal and external cultural heritage of games cultures. We introduce a four-fold table regarding the relationship between cultural heritage (or history) and digital technology. The four-fold table consists of the dimension of a researcher's comprehensive/applied goal-attainment and the dimension of the internality/externality of history and cultural heritage in regard to the digital game cultural context. Within these cultures, there are several alternative ways of discussing the relationship between history, cultural heritage, and digital technology, separate from the traditional edutainment perspective. The dimensions are illustrated with practical examples, including a typologization of historiographical computer games, retrogaming, and educational workshops on game classics.", "article_title": "Gaming legacy? four approaches to the relation between cultural heritage and digital technology", "authors": [{"given": "Jaakko", "family": "Suominen", "affiliation": [{"original_name": "University of Turku, Pori, Finland", "normalized_name": "University of Turku", "country": "Finland", "identifiers": {"ror": "https://ror.org/05vghhr25", "GRID": "grid.1374.1"}}]}, {"given": "Anna", "family": "Sivula", "affiliation": [{"original_name": "University of Turku, Pori, Finland", "normalized_name": "University of Turku", "country": "Finland", "identifiers": {"ror": "https://ror.org/05vghhr25", "GRID": "grid.1374.1"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2013", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "6", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}