{"url": "http://dx.doi.org/10.1145/2700422", "identifier": {"string_id": "10.1145/2700422", "id_scheme": "DOI"}, "abstract": "The microscopic description of ancient pottery is widely used for the fabric definition, classification and provenance assessment. In most cases, however, the description is qualitative. An improvement of the study of archaeological pottery needs a more objective approach with quantitative analysis. In classical scientific literature, the structural features and mineralogical composition of pottery are carried out on thin sections by means of transmitted polarized light microscope. The determination were obtained through observations with and without cross polarizator (nicols). The quantitative measurements are normally achieved with tedious and time consuming table with point counter. In this article the attention has been focused on the automatic identification of structural and textural components of the potteries through optical microscopy. Image analysis techniques have been then used to automatically classify the image components. Results confirm the effectiveness of the proposed approach: petrographic data collection becomes faster with respect to the traditional method providing also quantitative information useful for fabric recognition.", "article_title": "Automatic Extraction of Petrographic Features from Pottery of Archaeological Interest", "authors": [{"given": "Giovanni", "family": "Puglisi", "affiliation": [{"original_name": "Dipartimento di Matematica e Informatica, University of Cagliari, Italy", "normalized_name": "University of Cagliari", "country": "Italy", "identifiers": {"ror": "https://ror.org/003109y17", "GRID": "grid.7763.5"}}]}, {"given": "Filippo", "family": "Stanco", "affiliation": [{"original_name": "Dipartimento di Matematica e Informatica, University of Catania, Italy", "normalized_name": "University of Catania", "country": "Italy", "identifiers": {"ror": "https://ror.org/03a64bh57", "GRID": "grid.8158.4"}}]}, {"given": "Germana", "family": "Barone", "affiliation": [{"original_name": "Dipartimento di Scienze Biologiche, Geologiche e Ambientali, University of Catania, Italy", "normalized_name": "University of Catania", "country": "Italy", "identifiers": {"ror": "https://ror.org/03a64bh57", "GRID": "grid.8158.4"}}]}, {"given": "Paolo", "family": "Mazzoleni", "affiliation": [{"original_name": "Dipartimento di Scienze Biologiche, Geologiche e Ambientali, University of Catania, Italy", "normalized_name": "University of Catania", "country": "Italy", "identifiers": {"ror": "https://ror.org/03a64bh57", "GRID": "grid.8158.4"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2015", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "8", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}