{"url": "http://dx.doi.org/10.1093/llc/fqz029", "identifier": {"string_id": "10.1093/llc/fqz029", "id_scheme": "DOI"}, "abstract": "Many classical texts are available in multiple versions that almost always differ from each other due to transcription error and editorial discretion. One of the central challenges in the study of such texts is the preparation of a ‘synoptic’ text: an aligned presentation of the various versions in which corresponding words or phrases, even if not identical, are mapped to each other. Multiple text alignment of this sort must take into account orthographic and conceptual relationships between words. In this article, we define this text alignment problem as an optimization problem by providing a formal measure of alignment quality. Unlike previous measures, our measure uses word embeddings to take into account conceptual similarity between aligned words. We propose an efficient and scalable alignment method in accordance with the proposed criteria. This method splits the texts to be aligned into smaller subtexts, thus improving both efficiency and accuracy. Empirical comparisons on sample data indicate our method is significantly faster than existing methods, often rendering intractable problems tractable, and that the alignment obtained by our method is considerably better than that obtained by other methods.", "article_title": "FAST: Fast and Accurate Synoptic Texts", "authors": [{"given": " Oran", "family": "Brill", "affiliation": [{"original_name": "Department of Computer Science, Bar-Ilan University, Israel", "normalized_name": "Bar-Ilan University", "country": "Israel", "identifiers": {"ror": "https://ror.org/03kgsv495", "GRID": "grid.22098.31"}}]}, {"given": " Moshe", "family": "Koppel", "affiliation": [{"original_name": "Department of Computer Science, Bar-Ilan University, Israel", "normalized_name": "Bar-Ilan University", "country": "Israel", "identifiers": {"ror": "https://ror.org/03kgsv495", "GRID": "grid.22098.31"}}]}, {"given": " Avi", "family": "Shmidman", "affiliation": [{"original_name": "Department of Hebrew Literature, Bar-Ilan University, Israel", "normalized_name": "Bar-Ilan University", "country": "Israel", "identifiers": {"ror": "https://ror.org/03kgsv495", "GRID": "grid.22098.31"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "35", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}