{"url": "http://dx.doi.org/10.1093/llc/fqu055", "identifier": {"string_id": "10.1093/llc/fqu055", "id_scheme": "DOI"}, "abstract": "Structural similarities across narratives play an important role in many areas of humanities research. In this article, we describe a methodology and an implementation to uncover such similarities automatically in two application scenarios. In both scenarios—ritual and folktale studies—existing research examines similarities of narratives on a structural level and discusses structural principles that govern the combination of individual events to tales or rituals. We present a largely unsupervised and fully automated alignment-based approach for the detection of structural similarities of narratives that allows for data-driven quantitative studies of narrative structure. Our approach makes use of an adaptable, computational linguistic processing architecture that creates integrated discourse representations of events, participants, and their relations. Our contributions are twofold and crucially build on the automatically constructed discourse representations: (1) We examine different ‘semantics-driven cross-document alignment’ algorithms that determine (sequences of) events shared between narratives, to support the search for recurrent elements in their structure. The alignment algorithms are evaluated in two experiments. (2) We develop ‘tools for exploration and interpretation’ that we offer to humanities researchers for investigation of the analyzed data. These include search facilities, visualizations, statistical overviews, and a graph-based algorithm that identifies densely aligned regions across documents for targeted inspection.", "article_title": "An NLP-based cross-document approach to narrative structure discovery", "authors": [{"given": " Nils", "family": "Reiter", "affiliation": [{"original_name": "Heidelberg University, Germany", "normalized_name": "Heidelberg University", "country": "Germany", "identifiers": {"ror": "https://ror.org/038t36y30", "GRID": "grid.7700.0"}}]}, {"given": " Anette", "family": "Frank", "affiliation": [{"original_name": "Heidelberg University, Germany", "normalized_name": "Heidelberg University", "country": "Germany", "identifiers": {"ror": "https://ror.org/038t36y30", "GRID": "grid.7700.0"}}]}, {"given": " Oliver", "family": "Hellwig", "affiliation": [{"original_name": "Heidelberg University, Germany", "normalized_name": "Heidelberg University", "country": "Germany", "identifiers": {"ror": "https://ror.org/038t36y30", "GRID": "grid.7700.0"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}