{"url": "http://dx.doi.org/10.1093/llc/18.2.139", "identifier": {"string_id": "10.1093/llc/18.2.139", "id_scheme": "DOI"}, "abstract": "Karl Lachmann's edition from 1833 still provides the basis for Parzival scholarship. Although the text has subsequently been revised in parts, a fundamentally new edition considering all extant manuscripts is required. Computer technology offers means for tackling this task in an effective and reliable manner. A critical electronic edition will give access to the manuscript material, which may be published stage by stage, corresponding to different sections of the text. Such an edition will allow users to consult a base text, electronically linked to an apparatus of variants, to manuscript transcriptions, and to facsimiles. Browsing among these components, readers will experience the extent to which the Parzival romance was open to textual variance in the course of its transmission (an aspect stressed by theories of the so‐called ‘New Philology’). Furthermore, new stemmatological methods borrowed from evolutionary biology (phylogeny) will provide insight into manuscript groupings that may reflect early textual versions that relate to the semi‐oral status of vernacular literary culture. Thus, an electronic edition will be the essential prerequisite of any new Parzival book edition. But it also constitutes an edition in its own right, revealing the discursive and visual richness of medieval text traditions and involving the readers in the editorial process.", "article_title": "New Philology and New Phylogeny: Aspects of a Critical Electronic Edition of Wolfram's Parzival", "authors": [{"given": "M.", "family": "Stolz", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "18", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}