{"identifier": {"string_id": "10.16995/dm.68", "id_scheme": "DOI"}, "abstract": "The cultural heritage of medieval Sicily faces enormous challenges. Rich and diverse as it is, it is beset by numerous problems that have rendered it fragile and often inaccessible. The situation is such that many sites are unsigned. Others are very difficult to get to. And even others – ones that are more easily located – have erratic hours, essentially locking out the average visitor to Sicily unless s/he is willing to invest the time and have the language skills necessary to persuade residents in the surrounding area to get the access keys.Given these challenges, we are developing The Norman Sicily Project to document the cultural heritage of medieval Sicily during its Norman period (in other words, c. 1061–1194) so that a wide audience can learn about what was once there and what still remains. The site attempts to reconstruct what we know about the society by bringing together images, basic identifying information, geolocation data and, in some cases, videos, using modern web development techniques. It also offers genealogical information and visualization tools that can help visitors understand the data in new ways as well as sustainability data related to the monuments’ physical states. The intention is that the project will offer scholars, students and the general public who are interested in Norman Sicily the opportunity to learn from and collaborate with each other while suggesting a web-based model for other medieval communities.", "article_title": "The Norman Sicily Project: A Digital Portal to Sicily’s Norman Past", "authors": [{"given": "Dawn Marie", "family": "Hayes", "affiliation": [{"original_name": "Montclair State University", "normalized_name": "Montclair State University", "country": "United States", "identifiers": {"ror": "https://ror.org/01nxc2t48", "GRID": "grid.260201.7"}}]}, {"given": "Joseph", "family": "Hayes", "affiliation": [{"original_name": "Stardog Union", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Open Library of the Humanities", "date": "2019", "keywords": null, "journal_title": "Digital Medievalist", "volume": "12", "issue": "1", "ISSN": [{"value": "1715-0736", "type": "electronic"}], "url": "http://dx.doi.org/10.16995/dm.68"}