{"url": "http://dx.doi.org/10.1093/llc/fqv013", "identifier": {"string_id": "10.1093/llc/fqv013", "id_scheme": "DOI"}, "abstract": "This article presents the ‘Roman City Ruleset’, a suite of procedural rules for creating 3D models of Roman and Hellenistic architecture and urban environments. Unlike traditional 3D modeling software, in which the user directly manipulates polygons to simulate form, procedural modeling entails the use of computer programming languages to write a semantic description of a building that then generates a polygonal model. Procedural modeling has the potential to address a number of issues related to 3D archaeological reconstructions which are of concern to digital humanists. Of particular interest for archaeologists and architectural historians is the ability to test hypothetical reconstructions of ancient architecture in a fully realized urban context. The procedural rules link each iteration of a model to its source material, allowing the degree of certainty present in each model to be accurately defined through the documentation of each step in the process of interpreting a given data set. Procedural modeling enhances the scholarly value of architectural reconstructions by providing a platform for the comparison and refutation of 3D visualizations, and advances the methodology of 3D modeling toward becoming an essential part of the digital humanist’s toolkit.", "article_title": "An Integrated Approach to the Procedural Modeling of Ancient Cities and Buildings", "authors": [{"given": " Marie", "family": "Saldaña", "affiliation": [{"original_name": "UCLA, Los Angeles, California", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2015-06-18", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "30", "issue": "suppl 1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}