{"url": "http://dx.doi.org/10.16995/dscn.41", "identifier": {"string_id": "10.16995/dscn.41", "id_scheme": "DOI"}, "abstract": "Digital Humanities is getting a lot of attention! But do they exist as a community, unified and consistent? Is this community’s government balanced and democratic? Up to now, no study has explored such a community by investigating its members, looking at them through the prism of multilingualism and geography. The \"Who are you, Digital Humanists?\" survey, conducted after THATCamp Luxembourg (Terras 2012b) and promoted at DH2012 (Hambourg), provided an incomplete, though already significant, sample of 850 people who accepted to answer a questionnaire. The survey found a highly mixed linguistic and geographic profile, the existence of outsiders who either were not aware of the study or did not pay attention to it, the marginalization of English as a first language, and the dominance of English as a second language. It showed that Digital Humanities are strongly influenced by History and Classical Studies, but have little or no bearing on disciplines concerned with today’s world, on the one hand, and with Web sciences, data mining and text mining, on the other hand. A major event on cultural diversity, the Digital Humanities 2012, was governed by Europe and North America, namely the United Kingdom and its former colonies (Ireland, Canada, the United States and Australia). The Anglophone community strikes again, it appears. In order to measure progress in the diversity of the power of our community, this paper proposes the creation of an indicator, the Digital Humanities Decision Power (DHDP), which measures the gap between the various groups of Digital Humanists and their power in the field and the scientific selection procedures. On the basis of this indicator, a collective debate is necessary to make our community more responsive to linguistic and geographic diversity. We call this the Finnish Sauna strategy.", "article_title": "La stratégie du sauna finlandais: Les frontières des Digital Humanities", "authors": [{"given": "Marin", "family": "Dacos", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Open Library of the Humanities", "date": "2017", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "0", "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}