{"url": "http://dx.doi.org/10.1093/llc/fqu049", "identifier": {"string_id": "10.1093/llc/fqu049", "id_scheme": "DOI"}, "abstract": "In this article, we focus on the problem of verifying Saikaku Ihara’s authorship, especially for Yorozu no humihougu (万の文反古), a posthumous work. Saikaku Ihara (井原西鶴) (c. 1642–93) is one of the most famous writers of the Edo period (1603–1868) in Japan. Saikaku's works are known for their significance for developing Japanese novels today. For a long time, researchers have tried to identify Saikaku’s works by investigating the history, content, format, and other features. However, it remained unclear which works were really written by Saikaku. Meanwhile, the potential of quantitative analysis of textual data has dramatically advanced. To resolve Saikaku’s authorship problem, our laboratory worked with Saikaku researchers to develop a database of works attributed to Saikaku. Based on these new capabilities, we examined Yorozu no humihougu (万の文反古) using quantitative analysis. In this study, we compared Yorozu no humihougu (万の文反古) and Kousyoku ichidai otoko (好色一代男), which has been verified to be a work of Saikaku. We examined six grammatical categories using principal component analysis where significant differences were found. Yorozu no humihougu (万の文反古) was revealed to be characterized as having a higher frequency of verbs and a lower frequency of particles than in Kousyoku ichidai otoko (好色一代男).", "article_title": "Verifying the authorship of Saikaku Ihara’s work in early modern Japanese literature; a quantitative approach", "authors": [{"given": " Ayaka", "family": "Uesaka", "affiliation": [{"original_name": "Graduate School of Culture and Information Science, Doshisha University, Kyoto City, Japan", "normalized_name": "Doshisha University", "country": "Japan", "identifiers": {"ror": "https://ror.org/01fxdkm29", "GRID": "grid.255178.c"}}]}, {"given": " Masakatsu", "family": "Murakami", "affiliation": [{"original_name": "Faculty of Culture and Information science, Doshisha University, Kyoto City, Japan", "normalized_name": "Doshisha University", "country": "Japan", "identifiers": {"ror": "https://ror.org/01fxdkm29", "GRID": "grid.255178.c"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "30", "issue": "4", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}