{"url": "http://dx.doi.org/10.1145/3012289", "identifier": {"string_id": "10.1145/3012289", "id_scheme": "DOI"}, "abstract": "The increasing demand of technological facilities for galleries, museums, and archives has led to the need for designing practical and effective solutions for managing the digital life cycle of cultural heritage collections. These facilities have to support users in addressing several challenges directly related to the creation, management, preservation, and visualization of digital collections. Such challenges include, for example, the support for a collaborative management of the produced information, their curation from a multilingual perspective to break the language barriers and make collections available to different stakeholders, and the development of services for exposing structured version of data both to users and machines. Platforms satisfying all of these requirements have to support curators activities and, at the same time, provide facilities for engaging the virtual consumers of the produced data. In this article, we propose a description of an abstract architecture for managing digital collections built on a set of components, services, and APIs able to address the challenges mentioned previously. An instantiation of this architecture is discussed, and we present a use case concerning the management of a digital archive of verbo-visual art. Lessons learned from this experience are reported to outline future activities.", "article_title": "A Knowledge Management Architecture for Digital Cultural Heritage", "authors": [{"given": "Mauro", "family": "Dragoni", "affiliation": [{"original_name": "Fondazione Bruno Kessler", "normalized_name": "Fondazione Bruno Kessler", "country": "Italy", "identifiers": {"ror": "https://ror.org/01j33xk10", "GRID": "grid.11469.3b"}}]}, {"given": "Sara", "family": "Tonelli", "affiliation": [{"original_name": "Fondazione Bruno Kessler", "normalized_name": "Fondazione Bruno Kessler", "country": "Italy", "identifiers": {"ror": "https://ror.org/01j33xk10", "GRID": "grid.11469.3b"}}]}, {"given": "Giovanni", "family": "Moretti", "affiliation": [{"original_name": "Fondazione Bruno Kessler", "normalized_name": "Fondazione Bruno Kessler", "country": "Italy", "identifiers": {"ror": "https://ror.org/01j33xk10", "GRID": "grid.11469.3b"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2017-07-31", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "10", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}