{"url": "http://dx.doi.org/10.1145/1551676.1551679", "identifier": {"string_id": "10.1145/1551676.1551679", "id_scheme": "DOI"}, "abstract": "In the last few years, the number of projects involving historical reconstruction has increased significantly. Recent technologies have proven a powerful tool for a better understanding of our cultural heritage through which to attain a glimpse of the environments in which our ancestors lived. However, to accomplish such a purpose, these reconstructions should be presented to us as they may really have been perceived by a local inhabitant, according to the illumination and materials used back then and, equally important, the characteristics of the human visual system.The human visual system has a remarkable ability to adjust itself to almost all everyday scenarios. This is particularly evident in extreme lighting conditions, such as bright light or dark environments. However, a major portion of the visible spectra captured by our visual system cannot be represented in most display devices. High dynamic range imagery is a field of research which is developing techniques to correct such inaccuracies. This new viewing paradigm is perfectly suited for archaeological interpretation, since its high contrast and chromaticity can present us with an enhanced viewing experience, closer to what an inhabitant of that era may have seen.In this article we present a case study of the reconstruction of a Roman site. We generate high dynamic range images of mosaics and frescoes from one of the most impressive monuments in the ruins of Conimbriga, Portugal, an ancient city of the Roman Empire. To achieve the requisite level of precision, in addition to having a precise geometric 3D model, it is crucial to integrate in the virtual simulation authentic physical data of the light used in the period under consideration. Therefore, in order to create a realistic physical-based environment, we use in our lighting simulations real data obtained from simulated Roman luminaries of that time.", "article_title": "High dynamic range—a gateway for predictive ancient lighting", "authors": [{"given": "Alexandrino", "family": "Gonçalves", "affiliation": [{"original_name": "Research Center for Informatics and Communications of the Polytechnic Institute of Leiria, Portugal", "normalized_name": "Instituto Politécnico de Leiria", "country": "Portugal", "identifiers": {"ror": "https://ror.org/010dvvh94", "GRID": "grid.36895.31"}}]}, {"given": "Luís", "family": "Magalhães", "affiliation": [{"original_name": "University of Trás-os-Montes and Alto Douro", "normalized_name": "University of Trás-os-Montes and Alto Douro", "country": "Portugal", "identifiers": {"ror": "https://ror.org/03qc8vh97", "GRID": "grid.12341.35"}}, {"original_name": "Institute for Systems and Computer Engineering of Porto, Portugal", "normalized_name": "Institute for Systems and Computer Engineering of Porto", "country": "Portugal", "identifiers": {"ror": "https://ror.org/05fa8ka61", "GRID": "grid.20384.3d"}}]}, {"given": "João", "family": "Moura", "affiliation": [{"original_name": "University of Trás-os-Montes and Alto Douro, Knowledge Engineering and Decision Support Research Center, Portugal", "normalized_name": "University of Trás-os-Montes and Alto Douro", "country": "Portugal", "identifiers": {"ror": "https://ror.org/03qc8vh97", "GRID": "grid.12341.35"}}]}, {"given": "Alan", "family": "Chalmers", "affiliation": [{"original_name": "The Digital Laboratory, WMG, University of Warwick, UK", "normalized_name": "University of Warwick", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01a77tt86", "GRID": "grid.7372.1"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2009-07-21", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "2", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}