{"url": "http://dx.doi.org/10.1093/llc/fqs018", "identifier": {"string_id": "10.1093/llc/fqs018", "id_scheme": "DOI"}, "abstract": "Those working within the academy are drawing collaborations, both within and across their home institutions, to undertake increasingly complex and sophisticated research questions, a trend supported by the granting agencies. Advances in computers and telecommunications have facilitated these collaborations by allowing teams to recruit the right person and expertise, regardless of location. To ensure that they are able to achieve their research objectives, these teams must find methods and means to maximize the benefits associated generally with collaboration while minimizing challenges and to also address those challenges more specifically associated with the geographical, linguistic and cultural diversity. This article contributes to this understanding by reporting on interviews conducted with individuals with experience in teams that cross geographical, linguistic and cultural boundaries and focus on understanding the benefits and challenges associated with collaboration with membership and the strategies used to strengthen them. Whereas these teams benefit from these collaborations, they experience many challenges, including language and cultural differences, differing access to and comfort levels with technology, and often conflicting requirements from funding agencies and stakeholders. These teams have devised strategies at project and individual levels, with clearly articulated project plans, project liaisons, flexibility and other soft and language skills, multiple communication channels, and others, to mitigate these challenges. The article concludes with recommendations for funders, projects and individuals.", "article_title": "A trip around the world: Accommodating geographical, linguistic and cultural diversity in academic research teams", "authors": [{"given": " Lynne", "family": "Siemens", "affiliation": [{"original_name": "School of Public Administration, University of Victoria, Canada", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": " Elisabeth", "family": "Burr", "affiliation": [{"original_name": "Universität Leipzig, Institut für Romanistik, Germany", "normalized_name": "Leipzig University", "country": "Germany", "identifiers": {"ror": "https://ror.org/03s7gtk40", "GRID": "grid.9647.c"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}