{"url": "http://dx.doi.org/10.1093/llc/fqy013", "identifier": {"string_id": "10.1093/llc/fqy013", "id_scheme": "DOI"}, "abstract": "Based on n text excerpts, the authorship linking task is to determine a way to link pairs of documents written by the same person together. This problem is closely related to authorship attribution questions, and its solution can be used in the author clustering task. However, no training information is provided and the solution must be unsupervised. To achieve this, various text representation strategies can be applied, such as characters, punctuation symbols, or letter n-grams as well as words, lemmas, Part-Of-Speech (POS) tags, and sequences of them. To estimate the stylistic distance (or similarity) between two text excerpts, different measures have been suggested based on the L1 norm (e.g. Manhattan, Tanimoto), the L2 norm (e.g. Matusita), the inner product (e.g. Cosine), or the entropy paradigm (e.g. Jeffrey divergence). From those possible implementations, it is not clear which text representation and distance functions produce the best performance, and this study provides an answer to this question. Three corpora, extracted from French and English literature, have been evaluated using standard methodology. Moreover, we suggest an additional performance measure called high precision (HPrec) capable of judging the quality of a ranked list of links to provide only correct answers. No systematic difference can be found between token- or lemma-based text representations. Simple POS tags do not provide an effective solution but short sequences of them form a good text representation. Letter n-grams (with n = 4–6) give high HPrec rates. As distance measures, this study found that the Tanimoto, Matusita, and Clark distance measures perform better than the often-used Cosine function. Finally, applying a pruning procedure (e.g. culling terms appearing once or twice or limiting the vocabulary to the 500 most frequent words) reduces the representation complexity and might even improve the effectiveness of the attribution scheme.", "article_title": "Evaluation of text representation schemes and distance measures for authorship linking", "authors": [{"given": " Mirco", "family": "Kocher", "affiliation": [{"original_name": "University of Neuchatel, Switzerland", "normalized_name": "University of Neuchâtel", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/00vasag41", "GRID": "grid.10711.36"}}]}, {"given": " Jacques", "family": "Savoy", "affiliation": [{"original_name": "University of Neuchatel, Switzerland", "normalized_name": "University of Neuchâtel", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/00vasag41", "GRID": "grid.10711.36"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}