{"url": "http://dx.doi.org/10.1093/llc/fqs031", "identifier": {"string_id": "10.1093/llc/fqs031", "id_scheme": "DOI"}, "abstract": "It has been an accepted notion that ‘inter-textuality’ is the basis of all communication. Games, inasmuch as they use semiotic systems, are no exception. At the same time the special rhetorical use of specific references and allusions to other texts, particularly in literature, is also an established fact. It is however, quite surprising to find rhetorical inter-textuality in computer games, even in single player action of the shooting type, because of the demands such games make on the player’s time and attention. Following a theoretical grounding in theories of allusion (Ben-Porat, 1976, 1978) and game theory (Aarseth, 1997, 1999, 2005a,b, 2006, 2012), the article presents six distinct types of rhetorical allusions, discussing them in relation to the narrativity level of the game to which they belong, to the source text position vis-à-vis the game, and to published evidence concerning the identification of such literary canonic traces and reflections on their contribution to the game. The results are hardly surprising, but still interesting. Game-produced narratives are not literary, certainly not literary inter-textual texts. Consequently, although there are numerous inter-textual relations between computer games and canonic, as well as popular literary texts, very few of them can be actualized as rhetorical allusions, and even less will. They are not treated as such by those who use them, though their authors may think and act otherwise. Neither triggers nor a high concentration of narrative elements effects actualizations. Significantly, gamers’ behavior is not different from that of average readers and the nature of the triggers is typical of contemporary culture: they consist of minimal cultural units, former attributes of canonic works that have become detached from and independent of their sources.", "article_title": "Allusive inter-textuality in computer games", "authors": [{"given": " Ziva", "family": "Ben-Porat", "affiliation": [{"original_name": "The Porter Institute for Poetics and Semiotics, Tel Aviv University, Israel", "normalized_name": "Tel Aviv University", "country": "Israel", "identifiers": {"ror": "https://ror.org/04mhzgx49", "GRID": "grid.12136.37"}}, {"original_name": "Department of Culture, Creation and Production, Sapir Academic College, Israel", "normalized_name": "Sapir College", "country": "Israel", "identifiers": {"ror": "https://ror.org/04hwjfc40", "GRID": "grid.430165.5"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "27", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}