{"url": "http://dx.doi.org/10.1093/llc/fqq027", "identifier": {"string_id": "10.1093/llc/fqq027", "id_scheme": "DOI"}, "abstract": "Moving from a traditional dialect geography research methodology to one in which data are processed electronically, and where visualization is used as a research tool, can be of great benefit to dialect geography. A working environment offering full support for using visualization as a research tool could take dialect geography into the era of e-Science. Despite the advent of electronic data processing, electronic publishing and Geographic Information Systems (GIS), an analysis of the most important computerized tools for dialect geography research suggests that there is little support for the use of modern data mining and analysis techniques connected to visualization for the analysis and interpretation of dialect data. In this article, we use the electronic publication of two major dialect dictionaries to illustrate the value of visualization as a research tool by showing how visual data mining and combining dialect data with independent data sets applies to dialect geography research. We argue that there is no need for large-scale software development because visualization, as a research tool, is supported to a large extent by geo-browsers such as ‘Google Earth’, which make it possible to flexibly combine and visualize different types of geo-referenced data.", "article_title": "Visualization as a research tool for dialect geography using a geo-browser", "authors": [{"given": " Folkert", "family": "de Vriend", "affiliation": [{"original_name": "Radboud University, Centre for Language and Speech Technology, Nijmegen, The Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Lou", "family": "Boves", "affiliation": [{"original_name": "Radboud University, Centre for Language and Speech Technology, Nijmegen, The Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Roeland", "family": "van Hout", "affiliation": [{"original_name": "Radboud University, Centre for Language Studies, Nijmegen, The Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Jos", "family": "Swanenberg", "affiliation": [{"original_name": "Tilburg University, Department of Culture Studies, Tilburg, The Netherlands", "normalized_name": "Tilburg University", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/04b8v1s79", "GRID": "grid.12295.3d"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2010", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "26", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}