{"identifier": {"string_id": "10.16995/dm.45", "id_scheme": "DOI"}, "abstract": "Europeana Regia is a project to digitise manuscripts from the Middle Ages and the Renaissance, supported by the European Commission and involving five European libraries. During the project, a qualitative study was conducted to determine and rank the expectations and needs of the current and potential users of medieval manuscripts online. Focus groups were organised in three of the project’s partner libraries. Each focus group was dedicated to one of the user categories primarily targeted in the project: 1) researchers and academics; 2) History, Arts and Applied Arts teachers in high schools; 3) the interested general public.The study has confirmed the considerable interest of researchers and academics in this project, but has also pointed out their demanding standards. Compared to the existing offer on other sites, their requests are less concerned with new functionalities than on how well the tools perform, the speed of access and how exhaustive the information would be. Researchers are accustomed to working on the web and can therefore choose and compare what is on offer in the field of online manuscripts.For high schools teachers, the project is seen as an excellent potential teaching aid, but it would require suggestions for courses, themed presentations, selections (noteworthy pages) and a considerable effort to provide mediation (translated passages, reading in the original language, video conferences by specialists, analyses of pages). It is important to encourage them to browse around, in and through a marked space.Interest in the project is less marked in the interested general public, who would only consult medieval manuscripts and illuminated manuscripts from time to time, often motivated by family or cultural events. The illustrations are the main attraction for this public. Within the interested general public, however, there is one category very interested in the project, already identified among the users of cultural or online libraries: a population of seniors, fascinated by the process of how manuscripts are produced, calligraphy, paleography, etc.", "article_title": "Consultation of manuscripts online: a qualitative study of three potential user categories", "authors": [{"given": "Philippe", "family": "Chevallier", "affiliation": [{"original_name": "Strategy and Research Division, Bibliothèque nationale de France", "normalized_name": "Bibliothèque Nationale de France", "country": "France", "identifiers": {"ror": "https://ror.org/04v1bf639", "GRID": "grid.424105.6"}}]}, {"given": "Laure", "family": "Rioust", "affiliation": [{"original_name": "Associate Director of OUROUK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Laurent", "family": "Bouvier-Ajam", "affiliation": [{"original_name": "Associate Director of OUROUK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Open Library of the Humanities", "date": "2013", "keywords": null, "journal_title": "Digital Medievalist", "volume": "8", "issue": null, "ISSN": [{"value": "1715-0736", "type": "electronic"}], "url": "http://dx.doi.org/10.16995/dm.45"}