{"url": "http://dx.doi.org/10.1093/llc/fqw059", "identifier": {"string_id": "10.1093/llc/fqw059", "id_scheme": "DOI"}, "abstract": "It is widely believed that different parts of a classical Chinese poem vary in syntactic properties. The middle part is usually parallel, i.e. the two lines in a couplet have similar sentence structure and part of speech; in contrast, the beginning and final parts tend to be non-parallel. Imagistic language, dominated by noun phrases evoking images, is concentrated in the middle; propositional language, with more complex grammatical structures, is more often found at the end. We present the first quantitative analysis on these linguistic phenomena—syntactic parallelism, imagistic language, and propositional language—on a treebank of selected poems from the Complete Tang Poems. Written during the Tang Dynasty between the 7th and 9th centuries CE, these poems are often considered the pinnacle of classical Chinese poetry. Our analysis affirms the traditional observation that the final couplet is rarely parallel; the middle couplets are more frequently parallel, especially at the phrase rather than the word level. Further, the final couplet more often takes a non-declarative mood, uses function words, and adopts propositional language. In contrast, the beginning and middle couplets employ more content words and tend toward imagistic language.", "article_title": "Syntactic patterns in classical Chinese poems: A quantitative study", "authors": [{"given": " John", "family": "Lee", "affiliation": [{"original_name": "Department of Linguistics and Translation, City University of Hong Kong, Hong Kong SAR, China", "normalized_name": "City University of Hong Kong", "country": "China", "identifiers": {"ror": "https://ror.org/03q8dnn23", "GRID": "grid.35030.35"}}]}, {"given": " Yin Hei", "family": "Kong", "affiliation": [{"original_name": "Department of Linguistics and Translation, City University of Hong Kong, Hong Kong SAR, China", "normalized_name": "City University of Hong Kong", "country": "China", "identifiers": {"ror": "https://ror.org/03q8dnn23", "GRID": "grid.35030.35"}}]}, {"given": " Mengqi", "family": "Luo", "affiliation": [{"original_name": "Information Retrieval and Knowledge Mining Laboratory, Wuhan University, Wuhan, China", "normalized_name": "Wuhan University", "country": "China", "identifiers": {"ror": "https://ror.org/033vjfk17", "GRID": "grid.49470.3e"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2017", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}