{"url": "http://dx.doi.org/10.1093/llc/fqv021", "identifier": {"string_id": "10.1093/llc/fqv021", "id_scheme": "DOI"}, "abstract": "We look to unlock the verbal code of President Putin and NATO Secretary-General Rasmussen during the Ukrainian crisis. On 18 March 2014, referring to the medieval history of Russia, Putin expressed a vision that invites to explore the role of ancestral mental images as an instance of people with a direct knowledge of spiritual truth. Looking for spiritual truth is often at the edge of words, forcing the speaker to resort to poetic language to convey an inspired message beyond common understanding. Using a fragment of Martindale’s creativity model, we look for indicators of insight (regressive thought, metaphors, dual-coding of images and emotions) in Putin’s and NATO’s speeches over a short take of recent history, December 2013–September 2014. Among obvious results, the annexing of Crimea to the Russian Federation (18 March 2014) sparked new words in both Putin’s and NATO’s speeches. The May 9 ‘Great Victory Day’ also affected Putin’s speeches. After May 9, a visible discontinuity marks the speeches of both Putin and NATO, but in opposite directions. Higher scores of metaphoric thought in Putin contrasts with lower scores in NATO. Finally, the threat index increases moderately in both cases, yet bears no strong relation to the ups or downs of visionary metaphoric thought in either Putin or NATO. The two corpuses contain the words ‘value’ and ‘border’ in plenty, pushing linguistic detection scholars to explore new frontiers.", "article_title": "Deaf sentences1over Ukraine: Mysticism versus ethics", "authors": [{"given": " Robert L.", "family": "Hogenraad", "affiliation": [{"original_name": "Université Catholique de Louvain, Louvain-la-Neuve, Belgium", "normalized_name": "Université Catholique de Louvain", "country": "Belgium", "identifiers": {"ror": "https://ror.org/02495e989", "GRID": "grid.7942.8"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2015-06-24", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "31", "issue": "4", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}