{"url": "http://dx.doi.org/10.1145/3127090", "identifier": {"string_id": "10.1145/3127090", "id_scheme": "DOI"}, "abstract": "The discovery of quasi-crystals has led to a great debate about their unusual structure. The big surprise is that these structures were found in Islamic art several centuries ago. This latest discovery drew the attention of scientists to propose several approaches for the comprehension of these structures by analyzing several quasi-periodic patterns spread around the Islamic world. In this article, we propose a systematic method for generating new quasi-periodic patterns inspired by existing Islamic historical patterns. The method builds Islamic quasi-periodic patterns based on a quasi-periodic tiling and a few intuitive parameters. Given a quasi-periodic tiling, the method divides its tiles (rhombs) into symmetric right triangles and constructs their template motifs. The construction of these template motifs is achieved by a systematic and well-organized process. The content of the tiles is obtained by applying mirror reflections to the constructed template motifs. Finally, the pattern is drawn by putting the content of the constructed tiles in the tiling. To show the effectiveness of this generative method, examples of new quasi-periodic patterns will be presented.", "article_title": "Generating Islamic Quasi-Periodic Patterns", "authors": [{"given": "Aziz", "family": "Khamjane", "affiliation": [{"original_name": "Université Sidi Mohamed Ben Abdellah, Fes, Morocco", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Rachid", "family": "Benslimane", "affiliation": [{"original_name": "Université Sidi Mohamed Ben Abdellah, Fes, Morocco", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2018", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "11", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}