{"url": "http://dx.doi.org/10.1093/llc/fqs055", "identifier": {"string_id": "10.1093/llc/fqs055", "id_scheme": "DOI"}, "abstract": "In 1457, the Florentine merchant, Giovanni Rucellai, started to compose a family records and commonplace book, the Zibaldone Quaresimale. His goal was to transmit knowledge to his sons. This article is a report on the computer-assisted analysis of the Zibaldone and the knowledge Giovanni intended to transmit. The 2nd and 3rd sections treat the theoretical framework applied for knowledge structure analysis and the technical requirements this imposed. In the 4th section, I explain how I transformed the manuscript into a semantically and linguistically annotated corpus with the help of semi-automatic procedures. I also discuss the integrated research environment that I developed to store and link information from secondary and primary sources. In the 6th section, through a concrete research problem, the analysis of social perception, I demonstrate the practical application and the power of the digital environment. This section also presents how the knowledge system described in the codex is reconstructed with the help of a Web Ontology Language ontology. Finally, I argue that a project in Digital Humanities can bring new insights only if a comprehensive theoretical model directs the design and the use of the digital environment; one that functions as a framework to interpret the data that the digital environment produces.", "article_title": "The computer-assisted analysis of a medieval commonplace book and diary (MS Zibaldone Quaresimale by Giovanni Rucellai)", "authors": [{"given": " Gábor Mihály", "family": "Tóth", "affiliation": [{"original_name": "University of Oxford, UK", "normalized_name": "University of Oxford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/052gg0110", "GRID": "grid.4991.5"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}