{"url": "http://dx.doi.org/10.1093/llc/fqy048", "identifier": {"string_id": "10.1093/llc/fqy048", "id_scheme": "DOI"}, "abstract": "In the past decade, an increasing set of digital tools has been developed with which digital sources can be selected, analyzed, and presented. Many tools go beyond key word search and perform different types of analysis, aggregation, mapping, and linking of data selections, which transforms materials and creates new perspectives, thereby changing the way scholars interact with and perceive their materials. These tools, together with the massive amount of digital and digitized data available for humanities research, put a strain on traditional humanities research methods. Currently, there is no established method of assessing the role of digital tools in the research trajectory of humanities scholars. There is no consensus on what questions researchers should ask themselves to evaluate digital sources beyond those of traditional analogue source criticism. This article aims to contribute to a better understanding of digital tools and the discussion of how to evaluate and incorporate them in research, based on findings from a digital tool criticism workshop held at the 2017 Digital Humanities Benelux conference. The overall goal of this article is to provide insight in the actual use and practice of digital tool criticism, offer a ready-made format for a workshop on digital tool criticism, give insight in aspects that play a role in digital tool criticism, propose an elaborate model for digital tool criticism that can be used as common ground for further conversations in the field, and finally, provide recommendations for future workshops, researchers, data custodians, and tool builders.", "article_title": "Toward a model for digital tool criticism: Reflection as integrative practice", "authors": [{"given": " Marijn", "family": "Koolen", "affiliation": [{"original_name": "Royal Netherlands Academy of Arts and Sciences - Humanities Cluster, The Netherlands", "normalized_name": "Royal Netherlands Academy of Arts and Sciences", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/043c0p156", "GRID": "grid.418101.d"}}]}, {"given": " Jasmijn", "family": "van Gorp", "affiliation": [{"original_name": "Department of Media and Culture Studies, Utrecht University, The Netherlands", "normalized_name": "Utrecht University", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/04pp8hn57", "GRID": "grid.5477.1"}}]}, {"given": " Jacco", "family": "van Ossenbruggen", "affiliation": [{"original_name": "Centrum Wiskunde & Informatica, VU University Amsterdam", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}, {"original_name": "Network Institute, The Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}