{"url": "http://dx.doi.org/10.1145/2822899", "identifier": {"string_id": "10.1145/2822899", "id_scheme": "DOI"}, "abstract": "We have experienced rapid development in Augmented Reality (AR) systems and platforms in the world of cultural heritage, namely in cultural settings and historical museums. However, we still face a range of challenges to design an AR system that meets the requirements for an AR installation working autonomously in a cultural heritage setting for an extended duration. This article describes the development of two installations for the visualization of a 3D reconstruction of a castle chapel, running autonomously during open hours in the location of a castle museum. We present a convincing 3D visualization running at interactive frame-rates on modern tablets. In one installation, the tablet is connected to a large screen TV for an immersive experience, and, in another, the tablet is hand-held, thus facilitating translational freedom in the chapel. Both installations allow unsupervised usage during museum visiting hours. Based on in-field observations and on-device logging of application usage, user behavior is analyzed and evaluated. Results indicate that users spent a limited amount of time using the application and did not fully explore the visual area of the chapel. In order for the user to spend more time with the application, additional information must be presented to the user.", "article_title": "Handheld Visual Representation of a Castle Chapel Ruin", "authors": [{"ORCID": "http://orcid.org/0000-0002-3528-4766", "authenticated-orcid": false, "given": "Jacob B.", "family": "Madsen", "affiliation": [{"original_name": "Aalborg University, Aalborg, Denmark", "normalized_name": "Aalborg University", "country": "Denmark", "identifiers": {"ror": "https://ror.org/04m5j1k67", "GRID": "grid.5117.2"}}]}, {"given": "Claus B.", "family": "Madsen", "affiliation": [{"original_name": "Aalborg University, Aalborg, Denmark", "normalized_name": "Aalborg University", "country": "Denmark", "identifiers": {"ror": "https://ror.org/04m5j1k67", "GRID": "grid.5117.2"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2016", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "9", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}