{"url": "http://dx.doi.org/10.1093/llc/fqt016", "identifier": {"string_id": "10.1093/llc/fqt016", "id_scheme": "DOI"}, "abstract": "This article describes PlotVisML, a simple, flexible XML schema for encoding literary narratives that was developed by an interdisciplinary team of researchers in literary studies, interface design, computing studies, and education as part of a research project on reading, writing, and teaching complex literary narrative. PlotVisML is a simple, adaptable schema consisting of five key elements: <action>, <dialogue>, and <narration> (tags for marking up narrative events), and <character> and <object> (tags for encoding narrative objects). Fictional narratives that have been marked up using PlotVisML can be visualized in PlotVis, a digital scholarly tool that allows users to model and interact with literary narratives in three dimensions. Both PlotVis, an interactive visualization tool, and PlotVisML, our custom XML schema for encoding literary narratives, were designed to permit challenging new views on familiar plotlines and, more importantly, to depart from conventional ways of modeling narrative in literary instruction. In discussing the process of developing PlotVisML, we contribute to the ongoing discussion of text encoding as a form of close reading (e.g., Liepert, 2009).", "article_title": "Challenging new views on familiar plotlines: A discussion of the use of XML in the development of a scholarly tool for literary pedagogy", "authors": [{"given": " Monica", "family": "Brown", "affiliation": [{"original_name": "Department of English, The University of British Columbia, Vancouver, British Columbia, Canada", "normalized_name": "University of British Columbia", "country": "Canada", "identifiers": {"ror": "https://ror.org/03rmrcq20", "GRID": "grid.17091.3e"}}]}, {"given": " Teresa", "family": "Dobson", "affiliation": [{"original_name": "Department of Language and Literacy Education, The University of British Columbia, Vancouver, British Columbia, Canada", "normalized_name": "University of British Columbia", "country": "Canada", "identifiers": {"ror": "https://ror.org/03rmrcq20", "GRID": "grid.17091.3e"}}]}, {"given": " Dustin", "family": "Grue", "affiliation": [{"original_name": "Department of English, The University of British Columbia, Vancouver, British Columbia, Canada", "normalized_name": "University of British Columbia", "country": "Canada", "identifiers": {"ror": "https://ror.org/03rmrcq20", "GRID": "grid.17091.3e"}}]}, {"given": " Stan", "family": "Ruecker", "affiliation": [{"original_name": "Institute of Design, Illinois Institute of Technology, Chicago, IL, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}