{"url": "http://dx.doi.org/10.1145/3352933", "identifier": {"string_id": "10.1145/3352933", "id_scheme": "DOI"}, "abstract": "This article attempts to understand how present Virtual Reality (VR) environments can contribute to enhancing the communication of cultural heritage by providing an experience of the past that is acceptable for the younger generation and how museums and cultural institutions should adopt and use such technologies. Aspects of acceptance, experience, and expectation of VR with the underlying values are not well understood but are important for the sustainability of the communication of cultural heritage as a bequest to future generations. We conducted a combined quantitative--qualitative study on the participants who have various prior experience with gaming and VR, and different levels of knowledge on the history presented within the virtual environment. This study investigates how participants accept and are stimulated in terms of personal experience and their expectations and ideas for the future of museums if VR is used for enhancing the learning of cultural heritage. Prior gaming and VR experience were investigated to see whether they do indeed influence the preference for using VR for learning cultural heritage. We demonstrated that particular age groups and background are especially agreeable to virtual reality as environments for learning and experiencing cultural heritage, regardless of their knowledge of the historical context of the virtually reconstructed site. Our findings also revealed important behaviours in our demographics group with regards to user preferred length of time and the believability of the virtual environment and how it influences aspects of their experience such as the exploration of the heritage site, familiarity, and meaning making. The study has implications for the use of VR for enhancing the experience of cultural heritage in museums and cultural institutions.", "article_title": "The Effects of VR Environments on the Acceptance, Experience, and Expectations of Cultural Heritage Learning", "authors": [{"given": "Eugene", "family": "Ch’ng", "affiliation": [{"original_name": "NVIDIA Joint-Lab on Mixed Reality, University of Nottingham, Ningbo, Zhejiang, China", "normalized_name": "University of Nottingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ee9ar58", "GRID": "grid.4563.4"}}]}, {"given": "Yue", "family": "Li", "affiliation": [{"original_name": "International Doctoral Innovation Centre, University of Nottingham, Ningbo, Zhejiang, China", "normalized_name": "University of Nottingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ee9ar58", "GRID": "grid.4563.4"}}]}, {"given": "Shengdan", "family": "Cai", "affiliation": [{"original_name": "Faculty of Humanities and Social Sciences, University of Nottingham, Ningbo, Zhejiang, China", "normalized_name": "University of Nottingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ee9ar58", "GRID": "grid.4563.4"}}]}, {"given": "Fui-Theng", "family": "Leow", "affiliation": [{"original_name": "Faculty of Business, University of Nottingham, Ningbo, Zhejiang, China", "normalized_name": "University of Nottingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ee9ar58", "GRID": "grid.4563.4"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2020-02-25", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "13", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}