{"url": "http://dx.doi.org/10.1093/llc/fqq011", "identifier": {"string_id": "10.1093/llc/fqq011", "id_scheme": "DOI"}, "abstract": "This article deals with the lemmatization of Middle Dutch literature. This text collection—like any other medieval corpus—is characterized by an enormous spelling variation, which makes it difficult to perform a computational analysis of this kind of data. Lemmatization is therefore an essential preprocessing step in many applications, since it allows the abstraction from superficial textual variation, for instance in spelling. The data we will work with is the Corpus-Gysseling, containing all surviving Middle Dutch literary manuscripts dated before 1300 AD. In this article we shall present a language-independent system that can ‘learn’ intra-lemma spelling variation. We describe a series of experiments with this system, using Memory-Based Machine Learning and propose two solutions for the lemmatization of our data: the first procedure attempts to generate new spelling variants, the second one seeks to implement a novel string distance metric to better detect spelling variants. The latter system attempts to rerank candidates suggested by a classic Levenshtein distance, leading to a substantial gain in lemmatization accuracy. This research result is encouraging and means a substantial step forward in the computational study of Middle Dutch literature. Our techniques might be of interest to other research domains as well because of their language-independent nature.", "article_title": "Weigh your words--memory-based lemmatization for Middle Dutch", "authors": [{"given": " Mike", "family": "Kestemont", "affiliation": [{"original_name": "Institute for the Study of Literature in the Netherlands (ISLN)", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}, {"original_name": "University of Antwerp, Belgium", "normalized_name": "University of Antwerp", "country": "Belgium", "identifiers": {"ror": "https://ror.org/008x57b05", "GRID": "grid.5284.b"}}]}, {"given": " Walter", "family": "Daelemans", "affiliation": [{"original_name": "CLiPS Computational Linguistics Group, University of Antwerp, Belgium", "normalized_name": "University of Antwerp", "country": "Belgium", "identifiers": {"ror": "https://ror.org/008x57b05", "GRID": "grid.5284.b"}}]}, {"given": " Guy", "family": "De Pauw", "affiliation": [{"original_name": "CLiPS Computational Linguistics Group, University of Antwerp, Belgium", "normalized_name": "University of Antwerp", "country": "Belgium", "identifiers": {"ror": "https://ror.org/008x57b05", "GRID": "grid.5284.b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2010", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "25", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}