{"url": "http://dx.doi.org/10.1093/llc/fqy077", "identifier": {"string_id": "10.1093/llc/fqy077", "id_scheme": "DOI"}, "abstract": "Recent studies have shown that macroscopic patterns of continuity and change over the course of centuries can be detected through the analysis of time series extracted from massive textual corpora. Similar data-driven approaches have already revolutionized the natural sciences and are widely believed to hold similar potential for the humanities and social sciences, driven by the mass-digitization projects that are currently under way, and coupled with the ever-increasing number of documents which are ‘born digital’. As such, new interactive tools are required to discover and extract macroscopic patterns from these vast quantities of textual data. Here we present History Playground, an interactive web-based tool for discovering trends in massive textual corpora. The tool makes use of scalable algorithms to first extract trends from textual corpora, before making them available for real-time search and discovery, presenting users with an interface to explore the data. Included in the tool are algorithms for standardization, regression, change-point detection in the relative frequencies of n-grams, multi-term indices, and comparison of trends across different corpora.", "article_title": "History playground: A tool for discovering temporal trends in massive textual corpora", "authors": [{"given": " Thomas", "family": "Lansdall-Welfare", "affiliation": [{"original_name": "Intelligent Systems Laboratory, Department of Engineering Mathematics, University of Bristol, Bristol, UK", "normalized_name": "University of Bristol", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0524sp257", "GRID": "grid.5337.2"}}]}, {"given": " Nello", "family": "Cristianini", "affiliation": [{"original_name": "Intelligent Systems Laboratory, Department of Engineering Mathematics, University of Bristol, Bristol, UK", "normalized_name": "University of Bristol", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0524sp257", "GRID": "grid.5337.2"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-12-31", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "35", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}