{"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/23376", "identifier": {"string_id": "10.11588/dah.2016.2.23376", "id_scheme": "DOI"}, "abstract": "In the past few years, the number of fine-art collections that are dig- itized and publicly available has been growing rapidly. With the availability of such large collections of digitized artworks comes the need to develop multime- dia systems to archive and retrieve this pool of data. Measuring the visual similar- ity between artistic items is an essential step for such multimedia systems, which can benefit more high-level multimedia tasks. In order to model this similarity between paintings, we should extract the appropriate visual features for paintings and find out the best approach to learn the similarity metric based on these fea- tures. We investigate a comprehensive list of visual features and metric learning approaches to learn an optimized similarity measure between paintings. We de- velop a machine that is able to make aesthetic-related semantic-level judgments, such as predicting a painting’s style, genre, and artist, as well as providing simi- larity measures optimized based on the knowledge available in the domain of art historical interpretation. Our experiments show the value of using this similarity measure for the aforementioned prediction tasks.", "article_title": "Large-scale Classification of Fine-Art Paintings: Learning The Right Metric on The Right Feature", "authors": [{"given": "Babak", "family": "Saleh", "affiliation": [{"original_name": "Rutgers university", "normalized_name": "Rutgers, The State University of New Jersey", "country": "United States", "identifiers": {"ror": "https://ror.org/05vt9qd57", "GRID": "grid.430387.b"}}]}, {"given": "Ahmed", "family": "Elgammal", "affiliation": [{"original_name": "Rutgers university", "normalized_name": "Rutgers, The State University of New Jersey", "country": "United States", "identifiers": {"ror": "https://ror.org/05vt9qd57", "GRID": "grid.430387.b"}}]}], "publisher": null, "date": "2016", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}