{"url": "http://dx.doi.org/10.1093/llc/fqaa002", "identifier": {"string_id": "10.1093/llc/fqaa002", "id_scheme": "DOI"}, "abstract": "The extraction of large amounts of multilingual parallel text from web resources is a widely used technique in natural language processing. However, automatically collected parallel corpora usually lack precise metadata, which are crucial to accurate data analysis and interpretation. The combination of automated extraction procedures and manual metadata enrichment may help address this issue. Wikipedia is a promising candidate for the exploration of the potential of said combination of methods because it is a rich source of translations in a large number of language pairs and because its open and collaborative nature makes it possible to identify and contact the users who produce translations. This article tests to what extent translated texts automatically extracted from Wikipedia by means of neural networks can be enriched with pertinent metadata through a self-submission-based user survey. Special emphasis is placed on data usefulness, defined in terms of a catalogue of previously established assessment criteria, most prominently metadata quality. The results suggest that from a quantitative perspective, the proposed methodology is capable of capturing metadata otherwise not available. At the same time, the crowd-based collection of data and metadata may face important technical and social limitations.", "article_title": "Automatically extracted parallel corpora enriched with highly useful metadata? A Wikipedia case study combining machine learning and social technology", "authors": [{"given": " Ahmad", "family": "Aghaebrahimian", "affiliation": [{"original_name": "Department of Translation Studies, University of Innsbruck, Austria", "normalized_name": "Universität Innsbruck", "country": "Austria", "identifiers": {"ror": "https://ror.org/054pv6659", "GRID": "grid.5771.4"}}]}, {"given": " Andy", "family": "Stauder", "affiliation": [{"original_name": "Department of Translation Studies, University of Innsbruck, Austria", "normalized_name": "Universität Innsbruck", "country": "Austria", "identifiers": {"ror": "https://ror.org/054pv6659", "GRID": "grid.5771.4"}}]}, {"given": " Michael", "family": "Ustaszewski", "affiliation": [{"original_name": "Department of Translation Studies, University of Innsbruck, Austria", "normalized_name": "Universität Innsbruck", "country": "Austria", "identifiers": {"ror": "https://ror.org/054pv6659", "GRID": "grid.5771.4"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}