{"url": "http://dx.doi.org/10.1093/llc/16.4.353", "identifier": {"string_id": "10.1093/llc/16.4.353", "id_scheme": "DOI"}, "abstract": "The study first establishes a set of formal properties of Ulysses through a computational approach based on frequency counts of the ninety-nine most common words of the text. The common words are first used to discriminate interior monologue, dialogue, and narrative, and then to discriminate between the different narrative styles of the text. The discriminations are achieved by means of multivariate statistics, such as principal component analysis, and by distribution tests (Student's t-test and Mann-Whitney test). Using the linguistic premise that all matter is meaning, as well as Bakhtin's argument that all language is ideologically saturated, the study then explores the relationship between common words, meaning, and ideology. It concentrates on the Gerty MacDowell section of episode 13 of Ulysses in order to show how common words that appear more frequently in that episode than in others—such as two modals, two causal conjunctions, and one preposition—are integral to the various syntactic structures that differentiate styles and contribute to the meaning and ideology of the text. The article links these discriminations to Bakhtin's concept of polyphony and to his discussion of the ‘creation of specific novelistic images of languages’. Its conclusion, therefore, is that computational analysis of style can open interpretation to details of form, meaning, and ideology that enable humanities computing to make a distinctive contribution to literary criticism.", "article_title": "The Statistical Analysis of Style: Reflections on Form, Meaning, and Ideology in the 'Nausicaa' Episode of Ulysses", "authors": [{"given": " C. W. F.", "family": "McKenna", "affiliation": [{"original_name": "Centre for Literary and Linguistic Computing, Faculty of Arts and Social Science, The University of Newcastle New South Wales 2308, Australia", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " A.", "family": "Antonia", "affiliation": [{"original_name": "Centre for Literary and Linguistic Computing, Faculty of Arts and Social Science, The University of Newcastle New South Wales 2308, Australia", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2001", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "16", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}