{"url": "http://dx.doi.org/10.1145/3316414", "identifier": {"string_id": "10.1145/3316414", "id_scheme": "DOI"}, "abstract": "Fourth Industrial Revolution technologies, such as artificial intelligence, big data, the Internet of Things (IoT), and virtual reality, have disrupted legacy methods of operations and have led to progress in many industries worldwide. These technologies also affect the cultural and national heritage. IoT generates large volumes of streaming data; therefore, advanced data analytics using big data analytics and artificial neural networks is an important research topic. In this study, IoT sensor data was collected at the restored Woljeong Bridge, which was originally built in the eighth century, or AD 760, during the Silla Dynasty (57 BC--AD 935) in South Korea. We empirically evaluate a recurrent neural network with recurrent units, including a long short-term memory (LSTM) unit and a gated recurrent unit (GRU). Additionally, we evaluate hybrid deep-learning models (convolution neural networks [CNN]-LSTM and CNN-GRU) to build a prediction model, facilitating the preventive conservation of an invaluable cultural and national heritage site. The experimental results show that the LSTM unit is an effective and robust model. When comparing the hybrid models (i.e., the joint CNN-LSTM and CNN-GRU architectures), we found that the vanilla LSTM and GRU models had superior time-series prediction capabilities.", "article_title": "Cultural Heritage and the Intelligent Internet of Things", "authors": [{"given": "Woosik", "family": "Lee", "affiliation": [{"original_name": "Illinois Institute of Technology, Chicago, USA", "normalized_name": "Illinois Institute of Technology", "country": "United States", "identifiers": {"ror": "https://ror.org/037t3ry66", "GRID": "grid.62813.3e"}}]}, {"given": "Dong-hoon", "family": "Lee", "affiliation": [{"original_name": "a Seoul School of Integrated Sciences 8 Technologies, Seodaemun-gu, Seoul, South Korea", "normalized_name": "Seoul School of Integrated Sciences and Technologies", "country": "South Korea", "identifiers": {"ror": "https://ror.org/02xj62754", "GRID": "grid.464670.7"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2019-06-14", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "12", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}