{"url": "http://dx.doi.org/10.1093/llc/fqp037", "identifier": {"string_id": "10.1093/llc/fqp037", "id_scheme": "DOI"}, "abstract": "New technologies have always influenced communication, by adding new ways of communication to the existing ones and/or changing the ways in which existing forms of communication are utilized. This is particularly obvious in the way in which computer-mediated communication (CMC) has had an impact on communication. In this exploratory article, we are concerned with some characteristics of a newly evolving form of Spanish Internet orthography that differ from standard Spanish spelling. Three types of deviations from ‘the norm’ are considered: a reduction (post-vocalic d/[ð] deletion in -ado), a transformation (namely the spelling change from ch to x), and reduplication (of characters). Based on a corpus of approximately 2.7 million words of regionally balanced informal internet Spanish compiled in 2008, we describe the spelling changes and discuss a variety of sometimes interacting factors governing the rates of spelling variants such as overall frequency effects, functional (pragmatic, sociolinguistic, and iconicity-related) characteristics, and phonological constraints. We also compare our findings to data from Mark Davies's (2002) Corpus del Español (100 million words, 1200s–1900s, http://www.corpusdelespanol.org) as well as other sources and relate them to the discussion of the register/genre of Internet language.", "article_title": "k dixez? A corpus study of Spanish Internet orthography", "authors": [{"given": " Mark", "family": "Myslín", "affiliation": [{"original_name": "University of California, Santa Barbara, CA, USA", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}, {"given": " Stefan Th.", "family": "Gries", "affiliation": [{"original_name": "University of California, Santa Barbara, CA, USA", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2010", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "25", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}