{"url": "http://dx.doi.org/10.1093/llc/fqaa010", "identifier": {"string_id": "10.1093/llc/fqaa010", "id_scheme": "DOI"}, "abstract": "Following Dr Barber’s unfortunate criticism (Barber, 2018, Marlowe and overreaching: a misuse of stylometry. Digital Scholarship in the Humanities, 34:1–12), in which she, with an obvious lack of familiarity with them, subjected the Rolling Delta procedures used, to the caveats of Delta and traditional stylometry, this article makes use of an extended methodological framework and applies Rolling Delta to the target texts with a totality of reference texts. The outcome is different from the expected, since the author of Tamburlaine 1 and 2 emerges as stylistically also dominant in the anonymous play The Tragedy of Locrine, in Kyd’s closet play Cornelia, in Peele’s The Battle of Alcazar and David and Bethsabe. In contrast, the official Marlowe corpus relates stylistically to contemporary authors, but not to the two Tamburlaines. Traditional scholarship and learning do not refute conjectures of misattributed Peele plays and there are also strong indications that plays associated with Lord Strange’s Men nominally became Marlowe plays when Henslowe acquired them in 1594 for his Admiral’s Men and printers made use of the cult of personality, in which the author’s death became an important factor in the marketing of printed playbooks. Otherwise, there is no documentary and empirical evidence that Marlowe wrote the plays in question. The canonization of the plays occurred only in the nineteenth century, and the Marlowe we have inherited—the poet, spy, atheist, homosexual, and so on—is almost entirely an invention of the twentieth century (Hooks, 2018, Making Marlowe. In Melnikoff, K. and Knutson, R. (eds), Christopher Marlowe, Theatrical Commerce, and the Book Trade. Cambridge: University Press, p. 98).", "article_title": "The Marlowe corpus revisited", "authors": [{"given": " Hartmut", "family": "Ilsemann", "affiliation": [{"original_name": "English Department, Leibniz Universität Hannover, Germany", "normalized_name": "University of Hannover", "country": "Germany", "identifiers": {"ror": "https://ror.org/0304hq317", "GRID": "grid.9122.8"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}