{"url": "http://dx.doi.org/10.1093/llc/fqi033", "identifier": {"string_id": "10.1093/llc/fqi033", "id_scheme": "DOI"}, "abstract": "In recent years, Latin America has been one of the world's fastest growing areas for Internet connectivity. While numerous studies have examined the factors contributing to this communications explosion, this article concentrates upon one of its effects—the proliferation of freely available, scholarly, peer-reviewed electronic journals in the fields of literary, cultural and area studies. This article argues that in the field of Latin American studies, the majority of e-journals are being produced in Latin American countries, rather than in the US or the UK for example. It is Latin American academics, rather than their US and UK counterparts, who are embracing new technologies and the opportunities facilitated for effective dissemination of research. In order to understand this marked move towards electronic scholarly journals, this article outlines the state of Internet connectivity in the region, the financial and material constraints and other restrictions placed upon academic publication, and the lack of international visibility of Latin American scholarly print journals. While questions need to be addressed as to the future sustainability and preservation of these free journals, many of them managed by individual academics and funded by their universities, this article argues that electronic publishing offers Latin American academics an unprecedented opportunity to disseminate their research. Furthermore, this model gives international academics immediate, free access to important research that is emerging from the continent, which is the subject of study. Such access has the potential to revolutionize the way that international academics approach Latin American studies and to encourage a greater degree of international academic debate.", "article_title": "E-Journal Proliferation in Emerging Economies: The Case of Latin America", "authors": [{"given": " Shoshannah", "family": "Holdom", "affiliation": [{"original_name": "Humbul Humanities Hub, Research Technologies Service, Oxford University, UK", "normalized_name": "University of Oxford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/052gg0110", "GRID": "grid.4991.5"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2005", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "20", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}