{"url": "http://dx.doi.org/10.1093/llc/fql018", "identifier": {"string_id": "10.1093/llc/fql018", "id_scheme": "DOI"}, "abstract": "PériCulture is the name of a research project at the Université de Montréal which is part of a larger project based at the Université de Sherbrooke. The parent project aimed to form a research network for managing Canadian digital cultural content. The general research objective of PériCulture was to study indexing methods for web-based non-textual cultural content, specifically still images. The research results reported here build on work in image indexing and automatic (text) indexing by studying properties of text associated with images in a networked environment to try to gain some understanding of how the ancillary text associated with images on web pages can be exploited to index the corresponding images. We studied this question in the context of selected web sites, i.e. that contained multimedia objects, that had text associated with these objects (broader than file names and captions), that were bilingual (English and French), and that housed Canadian digital cultural content. We identified keywords that were useful in indexing and studied their proximity to the object described. Potential indexing terms were identified in various HTML tags and full text (each considered a different source of ancillary text). Our study found that a large number of useful indexing terms are available in the ancillary text of many web sites with cultural content, and that ancillary text of different sources have variable usefulness in retrieval. Our results suggest that these terms can be manipulated in a number of ways in automated retrieval systems to improve search results.", "article_title": "Using Ancillary Text to Index Web-based Multimedia Objects", "authors": [{"given": " Lyne", "family": "Da Sylva", "affiliation": [{"original_name": "École de bibliothéconomie et des sciences de l’information, Université de Montréal", "normalized_name": "University of Montreal", "country": "Canada", "identifiers": {"ror": "https://ror.org/0161xgx34", "GRID": "grid.14848.31"}}]}, {"given": " James M.", "family": "Turner", "affiliation": [{"original_name": "École de bibliothéconomie et des sciences de l’information, Université de Montréal", "normalized_name": "University of Montreal", "country": "Canada", "identifiers": {"ror": "https://ror.org/0161xgx34", "GRID": "grid.14848.31"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2006", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "21", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}