{"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/52672", "identifier": {"string_id": "10.11588/dah.2019.4.52672", "id_scheme": "DOI"}, "abstract": "As art museums undergo a digital transformation, institutions rethink physical exhibitions and print publications to create online resources which expand or replicate their traditional functions. Collection websites, online exhibitions, online publications, exhibition websites, and online exhibition catalogues coexist with interactive features which cannot be easily categorized in the previous typologies, the exhibition and the publication. Moreover, often these different types of online resources share characteristics and functions. This article intends to define two of the most relevant online resources typologies in art museums, the online exhibition and the online publication. The aim of it is to discuss and understand the importance of rethinking traditional typologies in the digital age. If typologies are necessary is because they help us to advance previous models. Both the definition and discussion are built upon the perspectives of art museums practitioners and a scholarly audience collected through interviews. The viewpoints of the two collectives help us understand existing conventions, preferences, and needs with regards to online exhibitions and publications in art museums.", "article_title": "Defining online resources typologies in art museums: online exhibitions and publications", "authors": [{"given": "Maribel", "family": "Hidalgo Urbaneja", "affiliation": [{"original_name": "University of Glasgow", "normalized_name": "University of Glasgow", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vtgdb53", "GRID": "grid.8756.c"}}]}], "publisher": null, "date": "2020", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}