{"url": "http://dx.doi.org/10.1093/llc/fqs030", "identifier": {"string_id": "10.1093/llc/fqs030", "id_scheme": "DOI"}, "abstract": "This contribution comments on certain works of digital literature in order to demonstrate their use of formal and thematic literary techniques and show that ‘wreaders’ have their own creative pattern. Playing with hyperlinks involves disorganized thinking, associative laxity and conceptual, and linguistic alterations that infringe the linear construction of the literary paradigm. The mechanism that appears during this creative ‘wreadering–wandering’ process operates in such a way that time and space converge to produce what we will call ‘digital entropy’, a creative force in which it is nowadays possible to identify cultural keywords. The expansive nature of this ‘entropy’ means that digital work arising from the local becomes universal. A discussion is included on the new ‘complex digital ego’, which operates under multiple cultural and transliterary parameters to denounce the crisis in the analogue aesthetic. Some of the characteristics attributable to digital literature—collective experimentation and the rupture of narrative linearity—are exemplified in literary stories from collective and experimental Hispanic digital literature. We also avail ourselves of some examples of pioneer digital literary works written in Spanish, in which a number of specific qualities can be found in the very virtual nature of the text. This study presents an original approach to these works in relation to three pathways to reading: Hypertextual Reading, Ekphrastic Reading, and Serendipity Reading.", "article_title": "Poetics of crisis or crisis of poetics in digital reading/writing?: The case of Spanish digital literature*", "authors": [{"given": " Dolores", "family": "Romero López", "affiliation": [{"original_name": "Complutense University of Madrid, Spain", "normalized_name": "Complutense University of Madrid", "country": "Spain", "identifiers": {"ror": "https://ror.org/02p0gd045", "GRID": "grid.4795.f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "27", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}