{"url": "http://dx.doi.org/10.1093/llc/19.3.253", "identifier": {"string_id": "10.1093/llc/19.3.253", "id_scheme": "DOI"}, "abstract": "What could and should be the relationship between research archives of endangered cultural heritage materials and the originating community? This paper argues that recent developments in distributed computing in a networked environment have allowed us to re‐imagine this relationship in a way that profoundly changes the role of the archive and reinforces the desirability of establishing ongoing reciprocal relationships with cultural heritage communities. Some possibilities are suggested drawing from experience with PARADISEC (the Pacific and Regional Archive for Digital Sources in Endangered Cultures, established in 2003 as a collaborative venture between the University of Sydney, the University of Melbourne, and the Australian National University) and with local community‐based digital archives in the remote Australian communities of Belyuen and Wadeye. Repatriation and rights, planning principles for establishment and sustainability of local digital archives in community cultural centres, and models for a staged approach in setting up ongoing relationships with rights holders are discussed. The paper argues that digital archives, as distributed virtual institutions, need to engage with a number of different communities of interest: not only the individuals, communities, and institutions that own the cultural heritage objects we preserve, but also the wider academic community and international standards‐setting bodies. Planning for our archives’ digital future means imagining ourselves as actors and creators within that virtual society.", "article_title": "Turning It All Upside Down . . . Imagining a distributed digital audiovisual archive", "authors": [{"given": "L.", "family": "Barwick", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "19", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}