{"url": "http://dx.doi.org/10.16995/dscn.316", "identifier": {"string_id": "10.16995/dscn.316", "id_scheme": "DOI"}, "abstract": "In this paper, we describe how the hypergeometric test can be used to determine whether a given theme of interest occurs in a storyset at a frequency more than would be expected by chance. By a storyset we mean simply a list of stories defined according to a common attribute (e.g., author, movement, period). The test works roughly as follows: Given a background storyset and a sub-storyset of interest, the test determines whether a given theme is over-represented in the sub-storyset, based on comparing the proportions of stories in the sub-storyset and background storyset featuring the theme. A storyset is said to be “enriched” for a theme with respect to a particular background storyset, when the theme is identified as being significantly over-represented by the test. Furthermore, we introduce here a toy dataset consisting of 280 manually themed Star Trek television franchise episodes. As a proof of concept, we use the hypergeometric test to analyze the Star Trek stories for enriched themes. The hypergeometric testing approach to theme enrichment analysis is implemented for the Star Trek thematic dataset in the R package stoRy. A related R Shiny web application can be found at https://github.com/theme-ontology/shiny-apps.", "article_title": "Theme Enrichment Analysis: A Statistical Test for Identifying Significantly Enriched Themes in a List of Stories with an Application to the Star Trek Television Franchise", "authors": [{"given": "Mikael", "family": "Onsjö", "affiliation": [{"original_name": "Independent Researcher", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Paul", "family": "Sheridan", "affiliation": [{"original_name": "Hirosaki University", "normalized_name": "Hirosaki University", "country": "Japan", "identifiers": {"ror": "https://ror.org/02syg0q74", "GRID": "grid.257016.7"}}]}], "publisher": "Open Library of the Humanities", "date": "2020-01-23", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "10", "issue": "1", "ISSN": [{"value": "1918-3666", "type": "electronic"}]}