{"url": "http://dx.doi.org/10.1093/llc/fqs046", "identifier": {"string_id": "10.1093/llc/fqs046", "id_scheme": "DOI"}, "abstract": "The aim of this article was to distinguish different authorial layers within a 15th-century chronicle, a rare medieval autograph or author’s copy (Croniken van der Duytscher Oirden or Jüngere Hochmeisterchronik), and to test specifically the validity of claims concerning the original composition of the text. A better apprehension of the creative process involved in composing the Croniken is essential for the interpretation and understanding of the purpose and intended audience of the text. Furthermore, it gives an insight into the historiographical activities in the ‘peripheral’ bailiwicks of the Teutonic Order. Computational techniques, in this case John Burrows’ tried-and-tested Delta method, play an invaluable role in both the solution of these issues as well as in pointing in the direction of new enquiries. Here, the Delta method was used to create a walking window, only 2,000 words in length, across the entire chronicle. Despite the small sample size, chosen because in the present case, a finer granularity and precision in detecting the shifts in authorial styles was as important as reliability, Delta was able to pick out distinct parts of the chronicle, some as short as just >500 words.", "article_title": "Layer on layer. 'Computational archaeology' in 15th-century Middle Dutch historiography", "authors": [{"given": " Rombert J.", "family": "Stapel", "affiliation": [{"original_name": "Fryske Akademy", "normalized_name": "Fryske Akademy", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/05fcmfe52", "GRID": "grid.450022.1"}}, {"original_name": "Royal Netherlands Academy of Arts and Sciences", "normalized_name": "Royal Netherlands Academy of Arts and Sciences", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/043c0p156", "GRID": "grid.418101.d"}}, {"original_name": "Leiden University, Netherlands", "normalized_name": "Leiden University", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/027bh9e22", "GRID": "grid.5132.5"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}