{"url": "http://dx.doi.org/10.1145/2901297", "identifier": {"string_id": "10.1145/2901297", "id_scheme": "DOI"}, "abstract": "We describe a common problem in the curation and analysis of archaeological materials: restoring the orientation and dimensions of damaged objects. Our focus is a common architectural type in Mediterranean sites, the Doric column drum, which we investigate at one of the earliest Doric temples in the Greek world, the Hera temple at Olympia. The 3D modeling and analysis of this building by the Digital Architecture Project since 2013 has revealed new insights into the construction history of its stone colonnades. This paper concerns the analysis of the 3D models of the in situ material, using the almost 100 fallen drums and capitals to reconstruct the colonnade digitally. In order to accomplish this, we propose two novel methods for training the machine to estimate the dimensions of a fragmentary column drum. One approach is a modification of ICP, where the fragment is compared to an ideal model of an intact drum, which is resized iteratively until concluding with a satisfactory fit. Another approach recasts the scan data into polar coordinates and uses RANSAC to identify the exterior profiles of the piece and remove points likely to belong to damaged areas. The filtered points are then examined by the algorithm to estimate the radii and taper of the drum. Besides saving a great deal of time in the field, these methods are also accurate to within 0.2% of the total radius for well-preserved material, and 1% for even the most fragmentary drums at Olympia. These data have allowed the digital reconstruction of 80% of the displaced drums and all of the capitals from the temple. Our algorithms can be used to measure any fluted column drums, and we discuss the potential value of our approach for other categories of archaeological artifacts.", "article_title": "Pattern Matching and the Analysis of Damaged Ancient Objects", "authors": [{"given": "Philip", "family": "Sapirstein", "affiliation": [{"original_name": "University of Nebraska-Lincoln", "normalized_name": "University of Nebraska–Lincoln", "country": "United States", "identifiers": {"ror": "https://ror.org/043mer456", "GRID": "grid.24434.35"}}]}, {"given": "Eric", "family": "Psota", "affiliation": [{"original_name": "University of Nebraska-Lincoln", "normalized_name": "University of Nebraska–Lincoln", "country": "United States", "identifiers": {"ror": "https://ror.org/043mer456", "GRID": "grid.24434.35"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2016", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "9", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}