{"url": "http://dx.doi.org/10.1093/llc/fqv016", "identifier": {"string_id": "10.1093/llc/fqv016", "id_scheme": "DOI"}, "abstract": "The evolution of fairy tales often involves complex interactions between oral and literary traditions, which can be difficult to tease apart when investigating their origins. Here, we show how computer-assisted stemmatology can be productively applied to this problem, focusing on a long-standing controversy in fairy tale scholarship: did Little Red Riding Hood originate as an oral tale that was adapted by Perrault and the Brothers Grimm, or is the oral tradition in fact derived from literary texts? We address this question by analysing a sample of twenty-four literal and oral versions of the fairy tale Little Red Riding Hood using several methods of phylogenetic analysis, including maximum parsimony and two network-based approaches (NeighbourNet and TRex). While the results of these analyses are more compatible with the oral origins hypothesis than the alternative literary origins hypothesis, their interpretation is problematized by the fact that none of them explicitly model lineal (i.e. ancestor-descendent) relationships among taxa. We therefore present a new likelihood-based method, PhyloDAG, which was specifically developed to model lineal as well as collateral and reticulate relationships. A comparison of different structures derived from PhyloDAG provided a much clearer result than the maximum parsimony, NeighbourNet or TRex analyses, and strongly favoured the hypothesis that literary versions of Little Red Riding Hood were originally based on oral folktales, rather than vice versa.", "article_title": "Oral fairy tale or literary fake? Investigating the origins ofLittle Red Riding Hoodusing phylogenetic network analysis", "authors": [{"given": " Jamshid", "family": "Tehrani", "affiliation": [{"original_name": "Department of Anthropology, Durham University, Durham, UK", "normalized_name": "Durham University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01v29qb04", "GRID": "grid.8250.f"}}]}, {"given": " Quan", "family": "Nguyen", "affiliation": [{"original_name": "Department of Computer Science and Helsinki Institute for Information Technology, FI-0014 University of Helsinki, Helsinki", "normalized_name": "University of Helsinki", "country": "Finland", "identifiers": {"ror": "https://ror.org/040af2s02", "GRID": "grid.7737.4"}}]}, {"given": " Teemu", "family": "Roos", "affiliation": [{"original_name": "Department of Computer Science and Helsinki Institute for Information Technology, FI-0014 University of Helsinki, Helsinki", "normalized_name": "University of Helsinki", "country": "Finland", "identifiers": {"ror": "https://ror.org/040af2s02", "GRID": "grid.7737.4"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2015", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "31", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}