{"url": "http://dx.doi.org/10.1093/llc/fqx047", "identifier": {"string_id": "10.1093/llc/fqx047", "id_scheme": "DOI"}, "abstract": "In our research, we study mechanisms of knowledge dissemination based on the structural and social networks surrounding the edition history of a single text: the Tractatus de sphaera by Johannes de Sacrobosco. By applying methods from network analysis, we investigate how specific commentaries on the text circulated, which actors were responsible for them and what factors supported or hindered the spread of specific kinds of knowledge. The basis of this investigation is represented by CorpusTracer, a database that stores the required data in a suitable format and with the required level of expressivity. In this article, we present the design of our database and our data model based on CIDOC-CRM and FRBRoo. We discuss the implementation and suitability of the conceptual and technical realization for our research question. We conclude that FRBRoo fits well to the task at hand. We found that the comparatively complex data structure it requires can be sufficiently abstracted through current implementation methods. As the research continues, our data model will have to grow and we expect that the presented methods will be sufficient to accommodate our future requirements.", "article_title": "CorpusTracer: A CIDOC database for tracing knowledge networks", "authors": [{"given": " Florian", "family": "Kräutli", "affiliation": [{"original_name": "Max Planck Institute for the History of Science, Germany", "normalized_name": "Max Planck Institute for the History of Science", "country": "Germany", "identifiers": {"ror": "https://ror.org/0492sjc74", "GRID": "grid.419556.a"}}]}, {"given": " Matteo", "family": "Valleriani", "affiliation": [{"original_name": "Max Planck Institute for the History of Science, Germany", "normalized_name": "Max Planck Institute for the History of Science", "country": "Germany", "identifiers": {"ror": "https://ror.org/0492sjc74", "GRID": "grid.419556.a"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2017", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}