{"url": "http://dx.doi.org/10.1145/3287272", "identifier": {"string_id": "10.1145/3287272", "id_scheme": "DOI"}, "abstract": "Digital heritage interpretation is often untethered from traditional museological techniques and environments. As museums and heritage sites explore the potential of locative technologies and ever more sophisticated content-triggering mechanisms for use outdoors, the kinds of questions that digital heritage researchers are able to explore have become increasingly more complex. Researchers now find themselves in the realm of the immersive, the experiential, and the performative. Working closely with their research participants, they navigate ambiguous terrain, including the often unpredictable affective resonances that are the direct consequences of interaction. This article creates a dialogue between two case studies which, taken together, help to unpack some key methodological and ethical questions emerging from these developments. First, we introduce With New Eyes I See, an itinerant and immersive digital heritage encounter which collapsed boundaries between physical/digital, fact/fiction and past/present. Second, we detail Rock Art on Mobile Phones, a set of dialogic web apps that aimed to explore the potential of mobile devices in delivering heritage interpretation in the rural outdoors. Looking outward from these case studies, we reflect on how traditional evaluation frameworks are being stretched and strained given the kinds of questions that digital heritage researchers are now exploring. Drawing on vignettes from experience-oriented qualitative studies with participants, we articulate specific common evaluative challenges related to the embodied, multimodal, and transmedial nature of the digital heritage experiences under investigation. In doing so, we make the case for reflexivity as a central and more collaborative feature of research design within this field going forward — paying attention to and advocating the reciprocal relationship between researchers and the heritage experiences that we study.", "article_title": "Evaluating Digital Cultural Heritage ‘In the Wild’", "authors": [{"given": "Areti", "family": "Galani", "affiliation": [{"original_name": "School of Arts and Cultures, Newcastle University, Newcastle upon Tyne, UK", "normalized_name": "University of Newcastle Australia", "country": "Australia", "identifiers": {"ror": "https://ror.org/00eae9z71", "GRID": "grid.266842.c"}}]}, {"given": "Jenny", "family": "Kidd", "affiliation": [{"original_name": "School of Journalism, Media and Culture, Cardiff University, Cardiff, UK", "normalized_name": "Cardiff University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/03kk7td41", "GRID": "grid.5600.3"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2019-02-14", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "12", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}