{"url": "http://dx.doi.org/10.1093/llc/fqu046", "identifier": {"string_id": "10.1093/llc/fqu046", "id_scheme": "DOI"}, "abstract": "One of the main efforts of recent computational linguistics is to formalize the process of identifying and evaluating similarity between narratives, which is argued to be a key concept for all human behavior. Analyses of the data of 52 adults that participated in our empirical study offered evidence that supports the position that narrative similarity can be equated to the existence of a common summary between the narratives involved. As a further step for applying the above hypothesis, we introduced our own methods for measuring similarity of narratives through the notion of summary and compared them with some of the existing lexical-matching similarity measures. Comparisons of each computational measure with the actual similarity judgments of human participants revealed that methods that merely measure the number of shared words between two stories were unable to capture human similarity judgments, especially for stories of moderate similarity levels. However, the summary-based methods of our approach managed to reproduce human ratings for story pairs across all the range of similarity (from high similarity to low similarity).", "article_title": "Narrative similarity as common summary: Evaluation of behavioral and computational aspects", "authors": [{"given": " Elektra", "family": "Kypridemou", "affiliation": [{"original_name": "Open University of Cyprus, Cyprus", "normalized_name": "Open University of Cyprus", "country": "Cyprus", "identifiers": {"ror": "https://ror.org/033sm2k57", "GRID": "grid.440846.a"}}]}, {"given": " Loizos", "family": "Michael", "affiliation": [{"original_name": "Open University of Cyprus, Cyprus", "normalized_name": "Open University of Cyprus", "country": "Cyprus", "identifiers": {"ror": "https://ror.org/033sm2k57", "GRID": "grid.440846.a"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}