{"url": "http://dx.doi.org/10.1145/3099618", "identifier": {"string_id": "10.1145/3099618", "id_scheme": "DOI"}, "abstract": "We analyze use of an interactive system for the exploration of highly detailed three-dimensional (3D) models of a collection of protostoric Mediterranean sculptures. In this system, when the object of interest is selected, its detailed 3D model and associated information are presented at high resolution on a large display controlled by a touch-enabled horizontal surface at a suitable distance. The user interface combines an object-aware interactive camera controller with an interactive point-of-interest selector and is implemented within a scalable implementation based on multiresolution structures shared between the rendering and user interaction subsystems. The system was installed in several temporary and permanent exhibitions and was extensively used by tens of thousands of visitors. We provide a data-driven analysis of usage experience based on logs gathered during a 27-month period at four exhibitions in archeological museums for a total of more than 75K exploration sessions. We focus on discerning the main visitor behaviors during 3D exploration by employing tools for deriving interest measures on surfaces and tools for clustering and knowledge discovery from high-dimensional data. The results highlight the main trends in visitor behavior during the interactive sessions. These results provide useful insights for the design of 3D exploration user interfaces in future digital installations.", "article_title": "Data-Driven Analysis of Virtual 3D Exploration of a Large Sculpture Collection in Real-World Museum Exhibitions", "authors": [{"given": "Marco", "family": "Agus", "affiliation": [{"original_name": "King Abdullah University of Science and Technology, Saudi Arabia and CRS4, Italy", "normalized_name": "King Abdullah University of Science and Technology", "country": "Saudi Arabia", "identifiers": {"ror": "https://ror.org/01q3tbs38", "GRID": "grid.45672.32"}}]}, {"given": "Fabio", "family": "Marton", "affiliation": [{"original_name": "CRS4, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Fabio", "family": "Bettio", "affiliation": [{"original_name": "CRS4, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Markus", "family": "Hadwiger", "affiliation": [{"original_name": "King Abdullah University of Science and Technology, Saudi Arabia", "normalized_name": "King Abdullah University of Science and Technology", "country": "Saudi Arabia", "identifiers": {"ror": "https://ror.org/01q3tbs38", "GRID": "grid.45672.32"}}]}, {"given": "Enrico", "family": "Gobbetti", "affiliation": [{"original_name": "CRS4, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2018", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "11", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}