{"url": "http://dx.doi.org/10.1093/llc/fqu041", "identifier": {"string_id": "10.1093/llc/fqu041", "id_scheme": "DOI"}, "abstract": "The article aims to model the verbal and prosodic features of emotional expression in interviews to investigate the potential for synergy between scholarly fields that have the narrative as object of study. Using a digital collection of oral history interviews that contains narrative aspects addressing war and violence in Croatia, we analyzed emotional expression through the words spoken, and through the pitch, vocal effort, and pause duration in the speech signal. The findings were correlated with the linear structure of interviews as well as question type. Our analysis indicates that the weight of emotion words for the overall expressed emotion is stronger in later interview parts as well as after open questions and meaning questions. Similar patterns were found for pitch and pause duration, but not for vocal effort. Although the verbal expression of emotions was somewhat correlated to pause duration, the hypothesized correlation between the verbal and nonverbal features was not confirmed. The research also shows that the various expressive layers in the interviews as well as the relations between them are a suited basis for computational modeling that may help track emotional personal narratives in interview collections. Additional research is needed to further develop the framework for the automated analysis of verbal and nonverbal cues to automatically generate annotations to be used for exploring spoken word collections.", "article_title": "Towards modeling expressed emotions in oral history interviews: Using verbal and nonverbal signals to track personal narratives", "authors": [{"given": " Khiet P.", "family": "Truong", "affiliation": [{"original_name": "Human Media Interaction, University of Twente, The Netherlands", "normalized_name": "University of Twente", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/006hf6230", "GRID": "grid.6214.1"}}]}, {"given": " Gerben J.", "family": "Westerhof", "affiliation": [{"original_name": "Department of Psychology, Health, and Technology, University of Twente, The Netherlands", "normalized_name": "University of Twente", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/006hf6230", "GRID": "grid.6214.1"}}]}, {"given": " Sanne M. A.", "family": "Lamers", "affiliation": [{"original_name": "Department of Psychology, Health, and Technology, University of Twente, The Netherlands", "normalized_name": "University of Twente", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/006hf6230", "GRID": "grid.6214.1"}}]}, {"given": " Franciska", "family": "de Jong", "affiliation": [{"original_name": "Human Media Interaction, University of Twente, The Netherlands", "normalized_name": "University of Twente", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/006hf6230", "GRID": "grid.6214.1"}}, {"original_name": "Erasmus Studio for e-research, Erasmus Universiteit Rotterdam, The Netherlands", "normalized_name": "Erasmus University Rotterdam", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/057w15z03", "GRID": "grid.6906.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}