{"url": "http://dx.doi.org/10.1093/llc/fqz096", "identifier": {"string_id": "10.1093/llc/fqz096", "id_scheme": "DOI"}, "abstract": "Deep neural networks have been widely used in various language processing tasks. Recurrent neural networks (RNNs) and convolutional neural networks (CNN) are two common types of neural networks that have a successful history in capturing temporal and spatial features of texts. By using RNN, we can encode input text to a lower space of semantic features while considering the sequential behavior of words. By using CNN, we can transfer the representation of input text to a flat structure to be used for classifying text. In this article, we proposed a novel recurrent CNN model to capture not only the temporal but also the spatial features of the input poem/verse to be used for poet identification. Considering the shortcomings of the normal RNNs, we try both long short-term memory and gated recurrent unit units in the proposed architecture and apply them to the poet identification task. There are a large number of poems in the history of literature whose poets are unknown. Considering the importance of the task in the information processing field, a great variety of methods from traditional learning models, such as support vector machine and logistic regression, to deep neural network models, such as CNN, have been proposed to address this problem. Our experiments show that the proposed model significantly outperforms the state-of-the-art models for poet identification by receiving either a poem or a single verse as input. In comparison to the state-of-the-art CNN model, we achieved 9% and 4% improvements in f-measure for poem- and verse-based tasks, respectively.", "article_title": "Recurrent convolutional neural networks for poet identification", "authors": [{"given": " Dariush", "family": "Salami", "affiliation": [{"original_name": "Department of Communication and Networking, School of Electrical Engineering, Aalto University, Finland", "normalized_name": "Aalto University", "country": "Finland", "identifiers": {"ror": "https://ror.org/020hwjq30", "GRID": "grid.5373.2"}}]}, {"given": " Saeedeh", "family": "Momtazi", "affiliation": [{"original_name": "Computer Engineering Department, Amirkabir University of Technology, Tehran, Iran", "normalized_name": "Amirkabir University of Technology", "country": "Iran", "identifiers": {"ror": "https://ror.org/04gzbav43", "GRID": "grid.411368.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}