{"url": "http://dx.doi.org/10.1093/llc/fqy051", "identifier": {"string_id": "10.1093/llc/fqy051", "id_scheme": "DOI"}, "abstract": "Although recent research acknowledges the potential of visualization methods in digital humanities (DH), the predominant terminology used to describe visualizations (prototypes and tools) focuses on their use as a means to an end and, more importantly, as an instrument in the service of humanities research. We introduce the sandcastle as a metaphorical lens and provocative term to highlight visualization as a research process in its own right. We argue that building visualization sandcastles provides a holistic approach to cross-disciplinary knowledge generation that embraces visualization as (1) an aesthetic provocation to elicit critical insights, interpretation, speculation, and discussions within and beyond scholarly audiences, (2) a dynamic process wherein speculation and re-interpretation advance knowledge within all disciplines involved, and (3) a mediator of ideas and theories within and across disciplines. Our argument is grounded in critical theory, DH, design, human–computer interaction, and visualization, and based on our own research on an exceptional literary collection. We argue that considering visualizations as sandcastles foregrounds valuable insights into the roles of visualization as a mindset, methodology, and praxis within humanities research and beyond.", "article_title": "In defense of sandcastles: Research thinking through visualization in digital humanities", "authors": [{"given": " Uta", "family": "Hinrichs", "affiliation": [{"original_name": "School of Computer Science, University of St Andrews, Scotland", "normalized_name": "University of St Andrews", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02wn5qz54", "GRID": "grid.11914.3c"}}]}, {"given": " Stefania", "family": "Forlini", "affiliation": [{"original_name": "Department of English, University of Calgary, Canada", "normalized_name": "University of Calgary", "country": "Canada", "identifiers": {"ror": "https://ror.org/03yjb2x39", "GRID": "grid.22072.35"}}]}, {"given": " Bridget", "family": "Moynihan", "affiliation": [{"original_name": "University of Edinburgh, UK", "normalized_name": "University of Edinburgh", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01nrxwf90", "GRID": "grid.4305.2"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "Supplement_1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}