{"url": "http://dx.doi.org/10.17928/jjadh.2.1_90", "identifier": {"string_id": "10.17928/jjadh.2.1_90", "id_scheme": "DOI"}, "abstract": "Popular songs can be regarded as a fine representation of modern society andculture. In particular, the lyrics of popular songs are the most importantaspect for understanding the sense of values and linguistic sensitivity in agiven generation and community. The purpose of the present study is toinvestigate the chronological variation of popular Japanese songs usingstylometric techniques. This study draws on the lyrics of 858 songs, whichappeared on the Oricon annual top 20 single hit chart between 1976 and 2015. Thelinguistic features investigated in this study include five different types oflexical indices, namely (a) number of words, (b) parts-of-speech, (c) wordtypes, (d) character types, and (e) vocabulary level. Multiple regressionanalysis was conducted to explore the chronological change in the frequencies oflexical indices. The results showed that the frequencies of word types andcharacter types dramatically changed before and after 1990. Moreover, the usagesof auxiliary verbs as well as lower level vocabulary became more prominent,whereas the frequencies of adjectival nouns and conjunctions decreased. Thefindings suggest that a turning point in cultural trends corresponds with thehistorically significant political and economic events, such as the end of theShowa era and the burst of the bubble economy.", "article_title": "Investigating the Chronological Variation of Popular Song Lyrics ThroughLexical Indices", "authors": [{"given": "Yuichiro", "family": "Kobayashi", "affiliation": [{"original_name": "Nihon University", "normalized_name": "Nihon University", "country": "Japan", "identifiers": {"ror": "https://ror.org/05jk51a88", "GRID": "grid.260969.2"}}]}, {"given": "Misaki", "family": "Amagasa", "affiliation": [{"original_name": "Toyo University", "normalized_name": "Toyo University", "country": "Japan", "identifiers": {"ror": "https://ror.org/059d6yn51", "GRID": "grid.265125.7"}}]}, {"given": "Takafumi", "family": "Suzuki", "affiliation": [{"original_name": "Toyo University", "normalized_name": "Toyo University", "country": "Japan", "identifiers": {"ror": "https://ror.org/059d6yn51", "GRID": "grid.265125.7"}}]}], "publisher": "Japanese Association for Digital Humanities", "date": "2017-09-06", "keywords": null, "journal_title": "Journal of the Japanese Association for Digital Humanities", "volume": "2", "issue": "1", "ISSN": [{"value": "2188-7276", "type": "electronic"}]}