{"url": "http://dx.doi.org/10.1093/llc/15.1.65", "identifier": {"string_id": "10.1093/llc/15.1.65", "id_scheme": "DOI"}, "abstract": "Scholarly editing in the Netherlands is concentrated in the Constantijn Huygens Institut (CHI) in The Hague, which is a research institute of the Royal Netherlands Academy of Arts and Sciences. The CHI produces text editions of works from every period of Dutch literary history. All genres and types of editions are represented. Editorial methods and techniques developed in other countries are adopted according to the needs of the Institute. In the past, most projects at the CHI resulted in printed publications and little consideration was given to production or presentation using electronic media. In the recent planning and development of new projects, however, an important shift can be seen in favour of these media. For two of the projects outlined in this paper this includes or has included the digitization of all relevant versions of a text through scanning and OCR. Computer programs such as TUSTEP and COLLATE will be used to compare all of those versions. The copy of the editions will be stored in SGML to make future reprints possible. Lists of authorial variants and perhaps other research material will be made available on the Internet. The third project discussed here involves the publication in its entirety of a sizeable body of nineteenth-century poetry by means of a CD-ROM/DVD or the Internet. The full-text electronic edition will also contain digital images of the original documents as well as hypertext links to the author's annotations.", "article_title": "Scholarly editing in The Netherlands", "authors": [{"given": "H.", "family": "van Vliet", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "A.", "family": "Kets-Vree", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "15", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}