{"url": "http://dx.doi.org/10.1093/llc/fqv065", "identifier": {"string_id": "10.1093/llc/fqv065", "id_scheme": "DOI"}, "abstract": "This article surveys how phylogenetics may be applied effectively and productively to the analysis of textual traditions—and, by implication, how it might not be. Examples from two very different traditions (the artificial Julius Caesar ‘Orange Branch’, and Chaucer’s Wife of Bath’s Prologue) are deployed to support four central premises. First, it is an error to understand the results of any quantitative analysis of textual traditions as if they represent exactly what happened in the actual making of these copies. Second, phylogenetic methods can give useful results on uncorrected, unregularized data for vernacular and other traditions, where the spelling of individual words is relatively stable across copies. Third, before any collation, any transcription, any data preparation is started toward investigation of a textual tradition, and before analysis commences, the editor must develop an explicit model of the variation he or she expects to find in the copies which constitute that tradition. Fourth, one can only be as certain, in any reconstruction of any textual tradition, as the data, the model of variation, the methods applied, and other evidence allow. The discussion leads to a final conclusion that scholars should use both traditional qualitative analysis and the new quantitative methods to complement, correct, and complete each other.", "article_title": "Four rules for the application of phylogenetics in the analysis of textual traditions", "authors": [{"given": " Peter", "family": "Robinson", "affiliation": [{"original_name": "University of Saskatchewan, Canada", "normalized_name": "University of Saskatchewan", "country": "Canada", "identifiers": {"ror": "https://ror.org/010x8gc63", "GRID": "grid.25152.31"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2015", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "31", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}