{"url": "http://dx.doi.org/10.1093/llc/fqv005", "identifier": {"string_id": "10.1093/llc/fqv005", "id_scheme": "DOI"}, "abstract": "This article presents a novel architecture using a hybrid model for developing a Sindhi spellchecker system which has yet not been developed prior to this work. The compound textual forms and glyphs of Sindhi language presents a substantial challenge for developing a Sindhi spellchecker system and generating a similar suggestion list for misspelled words. In order to implement such a system, phonetic-based Sindhi language rules and patterns must be taken into account for increasing the accuracy and efficiency. In this research work, a simple and efficient combinational hybrid system is proposed, using three different algorithms, the Edit Distance algorithm to find the measure of similarity between two Sindhi strings. The phonetic-based SoundEx and ShapeEx algorithms are developed for pattern or glyph matching, generating accurate and an efficient suggestion list for incorrect or misspelled Sindhi words. The proposed system is established with a blend between Phonetic-based SoundEx algorithm and ShapeEx algorithm for pattern or glyph matching, generating accurate and efficient suggestion list for incorrect or misspelled Sindhi words. In this article, a table of phonetically similar-sounding Sindhi characters is presented which are grouped together along with another table containing similar glyph or shape-based character groups. The system has been successfully integrated into a pre-developed Sindhi word processer application. The Sindhi word segmentation methodology and algorithms required for the spellchecker has already been published and so are not discussed in detail in this article.", "article_title": "Phonetic-based Sindhi spellchecker system using a hybrid model", "authors": [{"given": " Zeeshan", "family": "Bhatti", "affiliation": [{"original_name": "Institute of Information and Communication Technology, University of Sindh, Jamshoro, Pakistan", "normalized_name": "University of Sindh", "country": "Pakistan", "identifiers": {"ror": "https://ror.org/01d692d57", "GRID": "grid.412795.c"}}]}, {"given": " Imdad", "family": "Ali Ismaili", "affiliation": [{"original_name": "Institute of Information and Communication Technology, University of Sindh, Jamshoro, Pakistan", "normalized_name": "University of Sindh", "country": "Pakistan", "identifiers": {"ror": "https://ror.org/01d692d57", "GRID": "grid.412795.c"}}]}, {"given": " Dil", "family": "Nawaz Hakro", "affiliation": [{"original_name": "School of Computer Sciences, University Sains Malaysia, Malaysia", "normalized_name": "Universiti Sains Malaysia", "country": "Malaysia", "identifiers": {"ror": "https://ror.org/02rgb2k63", "GRID": "grid.11875.3a"}}]}, {"given": " Waseem", "family": "Javid Soomro", "affiliation": [{"original_name": "Institute of Information and Communication Technology, University of Sindh, Jamshoro, Pakistan", "normalized_name": "University of Sindh", "country": "Pakistan", "identifiers": {"ror": "https://ror.org/01d692d57", "GRID": "grid.412795.c"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2015", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "31", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}