{"url": "http://dx.doi.org/10.1093/llc/fqy074", "identifier": {"string_id": "10.1093/llc/fqy074", "id_scheme": "DOI"}, "abstract": "In this article, we introduce the first Kurdish text corpus for Central Kurdish (Sorani) branch, called AsoSoft text corpus. Kurdish language, which is spoken by more than 30 million people, has various dialects. As one of the two main branches of Kurdish, Central Kurdish is the formal dialect of Kurdish literature. AsoSoft text corpus is of size 188 million tokens and has been collected mostly from Web sites, published books, and magazines. The corpus has been normalized and converted into Text Encoding Initiative XML format. In both collecting and processing the text, we have faced several challenges and have proposed solutions to them. About 22% of the corpus is topic annotated with six topic tags, and a topic identification task has been done to evaluate the correctness of annotation. The computational experiments of the Central Kurdish text processing are also presented with the support of related supplementary statistics. For the first time, the validity of Zipf’s law for Central Kurdish is presented and also perplexity of this language is calculated using standard N-gram language models. The perplexity of Central Kurdish is 276 for a tri-gram language model.", "article_title": "Toward Kurdish language processing: Experiments in collecting and processing the AsoSoft text corpus", "authors": [{"given": " Hadi", "family": "Veisi", "affiliation": [{"original_name": "Faculty of New Sciences and Technologies, University of Tehran, Iran", "normalized_name": "University of Tehran", "country": "Iran", "identifiers": {"ror": "https://ror.org/05vf56z40", "GRID": "grid.46072.37"}}]}, {"given": " Mohammad", "family": "MohammadAmini", "affiliation": [{"original_name": "IT Department, Faculty of Engineering, Tarbiat Modares University, Iran", "normalized_name": "Tarbiat Modares University", "country": "Iran", "identifiers": {"ror": "https://ror.org/03mwgfy56", "GRID": "grid.412266.5"}}]}, {"given": " Hawre", "family": "Hosseini", "affiliation": [{"original_name": "Electrical and Computer Engineering, Ryerson University, Canada", "normalized_name": "Ryerson University", "country": "Canada", "identifiers": {"ror": "https://ror.org/05g13zd79", "GRID": "grid.68312.3e"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}