{"url": "http://dx.doi.org/10.1093/llc/fqy012", "identifier": {"string_id": "10.1093/llc/fqy012", "id_scheme": "DOI"}, "abstract": "While studies on diachronic Chinese syntax have identified a number of linguistic changes in Medieval Chinese, they have mostly been underpinned by qualitative analyses. In the most large-scale quantitative analysis to-date, this article investigates changes in the use of classifiers, demonstratives, and copulae. Our analysis, based on the Chinese Buddhist Canon, examines over 40 million characters in texts spanning a millennium. Results suggest that from the late Eastern Han period (circa 150 CE) onwards, the vernacular style became increasingly widespread, at the expense of the literary style, as reflected by changes in the use of classifiers and demonstratives, and in the construction of nominal sentences. However, the vernacular style became less frequently used in the Northern Sung period (960–1127 CE). This reversal may shed light on the work of the Stylists, editors appointed by the Sung court to polish Buddhist texts with more literary elements.", "article_title": "Vernacularization in Medieval Chinese: A quantitative study on classifiers, demonstratives, and copulae in the Chinese Buddhist Canon", "authors": [{"given": " Tak-sum", "family": "Wong", "affiliation": [{"original_name": "Department of Linguistics and Translation, City University of Hong Kong, Kowloon, Hong Kong", "normalized_name": "City University of Hong Kong", "country": "China", "identifiers": {"ror": "https://ror.org/03q8dnn23", "GRID": "grid.35030.35"}}]}, {"given": " John S Y", "family": "Lee", "affiliation": [{"original_name": "Department of Linguistics and Translation, City University of Hong Kong, Kowloon, Hong Kong", "normalized_name": "City University of Hong Kong", "country": "China", "identifiers": {"ror": "https://ror.org/03q8dnn23", "GRID": "grid.35030.35"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}