{"url": "http://dx.doi.org/10.1093/llc/fqx043", "identifier": {"string_id": "10.1093/llc/fqx043", "id_scheme": "DOI"}, "abstract": "This article looks at the provenance of the unfinished novel The Dark Tower, generally attributed to C. S. Lewis. The manuscript was purportedly rescued from a bonfire shortly after Lewis’s death by his literary executor Walter Hooper, but the quality of the text is hardly vintage Lewis. Using computer stylometric programs made available by Eder et al.’s (2016: Stylometry with R: A package for computational text analysis. R Journal, 8(1): 107–21) ‘stylo’ package and a word length analysis, samples of each chapter of The Dark Tower were compared with works known to be by Lewis, two books by Hooper and a hoax letter concerning the bonfire by Anthony Marchington. Initial experiments found that the first six chapters of The Dark Tower were stylometrically consistent with Lewis’s known works, but the incomplete Chapter 7 was not. This may have been due to an abrupt change in genre, from narrative to pseudoscientific style. Using principal components analysis, it was found that the first and subsequent components were able to separate genre and individual style, and thus a plot of the second against the third principal components enabled the effects of genre to be filtered out. This showed that Chapter 7 was also consistent with the other samples of C. S. Lewis’s writing.", "article_title": "Computer stylometry of C. S. Lewis’s The Dark Tower and related texts", "authors": [{"given": " Michael P", "family": "Oakes", "affiliation": [{"original_name": "RIILP, University of Wolverhampton, England", "normalized_name": "University of Wolverhampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01k2y1055", "GRID": "grid.6374.6"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2017", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}