{"url": "http://dx.doi.org/10.1145/3057929", "identifier": {"string_id": "10.1145/3057929", "id_scheme": "DOI"}, "abstract": "Archaeological data are characterized by both spatial and temporal dimensions that are often related to each other and are of particular interest during the interpretation process. For this reason, several attempts have been performed in recent years to develop a geographical information system (GIS) tailored for archaeological data. However, despite the increasing use of information technologies in the archaeological domain, the actual situation is that any agency or research group independently develops its own local database and management application that is isolated from the others. Conversely, the sharing of information and the cooperation between different archaeological agencies or research groups can be particularly useful to support the interpretation process by using data discovered in similar situations with respect to spatio-temporal or thematic aspects. In the geographical domain, the INSPIRE initiative of the European Union tries to support the development of a spatial data infrastructure (SDI) through which several organizations, such as public bodies or private companies, with overlapping goals can share data, resources, tools, and competencies in an effective way. The aim of this article is to lay the basis for the development of an archaeological SDI starting from the experience acquired during the collaboration among several Italian organizations. In particular, the article proposes a spatio-temporal conceptual model for archaeological data based on the ISO Standards of the 19100 family and promotes the use of the GeoUML methodology to put into practice such interoperability. The GeoUML methodology and tools have been enhanced to suit the archaeological domain and to automatically produce several useful documents, configuration files, and code base starting from the conceptual specification. The applicability of the spatio-temporal conceptual model and the usefulness of the produced tools have been tested in three different Italian contexts: Rome, Verona, and Isola della Scala.", "article_title": "An Interoperable Spatio-Temporal Model for Archaeological Data Based on ISO Standard 19100", "authors": [{"given": "Sara", "family": "Migliorini", "affiliation": [{"original_name": "University of Verona, Verona (Italy)", "normalized_name": "University of Verona", "country": "Italy", "identifiers": {"ror": "https://ror.org/039bp8j42", "GRID": "grid.5611.3"}}]}, {"given": "Piergiovanna", "family": "Grossi", "affiliation": [{"original_name": "University of Verona, Verona (Italy)", "normalized_name": "University of Verona", "country": "Italy", "identifiers": {"ror": "https://ror.org/039bp8j42", "GRID": "grid.5611.3"}}]}, {"given": "Alberto", "family": "Belussi", "affiliation": [{"original_name": "University of Verona, Verona (Italy)", "normalized_name": "University of Verona", "country": "Italy", "identifiers": {"ror": "https://ror.org/039bp8j42", "GRID": "grid.5611.3"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2018", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "11", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}