{"url": "http://dx.doi.org/10.1093/llc/fql048", "identifier": {"string_id": "10.1093/llc/fql048", "id_scheme": "DOI"}, "abstract": "The search for a reliable expression to measure an author's lexical richness has constituted many statisticians' holy grail over the last decades in their attempt to solve some controversial authorship attributions. The greatest effort has been devoted to find a formula grounded on the computation of tokens, word-types, most-frequent-word(s), hapax legomena, hapax dislegomena, etc., such that it would characterize a text successfully, independent of its length. In this line, Yule's K and Zipf 's Z seem to be generally accepted by scholars as reliable measures of lexical repetition and lexical richness by computing content and function words altogether.1 Given the latter's higher frequency, they prove to be more reliable identifiers when isolatedly computed in p.c.a. and Delta-based attribution studies, and their rate to the former also measures the functional density of a text. In this paper, we aim to show that each constant serves to measure a specific feature and, as such, they are thought to complement one another since a supposedly rich text (in terms of its lemmas) does necessarily have to characterize by its low functional density, and vice versa. For this purpose, an annotated corpus of the West Saxon Gospels (WSG) and Apollonius of Tyre (AoT) has been used along with a huge raw corpus.", "article_title": "Function Words in Authorship Attribution Studies", "authors": [{"given": " Antonio Miranda", "family": "García", "affiliation": [{"original_name": "Department of English, School of Engineering, University of Málaga, Spain", "normalized_name": "University of Malaga", "country": "Spain", "identifiers": {"ror": "https://ror.org/036b2ww28", "GRID": "grid.10215.37"}}]}, {"given": " Javier Calle", "family": "Martín", "affiliation": [{"original_name": "Department of English, Faculty of Arts, University of Málaga, Spain", "normalized_name": "University of Malaga", "country": "Spain", "identifiers": {"ror": "https://ror.org/036b2ww28", "GRID": "grid.10215.37"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2006", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "22", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}