{"url": "http://dx.doi.org/10.1093/llc/fqz084", "identifier": {"string_id": "10.1093/llc/fqz084", "id_scheme": "DOI"}, "abstract": "A growing body of critical works on the digital expressions of African literature confirms the importance of digital literary studies in Africa. Examples of this growing scholarship include those of Shola Adenekan (2012) and Stephanie Santana (2018). Adenekan’s work focuses on ‘the Internetting of African literature’, while Santana's essay uses digital fiction from South Africa to offer a brilliant treatment of the connections between national spaces and digital networks. Several questions emerge, though, in considering how digital technologies reformulate the form, function, and audience of African literature. How are we, for instance, to understand the role of digital publics? What kind of ideological terrains emerge in online literary representations? What mediations do digital technologies bring to the changing forms and publics of contemporary writing in Africa? How does the ontology of the digital reconfigure the behaviour of the audience in the interpretation of literary meaning and how might previous scholarship such as those of Karin Barber’s on publics and audiences be read in the context of digitality? This article aims to answer these questions by examining some articulations of reader agency to Chinua Achebe’s There was a Country on digital avenues such as Facebook. Aside from an exploration of the intersection of digital culture and African literary forms, I hope to use online responses to Achebe’s memoir to track the trajectories of the new publics of African literature, showing how the ethnopolitics that greeted the publication of Achebe’s wartime narrative explicates the nature of digital publics", "article_title": "Chinua Achebe’s There was a Country and the digital publics of African literature", "authors": [{"given": " James", "family": "Yeku", "affiliation": [{"original_name": "Department of African and African American Studies, University of Kansas, Lawrence, KS, USA", "normalized_name": "University of Kansas", "country": "United States", "identifiers": {"ror": "https://ror.org/001tmjg57", "GRID": "grid.266515.3"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019-10-26", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}