{"url": "http://dx.doi.org/10.1093/llc/fqv015", "identifier": {"string_id": "10.1093/llc/fqv015", "id_scheme": "DOI"}, "abstract": "This keynote address for the 2014 Digital Humanities conference is a practitioner’s talk, and—though the abstract belies it—an optimistic one. I take as given the evidence that human beings are irrevocably altering the conditions for life on Earth and that, despite certain unpredictabilities, we live at the cusp of a mass extinction. What is the place of digital humanities (DH) practice in the new social and geological era of the Anthropocene? What are the DH community’s most significant responsibilities, and to whom? This talk positions itself in deep time, but strives for a foothold in the vital here-and-now of service to broad publics. From the presentist, emotional aesthetics of Dark Mountain to the arms-length futurism of the Long Now, I dwell on concepts of graceful degradation, preservation, memorialization, apocalypse, ephemerality, and minimal computing. I discuss digital recovery and close reading of texts and artifacts once thought lost forever, and the ways that prosopography, graphesis, and distant reading open new vistas on the longue durée. Can DH develop a practical ethics of resilience and repair? Can it become more humane while working at inhuman scales? Can we resist narratives of progress, and still progress? I wish to open community discussion about the practice of DH, and what to give, in the face of a great hiatus or the end of it all.", "article_title": "Digital Humanities in the Anthropocene", "authors": [{"given": " Bethany", "family": "Nowviskie", "affiliation": [{"original_name": "University of Virginia Library, VA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2015", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "30", "issue": "suppl 1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}