{"url": "http://dx.doi.org/10.1145/3383781", "identifier": {"string_id": "10.1145/3383781", "id_scheme": "DOI"}, "abstract": "The introduction of digital technologies into documentation methods for cultural heritage and archeology made it possible to develop new tools for the acquisition and management of information collected for multidisciplinary studies. These tools are beginning to assert themselves as supports privileged for the description, analysis and comprehension of the objects of study. SIAT is a first step toward the creation of a set of methods, modern tools of analysis, and research in history and archeology. The objective of this approach is to define a continuum of information between all phases of the process from image acquisition, video, and spatial data to the construction of semantically enriched representations by integrating multi-dimensional aspects, multi-scales, multi-layer, and multi-temporal. This research tries to provide a definition and development of a set of data processing modules that can be used by specialists in the conservation of cultural heritage.", "article_title": "SIAT", "authors": [{"given": "Ameni", "family": "Yengui", "affiliation": [{"original_name": "MIRACL, Sfax University, Tunisia University of Sfax, Tunisia, Faculty of Economics and Management", "normalized_name": "University of Sfax", "country": "Tunisia", "identifiers": {"ror": "https://ror.org/04d4sd432", "GRID": "grid.412124.0"}}]}, {"given": "Mahmoud", "family": "Neji", "affiliation": [{"original_name": "MIRACL, Sfax University, Tunisia University of Sfax, Tunisia, Faculty of Economics and Management", "normalized_name": "University of Sfax", "country": "Tunisia", "identifiers": {"ror": "https://ror.org/04d4sd432", "GRID": "grid.412124.0"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2020-07-07", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "13", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}