{"url": "http://dx.doi.org/10.1145/3336125", "identifier": {"string_id": "10.1145/3336125", "id_scheme": "DOI"}, "abstract": "CARE-GIS is a mapping application with Geographic Information Systems (GIS) functionalities that gives a geographic dimension to the important and valuable Corpus Architecturae Religiosae Europeae (CARE) dataset, useful not only for the scientific community but also for a larger public of non-specialists, who can easily access the CARE information from a map. The CARE-GIS application makes it possible to select and display CARE sites’ information (only for Italy, in the current version), by means of query forms, which allows one to cross several fields of the recorded data, to create thematic maps with the selected data. Moreover, the flexible nature of the application, by means of GeoJSON files and the QGIS software, allows one to add more layers, and map historical/archaeological data vs. other types of data, such as geomorphological ones or the analysis of the construction materials, or any other data related to the CARE sites. The displayed CARE data are extracted from the WikiCARE web pages by means of PHP “scraping” functions. A light-weight database is used by the CARE-GIS application, mainly to handle the connection to the WikiCARE website and fasten up the CARE sites’ search functions. The responsive CARE-GIS user interface allows accessing the maps from any kind of digital device, such as computers, tablets, and smartphones, making it a useful web application to get online information, when visiting the CARE mapped historical sites.", "article_title": "Mapping Medieval Christianity. CARE-GIS", "authors": [{"given": "Pacifico", "family": "Cofrancesco", "affiliation": [{"original_name": "Chemistry Department, CSGI Unit of Pavia, University of Pavia, Pavia, Italy", "normalized_name": "University of Pavia", "country": "Italy", "identifiers": {"ror": "https://ror.org/00s6t1f81", "GRID": "grid.8982.b"}}]}, {"given": "Consuelo", "family": "Capolupo", "affiliation": [{"original_name": "LATEM (Laboratorio di Archeologia Tardoantica e Medievale), University Suor Orsola Benincasa, Naples, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Alessia", "family": "Frisetti", "affiliation": [{"original_name": "LATEM (Laboratorio di Archeologia Tardoantica e Medievale), University Suor Orsola Benincasa, Naples, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2020", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "12", "issue": "4", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}