{"url": "http://dx.doi.org/10.1093/llc/fqw011", "identifier": {"string_id": "10.1093/llc/fqw011", "id_scheme": "DOI"}, "abstract": "One of the great advantages the digital medium has to offer the field of scholarly editing is that it makes its products much easier to distribute. No longer bound to a shelf, the Digital Scholarly Edition has the potential to reach a much wider audience than a printed edition could. To a certain extent, however, the nature of the materials textual scholars are working with dictates the perimeters within which this dissemination can take place. When working with modern manuscripts, for instance, copyright restrictions may limit the extent to which a project can distribute its resources. In an academic climate where open access is not only becoming a standard, but in some cases even a requirement for receiving funding, such limitations may be perceived as problematic. In this article, we argue that even within the boundaries of copyright restrictions there can still be room to produce and distribute the results of textual scholarship. Therefore, the article zooms in on the way in which different Digital Scholarly Editions of copyrighted materials deal with this issue, using the Beckett Digital Manuscript Project (BDMP; www.beckettarchive.org) and Woolf Online (www.woolfonline.com) as case studies. To conclude, we investigate other strategies that may be used to share as much research data as we are allowed to, e.g. by sharing metadata and ancillary data, or by using the fair use doctrine to circumvent the problem. Case studies used for this aspect of the article include ModNets (www.modnets.org), the BDMP Encoding Manual (www.beckettarchive.org/encodingmanual), the Lexicon of Scholarly Editing (http://uahost.uantwerpen.be/lse), and the Finnegans Wake Extensible Elucidation Treasury (FWEET; www.fweet.org).", "article_title": "Digital scholarly editing within the boundaries of copyright restrictions", "authors": [{"given": " Wout", "family": "Dillen", "affiliation": [{"original_name": "Centre for Manuscript Genetics, University of Antwerp, Belgium", "normalized_name": "University of Antwerp", "country": "Belgium", "identifiers": {"ror": "https://ror.org/008x57b05", "GRID": "grid.5284.b"}}]}, {"given": " Vincent", "family": "Neyt", "affiliation": [{"original_name": "Centre for Manuscript Genetics, University of Antwerp, Belgium", "normalized_name": "University of Antwerp", "country": "Belgium", "identifiers": {"ror": "https://ror.org/008x57b05", "GRID": "grid.5284.b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016-03-06", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "31", "issue": "4", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}