{"url": "http://dx.doi.org/10.1093/llc/fqz042", "identifier": {"string_id": "10.1093/llc/fqz042", "id_scheme": "DOI"}, "abstract": "The article offers a state-of-the-art overview of a number of Digital Humanities (DH) initiatives that have emerged in Sweden over the past decade. We identify two major developments that seem to be taking place within DH, with a specific focus on the infrastructural aspects of the development: (1) a strive to open up and broaden the research output and (2) multi-disciplinary collaboration and its effects. The two major components accentuate the new infrastructural patterns that are developing and the challenges these infer on universities. While current research is at large multi-disciplinary, developing infrastructures also enable the move towards post-disciplinarity, bringing the universities closer to the surrounding society. At five universities in Sweden, individual-sited infrastructures supporting DH research have been built today. They are complemented by national and international infrastructures, thus supporting developments and tackling some of the major challenges. In the article, the relations between individual disciplines, the question of multi- and post-disciplinarity, and the field of Digital Humanities are discussed, while stressing the factors necessary—sine qua non—for a fruitful development of the scholarly infrastructures.", "article_title": "Digital humanities in Sweden and its infrastructure: Status quo and the sine qua non", "authors": [{"given": " Koraljka", "family": "Golub", "affiliation": [{"original_name": "Institute and Department of Library and Information Science, School of Cultural Sciences, Faculty of Arts and Humanities, Linnaeus University, Sweden", "normalized_name": "Linnaeus University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/00j9qag85", "GRID": "grid.8148.5"}}]}, {"given": " Elisabet", "family": "Göransson", "affiliation": [{"original_name": "Centre for Theology and Religious Studies and Centre for Languages and Literature, Lund University, Sweden", "normalized_name": "Lund University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/012a77v79", "GRID": "grid.4514.4"}}]}, {"given": " Anna", "family": "Foka", "affiliation": [{"original_name": "Digital Humanities Uppsala (DH Uppsala), Department of ALM, Faculty of Arts, Uppsala University, Sweden", "normalized_name": "Uppsala University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/048a87296", "GRID": "grid.8993.b"}}, {"original_name": "Humlab, Umeå University, Sweden", "normalized_name": "Umeå University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/05kb8h459", "GRID": "grid.12650.30"}}]}, {"given": " Isto", "family": "Huvila", "affiliation": [{"original_name": "Department of ALM, Faculty of Arts, Uppsala University, Sweden", "normalized_name": "Uppsala University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/048a87296", "GRID": "grid.8993.b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019-06-18", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}