{"url": "http://dx.doi.org/10.1093/llc/fqs013", "identifier": {"string_id": "10.1093/llc/fqs013", "id_scheme": "DOI"}, "abstract": "This article explores building blocks in extant and emerging social media toward the possibilities they offer to the scholarly edition in electronic form, positing that we are witnessing the nascent stages of a new ‘social’ edition existing at the intersection of social media and digital editing. Beginning with a typological formulation of electronic scholarly editions, activities common to humanities scholars who engage with texts as expert readers are considered, noting that many methods of engagement both reflect the interrelated nature of long-standing professional reading strategies and are social in nature; extending this frame work, the next steps in the scholarly edition’s development in its incorporation of social media functionality reflect the importance of traditional humanistic activities and workflows, and include collaboration, incorporating contributions by its readers and re-visioning the role of the editor away from that of ultimate authority and more toward that of facilitator of reader involvement. Intended to provide a ‘toolkit’ for academic consideration, this discussion of the emerging social edition points to new methods of textual engagement in digital literary studies and is accompanied by two integral, detailed appendices, published in Digital Humanities Quarterly under the title ‘Pertinent discussions toward modeling the social edition: Annotated bibliographies’ (http://www.digitalhumanities.org/dhq/vol/6/1/000111/000111.html): one addressing issues pertinent to online reading and interaction, and another on social networking tools.", "article_title": "Toward modeling the social edition: An approach to understanding the electronic scholarly edition in the context of new and emerging social media", "authors": [{"given": " Ray", "family": "Siemens", "affiliation": [{"original_name": "Electronic Textual Cultures Lab, University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": " Meagan", "family": "Timney", "affiliation": [{"original_name": "Blurb, Inc.", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Cara", "family": "Leitch", "affiliation": [{"original_name": "Department of English, University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": " Corina", "family": "Koolen", "affiliation": [{"original_name": "Centre for the Arts in Society, Leiden University", "normalized_name": "Leiden University", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/027bh9e22", "GRID": "grid.5132.5"}}]}, {"given": " Alex", "family": "Garnett", "affiliation": [{"original_name": "School of Library, Archival & Information Studies, University of British Columbia", "normalized_name": "University of British Columbia", "country": "Canada", "identifiers": {"ror": "https://ror.org/03rmrcq20", "GRID": "grid.17091.3e"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "27", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}