{"url": "http://dx.doi.org/10.1093/llc/fqx030", "identifier": {"string_id": "10.1093/llc/fqx030", "id_scheme": "DOI"}, "abstract": "Understanding people’s online behaviour has traditionally been a field of interest of commercial research agencies. However, academic researchers in a variety of fields are interested in the same type of data to gain insights in the Web behaviour of users. Digital Humanities scholars interested in the use of digital collections are, e.g., interested in the navigation paths of users to these collections. In our case we wanted (1) to analyse the way news consumers visit news websites and (2) understand how these websites fit in their daily news consumption patterns. Until now most common applied scholarly research methods to analyse online user behaviour focus on analyses of log files provided by website owners or recalled user behaviour by survey, diary, or interview methods. Only recently scholars started to experiment with gathering real-world data of Web behaviour by monitoring a group of respondents. In this article we describe the set-up of ‘The Newstracker’, a tool that primarily allowed us to analyse online news consumption of a group of young Dutch news users on their desktop and laptop computers. We demonstrate the workflow of the Newstracker and how we designed the data collection and pre-processing phase. By reflecting on the technical, methodological, and analytical challenges we encountered, we illustrate the potential of online monitoring tools such as the Newstracker. We end our article with discussing its limitations by stressing the need for a multimethod study design when aiming not only to analyse but also to understand online user behaviour.", "article_title": "Analysing and understanding news consumption patterns by tracking online user behaviour with a multimodal research design", "authors": [{"given": " Martijn", "family": "Kleppe", "affiliation": [{"original_name": "National Library of the Netherlands (KB), The Netherlands and Vrije Universiteit Amsterdam, The Netherlands", "normalized_name": "VU Amsterdam", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/008xxew50", "GRID": "grid.12380.38"}}]}, {"given": " Marco", "family": "Otte", "affiliation": [{"original_name": "National Library of the Netherlands (KB), The Netherlands and Vrije Universiteit Amsterdam, The Netherlands", "normalized_name": "VU Amsterdam", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/008xxew50", "GRID": "grid.12380.38"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2017-10-14", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "32", "issue": "suppl_2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}