{"url": "http://dx.doi.org/10.1145/2532630.2532632", "identifier": {"string_id": "10.1145/2532630.2532632", "id_scheme": "DOI"}, "abstract": "Experimental archaeology has long yielded valuable insights into the tools and techniques that were featured in past peoples’ relationships with the material world around them. However, experimental archaeology has, until now, confined itself to rigid, empirical, and quantitative questions. This article applies principles of experimental archaeology and serious gaming tools in the reconstructions of a British Iron Age round house. This article explains a number of experiments conducted to look for quantitative differences in movement in virtual versus material environments, using both “virtual” studio reconstruction as well as material reconstruction. The data from these experiments was then analysed to look for differences in movement that could be attributed to artefacts and/or environments. This article also explains the structure of the experiments, how the data was generated, what theories may make sense of the data, what conclusions have been drawn, and how serious gaming tools can support the creation of new experimental heritage environments.", "article_title": "Experimental archaeology and games", "authors": [{"given": "Kirk", "family": "Woolford", "affiliation": [{"original_name": "University of Surrey Guildford, UK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Stuart", "family": "Dunn", "affiliation": [{"original_name": "Kings College London, UK", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2014-01-06", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "6", "issue": "4", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}