{"url": "http://dx.doi.org/10.1007/s42803-019-00014-8", "identifier": {"string_id": "10.1007/s42803-019-00014-8", "id_scheme": "DOI"}, "abstract": "Online book discussion is a popular activity on weblogs, specialized book discussion sites, booksellers’ sites and elsewhere. These discussions are important for research into literary reception and should be made and kept accessible for researchers. This article asks what an archive of online book discussion should and could look like, and how we could describe such an archive in terms of some of the central concepts of textual scholarship: work, document, text, transcription and variant. What could an approach along the lines of textual scholarship mean for such a collection? If such a collection holds many pieces of information that would not usually be considered text (such as demographic information about contributors), could we still call such a collection an edition, and could we call editing the activity of preparing such a collection?The article introduces some of the relevant (Dutch-language) sites, and summarizes their properties (among others: they are dynamic and vulnerable, they contain structured data and are very large) from the perspective of creating a research collection. It discusses the interpretation of some essential terms of textual studies in this context, and briefly lists a number of components that a digital edition of these sites might or should contain. It argues that such a collection is the result of scholarly work and should not be considered as 'just' a web archive.", "article_title": "Editing social media: the case of online book discussion", "authors": [{"given": "Peter", "family": "Boot", "affiliation": [{"original_name": "Huygens Institute for the History of the Netherlands, Amsterdam, The Netherlands", "normalized_name": "Huygens Institute for the History of the Netherlands", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/04x6kq749", "GRID": "grid.450092.a"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-05-23", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}