{"url": "http://dx.doi.org/10.1093/llc/fqu007", "identifier": {"string_id": "10.1093/llc/fqu007", "id_scheme": "DOI"}, "abstract": "Interoperability is the key term within the framework of the European-funded research project Interedition,1 whose aim is ‘to encourage the creators of tools for textual scholarship to make their functionality available to others, and to promote communication between scholars so that we can raise awareness of innovative working methods’. The tools developed by Interedition’s ‘Prototyping’ working group were tested by other research teams, which formulate strategic recommendations. To this purpose, the Centre for Manuscript Genetics (University of Antwerp), the Huygens Institute for the History of the Netherlands (The Hague), and the University of Würzburg have been working together within the framework of Interedition. One of the concrete results of collaboration is the development and fine-tuning of the text collation tool CollateX.2 In this article, we would like to investigate how the architecture of a digital archive containing modern manuscripts can be designed in such a way that users can autonomously collate textual units of their choice with the help of the collation tool CollateX and thus decide for themselves how efficiently this digital architecture functions—as an archive, as a genetic dossier, or as an edition. The first part introduces CollateX and its internal concepts and heuristics as a tool for digitally supported collation. How this tool can be integrated in the infrastructure of an electronic edition is discussed in part two. The third and final part examines the possibility of deploying CollateX for the collation of modern manuscripts by means of a test case: the Beckett Digital Manuscript Project (www.beckettarchive.org).", "article_title": "Computer-supported collation of modern manuscripts: CollateX and the Beckett Digital Manuscript Project", "authors": [{"given": " Ronald", "family": "Haentjens Dekker", "affiliation": [{"original_name": "Department of IT R&D, Huygens Institute for the History of the Netherlands, Royal Netherlands Academy of Arts and Sciences, The Netherlands", "normalized_name": "Royal Netherlands Academy of Arts and Sciences", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/043c0p156", "GRID": "grid.418101.d"}}]}, {"given": " Dirk", "family": "van Hulle", "affiliation": [{"original_name": "Department of Literary Studies, University of Antwerp, Antwerp, Belgium", "normalized_name": "University of Antwerp", "country": "Belgium", "identifiers": {"ror": "https://ror.org/008x57b05", "GRID": "grid.5284.b"}}]}, {"given": " Gregor", "family": "Middell", "affiliation": [{"original_name": "Institut für Deutsche Philologie, Universität Würzburg, Würzburg, Germany", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Vincent", "family": "Neyt", "affiliation": [{"original_name": "Department of Literary Studies, University of Antwerp, Antwerp, Belgium", "normalized_name": "University of Antwerp", "country": "Belgium", "identifiers": {"ror": "https://ror.org/008x57b05", "GRID": "grid.5284.b"}}]}, {"given": " Joris", "family": "van Zundert", "affiliation": [{"original_name": "Methodology Research Program, Huygens Institute for the History of the Netherlands, Royal Netherlands Academy of Arts and Sciences, The Netherlands", "normalized_name": "Royal Netherlands Academy of Arts and Sciences", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/043c0p156", "GRID": "grid.418101.d"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "30", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}