{"url": "http://dx.doi.org/10.1093/llc/fql032", "identifier": {"string_id": "10.1093/llc/fql032", "id_scheme": "DOI"}, "abstract": "This article presents elements of a Correspondence Analysis (CA) approach to the measurement of linguistic distances in dialectology. It argues that both linguistic and spatial factors are part of an explanation of geolinguistic variation, and it shows how the exploratory and graphical properties of CA can contribute to such an explanation. The application is a study of the different realizations of the phoneme /r/ in Acadian French, a dialect spoken in Canada. Data are from the Atlas linguistique du vocabulaire maritime acadien and include over 5,000 tokens from eighteen localities. Using chi-square distances, the analysis results in a two-dimensional space that arranges the localities along continua. Linguistic interpretation of this space, based on those features of /r/ that are identified as accounting for the structuring of these continua, suggests a hierarchy of phonological processes—including alternation between apical and dorsal articulations (in French words), and replacement of the retroflex rhotic found in English-origin words by apical and dorsal variants. Two external spatial factors, local concentration of francophone speakers and spheres of activity, are shown to correlate with the linguistic distances among localities.", "article_title": "Geographic Variation in Acadian French /r /: What Can Correspondence Analysis Contribute Toward Explanation?", "authors": [{"given": " Wladyslaw", "family": "Cichocki", "affiliation": [{"original_name": "University of New Brunswick, Canada", "normalized_name": "University of New Brunswick", "country": "Canada", "identifiers": {"ror": "https://ror.org/05nkf0n29", "GRID": "grid.266820.8"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2006-09-07", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "21", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}