{"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/21633", "identifier": {"string_id": "10.11588/dah.2015.1.21633", "id_scheme": "DOI"}, "abstract": "The past five years have witnessed a growing interest amongst art historians in the potential of digital projects to impact, if not transform, the discipline. A steep rise in conferences and institutes dedicated to digital art history, along with funding opportunities and institutional support, has accelerated the rate at which art historians are now engaging with digital techniques. With this new visibility, art historians have criticized themselves for lagging behind other disciplines such as history and archaeology. This article questions the assumption that art historians have been slow to embrace digital tools and methods through a brief historical examination of projects undertaken by institutions and scholars during the infancy of art history computing: the early 1980s through the early 1990s. Using Johanna Drucker's distinction of the \"digitized\" and \"digital\" iterations of art history, this essay traces the genealogies of both categories, arguing that scholars have been more active in theorizing, practicing and creating digital methods than is often seen to be the case. Ultimately, this essay is an attempt to help define from a historical perspective what \"digital art history\" is and how it has been practiced.", "article_title": "Forgotten Genealogies: Brief Reflections on the History of Digital Art History", "authors": [{"given": "Benjamin", "family": "Zweig", "affiliation": [{"original_name": "Visual Arts (CASVA) National Gallery of Art, Washington DC", "normalized_name": "National Gallery of Art", "country": "United States", "identifiers": {"ror": "https://ror.org/00q84em04", "GRID": "grid.431706.7"}}]}], "publisher": null, "date": "2015", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}