{"url": "http://dx.doi.org/10.1093/llc/fqr043", "identifier": {"string_id": "10.1093/llc/fqr043", "id_scheme": "DOI"}, "abstract": "We show how in colonial Potosí (present-day Bolivia) social and political stability was achieved through the self-organization of society through the repetition of religious rituals. Our analysis shows that the population of Potosí develops over the time a series of cycles of rituals and miracles as a response to social upheaval and natural disasters and that these cycles of religious performance become crucial mechanisms of cooperation among different ethnic and religious groups. Our methodology starts with a close reading and annotation of the Historia de Potosí by Bartolomé Arzans. Then, we model the religious cycles of miracles and rituals and store all social and cultural information about the cycles in a multirelational graph database. Finally, we perform graph analysis through traversals queries in order to establish facts concerning social networks, historical evolution of behaviors, types of participation of miraculous characters according to dates, parts of the city, ethnic groups, etc. It is also important to note that the religious activity at the group level gave native communities a way to participate in the social life. It also guaranteed that the city performed its role as producer of silver in the global economic structure of the Spanish empire. This case proves the importance of religion as a mechanism of stability and self-organization in periods of social or political turbulence. The multidisciplinary methodology combining traditional humanistic techniques with graph analysis shows a great potential for other sociological, historical, and literary problems.", "article_title": "The Potosi principle: religious prosociality fosters self-organization of larger communities under extreme natural and economic conditions", "authors": [{"given": " Juan Luis", "family": "Suárez", "affiliation": [{"original_name": "The CulturePlex Lab, Faculty of Arts and Humanities, University of Western Ontario, 1151 Richmond Street, London, ON, Canada N6A 3K7", "normalized_name": "Western University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02grkyz14", "GRID": "grid.39381.30"}}]}, {"given": " Shiddarta", "family": "Vásquez", "affiliation": [{"original_name": "The CulturePlex Lab, Faculty of Arts and Humanities, University of Western Ontario, 1151 Richmond Street, London, ON, Canada N6A 3K7", "normalized_name": "Western University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02grkyz14", "GRID": "grid.39381.30"}}]}, {"given": " Fernando", "family": "Sancho-Caparrini", "affiliation": [{"original_name": "Department of Computer Science and Artificial Intelligence, E.T.S. Ingeniería Informática, Universidad de Sevilla, Av. Reina Mercedes, s/n, 41012, Sevilla, Spain", "normalized_name": "University of Seville", "country": "Spain", "identifiers": {"ror": "https://ror.org/03yxnpp24", "GRID": "grid.9224.d"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2011", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "27", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}