{"url": "http://dx.doi.org/10.1093/llc/fqs034", "identifier": {"string_id": "10.1093/llc/fqs034", "id_scheme": "DOI"}, "abstract": "The article explores whether stylometric methods used in non-traditional authorship attribution can help to gain more insight in how medieval scribes dealt with the text they were copying. The research corpus consists of transcriptions from all more or less complete manuscripts of Jacob van Maerlant’s Scolastica, a Middle Dutch translation/adaptation of Peter Comestor’s Medieval Latin Historia scholastica. Five episodes were selected totalling seventy samples of around 1,200 tokens each. Cluster analysis and principal component analysis are used to compare the copies per episode. The results based on the Middle Dutch texts were highly influenced by irrelevant spelling variation. Since the aim was to explore differences on the content level of the copies, the analyses were extended to lemmatised versions of the texts. The results based on the lemmatised texts are a good starting point for the exploration of the ways in which Scolastica scribes dealt with the work they were copying. The main results of the exploration are that most copies of an episode cluster closely together, with only occasional outliers. The outliers are not the same for each episode, which suggests that a separate analysis and explanation per episode is needed—scribes may have had reasons to elaborate on one topic and to leave another untouched, for instance under the instruction of a patron. The article closes with some pointers for the next steps in the research, which are expected to need other kinds of methods for analysis.", "article_title": "The secret life of scribes. Exploring fifteen manuscripts of Jacob van Maerlant's Scolastica (1271)", "authors": [{"given": " Karina", "family": "van Dalen-Oskam", "affiliation": [{"original_name": "Huygens Institute for the History of the Netherlands (Royal Netherlands Academy of Arts and Sciences), The Netherlands", "normalized_name": "Royal Netherlands Academy of Arts and Sciences", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/043c0p156", "GRID": "grid.418101.d"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "27", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}