{"url": "http://dx.doi.org/10.1093/llc/fqt054", "identifier": {"string_id": "10.1093/llc/fqt054", "id_scheme": "DOI"}, "abstract": "Although a substantial corpus of digital materials is now available to scholarship across the disciplines, objective evidence of their use, impact, and value, based on a robust assessment, is sparse. Traditional methods of assessment of impact in the humanities, notably citation in scholarly publications, are not an effective way of assessing impact of digital content. These issues are problematic in the field of Digital Humanities where there is a need to effectively assess impact to justify its continued funding and existence. A number of qualitative and quantitative methods exist that can be used to monitor the use of digital resources in various contexts although they have yet to be applied widely. These have been made available to the creators, managers, and funders of digital content in an accessible form through the TIDSR (Toolkit for the Impact of Digital Scholarly Resources) developed by the Oxford Internet Institute. In 2011, the authors of this article developed the SPHERE project (Stormont Parliamentary Hansards: Embedded in Research and Education) specifically to use TIDSR to evaluate the use and impact of The Stormont Papers, a digital collection of the Hansards of the Stormont Northern Irish Parliament from 1921 to 1972. This article presents the methodology, findings, and analysis of the project. The authors argue that TIDSR is a useful and, critically, transferrable method to understand and increase the impact of digital resources. The findings of the project are modified into a series of wider recommendations on protecting the investment in digital resources by increasing their use, value, and impact. It is reasonable to suggest that effectively showing the impact of Digital Humanities is critical to its survival.", "article_title": "Assessing and measuring impact of a digital collection in the humanities: An analysis of the SPHERE (Stormont Parliamentary Hansards: Embedded in Research and Education) Project", "authors": [{"given": " Lorna M.", "family": "Hughes", "affiliation": [{"original_name": "National Library of Wales", "normalized_name": "National Library of Wales", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/03rjyp183", "GRID": "grid.421620.3"}}]}, {"given": " Paul S.", "family": "Ell", "affiliation": [{"original_name": "Queen’s University Belfast", "normalized_name": "Queen's University Belfast", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00hswnk62", "GRID": "grid.4777.3"}}]}, {"given": " Gareth A. G.", "family": "Knight", "affiliation": [{"original_name": "London School of Hygiene & Tropical Medicine", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Milena", "family": "Dobreva", "affiliation": [{"original_name": "University of Malta", "normalized_name": "University of Malta", "country": "Malta", "identifiers": {"ror": "https://ror.org/03a62bv60", "GRID": "grid.4462.4"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "30", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}