{"url": "http://dx.doi.org/10.1145/3343196", "identifier": {"string_id": "10.1145/3343196", "id_scheme": "DOI"}, "abstract": "In this article, we present a procedural approach to capture a variety of appearances of American Second Empire houses, which are well known for their mansard roofs and their inspired ornamentation. To develop this procedural approach, we have identified the set of rules and similarities of Second Empire houses. Our procedural approach, therefore, captures the style differences of Second Empire houses with a relatively few number of parameters. Using our interface, we are able to generate virtual houses in a wide variety of styles of American Second Empire architecture. We have also developed a method to break up these virtual models into slices in order to efficiently and economically 3D-print them. Using this method, we have printed miniatures of two landmark buildings in Savannah, GA and Baltimore, MD: The Hamilton-Turner Inn and Enoch Pratt House, respectively. We observe that the virtual models still provide more details because of the limited resolution of the 3D printing process as shown in Figures 1 and 2.", "article_title": "A Procedural Approach to Creating American Second Empire Houses", "authors": [{"given": "Madison", "family": "Kramer", "affiliation": [{"original_name": "Department of Visualization, Texas A8M University, San Antonio, TX", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Ergun", "family": "Akleman", "affiliation": [{"original_name": "Departments of Visualization 8 Computer Science and Engineering, Texas A8M University, College Station, TX", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2020", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "13", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}