{"url": "http://dx.doi.org/10.16995/dscn.18", "identifier": {"string_id": "10.16995/dscn.18", "id_scheme": "DOI"}, "abstract": "This paper outlines the circumstances surrounding a libel case that was filed against academic librarian Dale Askey by publisher Herbert Richardson and his company Edwin Mellen Press, the resulting online debate, protest, and advocacy, and the effort by a small team to capture, preserve, and make available preserved websites related to the event. Ruest, a programmer and archivist-librarian, presents the technical aspects of capturing and preserving WARC files. St.Onge, an archivist, reflects on some of the challenges of creating a traditional finding aid to contextualize and provide access to the collected electronic content. Milligan, a historian, discusses some preliminary findings based on analysis of the data set. Finally, the authors reflect on the issues brought to the surface by their engagement with questions of academic freedom, librarianship, and public advocacy and on how smaller groups of like-minded professionals can preserve online material whose afterlife might otherwise prove fleeting.", "article_title": "The great WARC adventure: Using SIPS, AIPS, and DIPS to document SLAPPs", "authors": [{"given": "Ian", "family": "Milligan", "affiliation": [{"original_name": "York University", "normalized_name": "York University", "country": "Canada", "identifiers": {"ror": "https://ror.org/05fq50484", "GRID": "grid.21100.32"}}]}, {"given": "Nick", "family": "Ruest", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Anna", "family": "St.Onge", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Open Library of the Humanities", "date": "2016", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "0", "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}