{"url": "http://dx.doi.org/10.1093/llc/fqz081", "identifier": {"string_id": "10.1093/llc/fqz081", "id_scheme": "DOI"}, "abstract": "This article reports on a study of interfaces to long-lived digital humanities (DH) resources using an innovative combination of research methods from book history, interface design, and digital preservation and curation to investigate how interfaces to DH resources have changed over time. To do this, we used the Internet Archive’s Wayback machine to investigate the original presentation and all subsequent changes to the interfaces of a small sample of projects. The study addresses the following questions: What can we learn from a study of interfaces to DH material? How have interfaces to DH materials changed over the course of their existence? Do these changes affect the way the resource is used, and the way it conveys meaning? Should we preserve interfaces for future scholarship? We show that a valuable information may be derived from the interfaces of long-lived projects. Visual design can communicate subtle messages about the way the resource was originally conceived by its creators and subsequent changes show how knowledge of user behaviour developed in the DH community. Interfaces provide information about the intellectual context of early digital projects. They can also provide information about the changing place of DH projects in local and national infrastructures, and the way that projects have sought to survive in challenging funding environments.", "article_title": "Interfaces, ephemera, and identity: A study of the historical presentation of digital humanities resources", "authors": [{"given": " Claire", "family": "Warwick", "affiliation": [{"original_name": "Department of English Studies, Durham University, UK", "normalized_name": "Durham University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01v29qb04", "GRID": "grid.8250.f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}