{"identifier": {"string_id": "10.16995/dm.42", "id_scheme": "DOI"}, "abstract": "The Cantus database is a well-established project devoted to the creation and distribution of electronic indices of manuscript and early printed sources of Latin chant for the liturgical Office. As of January 2011, there were over 379,000 records in the database, each of which is an individual chant in one of the 134 manuscripts which have been indexed to date. For over a decade, this research tool has been growing and adapting to the needs of chant scholars, musicologists, hagiographers, art historians and researchers in other fields. In addition to the basic search functions and downloading options, there are now several analytical tools available on the website, including a textual concordance and an interactive dendrogram-creation tool. The latter, an example of data-mining, allows the user to select a series of chants which will form the basis of a comparison among the numerous manuscripts whose contents are recorded in Cantus. Similarities in chant series can be interpreted as affinities among manuscripts, and so, the dendrograms which are created (through the calculations of similarity matrices) can assist researchers in identifying related chant repertories, in studying the origins and dissemination of saints' feasts, in providing evidence for the provenance of manuscript sources and, undoubtedly, for numerous other research applications.", "article_title": "The Cantus Database: Mining for Medieval Chant Traditions", "authors": [{"given": "Debra", "family": "Lacoste", "affiliation": [{"original_name": "University of Waterloo", "normalized_name": "University of Waterloo", "country": "Canada", "identifiers": {"ror": "https://ror.org/01aff2v68", "GRID": "grid.46078.3d"}}]}], "publisher": "Open Library of the Humanities", "date": "2012", "keywords": null, "journal_title": "Digital Medievalist", "volume": "7", "issue": null, "ISSN": [{"value": "1715-0736", "type": "electronic"}], "url": "http://dx.doi.org/10.16995/dm.42"}