{"url": "http://dx.doi.org/10.1093/llc/fqx029", "identifier": {"string_id": "10.1093/llc/fqx029", "id_scheme": "DOI"}, "abstract": "We present two new measures of syntactic distance between languages. First, we present the ‘movement measure’ which measures the average number of words that has moved in sentences of one language compared to the corresponding sentences in another language. Secondly, we introduce the ‘indel measure’ which measures the average number of words being inserted or deleted in sentences of one language compared to the corresponding sentences in another language. The two measures were compared to the ‘trigram measure’ which was introduced by Nerbonne & Wiersma (2006, A Measure of Aggregate Syntactic Distance. In Nerbonne, J. and Hinrichs, E. (eds.) Linguistic Distances Workshop at the joint conference of International Committee on Computational Linguistics and the Association for Computational Linguistics, Sydney, July, 2006, pp. 82–90.). We correlated the results of the three measures and found a low correlation between the results of the movement and indel measure, indicating that the two measures represent different kinds of linguistic variation. We found a high correlation between the results of the movement measure and the trigram measure. The results of all of the three measures suggest that English is syntactically a Scandinavian language. Because of our unique database design we were able to detect asymmetric relationships between the languages. All three measures suggest that asymmetric syntactical distances could be part of the explanation why native speakers of Dutch more easily understand German texts than native speakers of German understand Dutch texts (Swarte 2016).", "article_title": "Measuring syntactical variation in Germanic texts", "authors": [{"given": " Wilbert", "family": "Heeringa", "affiliation": [{"original_name": "Fryske Akademy, The Netherlands", "normalized_name": "Fryske Akademy", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/05fcmfe52", "GRID": "grid.450022.1"}}]}, {"given": " Femke", "family": "Swarte", "affiliation": [{"original_name": "Faculty of Arts, Applied Linguistics, University of Groningen, The Netherlands", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}, {"given": " Anja", "family": "Schüppert", "affiliation": [{"original_name": "Faculty of Arts, European Languages and Cultures, University of Groningen, The Netherlands", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}, {"given": " Charlotte", "family": "Gooskens", "affiliation": [{"original_name": "Faculty of Arts, Applied Linguistics, University of Groningen, The Netherlands", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}, {"original_name": "School of Behavioural, Cognitive and Social Sciences, University of New England, Australia", "normalized_name": "University of New England", "country": "United States", "identifiers": {"ror": "https://ror.org/02n2ava60", "GRID": "grid.266826.e"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}