{"url": "http://dx.doi.org/10.1093/llc/fqaa019", "identifier": {"string_id": "10.1093/llc/fqaa019", "id_scheme": "DOI"}, "abstract": "The growing amount of openly available research data enables various possibilities of reuse. Data can be analyzed, visualized, or even further processed, enriched, and combined with other sources to enable new research questions and a different view on the material. Several catalogues and research tools aggregate collections on specific topics to make them searchable and reusable. To be able to bring together different collections, a common data standard is necessary. This article discusses how semantic web technologies can be used to connect digital as well as analogue music catalogues and music editions. The article first discusses how music can be searched using its characteristic melody and presents the approach of the open-source search engine for music incipits, IncipitSearch. Subsequently, the advantages of semantic web standards for musicology are highlighted. Then, the underlying RDF- and schema.org-based metadata standard, which is used to aggregate and distribute the data, is discussed. The article concludes with an outlook on research perspectives for digital musicology and musicology in general.", "article_title": "Interconnecting music repositories with semantic web technologies—an RDF- and schema.org-based approach", "authors": [{"given": " Anna", "family": "Neovesky", "affiliation": [{"original_name": "Academy of Sciences and Literature, Mainz, Germany", "normalized_name": "Academy of Sciences and Literature", "country": "Germany", "identifiers": {"ror": "https://ror.org/01kdxra28", "GRID": "grid.461597.8"}}]}, {"given": " Frederic", "family": "von Vlahovits", "affiliation": [{"original_name": "Academy of Sciences and Literature, Mainz, Germany", "normalized_name": "Academy of Sciences and Literature", "country": "Germany", "identifiers": {"ror": "https://ror.org/01kdxra28", "GRID": "grid.461597.8"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}