{"url": "http://dx.doi.org/10.17928/jjadh.3.1_114", "identifier": {"string_id": "10.17928/jjadh.3.1_114", "id_scheme": "DOI"}, "abstract": "This article uses character n-grams methods to assess the authorship of three religious texts written in medieval Japan, comparing them to the works of Monkan (1278-1357), a Shingon monk active during the first half of the 14th century. Such texts belong to a literary genre called shōgyō that presents many challenges that render the use of traditional authorship attribution methods inappropriate. They were composed in Japanese kanbun (classical Chinese read in Japanese word order), and their contents are closer to cumulative work than to original creations by a single author. This article thus draws on previous research on the translators of the Chinese Buddhist canon, which have proven to be far more effective than traditional methods developed for modern languages for the analysis of this type of literature. Concretely, it proposes a workflow proceeding from the preparation of the corpus (with manuscript edition, encoding,…) to a concrete data analysis using the variable length n-gram method. The last part of the article deals with future perspectives that would further refine the results, such as taking into account the various speaking voices found inside the shōgyō and their relationship to the author, as well as stylistic analysis based on grammatical patterns. As a whole, the experiment succeeded in showing global trends in the texts of the Japanese Shingon schools, finding stylistic differences between the works of Kūkai, of monks from the 12th century, and of Monkan. Combined with a rigorous historical enquiry into the redaction context of the texts and their manuscripts, the data analysis also demonstrates that one of them was almost certainly written by Monkan, and another either by him or by one of his close disciples.", "article_title": "Data Mining in the Works of the Shingon Monk Monkan (1278–1357): Using Digital Methods to Assess the Contested Authorship of Three Religious Texts from Medieval Japan", "authors": [{"given": "Gaetan", "family": "Rappo", "affiliation": [{"original_name": "Graduate school of Letters, Nagoya University", "normalized_name": "Nagoya University", "country": "Japan", "identifiers": {"ror": "https://ror.org/04chrp450", "GRID": "grid.27476.30"}}]}], "publisher": "Japanese Association for Digital Humanities", "date": "2018-10-21", "keywords": null, "journal_title": "Journal of the Japanese Association for Digital Humanities", "volume": "3", "issue": "1", "ISSN": [{"value": "2188-7276", "type": "electronic"}]}