{"url": "http://dx.doi.org/10.1093/llc/fqx007", "identifier": {"string_id": "10.1093/llc/fqx007", "id_scheme": "DOI"}, "abstract": "This present article examines the verbal style and rhetoric of the candidates of the 2016 US presidential primary elections. To achieve this objective, this study analyzes the oral communication forms used by the candidates during the TV debates. When considering the most frequent lemmas, the candidates can be split into two groups, one using more frequently the pronoun ‘I’, and the second favoring more the ‘we’ (which corresponds to candidates leaving the presidential run sooner). According to several overall stylistic indicators, candidate Trump clearly adopted a simple and direct communication style, avoiding complex formulation and vocabulary. From a topical perspective, our analysis generates a map showing the affinities between candidates. This investigation results in the presence of three distinct groups of candidates, the first one with the Democrats (Clinton, O’Malley, and Sanders), the second with three Republicans (Bush, Cruz, Rubio), and the last with the duo Trump and Kasich, with, at a small distance, Paul. The over-used terms and typical sentences associated with each candidate reveal their specific topics such as ‘simple flat tax’ for Cruz, ‘balanced budget’ for Kasich, negativity with Trump, or critiques against large corporations and Wall Street for Sanders.", "article_title": "Analysis of the style and the rhetoric of the 2016 US presidential primaries", "authors": [{"given": " Jacques", "family": "Savoy", "affiliation": [{"original_name": "University of Neuchatel, Switzerland", "normalized_name": "University of Neuchâtel", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/00vasag41", "GRID": "grid.10711.36"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}