{"url": "http://dx.doi.org/10.1093/llc/fqu004", "identifier": {"string_id": "10.1093/llc/fqu004", "id_scheme": "DOI"}, "abstract": "The three main objectives of the research project ‘No Problem Has Solution: A Digital Archive of the Book of Disquiet’1 are: (1) to represent the dynamics of the acts of writing and editing in the production of the LdoD2; (2) to explore the potential of the digital medium to simulate the history of this dynamics; and (3) to create a space for virtualizing the LdoD capable of fostering new dynamics of reading, editing, and researching in the encounter between readers and its material corpus of written fragments. This article describes the project’s rationale and proposes a conceptual model of the functions that the software application to be developed should be able to perform. In this model, the electronic encoding of the fragments should support radial configurations that respond to multiple interactions. This model of the dynamic and reconfigurative iterability of the archive will enable users to virtualize the book according to four functions: reader-function, editor-function, book-function, and author-function.", "article_title": "A model for a virtualLdoD", "authors": [{"given": " Manuel", "family": "Portela", "affiliation": [{"original_name": "CLP-Centre for Portuguese Literature, University of Coimbra, Portugal", "normalized_name": "University of Coimbra", "country": "Portugal", "identifiers": {"ror": "https://ror.org/04z8k9a98", "GRID": "grid.8051.c"}}]}, {"given": " António", "family": "Rito Silva", "affiliation": [{"original_name": "INESC-ID, Instituto Superior Técnico, University of Lisbon, Portugal", "normalized_name": "University of Lisbon", "country": "Portugal", "identifiers": {"ror": "https://ror.org/01c27hj86", "GRID": "grid.9983.b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "30", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}