{"url": "http://dx.doi.org/10.1093/llc/16.2.135", "identifier": {"string_id": "10.1093/llc/16.2.135", "id_scheme": "DOI"}, "abstract": "This paper presents an overview of the goals, architecture, and usability of Kirrkirr, a Java-based visualization tool for XML dictionaries, currently being used with a dictionary for Warlpiri, an Australian Aboriginal language. It discusses the underlying lexicon structure, and shows how a computer interface can effectively select from and display that content in various ways. The views of the dictionary include a graph view, which shows a network of semantically related words, and a formatted text view that can be customized via XSLT stylesheets. The paper argues that indigenous language dictionaries have normally been written for linguists, whereas the educational needs of other users have not been adequately met. It discusses the strengths of a computer dictionary interface in providing more help to native speaker users than a conventional dictionary, but argues that the possibilities for the visualization of dictionary information on computers have so far been insufficiently exploited. The paper concludes by briefly discussing observational and task-based testing of the dictionary with native speakers and learners.", "article_title": "Kirrkirr: software for browsing and visual exploration of a structured Warlpiri", "authors": [{"given": " Christopher D.", "family": "Manning", "affiliation": [{"original_name": "Stanford UniversityStanford, CA, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Kevin", "family": "Jansz", "affiliation": [{"original_name": "University of SydneySydney, NSW, Australia", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Nitin", "family": "Indurkhya", "affiliation": [{"original_name": "Nanyang Technological UniversitySingapore", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "16", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}