{"url": "http://dx.doi.org/10.1093/llc/18.2.167", "identifier": {"string_id": "10.1093/llc/18.2.167", "id_scheme": "DOI"}, "abstract": "The inability of computing humanists to break into the mainstream of literary critical scholarship may be attributed to the prevalence of scientific methodologies and metaphors in humanities computing research—methodologies and metaphors that are wholly foreign not only the language of literary criticism, but to its entire purpose. Breaking out of this unfortunate misalignment entails reaching for more appropriate paradigms. The ‘algorithmic criticism’ here proposed rejects the empiricist vision of the computer as a means by which critical interpretations may be verified, and instead seeks to locate computational processes within the rich tradition of interpretive endeavours (usually aligned more with art than criticism), which seek not to constrain meaning, but to guarantee its multiplicity. Computational processes, which are perhaps more conformable to this latter purpose, may be usefully viewed as ways of providing the necessary conditions for interpretive insight. Algorithmic criticism seeks, therefore, in the narrowing forces of constraint embodied and instantiated in the strictures of algorithmic processing, an analogue to the liberating potentialities of art and the ludic values of humanistic inquiry. It proposes that we reconceive computer‐assisted text analysis as an activity best employed not in the service of a heightened critical objectivity, but as one that embraces the possibilities of that deepened subjectivity upon which critical insight depends.", "article_title": "Special Section: Reconceiving Text Analysis: Toward an Algorithmic Criticism", "authors": [{"given": "S.", "family": "Ramsay", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "18", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}