{"url": "http://dx.doi.org/10.1145/2693847", "identifier": {"string_id": "10.1145/2693847", "id_scheme": "DOI"}, "abstract": "The literature on information retrieval shows the importance of information reliability as a key criterion for relevance judgment. However, information reliability evaluation is discussed in many disciplines such as history, Arabic storytelling, and computer science. Although these disciplines share common principles, they differ in many aspects, which are studied in this article. However, we mainly focus on two disciplines. On the one hand, Arabic storytelling stands by rigid rules for transmitting information and inspecting sources and contents. On the other hand, the characteristics of the Web as a collaborative, open and vast area for information sharing has caused changes in our evaluation of information. This article studies related works to enumerate the main principles and steps that constitute guidelines for automatic information reliability evaluation. Finally, these guidelines are applied to Arabic storytelling, and experimental results are presented.", "article_title": "Information Reliability Evaluation", "authors": [{"given": "Ibrahim", "family": "Bounhas", "affiliation": [{"original_name": "LISI: Computing Lab. for Industrial Systems, Higher Institute of Documentation, Manouba University, Tunisia", "normalized_name": "Manouba University", "country": "Tunisia", "identifiers": {"ror": "https://ror.org/0503ejf32", "GRID": "grid.424444.6"}}]}, {"given": "Bilel", "family": "Elayeb", "affiliation": [{"original_name": "RIADI Research Laboratory, ENSI, Manouba University, Tunisia, and Emirates College of Technology, Abu Dhabi, UAE", "normalized_name": "Manouba University", "country": "Tunisia", "identifiers": {"ror": "https://ror.org/0503ejf32", "GRID": "grid.424444.6"}}]}, {"given": "Fabrice", "family": "Evrard", "affiliation": [{"original_name": "Informatics Research Institute of Toulouse (IRIT), Toulouse, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Yahya", "family": "Slimani", "affiliation": [{"original_name": "LISI: Computing Lab. for Industrial Systems, Higher Institute of Multimedia Arts of Manouba, Manouba University, Tunisia", "normalized_name": "Manouba University", "country": "Tunisia", "identifiers": {"ror": "https://ror.org/0503ejf32", "GRID": "grid.424444.6"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2015", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "8", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}