{"url": "http://dx.doi.org/10.1093/llc/fql034", "identifier": {"string_id": "10.1093/llc/fql034", "id_scheme": "DOI"}, "abstract": "Dialectometric techniques analyze linguistic variation quantitatively, allowing one to aggregate over what are frequently rebarbative geographic patterns of individual linguistic variants, such as which word is used for a particular concept in a language area, or which sounds are used in particular words. This leads to general formulations of the relation between linguistic variation and explanatory factors. Dialectometric techniques are maturing continuously, paving the way to genuinely new opportunities for the explanation of linguistic variation. These include, most prominently, techniques for analyzing syntactic variation, techniques for comparing the relative importance of different individual linguistic variables, techniques for comparing the relative importance of linguistic levels such as pronunciation, vocabulary, and/or prosody, and many more. This article serves as an introduction to a special issue of Literary and Linguistic Computing devoted to presenting a new work constituting Progress in Dialectometry: Toward Explanation.", "article_title": "Progress in Dialectometry: Toward Explanation", "authors": [{"given": " John", "family": "Nerbonne", "affiliation": [{"original_name": "University of Groningen, 9700 AS Groningen, The Netherlands", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}, {"given": " William", "family": "Kretzschmar", "affiliation": [{"original_name": "University of Georgia, Athens, Georgia 30602, USA", "normalized_name": "University of Georgia", "country": "United States", "identifiers": {"ror": "https://ror.org/00te3t702", "GRID": "grid.213876.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2006", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "21", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}