{"url": "http://dx.doi.org/10.1093/llc/fqi064", "identifier": {"string_id": "10.1093/llc/fqi064", "id_scheme": "DOI"}, "abstract": "The emergence of new media technologies and their integration into the creative process has led to an explosion of hybrid works whose complexities (both conceptual and material) challenge received ideas about the nature of art and its relationship with the future. ‘Variable media’ has been coined as a descriptor for creative projects incorporating elements whose viability within future incarnations of the same works may be compromised. The flexible and imaginative approach taken by the innovative new media arts community has much to offer information professionals facing the conservation challenges presented by digital materials. By the same token, the potential application of principles emerging in the field of digital preservation extends well beyond digital resources to encompass works of art and creative enterprises whose material constitution paradoxically threatens them with extinction. The paramount role played by ‘process’ (as opposed to ‘object’) has led us to explore various metadata development initiatives, including an extensive online questionnaire developed by the Variable Media Initiative at the Guggenheim Museum in New York, and the IFLA Requirements of Bibliographic Standards, with a view to combining elements of each and developing a new model to accommodate the complex documentation of the life cycles of new media artworks and of digital objects.", "article_title": "Cryogenics and Creativity: The Frankenstein Factor in Cultural Preservation", "authors": [{"given": " Eileen", "family": "Maitland", "affiliation": [{"original_name": "University of Glasgow", "normalized_name": "University of Glasgow", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vtgdb53", "GRID": "grid.8756.c"}}]}, {"given": " Cordelia", "family": "Hall", "affiliation": [{"original_name": "University of Glasgow", "normalized_name": "University of Glasgow", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vtgdb53", "GRID": "grid.8756.c"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2005-10-31", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "21", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}