{"url": "http://dx.doi.org/10.1093/llc/fqz011", "identifier": {"string_id": "10.1093/llc/fqz011", "id_scheme": "DOI"}, "abstract": "Digital humanities projects have long relied on various schema languages—chiefly, RELAX NG and Schematron—for validating the XML documents in their data collections; however, these languages are limited in their ability to check for consistency, coherence, and completeness across the entire project. In our work as part of “Endings”, an umbrella project that comprises four diverse digital edition projects from different fields, we have developed a methodology for checking and enforcing correctness, completeness, and coherence across the entire document set. The following article describes the various stages (what we term “levels”) of our diagnostics process, all of which are driven by XSLT (Extensible Stylesheet Language Transformations) stylesheets, and produce a human readable report. These levels include checks for referential integrity, correct entity tagging, and potential duplicates in the data set. Using examples from the Endings projects, we show how diagnostic processes not only ensure correctness in the data set, but can also aid in determining project milestones and completion dates. Diagnostics, we argue, are thus a crucial extension to schema-based validation for complex digital projects and can provide concrete ways for digital humanities projects to enforce coherence and consistency and track their progress toward completion.", "article_title": "Beyond validation: Using programmed diagnostics to learn about, monitor, and successfully complete your DH project", "authors": [{"given": " Martin", "family": "Holmes", "affiliation": [{"original_name": "Humanities Computing and Media Centre, University of Victoria, Canada", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": " Joseph", "family": "Takeda", "affiliation": [{"original_name": "Department of English Language and Literatures, University of British Columbia, Canada", "normalized_name": "University of British Columbia", "country": "Canada", "identifiers": {"ror": "https://ror.org/03rmrcq20", "GRID": "grid.17091.3e"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "Supplement_1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}