{"url": "http://dx.doi.org/10.1093/llc/fqt040", "identifier": {"string_id": "10.1093/llc/fqt040", "id_scheme": "DOI"}, "abstract": "Used here to describe the investigation of significant sound or prosodic patterns within the context of a system that can translate these patterns into comparative visualizations across texts, the term ‘distant listening’ is used provocatively to suggest that readers might interpret prosodic patterns as ‘noise’ (or seemingly unintelligible information) with close reading practices. In this study, we show that these same patterns appear coherent and discoverable within ProseVis, a visualization tool that supports these hermeneutics within a discovery-based paradigm that allows for new ways of making meaning. Charles Bernstein discusses ‘close listening’ as possibly contradictory to ‘ “readings” of poems that are based exclusively on the printed text and that ignore the poet’s own performances, the “total” sound of the work, and the relation of sound to semantics’ (Bernstein, 1998, p. 4). Likewise, this study considers the efficacy of using prosodic textual elements as features for similarity metrics instead of or alongside words and n-gram frequencies. In particular, this discussion describes the continued development of this work as a contribution to and within the context of authorship attribution and stylometric studies that consider the interpretability of prosodic features. To that end, in the first part of this discussion, we place the study within the theoretical and practical context of author attribution studies. In the second part of this discussion, we consider how changing similarity metric calculations through the inclusion and exclusion of certain prosodic features (such as tone and stress) and algorithmic parameters (such as the window size of sounds and weighting power) can facilitate the discovery of previously unidentifiable author-similarity patterns. Finally, in the third part of this study, we explore questions of identity construction within this framework of author attribution analysis by comparing ‘Melanctha’, the longest story in Gertrude Stein’s Three Lives (1909), with 150 different narrative voices from the First Person Narratives of the Documenting the American South collection.", "article_title": "Distant Listening to Gertrude Stein's 'Melanctha': Using Similarity Analysis in a Discovery Paradigm to Analyze Prosody and Author Influence", "authors": [{"given": " Tanya", "family": "Clement", "affiliation": [{"original_name": "School of Information, University of Texas at Austin, Austin", "normalized_name": "The University of Texas at Austin", "country": "United States", "identifiers": {"ror": "https://ror.org/00hj54h04", "GRID": "grid.89336.37"}}]}, {"given": " David", "family": "Tcheng", "affiliation": [{"original_name": "Illinois Informatics Institute, University of Illinois at Urbana-Champaign, Urbana", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}, {"given": " Loretta", "family": "Auvil", "affiliation": [{"original_name": "Illinois Informatics Institute, University of Illinois at Urbana-Champaign, Urbana", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}, {"given": " Boris", "family": "Capitanu", "affiliation": [{"original_name": "Illinois Informatics Institute, University of Illinois at Urbana-Champaign, Urbana", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}, {"given": " Joao", "family": "Barbosa", "affiliation": [{"original_name": "Texas Advanced Computing Center, University of Texas at Austin, Austin", "normalized_name": "The University of Texas at Austin", "country": "United States", "identifiers": {"ror": "https://ror.org/00hj54h04", "GRID": "grid.89336.37"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}