{"url": "http://dx.doi.org/10.1093/llc/fqq026", "identifier": {"string_id": "10.1093/llc/fqq026", "id_scheme": "DOI"}, "abstract": "This article details a modeling methodology that is appropriate for historical, functional documents that are to be digitally represented and hosted within a software environment for humanities research. The functionality is derived from Use Case modeling that can be undertaken in consultation with the User Group. The Use Cases are an expression of the whole-system model as they embody the interaction of User, with the document, in the software environment. The encoding mechanism largely practiced within the humanities computing community is represented by the TEI, which seeks to provide a set of guidelines for encoding humanities documents. However, TEI offers no guidance in relation to creating an encoding of a document that is supportive of the software environment that will host it, the interaction mechanisms required, or the User. We argue that modeling with recourse to the Logical, the Physical and the Interaction classes enables not just the generation of an appropriate encoding scheme, but also the software to manipulate it. We situate Use Case methodology within Activity Theory and relate this to the humanities computing community. The argument is framed in relation to the creation of a digital edition of an 18th century Spanish Account Book manuscript.", "article_title": "Appropriate Use Case modeling for humanities documents", "authors": [{"given": " Aja", "family": "Teehan", "affiliation": [{"original_name": "National University of Ireland, Ireland", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}, {"given": " John G.", "family": "Keating", "affiliation": [{"original_name": "National University of Ireland, Ireland", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2010", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "25", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}