{"url": "http://dx.doi.org/10.1145/2660776", "identifier": {"string_id": "10.1145/2660776", "id_scheme": "DOI"}, "abstract": "Besides being a medium for exhibiting three-dimensional heritage objects, the design and development of virtual heritage environments could also facilitate cultural learning. The aim of this article is to present some consideration on factors that could facilitate cultural learning in virtual heritage environment. Cultural learning in the context of this study refers to the acquisition of knowledge that encourages cultural awareness and appreciation. In this study, we explore virtual heritage environment design features, and cultural information characteristics and presentation formats that are important to facilitate cultural learning, from the casual user's perspective. We conducted experiments that required users to explore virtual heritage environments (focusing on architectural heritage) from selected heritage-related websites, followed by interview sessions. Four contributing factors were identified: information design, information presentation, navigation mechanism, and environment setting. The results suggest the need to reduce users’ cognitive load when exploring virtual heritage environments while simultaneously presenting information that adds value to their understanding. The results also suggest that the inclusion of cultural information in virtual heritage environments is essential for cultural learning to take place.", "article_title": "Factors Facilitating Cultural Learning in Virtual Architectural Heritage Environments", "authors": [{"given": "Nazrita", "family": "Ibrahim", "affiliation": [{"original_name": "Universiti Tenaga Nasional, Kajang, Selangor, Malaysia", "normalized_name": "Universiti Tenaga Nasional", "country": "Malaysia", "identifiers": {"ror": "https://ror.org/03kxdn807", "GRID": "grid.484611.e"}}]}, {"given": "Nazlena", "family": "Mohamad Ali", "affiliation": [{"original_name": "Universiti Kebangsaan Malaysia, Selangor, Malaysia", "normalized_name": "National University of Malaysia", "country": "Malaysia", "identifiers": {"ror": "https://ror.org/00bw8d226", "GRID": "grid.412113.4"}}]}, {"given": "Noor Faezah", "family": "Mohd Yatim", "affiliation": [{"original_name": "Universiti Kebangsaan Malaysia, Selangor, Malaysia", "normalized_name": "National University of Malaysia", "country": "Malaysia", "identifiers": {"ror": "https://ror.org/00bw8d226", "GRID": "grid.412113.4"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2015", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "8", "issue": "2", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}