{"url": "http://dx.doi.org/10.1145/2677083", "identifier": {"string_id": "10.1145/2677083", "id_scheme": "DOI"}, "abstract": "Visitor studies explore human experiences within museums, cultural heritage sites, and other informal learning settings to inform decisions. Smartphones offer novel opportunities for extending the depth and breadth of visitor studies while considerably reducing their cost and their demands on specialist human resources. By enabling the collection of significantly higher volumes of data, they also make possible the application of advanced machine-learning and visualization techniques, potentially leading to the discovery of new patterns and behaviors that cannot be captured by simple descriptive statistics. In this article, we present a principled approach to the use of smartphones for visitor studies, in particular proposing a structured methodology and associated methods that enable its effective use in this context. We discuss specific methodological considerations that have to be addressed for effective data collection, preprocessing, and analysis and identify the limitations in the applicability of these tools using family visits to the London Zoo as a case study. We conclude with a discussion of the wider opportunities afforded by the introduction of smartphones and related technologies and outline the steps toward establishing them as a standard tool for visitor studies.", "article_title": "Conducting Visitor Studies Using Smartphone-Based Location Sensing", "authors": [{"given": "Theano", "family": "Moussouri", "affiliation": [{"original_name": "UCL Institute of Archaeology, London, UK", "normalized_name": "Institute of Archaeology", "country": "Slovakia", "identifiers": {"ror": "https://ror.org/004pv5w59", "GRID": "grid.484920.3"}}]}, {"given": "George", "family": "Roussos", "affiliation": [{"original_name": "Birkbeck College, University of London, London, UK", "normalized_name": "University of London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04cw6st05", "GRID": "grid.4464.2"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2015-03-09", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "8", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}