{"identifier": {"string_id": "10.16995/dm.60", "id_scheme": "DOI"}, "abstract": "The project The Variance of Njáls saga examines variation in the sixty-three medieval and post-medieval manuscripts of Njáls saga from a linguistic, philological, and literary perspective. This saga is the most extensive of the Icelandic family sagas and is thought to have been composed around 1280. The following article describes methods used in the project to identify synchronic variation at a linguistic level in the fourteenth century manuscripts of the saga, and aspects of an analysis of the stemmatic relationship between manuscripts. In both fields the development of computer-based approaches has advanced notably in the last few years. However, affordable solutions customised for end-users are still lacking. The project therefore focuses on easy tools that can be applied in a short-term project with limited financial and human resources. The manuscripts are transcribed according to the conventions of MENOTA (Medieval Nordic Text Archive) in TEI-XML; a segmentation allowing for an identification of corresponding contents is added; linguistic features relevant for an examination of variation are tagged; and structures relevant for a comparison are displayed for further analysis with the help of XSLT-style sheets. The article discusses challenges that lie in the peculiarities of medieval writing (non-standardised orthography, abbreviations) and tries to outline practicable solutions. Initial results of comparisons of manuscripts based on this approach show variation not only in the semantic domain (substitution of words), but also in the syntactic domain (change of word order, usage of different syntactical constructions).", "article_title": "Easy tools to get to grips with linguistic variation in the manuscripts of Njáls saga.", "authors": [{"given": "Ludger", "family": "Zeevaert", "affiliation": [{"original_name": "Stofnun Árna Magnússonar í íslenskum fræðum / The Árni Magnússon Institute for Icelandic Studies Reykjavík, Iceland", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Open Library of the Humanities", "date": "2017-05-31", "keywords": null, "journal_title": "Digital Medievalist", "volume": "10", "issue": null, "ISSN": [{"value": "1715-0736", "type": "electronic"}], "url": "http://dx.doi.org/10.16995/dm.60"}