{"url": "http://dx.doi.org/10.1093/llc/fqy050", "identifier": {"string_id": "10.1093/llc/fqy050", "id_scheme": "DOI"}, "abstract": "Statistical approaches have become the mainstream in machine translation (MT), for their potential in producing less rigid and more natural translations than rule-based approaches. However, on closer examination, the uses of function words between statistical machine-translated Chinese and the original Chinese are different, and such differences may be associated with translationese as discussed in translation studies. This article examines the distribution of Chinese function words in a comparable corpus consisting of MTs and the original Chinese texts extracted from Wikipedia. An attribute selection technique is used to investigate which types of function words are significant in discriminating between statistical machine-translated Chinese and the original texts. The results show that statistical MT overuses the most frequent function words, even when alternatives exist. To improve the quality of the end product, developers of MT should pay close attention to modelling Chinese conjunctions and adverbial function words. The results also suggest that machine-translated Chinese shares some characteristics with human-translated texts, including normalization and being influenced by the source language; however, machine-translated texts do not exhibit other characteristics of translationese such as explicitation.", "article_title": "Function words in statistical machine-translated Chinese and original Chinese: A study into the translationese of machine translation systems", "authors": [{"given": " Chen-li", "family": "Kuo", "affiliation": [{"original_name": "Chang Gung Memorial Hospital and Chang Gung University, Taiwan", "normalized_name": "Chang Gung University", "country": "Taiwan", "identifiers": {"ror": "https://ror.org/00d80zx46", "GRID": "grid.145695.a"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "4", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}