{"url": "http://dx.doi.org/10.1093/llc/fqw021", "identifier": {"string_id": "10.1093/llc/fqw021", "id_scheme": "DOI"}, "abstract": "Relying on the analysis of a Latin historical corpus, our research aims to study the markers structuring literary texts in general, and focuses on methods which, by extension, should be valid for any text of some length. Our basic assumption is the following: such texts include complex multilevel structures (i.e. those calling upon lexis, semantics, morphology, syntax, etc) which function as heterogeneity indicators (progression to a new episode, focalization on a new point of view, insertion of reported speech, etc.). Additionally, the recurrence of these structures is a factor in textual cohesion. Under certain conditions, they function as topological ‘motifs’, marking the linear progression of the text and ensuring textual unity. We are developing new methods to detect and analyse the distributions of such ‘motifs’ and to support structural comparisons with the objective of contrastive corpus studies (contrasts between genres, authorial styles, etc.). Our methods are based on mathematical models (neighbourhoods, bursts) and combine a qualitative approach with a sequential quantitative analysis to comprehend language in a linear fashion.", "article_title": "A Text Structure Indicator and two Topological Methods: New Ways for Studying Latin Historic Narratives", "authors": [{"given": " Dominique", "family": "Longrée", "affiliation": [{"original_name": "LASLA, University of Liège, Liège", "normalized_name": "University of Liège", "country": "Belgium", "identifiers": {"ror": "https://ror.org/00afp2z80", "GRID": "grid.4861.b"}}]}, {"given": " Sylvie", "family": "Mellet", "affiliation": [{"original_name": "BCL, University Nice Sophia Antipolis, CNRS, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016-04-29", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}