{"url": "http://dx.doi.org/10.1093/llc/fql040", "identifier": {"string_id": "10.1093/llc/fql040", "id_scheme": "DOI"}, "abstract": "Since the early studies by Sokal (1988) and Cavalli-Sforza et al. (1989), there has been an increasing interest in depicting the history of human migrations by comparing genetic and linguistic differences that mirror different aspects of human history. Most of the literature concerns continental or macroregional patterns of variation, while regional and microregional scales were investigated less successfully. In this article we concentrate on the Netherlands, an area of only 40,000 km2.The focus of the article is on the analysis of surnames, which have been proven to be reliable genetic markers since in patrilineal systems they are transmitted—virtually unchanged—along generations, similar to a genetic locus on the Y-chromosome. We shall compare their distribution to that of dialect pronunciations, which are clearly culturally transmitted (children learn one of the linguistic varieties they are exposed to, normally that of their peers in the same area or that of their families). Since surnames, at the time of their introduction, were words subject to the same linguistic processes that otherwise result in dialect differences, one might expect the distribution of surnames to be correlated with dialect pronunciation differences. But we shall argue that once the collinear effects of geography on both genetics and cultural transmission are taken into account, there is in fact no statistically significant association between the two. We show that surnames cannot be taken as a proxy for dialect variation, even though they can be safely used as a proxy to Y-chromosome genetic variation.We work primarily with regression analyses, which show that both surname and dialect variation are strongly correlated with geographic distance. In view of this strong correlation, we focus on the residuals of the regression, which seeks to explain genetic and linguistic variation on the basis of geography (where geographic distance is the independent variable, and surname diversity or linguistic diversity is the dependent variable). We then seek a more detailed portrait of the geographic patterns of variation by identifying the ‘barriers’ (namely the areas where the residuals are greatest) by applying the Monmonier algorithm.We find the results historically and geographically insightful, hopefully leading to a deeper understanding of the role of the local migrations and cultural diffusion that are responsible for surname and dialect diversity.", "article_title": "To What Extent are Surnames Words? Comparing Geographic Patterns of Surname and Dialect Variation in the Netherlands", "authors": [{"given": " Franz", "family": "Manni", "affiliation": [{"original_name": "UMR 5145 CNRS, Musée de l'Homme MNHN, Paris, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Wilbert", "family": "Heeringa", "affiliation": [{"original_name": "Alfa-Informatica, Faculty of Arts, University of Groningen, The Netherlands", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}, {"given": " John", "family": "Nerbonne", "affiliation": [{"original_name": "Alfa-Informatica, Faculty of Arts, University of Groningen, The Netherlands", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2006-09-09", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "21", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}