{"url": "http://dx.doi.org/10.1145/1367080.1367084", "identifier": {"string_id": "10.1145/1367080.1367084", "id_scheme": "DOI"}, "abstract": "This article describes an approach to transdisciplinary information integration employing a core ontology. Information is modeled here with an ontology based on the CIDOC-Conceptual Reference Model (ISO 21127). When instantiated with some realistic examples taken from the field of biodiversity (collecting, determination, type creation, expedition, and observation events), the formal specification of semantic concepts makes scientific activities commonly understandable. Ontologies not only allow one to describe the results of scientific activities, such as a description of a biological species, but they can help to clarify the path by which the goal was reached. In particular, they provide a high-level uniform representation of transdisciplinary research activities and results. Ontologies as knowledge representation tools will therefore have strong impact on methodological questions and research strategies for different domains such as biology, archaeology, art history, and socio-economy. They can be regarded as semantic glue between and within scientific and scholarly domains as demonstrated in a series of examples. Following this approach, some requirements for research and development of integrated IT environments between memory instutions are derived.", "article_title": "Research between natural and cultural history information", "authors": [{"given": "Karl-Heinz", "family": "Lampe", "affiliation": [{"original_name": "Zoologisches Forschungsmuseum Alexander Koenig (ZFMK), Bonn, Germany and Interdisciplinary Center of Complex Systems (IZKS)", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Klaus", "family": "Riede", "affiliation": [{"original_name": "Zoologisches Forschungsmuseum Alexander Koenig (ZFMK), Bonn, Germany", "normalized_name": "Zoological Research Museum Alexander Koenig", "country": "Germany", "identifiers": {"ror": "https://ror.org/00wz4b049", "GRID": "grid.452935.c"}}]}, {"given": "Martin", "family": "Doerr", "affiliation": [{"original_name": "Institute of Computer Science, Foundation for Research and Technology Hellas (ICS Forth), Heraklion/Crete, Greece", "normalized_name": "Institute of Computer Science", "country": "Poland", "identifiers": {"ror": "https://ror.org/003fvp964", "GRID": "grid.425308.8"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2008", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "1", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}