{"url": "http://dx.doi.org/10.1093/llc/fqm004", "identifier": {"string_id": "10.1093/llc/fqm004", "id_scheme": "DOI"}, "abstract": "We apply default inheritance hierarchies to generating the morphology of Hebrew verbs. This approach represents inflectional exponents as markings associated with the application of rules by which complex word forms are deduced from simpler roots or stems. The high degree of similarity among verbs of different conjugation classes allows us to formulate general rules; these general rules are, however, sometimes overridden by conjugation-specific rules. Similarly, a verb's form within a particular conjugation is determined both by default rules and by overriding rules specific to lexical stem peculiarities. Our result is a concise set of rules defining the morphology of Hebrew verbs in all conjugations. We express these rules in KATR, both a formalism for default inheritance hierarchies and associated software for generating the forms specified by those rules. As we describe the rules, we point out general strategies for expressing morphology in KATR. We conclude by discussing KATR's advantages over ordinary DATR for the representation of morphological systems and our plans for KATR's successor, LATR.", "article_title": "A Default Inheritance Hierarchy for Computing Hebrew Verb Morphology", "authors": [{"given": " Raphael", "family": "Finkel", "affiliation": [{"original_name": "University of Kentucky, USA", "normalized_name": "University of Kentucky", "country": "United States", "identifiers": {"ror": "https://ror.org/02k3smh20", "GRID": "grid.266539.d"}}]}, {"given": " Gregory", "family": "Stump", "affiliation": [{"original_name": "University of Kentucky, USA", "normalized_name": "University of Kentucky", "country": "United States", "identifiers": {"ror": "https://ror.org/02k3smh20", "GRID": "grid.266539.d"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2007-05-25", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "22", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}