{"url": "http://dx.doi.org/10.1093/llc/fqaa030", "identifier": {"string_id": "10.1093/llc/fqaa030", "id_scheme": "DOI"}, "abstract": "Complex network approach provides language research with quantitative measures that can capture global features of language. Although translational language has been recognized as a ‘third code’ by some researchers, its independence still calls for further and quantitative validation in an overall manner. In this study, we intend to examine this independence and explore comprehensively its features. We investigated macroscopically translational language from English into Chinese and from Chinese into English by comparing with its source language and native language through syntactic dependency networks. The results show that: (1) translational language presents small-world and scale-free properties like most languages do; (2) however, it is independent of and different from both source language and native language in terms of its network parameters; (3) its network parameters show values eclectic between source language and native language, and this eclectic tendency may be regarded as a new candidate for universal features of translational language, which certainly needs further validation in other genres and language pairs. This study also corroborates that quantitative linguistic method of complex network approach can be well utilized in the study of translational language.", "article_title": "A syntactic dependency network approach to the study of translational language", "authors": [{"given": " Lu", "family": "Fan", "affiliation": [{"original_name": "Foreign Languages Research Center, Xi'an Jiaotong University, P.R. China", "normalized_name": "Xi'an Jiaotong University", "country": "China", "identifiers": {"ror": "https://ror.org/017zhmm22", "GRID": "grid.43169.39"}}]}, {"given": " Yue", "family": "Jiang", "affiliation": [{"original_name": "Foreign Languages Research Center, Xi'an Jiaotong University, P.R. China", "normalized_name": "Xi'an Jiaotong University", "country": "China", "identifiers": {"ror": "https://ror.org/017zhmm22", "GRID": "grid.43169.39"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020-04-29", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}