{"url": "http://www.zfdg.de/2017_005", "identifier": {"string_id": "10.17175/2017_005", "id_scheme": "DOI"}, "abstract": "Within the discipline of history, digital approaches, tools, and research methods are taking on increasing importance as both a research topic in its own right and as a way to support the field of history as a whole. In spite of this broad interest, projects that make use of new digital tools and methods such as topic modeling continue to be reviewed very critically. Using two projects as examples, this article therefore demonstrates how topic modeling can be used and further developed in order to support historical research. Both projects deal with bodies of knowledge from the 19th century, one in the context of the scholarly implementation of spectral analysis and the other within the context of historical education during the period of the German Emperor Wilhelm II. Through these examples, this article shows where topic modeling can still be improved and what role traditional hermeneutics must have as a central component in the application of topic modeling in the field of history, and thus the boundaries and capabilities of the use of topic modeling in historical research.", "article_title": "Einsatz von Topic Modeling in den Geschichtswissenschaften: Wissensbestände des 19. Jahrhunderts", "authors": [{"given": "Martin", "family": "Fechner", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}, {"given": "Andreas", "family": "Weiß", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}], "publisher": null, "date": "2017", "keywords": null, "journal_title": "Zeitschrift für digitale Geisteswissenschaften", "volume": "Heft 2.2017", "issue": null, "ISSN": [{"value": "2510-1358", "type": "electronic"}]}