{"url": "http://dx.doi.org/10.1007/s42803-019-00006-8", "identifier": {"string_id": "10.1007/s42803-019-00006-8", "id_scheme": "DOI"}, "abstract": "Over the last two decades publishing and distributing content on the Web has become a core part of society. This ephemeral content has rapidly become an essential component of the human record. Writing histories of the late 20th and early 21st century will require engaging with web archives. The scale of web content and of web archives presents significant challenges for how research can access and engage with this material. Digital humanities scholars are advancing computational methods to work with corpora of millions of digitized resources, but to fully engage with the growing content of two decades of web archives, we now require methods to approach and examine billions, ultimately trillions, of incongruous resources. This article approaches one seemingly insignificant, but fundamental, aspect in web design history: the use of tiny transparent images as a tool for layout design, and surfaces how traces of these files can illustrate future paths for engaging with web archives. This case study offers implications for future methods allowing scholars to engage with web archives. It also prompts considerations for librarians and archivists in thinking about web archives as data and the development of systems, qualitative and quantitative, through which to make this material available.", "article_title": "The invention and dissemination of the spacer gif: implications for the future of access and use of web archives", "authors": [{"given": "Trevor", "family": "Owens", "affiliation": [{"original_name": "U.S. Library of Congress, Washington, DC, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Grace Helen", "family": "Thomas", "affiliation": [{"original_name": "U.S. Library of Congress, Washington, DC, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "1", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}