{"url": "http://dx.doi.org/10.17928/jjadh.4.1_37", "identifier": {"string_id": "10.17928/jjadh.4.1_37", "id_scheme": "DOI"}, "abstract": "The genre of boys’ love (BL), which generally refers to a body of works that depict fictional relationships between beautiful “boys,” is produced for and consumed mainly by women in Japan. Ludic expressions of sexuality and gender unique to BL have gained popularity on a global scale but have also drawn negative attention. In this article, we employ the concept of asobigokoro (playful spirit/heart) to highlight the importance of regional ideas of play and playfulness in game analysis. We argue that asobigokoro functions as a kind of counter-discourse as it privileges non-Eurocentric ways of knowing, understanding, and “playing” with representations of sexuality. Game analysis through an asobigokoro lens enriches the field of regional gaming by drawing on Japanese sociopolitical contexts to situate a reading of Japanese ludic representations. Asobigokoro stresses the importance of understanding cultural variations of “play” and “playfulness” in order to make sense of “taboo” subjects in culturally nuanced ways. In our textual analysis of Enzai: Falsely Accused, we discover that the simultaneous appropriation and subversion of violent and sexually explicit content, which characterizes the game’s asobigokoro, can be traced to Japanese feminist forms of asobi (play), which are rooted within the Yaoi tradition.", "article_title": "Playing with Pain", "authors": [{"given": "Tsugumi", "family": "Okabe", "affiliation": [{"original_name": "University of Alberta", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}, {"given": "Jérémie", "family": "Pelletier-Gagnon", "affiliation": [{"original_name": "University of Alberta", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}], "publisher": "Japanese Association for Digital Humanities", "date": "2019", "keywords": null, "journal_title": "Journal of the Japanese Association for Digital Humanities", "volume": "4", "issue": "1", "ISSN": [{"value": "2188-7276", "type": "electronic"}]}