{"url": "http://dx.doi.org/10.1093/llc/fqt026", "identifier": {"string_id": "10.1093/llc/fqt026", "id_scheme": "DOI"}, "abstract": "In this article, the application of Ant-Colony Optimization (ACO) to a morphological segmentation task is described, where the aim is to analyse a set of words into their constituent stem and ending. A number of criteria for determining the optimal segmentation are evaluated comparatively while at the same time investigating more comprehensively the effectiveness of the ACO system in defining appropriate values for system parameters. Owing to the characteristics of the task at hand, particular emphasis is placed on studying the ACO process for learning sessions of a limited duration. Morphological segmentation becomes hardest in highly inflectional languages, where each stem is associated with a large number of distinct endings. Consequently, the present article investigates morphological segmentation of words from a highly inflectional language, specifically Ancient Greek, by combining pattern-recognition principles with limited linguistic knowledge. To weigh these sources of knowledge, a set of weights is used as a set of system parameters, to be optimized via ACO. ACO-based experimental results are shown to be of a higher quality than those achieved by manual optimisation or ‘randomised generate and test’ methods. This illustrates the applicability of the ACO-based approach to the morphological segmentation task.", "article_title": "Optimizing word segmentation tasks using ant colony metaheuristics", "authors": [{"given": " George", "family": "Tambouratzis", "affiliation": [{"original_name": "Institute for Language and Speech Processing, Athens, Greece", "normalized_name": "Institute for Language and Speech Processing", "country": "Greece", "identifiers": {"ror": "https://ror.org/00z24kr14", "GRID": "grid.424851.e"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013-05-24", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}