{"url": "http://dx.doi.org/10.1145/3354002", "identifier": {"string_id": "10.1145/3354002", "id_scheme": "DOI"}, "abstract": "For more than a decade, User eXperience (UX) has grown into a core concept of Human--Computer Interaction (HCI) and has been widely disseminated and accepted in the HCI community. At the same time, Cultural Heritage (CH) has been a favored domain for UX research, while the visitor is able to exploit CH material before, during, and after the visit, having different goals and requirements in each phase. Thus, CH organisations need to carefully explore the potential of investing in UX, as visitor satisfaction and intention to return and spread positive word-of-mouth is closely linked to the destination's overall success. A multitude of methods for UX analysis exist, but a clear overview of the current state of the available UX research methods in CH is missing. Recent studies [Othman 2012; Roussou 2018] have successfully developed frameworks to measure UX in cultural spaces, but most of them still lack understanding about how visitors interact with new technologies and simultaneously with the exhibits. In this article, a survey that describes the conceptual frameworks, models, research methodologies, and paradigms of incorporating Cultural User eXperience (CUX) in applications is reported, as well as the overall interaction between UX and CH and the related aspects that are influenced by the CH application domain and the parameters leading to optimization of the CUX. The outcome of this survey lays ground for understanding and defining the concept of UX research in CH, while current challenges and issues for future work are discussed.", "article_title": "Adding Culture to UX", "authors": [{"given": "Markos", "family": "Konstantakis", "affiliation": [{"original_name": "Department of Cultural Technology and Communication, University of the Aegean, II Research Group, Mytilene, Greece", "normalized_name": "University of the Aegean", "country": "Greece", "identifiers": {"ror": "https://ror.org/03zsp3p94", "GRID": "grid.7144.6"}}]}, {"given": "George", "family": "Caridakis", "affiliation": [{"original_name": "Department of Cultural Technology and Communication, University of the Aegean, II Research Group, Mytilene, Greece", "normalized_name": "University of the Aegean", "country": "Greece", "identifiers": {"ror": "https://ror.org/03zsp3p94", "GRID": "grid.7144.6"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2020", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "13", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}