{"url": "http://dx.doi.org/10.16995/dscn.43", "identifier": {"string_id": "10.16995/dscn.43", "id_scheme": "DOI"}, "abstract": "This paper aims to take into account the process of annotation as it can be inserted in a literary text driven by digital culture. Focusing on a corpus of digital literary texts, it will study how writers use hyperlinking as a way to build a network of allusions or commentaries inside the boundaries of their own text, or as support of reading of an another text. Three ranges of use are to be exposed. The first acts as a mediated reading of one's own work. Guillaume Vissac's Accident de personne, published as a twitter feed in 2010, has been edited as a (digital) whole by digital editor publie.net. The author used hyperlinks to reinforce patterns of similarity between characters and specific circumstances. The second use of semantic links inserts essayistic discourse and urban fabulation, as it can be found in François Bon's Tiers livre, in the web of its tentacular work and in a discursive ground of the social and literary environment of the writer. The third range of use covers writing-as-reading works, where links enact a set of commentaries or a way of rewriting a prior text. Philippe De Jonckheere's site, Désordre.net, and more specifically his project \"Tentative d'épuisement de Tentative d'épuisement d'un lieu parisien de Georges Perec,\" build on this idea. This project takes Perec's own reading of an urban place which tries to exhaust the real world by description, and adds a layer of hyperlinks giving back a reading of the reality depicted by Perec. These three uses show how literary writing in a digital context inherit from the tradition of marginal annotation and inscribe it in the most basic function of electronic publication, which is linking. In that perspective, links appear as a way to build a multidimensional textuality based on the depth of a virtual network.", "article_title": "Inner Margins of the Literary Digital Text: From Allusion to Rewriting", "authors": [{"given": "René", "family": "Audet", "affiliation": [{"original_name": "Université Laval", "normalized_name": "Université Laval", "country": "Canada", "identifiers": {"ror": "https://ror.org/04sjchr03", "GRID": "grid.23856.3a"}}]}], "publisher": "Open Library of the Humanities", "date": "2015", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "0", "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}