{"url": "http://dx.doi.org/10.1145/3012287", "identifier": {"string_id": "10.1145/3012287", "id_scheme": "DOI"}, "abstract": "Annotations provide a valuable perspective on the semantic information present in digital heritage collections, and in recent years they've been employed in a number of innovative, user-centric techniques that can personalise a user's experience of heritage materials, such as by actively adapting exhibits as a user reveals their interests, or by guiding users to explore collections which are meaningfully linked to what they have previously encountered. Despite the captivating opportunities offered by these techniques, collecting annotations for a large heritage collection is no trivial task. A significant amount of work is required to manually annotate large quantities of heritage materials, and automated, computational approaches leave much to be desired regarding the level of insight and semantic richness that they can currently provide. By analysing the emergent relationships between the initial annotations in a collection, we propose a metadata-driven algorithm for assisting and augmenting the annotation process. This algorithm, called SAGA (Semantically-Annotated Graph Analysis), allows for semi-automatic annotation, which balances the value of the contributions of human annotators with the time and effort-saving benefits of an automatic, suggestion-driven process. SAGA uses an entity relationship-driven approach to make annotation suggestions. It is used in the context of a web-based infrastructure called SAGE (Semantic Annotation by Group Exploration), a multiagent environment which assists groups of experts in creating comprehensive annotation sets for heritage collections. SAGA and SAGE are evaluated from the perspectives of suggestion accuracy, explicit user acceptance and implicit user acceptance, and demonstrate strong results in each evaluation.", "article_title": "A Web-Based Infrastructure for the Assisted Annotation of Heritage Collections", "authors": [{"given": "Jacob", "family": "Foley", "affiliation": [{"original_name": "University of New England, Armidale NSW", "normalized_name": "University of New England", "country": "United States", "identifiers": {"ror": "https://ror.org/02n2ava60", "GRID": "grid.266826.e"}}]}, {"given": "Paul", "family": "Kwan", "affiliation": [{"original_name": "University of New England, Armidale NSW", "normalized_name": "University of New England", "country": "United States", "identifiers": {"ror": "https://ror.org/02n2ava60", "GRID": "grid.266826.e"}}]}, {"given": "Mitchell", "family": "Welch", "affiliation": [{"original_name": "University of New England, Armidale NSW", "normalized_name": "University of New England", "country": "United States", "identifiers": {"ror": "https://ror.org/02n2ava60", "GRID": "grid.266826.e"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2017-07-31", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "10", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}