{"url": "http://dx.doi.org/10.1093/llc/fqx021", "identifier": {"string_id": "10.1093/llc/fqx021", "id_scheme": "DOI"}, "abstract": "In recent years, one of the two fully preserved ancient Greek tragic plays of disputed authorship, Rhesus, traditionally attributed to Euripides, has been the object of a quite lively scholarly interest. The rather extreme number, for the standards of classical philology, of four published commentaries in 10 years, by Athanasios D. Stefanis, [Euripides’]: Rhesus, Athens: Academy of Athens, 2004, Arne Feickert, Euripidis: Rhesus, Frankfurt: Lang, 2005, Vayos Liapis, A Commentary on the Rhesus Attributed to Euripides, Oxford: Oxford University Press, 2012, and Almut Fries, Pseudo-Euripides: Rhesus, Berlin: De Gruyter, 2014 (two of them in English), and one forthcoming by Marco Fantuzzi (also in English), tangibly prove the great vogue this drama enjoys nowadays. Its doubtful nature, as far as the fusion of tragic and comic elements is concerned (see further Burnett, Directions in Euripidean Criticism: A Collection of Essays, Durham: Duke University Press, pp. 13–51, 177–88, 1985), and, most of all, its controversial authorship and date still render it a riddle—even though its non-Euripidean origin is widely accepted. Our research is an attempt to unveil the authorial status of this play, employing traditional and non-traditional authorship attribution techniques. In fact, as it will become clear in the course of this work, the latter kind of methodology allows us to approach the author of Rhesus in a way that was not even thought possible until the present day.", "article_title": "Devising Rhesus: A strange ‘collaboration’ between Aeschylus and Euripides", "authors": [{"given": " Nikos", "family": "Manousakis", "affiliation": [{"original_name": "National and Kapodistrian University of Athens, Greece", "normalized_name": "National and Kapodistrian University of Athens", "country": "Greece", "identifiers": {"ror": "https://ror.org/04gnjpq42", "GRID": "grid.5216.0"}}]}, {"given": " Efstathios", "family": "Stamatatos", "affiliation": [{"original_name": "University of the Aegean, Greece", "normalized_name": "University of the Aegean", "country": "Greece", "identifiers": {"ror": "https://ror.org/03zsp3p94", "GRID": "grid.7144.6"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}