{"url": "http://dx.doi.org/10.1145/2905369", "identifier": {"string_id": "10.1145/2905369", "id_scheme": "DOI"}, "abstract": "Shape representations are critical for visual analysis of cultural heritage materials. This article studies two types of shape representations in a bag-of-words-based pipeline to recognize Maya glyphs. The first is a knowledge-driven Histogram of Orientation Shape Context (HOOSC) representation, and the second is a data-driven representation obtained by applying an unsupervised Sparse Autoencoder (SA). In addition to the glyph data, the generalization ability of the descriptors is investigated on a larger-scale sketch dataset. The contributions of this article are four-fold: (1) the evaluation of the performance of a data-driven auto-encoder approach for shape representation; (2) a comparative study of hand-designed HOOSC and data-driven SA; (3) an experimental protocol to assess the effect of the different parameters of both representations; and (4) bridging humanities and computer vision/machine learning for Maya studies, specifically for visual analysis of glyphs. From our experiments, the data-driven representation performs overall in par with the hand-designed representation for similar locality sizes on which the descriptor is computed. We also observe that a larger number of hidden units, the use of average pooling, and a larger training data size in the SA representation all improved the descriptor performance. Additionally, the characteristics of the data and stroke size play an important role in the learned representation.", "article_title": "Evaluating Shape Representations for Maya Glyph Classification", "authors": [{"given": "Gülcan", "family": "Can", "affiliation": [{"original_name": "Idiap Research Institute and École Polytechnique Fédérale de Lausanne (EPFL), Martigny, Switzerland", "normalized_name": "École Polytechnique Fédérale de Lausanne", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02s376052", "GRID": "grid.5333.6"}}]}, {"given": "Jean-Marc", "family": "Odobez", "affiliation": [{"original_name": "Idiap Research Institute and École Polytechnique Fédérale de Lausanne (EPFL), Martigny, Switzerland", "normalized_name": "École Polytechnique Fédérale de Lausanne", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02s376052", "GRID": "grid.5333.6"}}]}, {"given": "Daniel", "family": "Gatica-Perez", "affiliation": [{"original_name": "Idiap Research Institute and École Polytechnique Fédérale de Lausanne (EPFL), Martigny, Switzerland", "normalized_name": "École Polytechnique Fédérale de Lausanne", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02s376052", "GRID": "grid.5333.6"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2016", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "9", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}