{"url": "http://dx.doi.org/10.1093/llc/19.3.373", "identifier": {"string_id": "10.1093/llc/19.3.373", "id_scheme": "DOI"}, "abstract": "As the physical building of a national library can serve as a tangible expression of political and cultural philosophy, a given digital archive manifests ideological features of the national legacy it preserves and disseminates electronically. Millennial discourses have influenced national library building projects in both physical and digital archives. However, a simple analogy between conventional and electronic spaces is inadequate, because national policies on digitizing documents and regulating access engender contradictory impulses in archivists and policy makers. Although considerable attention has recently focused on the ‘right to read’, the physical space of a document archive is constituted by prohibitions on reading. In a 2002 survey, the degree of regulation varied greatly depending on national context. The Bibliothèque Nationale de France made its digital collection widely and anonymously available, but closely surveiled readers in its physical space. The Library of Congress offered democratic access and embraced an ‘open source’ approach to cataloguing, but corporate and public interests were in conflict, and ‘born digital’ documents created a policy crisis. The British Library offered an interface that emulated turning pages of rare tomes but came late to prioritize searchable text encoding. In contrast, the Danvers Archival Center offered a model of a ‘local’ archive that asserted its social function in a particular community but also claimed a role in shaping digital resources.", "article_title": "Reading Room(s): Building a National Archive in Digital Spaces and Physical Places", "authors": [{"given": "E.", "family": "Losh", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "19", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}