{"url": "http://dx.doi.org/10.1145/3242901", "identifier": {"string_id": "10.1145/3242901", "id_scheme": "DOI"}, "abstract": "The assessment of the structural behavior of historic masonry structures like Gothic cathedrals is an important engineering and architectural issue, because of the economic and cultural relevance of such buildings. In this article, we present a complete numerical methodology for point clouds processing, geometrical and parametric 3D modeling, and finite element structural analysis of the spire of the Cathedral of Senlis, France. Our work highlights the particular difficulties linked with digitization and geometrical modeling of highly complex Gothic structures, as well as the need to find compromises between quality and accuracy of extracted data used for geometrical modeling and structural analysis. The methodology enables the semi-automatic transformation of a three-dimensional points cloud, surveyed through terrestrial laser scanner, into a three-dimensional geometrical historic building information modeling (hBIM)-oriented model, and its use to propose a consistent 3D finite element mesh suitable for advanced structural analysis. A full software chain is integrated in the proposed numerical process, so as to use the most important data contained in the real geometry and accurately transposed in the point clouds. After a successful data processing step with 3DReshaper software that proved to be necessary for enhancement of point clouds, a semi-automated geometrical hBIM-oriented modeling step with Rhinoceros5 software and VisualARQ plugin has allowed the construction of a hybrid model by reverse engineering from the point clouds. This 3D model, containing both geometrical and parametric data of the structure, has been exported to the Hyperworks suite for finite element structural analysis under self-weight. Our computations focused on the estimation of the structure deformation and on the distribution of compression and traction stresses in all components of the complex structure. It is found that the spire is safe. Based on reliable and properly detailed results, our study provides significant information for understanding the behavior of the structure and potential damage monitoring.", "article_title": "From Point Cloud Data to Structural Analysis Through a Geometrical hBIM-Oriented Model", "authors": [{"given": "Raphael", "family": "Rolin", "affiliation": [{"original_name": "Sorbonne Universities, University of Technology of Compiègne, Compiègne, France", "normalized_name": "University of Technology of Compiègne", "country": "France", "identifiers": {"ror": "https://ror.org/04y5kwa70", "GRID": "grid.6227.1"}}]}, {"given": "Eduard", "family": "Antaluca", "affiliation": [{"original_name": "Sorbonne Universities, University of Technology of Compiègne, Compiègne, France", "normalized_name": "University of Technology of Compiègne", "country": "France", "identifiers": {"ror": "https://ror.org/04y5kwa70", "GRID": "grid.6227.1"}}]}, {"given": "Jean-Louis", "family": "Batoz", "affiliation": [{"original_name": "Sorbonne Universities, University of Technology of Compiègne, Compiègne, France", "normalized_name": "University of Technology of Compiègne", "country": "France", "identifiers": {"ror": "https://ror.org/04y5kwa70", "GRID": "grid.6227.1"}}]}, {"given": "Fabien", "family": "Lamarque", "affiliation": [{"original_name": "Sorbonne Universities, University of Technology of Compiègne, Compiègne, France", "normalized_name": "University of Technology of Compiègne", "country": "France", "identifiers": {"ror": "https://ror.org/04y5kwa70", "GRID": "grid.6227.1"}}]}, {"given": "Mathieu", "family": "Lejeune", "affiliation": [{"original_name": "Sorbonne University, Paris, France", "normalized_name": "Sorbonne University", "country": "France", "identifiers": {"ror": "https://ror.org/02en5vm52", "GRID": "grid.462844.8"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2019-05-30", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "12", "issue": "2", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}