{"url": "http://dx.doi.org/10.1093/llc/fqs045", "identifier": {"string_id": "10.1093/llc/fqs045", "id_scheme": "DOI"}, "abstract": "Digitization of Japanese historical documents has gained much attraction in the field of humanities in Japan recently, and numbers of documents are already available in digitized text format. However, text analysis of these documents has rarely been done mainly due to the lack of natural language processing tools that can handle pre-modern Japanese. In this article, we propose a method to extract and visualize the relationships among persons from Japanese historical documents with an aid of supplementary information such as personal name and place name indices. The goal of the method is to extract dynamics of relationships among historical persons. The method utilizes locational information to obtain latent relationships among persons based on their spatial activities. The proposed method is applied to a Japanese historical chronicle written in the 12th century. Experimental results showed a strong correspondence to the known historical facts, and the results of a user survey completed by researchers of Japanese history demonstrated some potential for the method to serve as a new approach in the fields of humanities.", "article_title": "Visualization of relationships among historical persons from Japanese historical documents", "authors": [{"given": " Fuminori", "family": "Kimura", "affiliation": [{"original_name": "College of Information Science and Engineering, Ritsumeikan University, Japan", "normalized_name": "Ritsumeikan University", "country": "Japan", "identifiers": {"ror": "https://ror.org/0197nmd03", "GRID": "grid.262576.2"}}]}, {"given": " Takahiko", "family": "Osaki", "affiliation": [{"original_name": "Independent Researcher", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Taro", "family": "Tezuka", "affiliation": [{"original_name": "Graduate School of Library, Information and Media Studies, University of Tsukuba, Japan", "normalized_name": "University of Tsukuba", "country": "Japan", "identifiers": {"ror": "https://ror.org/02956yf07", "GRID": "grid.20515.33"}}]}, {"given": " Akira", "family": "Maeda", "affiliation": [{"original_name": "College of Information Science and Engineering, Ritsumeikan University, Japan", "normalized_name": "Ritsumeikan University", "country": "Japan", "identifiers": {"ror": "https://ror.org/0197nmd03", "GRID": "grid.262576.2"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}