{"url": "http://dx.doi.org/10.1145/3216463", "identifier": {"string_id": "10.1145/3216463", "id_scheme": "DOI"}, "abstract": "Munsell Soil Charts are a very common tool used by archaeologists for the color specification task. Charts are usually employed directly on cultural heritage sites to identify color of soils and collected artifacts. However, charts are designed to be used specifying the color through subjective perception of users, by visual mean, in a time-consuming and error-prone procedure. It is likely that two users may estimate different Munsell notations for the same specimen, as colors are not perceived uniformly by different people. Hence, estimation process should be repeated several times and by more than a single expert user to be considered reliable. In this work, we employ our framework, Automatic Recognition of Color for Archaeology (ARCA), specifically designed to provide a method for objective, deterministic, fast, and automatic Munsell estimation. ARCA is a valuable asset for archaeologists as it provides the definition of a smooth pipeline for an affordable Munsell notation estimation: image acquisition of specimens with general purpose digital cameras in an uncontrolled environment, manual sampling of specimen images in the ARCA desktop application, automatic Munsell color specification, and report generation. We further assess our method with improved color tolerance validations and evaluations, introducing a comparison between ΔE00, ΔE76, ΔL*, Δa*, and Δb* differences. One of the main contributions of this article is the extension of our former dataset ARCA108. We gathered two additional sets of images obtaining a new dataset consisting of pictures of Munsell Soil Charts Editions 2000 and 2009 plus images from a real test case with 16 pottery shards. The new dataset counts 56,160 samples and 328 images, so it has been called ARCA328. Experimental results are reported to investigate which could be the best configuration to be used in the acquisition phase.", "article_title": "Munsell Color Specification using ARCA (Automatic Recognition of Color for Archaeology)", "authors": [{"given": "Filippo L. M.", "family": "Milotta", "affiliation": [{"original_name": "University of Catania, Italy", "normalized_name": "University of Catania", "country": "Italy", "identifiers": {"ror": "https://ror.org/03a64bh57", "GRID": "grid.8158.4"}}, {"original_name": "University of South Florida, Tampa, FL, USA", "normalized_name": "University of South Florida", "country": "United States", "identifiers": {"ror": "https://ror.org/032db5x82", "GRID": "grid.170693.a"}}]}, {"given": "Filippo", "family": "Stanco", "affiliation": [{"original_name": "University of Catania, Catania, Sicily, Italy", "normalized_name": "University of Catania", "country": "Italy", "identifiers": {"ror": "https://ror.org/03a64bh57", "GRID": "grid.8158.4"}}]}, {"given": "Davide", "family": "Tanasi", "affiliation": [{"original_name": "University of South Florida, Tampa, FL, USA", "normalized_name": "University of South Florida", "country": "United States", "identifiers": {"ror": "https://ror.org/032db5x82", "GRID": "grid.170693.a"}}]}, {"given": "Anna M.", "family": "Gueli", "affiliation": [{"original_name": "University of Catania, Catania, Sicily, Italy", "normalized_name": "University of Catania", "country": "Italy", "identifiers": {"ror": "https://ror.org/03a64bh57", "GRID": "grid.8158.4"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2018-11-20", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "11", "issue": "4", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}