{"url": "http://dx.doi.org/10.1093/llc/fqz091", "identifier": {"string_id": "10.1093/llc/fqz091", "id_scheme": "DOI"}, "abstract": "Cultural heritage connects the past with the future by forming an integral part of the identities of societies. Thus, countries must protect their cultural heritage and create policies to ensure that people benefit today and pass the heritage on to future generations. Beyond physical protection in the face of globalization, increasing access to cultural heritage is necessary to ensure participation and evaluate practices from an international perspective. Advances in computer and communication technologies are being exploited for these requirements. Acquiring knowledge about and interacting with cultural objects in any part of the world today is possible through the digital humanities approach. In this study, a conceptual model was formed to increase visibility and usage of Kandilli Observatory and Earthquake Research Institute Manuscripts, the Hittite cuneiform tablets from Bogazköy, the works of Ibn Sina at the Süleymaniye Manuscript Library, Evliya Çelebi’s ‘Book of Travels’, and the Old Assyrian Merchant Archives of Kültepe registered in UNESCO’s Memory of the World List. In this model, which is prepared with the digital humanities approach, best practices applied in the field are considered as examples in the literature. Suggestions are made on how to utilize digital humanities tools to increase access and visibility by revealing the economic, social, and cultural values of the works based on the model.", "article_title": "A conceptual model to increase the visibility and usage of cultural heritage objects: The case of UNESCO’s Memory of the World list1", "authors": [{"given": " Sümeyye", "family": "Akça", "affiliation": [{"original_name": "Department of Information Management, Ardahan University, Ardahan, Turkey", "normalized_name": "Ardahan University", "country": "Turkey", "identifiers": {"ror": "https://ror.org/042ejbk14", "GRID": "grid.449062.d"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}