{"url": "http://dx.doi.org/10.1093/llc/fqq003", "identifier": {"string_id": "10.1093/llc/fqq003", "id_scheme": "DOI"}, "abstract": "Categorization and taxonomy are topical issues in intertextuality studies. Instead of increasing the number of overlapping or contradictory definitions (often established with reference to limited databases) which exist even for key concepts such as “allusion ” or “quotation”, we propose an electronically implemented data-driven approach based on the isolation, analysis and description of a number of relevant parameters such as general text relation, marking for quotation, modification etc. If a systematic parameter analysis precedes discussions of possible correlations and the naming of features bundles as composite categories, a dynamic approach to categorization emerges which does justice to the varied and complex phenomena in this field. The database is the HyperHamlet corpus, a chronologically and generically wide-ranging collection of Hamlet references that confront linguistic and literary researchers with a comprehensive range of formal and stylistic issues. Its multi-dimensional encodings and search facilities provide the indispensable ‘freedom from the analytic limits of hardcopy', as Jerome McGann put it. The methodological and heuristic gains include a more complete description of possible parameter settings, a clearer recognition of multiple parameter settings (as implicit in existing genre definitions), a better understanding of how parameters interact, descriptions of disregarded literary phenomena that feature unusual parameter combinations and, finally, descriptive labels for the most polysemous areas that may clarify matters without increasing taxonomical excess.", "article_title": "A 'key to all quotations'? A corpus-based parameter model of intertextuality", "authors": [{"given": "Regula", "family": "Hohl Trillini", "affiliation": [{"original_name": "Department of English, University of Basel, Basel, Switzerland", "normalized_name": "University of Basel", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02s6k3f65", "GRID": "grid.6612.3"}}]}, {"given": "Sixta", "family": "Quassdorf", "affiliation": [{"original_name": "Department of English, University of Basel, Basel, Switzerland", "normalized_name": "University of Basel", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02s6k3f65", "GRID": "grid.6612.3"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2010", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "25", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}