{"url": "http://dx.doi.org/10.1145/3350427", "identifier": {"string_id": "10.1145/3350427", "id_scheme": "DOI"}, "abstract": "Museums offer an ideal environment for informal cultural learning on heritage artifacts, where visitors get engaged in learning due to an intrinsic motivation. Sharing the museum space among visitors allows for collective learning experiences and socializing with each other. Museums aim to design and deploy Tangible User Interfaces (TUIs) in order to embrace the physical materialities of artifacts in the visiting experience. TUIs are believed to be more collaborative, attract more visitors, and persuade them to explore further. Cultural learning on heritage artifacts is particularly meaningful from the early age when opinions and attitudes are shaped. Museums accordingly follow a gamification approach (i.e., using game elements in a non-game context) to provide a collaborative and entertaining learning experience to young visitors. In this study, we investigate the implications of merging these two approaches in order to take advantage of the qualities of both TUIs and gamification in an educational museum context. Accordingly, we present TouchTomb and its evaluation in a real-world museum environment. TouchTomb is a situated tangible gamification installation that aims to enhance informal cultural learning for young visitors and to foster engagement and collaboration among them. The basis of the installation is a shared progress bar and three games with different spatial configurations, embedded into a custom fabricated replica of an original ancient Egyptian tomb-chapel wall on a 1:1 scale. Our field study involved 14 school visits with a total number of 190 school pupils (from 10 to 14 years old). We deployed a mixed-method evaluation to investigate how such a tangible gamification approach entertains and educates 15 pupils collectively for a maximum of 15 minutes, including the evaluation procedures. We particularly investigated how the different spatial configurations of the game setups influenced the stages of pupils’ cultural learning, and the levels of engagement and collaboration among them. We conclude the article by discussing the qualities of tangible gamification and its role in facilitating cultural learning. For instance, cultural learning is enhanced by situating heritage artifacts in the experience, and embedding learning in the reward system. Engagement and collaboration among visitors are fostered by creating a sense of ownership and designing a diversity of goals.", "article_title": "Situated Tangible Gamification of Heritage for Supporting Collaborative Learning of Young Museum Visitors", "authors": [{"given": "Eslam", "family": "Nofal", "affiliation": [{"original_name": "KU Leuven, Leuven, Belgium", "normalized_name": "KU Leuven", "country": "Belgium", "identifiers": {"ror": "https://ror.org/05f950310", "GRID": "grid.5596.f"}}]}, {"given": "Georgia", "family": "Panagiotidou", "affiliation": [{"original_name": "KU Leuven, Leuven, Belgium", "normalized_name": "KU Leuven", "country": "Belgium", "identifiers": {"ror": "https://ror.org/05f950310", "GRID": "grid.5596.f"}}]}, {"given": "Rabee M.", "family": "Reffat", "affiliation": [{"original_name": "Assiut University, Assiut, Egypt", "normalized_name": "Assiut University", "country": "Egypt", "identifiers": {"ror": "https://ror.org/01jaj8n65", "GRID": "grid.252487.e"}}]}, {"given": "Hendrik", "family": "Hameeuw", "affiliation": [{"original_name": "Royal Museums of Art and History Brussels, Belgium", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Vanessa", "family": "Boschloos", "affiliation": [{"original_name": "Ghent University, Ghent, Belgium", "normalized_name": "Ghent University", "country": "Belgium", "identifiers": {"ror": "https://ror.org/00cv9y106", "GRID": "grid.5342.0"}}]}, {"given": "Andrew Vande", "family": "Moere", "affiliation": [{"original_name": "KU Leuven, Leuven, Belgium", "normalized_name": "KU Leuven", "country": "Belgium", "identifiers": {"ror": "https://ror.org/05f950310", "GRID": "grid.5596.f"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2020-02-25", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "13", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}