{"url": "http://dx.doi.org/10.1093/llc/fqx010", "identifier": {"string_id": "10.1093/llc/fqx010", "id_scheme": "DOI"}, "abstract": "The point of departure for this article is the Renderings project (http://trope-tank.mit.edu/renderings/) established in 2014 and developed at the Massachusetts Institute of Technology in a laboratory called the Trope Tank. The goal of the project is to translate highly computational and otherwise unusual digital literature into English. Translating digital works that are implemented as computer programs presents new challenges that go beyond the already difficult ones tackled by translators of more typical forms of literature. It is a type of translation akin to the translation of experimental, conceptual, or constrained works. It is not unusual for this task to require the translator or translators to reinvent the work in a new linguistic and cultural context, and sometimes also to port the original program to another programming language. This article describes an undertaking related to the broadly understood discipline of creative computing and studies the work of the translator as taking place both in code and language, drawing from the methodologies developed by the fields of code studies, platform studies, and expressive processing.", "article_title": "Renderings: Translating literary works in the digital age", "authors": [{"given": " Piotr", "family": "Marecki", "affiliation": [{"original_name": "Jagiellonian University, Poland", "normalized_name": "Jagiellonian University", "country": "Poland", "identifiers": {"ror": "https://ror.org/03bqmcz70", "GRID": "grid.5522.0"}}]}, {"given": " Nick", "family": "Montfort", "affiliation": [{"original_name": "Massachusetts Institute of Technology, USA", "normalized_name": "Massachusetts Institute of Technology", "country": "United States", "identifiers": {"ror": "https://ror.org/042nb2s44", "GRID": "grid.116068.8"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "32", "issue": "suppl_1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}