{"url": "http://dx.doi.org/10.1145/3402440", "identifier": {"string_id": "10.1145/3402440", "id_scheme": "DOI"}, "abstract": "Historical archives represent an immense wealth, the potential of which is endangered by the lack of effective management and access tools. We believe that this issue can be faced by providing archive catalogs with a semantic layer, containing rich semantic metadata, representing the content of documents in a full-fledged formal machine-readable format. In this article, we present the contribution offered in this direction by the PRiSMHA project, in which the conceptual vocabulary of the semantic layer is represented by computational ontologies. However, acquiring semantic knowledge represents a well-known bottleneck for knowledge-based systems; to solve this problem, PRiSMHA relies on a crowdsourcing collaborative model, i.e., an online community of users who collaborate in building semantic representations of the content of archival documents. In this perspective, this article aims at answering the following research question: Starting from the axioms characterizing concepts in the computational ontology underlying the system, how can we derive a user interface enabling users to formally represent the content of archival documents by exploiting the conceptual vocabulary provided by the ontology? Our solution includes the following steps: (a) a manually defined configuration, acting as a pre-filter, to hide “unsuited” classes, properties, and relations; (b) an algorithm, combining heuristics and reasoning, which extracts from the ontology all and only the “compatible” properties and relations, given an entity (event) type; and (c) a set of strategies to rank, group, and present the entity (event) properties and relations, based on the results of a study with users. This integrated solution enabled us to design an ontology-driven user interface enabling users to characterize entities, and in particular (historical) events, on the basis of the vocabulary provided by the ontology.", "article_title": "Building Semantic Metadata for Historical Archives through an Ontology-driven User Interface", "authors": [{"given": "Annamaria", "family": "Goy", "affiliation": [{"original_name": "Dipartimento di Informatica, Università di Torino, Torino, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Davide", "family": "Colla", "affiliation": [{"original_name": "Dipartimento di Informatica, Università di Torino, Torino, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Diego", "family": "Magro", "affiliation": [{"original_name": "Dipartimento di Informatica, Università di Torino, Torino, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Cristina", "family": "Accornero", "affiliation": [{"original_name": "Dipartimento di Studi Storici, Università di Torino, Torino, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Fabrizio", "family": "Loreto", "affiliation": [{"original_name": "Dipartimento di Studi Storici, Università di Torino, Torino, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Daniele Paolo", "family": "Radicioni", "affiliation": [{"original_name": "Dipartimento di Informatica, Università di Torino, Torino, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2020", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "13", "issue": "3", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}