{"url": "http://dx.doi.org/10.17928/jjadh.1.1_107", "identifier": {"string_id": "10.17928/jjadh.1.1_107", "id_scheme": "DOI"}, "abstract": "The Collaborative EuropeaN Digital Archival Research Infrastructure (CENDARI) project has developed a new virtual environment for humanities research, reimagining the analogue landscape of research sources for medieval and modern history and humanities research infrastructure models for the digital age.  To achieve this, the project has needed to be sensitive to the ways in which historical research practices in the 21st Century are distinct from those of earlier eras, harnessing the affordances of technology to reveal connections and support or refute hypotheses, enabling transnational approaches, and federating sources beyond the well-known and across the largely national organization paradigms that dominate within traditional knowledge infrastructures (libraries, archives and museums). This paper describes both the user-centered development methodology deployed by the project and the resulting technical architecture adopted to meet these challenging requirements.  The resulting system is a robust ‘enquiry environment’ able to integrate a variety of data types and standards with bespoke tools for the curation, annotation, communication and validation of historical insight.", "article_title": "The Taste of “Data Soup” and the Creation of a Pipeline for Transnational Historical Research", "authors": [{"given": "Jennifer", "family": "Edmond", "affiliation": [{"original_name": "Faculty of Arts Humanities and Social Sciences and Trinity Long Room Hub, Trinity College Dublin", "normalized_name": "Trinity College Dublin", "country": "Ireland", "identifiers": {"ror": "https://ror.org/02tyrky19", "GRID": "grid.8217.c"}}]}, {"given": "Natasa", "family": "Bulatovic", "affiliation": [{"original_name": "Max Planck Digital Library", "normalized_name": "Max Planck Digital Library", "country": "Germany", "identifiers": {"ror": "https://ror.org/0061msm67", "GRID": "grid.431460.4"}}]}, {"given": "Alexander", "family": "O'Connor", "affiliation": [{"original_name": "ADAPT Centre, KDEG, School of Computer Science & Statistics, Trinity College Dublin", "normalized_name": "Trinity College Dublin", "country": "Ireland", "identifiers": {"ror": "https://ror.org/02tyrky19", "GRID": "grid.8217.c"}}]}], "publisher": "Japanese Association for Digital Humanities", "date": "2015-09-01", "keywords": null, "journal_title": "Journal of the Japanese Association for Digital Humanities", "volume": "1", "issue": "1", "ISSN": [{"value": "2188-7276", "type": "electronic"}]}