{"url": "http://dx.doi.org/10.1145/2442080.2442083", "identifier": {"string_id": "10.1145/2442080.2442083", "id_scheme": "DOI"}, "abstract": "This article addresses the problem of automatic reconstruction of a 3D relief object from a line drawing. Our main application is reconstruction of archaeological artifacts based on line drawings. The problem is challenging due to five reasons: the small number of orthogonal views of the object, the sparsity of the strokes, their ambiguity, their large number, and their interrelations. We partition the reconstruction problem into two subproblems. First, we reconstruct the underlying smooth base of the object from the silhouette. Assuming that the variation of bases belonging to the same class of objects is relatively small, we create the base by modifying a similar base retrieved from a database. Second, we reconstruct the relief on top of the base. Our approach can reconstruct the relief from a complex drawing that consists of many interrelated strokes. Rather than viewing the interdependencies as a problem, we show how they can be exploited to automatically generate a good initial interpretation of the line drawing. Even though our algorithm is generic, its strength is demonstrated by the reconstruction of artifacts from manual drawings taken from real archaeological reports. These drawings are highly challenging, since artists created very complex and detailed descriptions of artifacts regardless of any considerations concerning their future use for shape reconstruction.", "article_title": "Reconstruction of relief objects from archeological line drawings", "authors": [{"given": "Michael", "family": "Kolomenkin", "affiliation": [{"original_name": "Technion, Haifa, Israel", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "George", "family": "Leifman", "affiliation": [{"original_name": "Technion, Haifa, Israel", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Ilan", "family": "Shimshoni", "affiliation": [{"original_name": "University of Haifa, Haifa, Israel", "normalized_name": "University of Haifa", "country": "Israel", "identifiers": {"ror": "https://ror.org/02f009v59", "GRID": "grid.18098.38"}}]}, {"given": "Ayellet", "family": "Tal", "affiliation": [{"original_name": "Technion, Haifa, Israel", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2013", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "6", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}