{"url": "http://dx.doi.org/10.1093/llc/fqaa018", "identifier": {"string_id": "10.1093/llc/fqaa018", "id_scheme": "DOI"}, "abstract": "This article revisits the study of the poetry communities, sisa, in the eighteenth-century Seoul, in terms of their membership, structural patterns, and boundaries of interaction. By applying methods in the digital humanities such as social network analysis and geographical information systems, I argue that literary activities in the sisa were performed beyond the factional demarcations, and cultural leverage was determined by their positional advantage in the community structure, not imposed by the political dominance. The factional affiliations of the participants were not directly correlated with the formation of cultural identities. The poetry communities functioned as major loci of cultural textual networks in the late Chosŏn Seoul. Paying no heed to hierarchical distinction, the participants enjoyed the convivial spontaneous environments and shared their literary works with one another. Focusing on the collaborative nature of the era, many modern scholars have examined the kinship, social classes, and political orientations of the community members; furthermore, some argue that those who belonged to influential political factions also exercised their cultural influence and set mainstream literary trends. My research differs from previous contributions in its emphasis on the relational community structure and the information flow. Measuring the homogeneity, centralities, and membership, I prove that the cultural practices were much more complicated beyond the social–political system, and explain how politically marginalized people were able to gain leverage in the cultural world.", "article_title": "Poetry in action: Networks of literary communication and the cultural leverage in the eighteenth-century Seoul", "authors": [{"given": " Jamie Jungmin", "family": "Yoo", "affiliation": [{"original_name": "Institute of Humanities, Yonsei University, Seoul, Republic of Korea", "normalized_name": "Yonsei University", "country": "South Korea", "identifiers": {"ror": "https://ror.org/01wjejq96", "GRID": "grid.15444.30"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}