{"url": "http://dx.doi.org/10.1093/llc/fqy006", "identifier": {"string_id": "10.1093/llc/fqy006", "id_scheme": "DOI"}, "abstract": "Digital possibilities and the presence of large image collections urged art history to reassess existing methods to study artworks. Big data facilitate new research—allowing to analyze millions of images—but also revealed the insufficiency of existing methods. The collaboration between computer vision and art history has provided tools to access and evaluate large image collections. This article elaborates on the potentials of a collaboration and presents work by the Computer Vision group of Heidelberg University. The group uses computational methods to study art data and performs automatic visual searches to find recurrences and organize data according to notions of similarity. It will be shown that large image collections can be studied efficiently with computer-based methods to assist art historians with iconographic research and that similar approaches already existed in art history at the beginning of the twentieth century.", "article_title": "Attesting similarity: Supporting the organization and study of art image collections with computer vision", "authors": [{"given": " Sabine", "family": "Lang", "affiliation": [{"original_name": "Heidelberg Collaboratory for Image Processing, Ruprecht-Karls-University Heidelberg, Germany", "normalized_name": "Heidelberg University", "country": "Germany", "identifiers": {"ror": "https://ror.org/038t36y30", "GRID": "grid.7700.0"}}]}, {"given": " Björn", "family": "Ommer", "affiliation": [{"original_name": "Heidelberg Collaboratory for Image Processing, Ruprecht-Karls-University Heidelberg, Germany", "normalized_name": "Heidelberg University", "country": "Germany", "identifiers": {"ror": "https://ror.org/038t36y30", "GRID": "grid.7700.0"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "4", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}