{"url": "http://dx.doi.org/10.1093/llc/fqy028", "identifier": {"string_id": "10.1093/llc/fqy028", "id_scheme": "DOI"}, "abstract": "In this article, we describe and contrast relevant properties of two electronic registers of Jakarta Indonesian instant messaging, or SMS, and Twitter against a continuum of conversation and writing features. Many linguists (Crystal, 2008, Txting: the Gr8 Db8. Oxford University Press; Carter and McCarthy, 2015, Applied Linguistics, 38(1): 1–20; McWhorter, 2013; Sindoni, 2013, Spoken and Written Discourse in Online Interactions. New York, NY; London: Routledge) have turned their attention to the properties of language evidenced in various social media. Taken as a whole, electronic media have become the predominant channel of non-speech language interaction (CNN.com reports (11/3/2015) that teens spend nine hours a day on electronic media: www.cnn.com/2015/11/03/health/). However, the study of these media is still in its early stages and, in our opinion, suffers from two flaws: instant messaging is relatively understudied, given its prevalence; and contrastive studies of different media are also rare (but cf. Danet and Herring’s, 2007, Handbook of Language and Communication: Diversity and Change. Handbook of Applied Linguistics, vol. 9. Berlin: Mouton De Gruyter, review of genre-specific analyses). Similarly, most linguistic studies we are aware of take European languages as the object of study; since any contrastive or variationist study takes the grammatical features of some standard as its point of departure, insights into register-based variation are limited by the typological features of the language. As a highly isolating, free word order language, Indonesian represents a typologically very different basic grammar from which to view register-based variation. This study contributes to the broadening of linguistic study of social media by contrasting rather than conflating two media, demonstrating that different register properties are associated with distinct social media platforms.", "article_title": "Distinguishing properties of SMS and Twitter in Indonesian: A contrastive study", "authors": [{"given": " Claudia M", "family": "Brugman", "affiliation": [{"original_name": "University of Maryland, College Park, MD, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Thomas J", "family": "Conners", "affiliation": [{"original_name": "University of Maryland, College Park, MD, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}