{"url": "http://dx.doi.org/10.1093/llc/fqt041", "identifier": {"string_id": "10.1093/llc/fqt041", "id_scheme": "DOI"}, "abstract": "Redfern [(2012), The lognormal distribution is not an appropriate parametric model for shot length distributions of Hollywood films. Literary and Linguistic Computing, doi:10.1093/llc/fqs066] disputes the idea that the lognormal distribution is a suitable parametric model for the shot length distribution of films. The force of his arguments against the idea is diminished by problems in his exposition, the most serious is the manner in which hypothesis testing is deployed. The application fails to deal adequately with the effect sample size has on P-values, and this compromises much of the analysis. There is, nevertheless, strong evidence of a fairly systematic departure from lognormality, manifest in the fact that distributions mostly remain positively skewed after log-transformation. This is not recognized in the article and thus not exploited. The present article shows that after a second transformation, normality can be achieved for well over half the films, which are thus distributionally regular in this sense. Some suggestions as to why lognormality, or any other form of distributional regularity, might be of interest are offered at the start of the article, which concludes with an illustration of how the establishment of a distributional ‘norm’ might then be exploited.", "article_title": "On the distributional regularity of shot lengths in film", "authors": [{"given": " Mike", "family": "Baxter", "affiliation": [{"original_name": "Nottingham Trent University, UK", "normalized_name": "Nottingham Trent University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04xyxjd90", "GRID": "grid.12361.37"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "30", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}