{"url": "http://dx.doi.org/10.1093/llc/fqs017", "identifier": {"string_id": "10.1093/llc/fqs017", "id_scheme": "DOI"}, "abstract": "Previous research in conceptual history, the study of change over time of key terms and value systems, has been carried out manually using a restricted number of pre-identified texts. We propose that a method combining techniques from corpus and computational linguistics can be exploited to support conceptual history with semantic searches on a vast sample of texts. To exemplify this method, we focus on a fundamental concept in modern science, the experimental method, in order to trace when the pre-existing and primarily religious concept of experiment (or experience) took on its modern, scientific meaning. We contrast a manual approach using the existing Early English Books Online search interface with an automatic method using corpus linguistics software and methods to turn the transcribed portion of the same dataset into a corpus. Both approaches allow us to separate the religious and scientific senses and plot their change over time. We observe a rapid change in the meaning of experimental from overwhelmingly religious to largely scientific within the 1660s. However, the automatic corpus method is much more efficient and will support future scholars in carrying out iterative studies in a matter of minutes rather than through weeks of painstaking work. Such methodological innovation has the potential to support the formation of new research questions, which could not have been considered previously.", "article_title": "Experiments in 17th century English: manual versus automatic conceptual history", "authors": [{"given": " Stephen", "family": "Pumfrey", "affiliation": [{"original_name": "Lancaster University", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}, {"given": " Paul", "family": "Rayson", "affiliation": [{"original_name": "Lancaster University", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}, {"given": " John", "family": "Mariani", "affiliation": [{"original_name": "Lancaster University", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "27", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}