{"url": "http://dx.doi.org/10.1145/3355395", "identifier": {"string_id": "10.1145/3355395", "id_scheme": "DOI"}, "abstract": "Digital technology in museum practice provides new means of interaction with artifacts and collections. In particular, we need interactive installations in order to encourage and stimulate visitors to learn and understand archaeological musical instruments through engagement and active participation: these instruments (i.e., interactive artifacts per se) are de facto unplayable and inaccessible to visitors, as a consequence of their preservation issues. However, presenting artifacts to the general public is a complex task for their multifaceted nature, and digital technology must not sacrifice accuracy or depth of information for the sake of entertainment. Moreover, deploying digital technology is a multidisciplinary effort that requires an interplay among different fields, from history and archaeology to information engineering and craftsmanship. In this article, we present a methodology to relate such disciplines in order to design a digital multimedia installation that promotes archaeological musical instruments in a museum. In defining the problem, we identify four different aspects to consider: the museum collection, the museum environment, the manufacturing opportunities for the installation, and the user experience. Such aspects are integrated in a design approach that is centered on Design Thinking. The proposed methodology is exemplified in the designing and manufacturing of an installation for a Pan flute from Egypt dated back to 700 A.D., a case in which multisensory interaction is particularly important to convey the lost sound of the instrument. We describe in detail an installation (exhibited at the Museum of Archaeological Science and Art at the University of Padova), which virtually recreates the Pan flute and communicates information related to its history, iconography, acoustics, and musicology. Just after the deployment of the installation, we also carried out an assessment with a group of experts in the fields of information engineering, music, musicology, and archaeology. The good results obtained demonstrate that the installation is a convenient way of interaction, simple to use and aesthetically integrated in the museum context.", "article_title": "Technology-Enhanced Interaction with Cultural Heritage", "authors": [{"given": "Niccoló", "family": "Pretto", "affiliation": [{"original_name": "University of Padova, Department of Information Engineering, Via Gradenigo, Padova, IT", "normalized_name": "University of Padua", "country": "Italy", "identifiers": {"ror": "https://ror.org/00240q980", "GRID": "grid.5608.b"}}]}, {"given": "Edoardo", "family": "Micheloni", "affiliation": [{"original_name": "University of Padova, Department of Information Engineering, Via Gradenigo, Padova, IT", "normalized_name": "University of Padua", "country": "Italy", "identifiers": {"ror": "https://ror.org/00240q980", "GRID": "grid.5608.b"}}]}, {"given": "Silvia", "family": "Gasparotto", "affiliation": [{"original_name": "University of the Republic of San Marino, Department of Economics, Sciences and Law, Contrada Omerelli, San Marino, SM", "normalized_name": "University of the Republic of San Marino", "country": "San Marino", "identifiers": {"ror": "https://ror.org/02c8cxz64", "GRID": "grid.445136.1"}}]}, {"given": "Carlo", "family": "Fantozzi", "affiliation": [{"original_name": "University of Padova, Department of Information Engineering, Via Gradenigo, Padova, IT", "normalized_name": "University of Padua", "country": "Italy", "identifiers": {"ror": "https://ror.org/00240q980", "GRID": "grid.5608.b"}}]}, {"given": "Giovanni De", "family": "Poli", "affiliation": [{"original_name": "University of Padova, Department of Information Engineering, Via Gradenigo, Padova, IT", "normalized_name": "University of Padua", "country": "Italy", "identifiers": {"ror": "https://ror.org/00240q980", "GRID": "grid.5608.b"}}]}, {"given": "Sergio", "family": "Canazza", "affiliation": [{"original_name": "University of Padova, Department of Information Engineering, Via Gradenigo, Padova, IT", "normalized_name": "University of Padua", "country": "Italy", "identifiers": {"ror": "https://ror.org/00240q980", "GRID": "grid.5608.b"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2020-05-31", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "13", "issue": "2", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}