{"url": "http://dx.doi.org/10.1093/llc/fqs048", "identifier": {"string_id": "10.1093/llc/fqs048", "id_scheme": "DOI"}, "abstract": "In our earlier work, an approach to defining dialect areas using multidimensional scaling (MDS) of the total collection of available raw data (from a region of Romania) has produced results that showed ‘some’ but ‘not all’ of the dialect distinctions that were anticipated. To investigate this situation, we have extended our approach in two ways, one methodological and one technical. Methodologically, we have switched from looking at raw data to examining interpretive maps based on recognized dialect distinctions. Further, we have categorized these interpretations as phonetic (regular and irregular), morphophonemic, morphological, and lexical, examining each category separately. The result is a much clearer set of dialect distinctions, as seen in the MDS pictures. However, the dialect distinctions vary by category, leading us to make suggestions about the role of each category in defining the notion of dialect. Our technical extension is the creation and use of a 3D viewer for looking at the MDS pictures. We project the linguistic-distance space into three, instead of two, dimensions, and manipulate the resulting structure interactively, thus uncovering and eliminating any accidental ‘closeness’, as sometimes happens in the 2D case. Strikingly, the resulting 3D objects seem to be very flat, which strongly suggests that there are only two relevant dimensions for distinguishing these dialects, although the two dimensions do not correspond exclusively to geographic dimensions. The result of these extensions is that the multidimensional approach becomes even more viable as a way of selecting dialect and dialect-transition areas, and perhaps more accessible for use with languages and dialects beyond our own study area.", "article_title": "Defining dialect regions with interpretations: Advancing the multidimensional scaling approach", "authors": [{"given": " Sheila", "family": "Embleton", "affiliation": [{"original_name": "York University, Toronto, Canada", "normalized_name": "York University", "country": "Canada", "identifiers": {"ror": "https://ror.org/05fq50484", "GRID": "grid.21100.32"}}]}, {"given": " Dorin", "family": "Uritescu", "affiliation": [{"original_name": "York University, Toronto, Canada", "normalized_name": "York University", "country": "Canada", "identifiers": {"ror": "https://ror.org/05fq50484", "GRID": "grid.21100.32"}}]}, {"given": " Eric S.", "family": "Wheeler", "affiliation": [{"original_name": "York University, Toronto, Canada", "normalized_name": "York University", "country": "Canada", "identifiers": {"ror": "https://ror.org/05fq50484", "GRID": "grid.21100.32"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013-01-06", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}