{"url": "http://dx.doi.org/10.16995/dscn.326", "identifier": {"string_id": "10.16995/dscn.326", "id_scheme": "DOI"}, "abstract": "Social Media and Digital Activism, in the context of the Global South, have continued to redefine identities and transform traditional notions of citizenship, nationhood, and belonging. With the power of digital technologies to bring public and private issues to light, digital cultures have enabled the shaping of contemporary faces of entire nations in the South. The most potent example of how digital activism and new age digital cultures have helped chisel a South Asian queer identity in India and beyond is Section 377, an archaic, colonial law, established in the country by the British Raj, and that until August 2018, criminalized homosexuality as “carnal intercourse” or an “unnatural sexual act.” Although not applicable specifically to homosexuals, it is widely perceived as an anti-queer law in the country; cloaked in colonial textual ambiguity, it directs the colonial desire for sexual control towards colonial societies. This research focuses on an exploration of Indian queer dissident subaltern counterpublics, and how these communities (both members and non-members) congregate on Twitter to combat postcolonial and Victorian structures through new media as a decolonizing and transnational space. Therefore, the hashtags surrounding this event perform and decolonize Indian cyberspaces. The study equally investigates how the new wave of digital activism post reading down of the Section 377 of the Indian Penal Code has fortified identities of the marginalized and the non-marginalized alike and transformed the notion of the “self” and the “other.” Given this premise, this paper employs Twitter Search API to collect and filter tweets that explore the private and public discourses of a digital movement that has proved instrumental in the creation of digital spaces for the marginalized “other.” This body of work contributes to the pool of research that is focused on the understanding of South Asian digital identities and the creation of their digital spaces as a solution for social, legal, and political discrimination.", "article_title": "Digital Queer: Tracing the Digital Discourse around Section 377 of the Indian Penal Code", "authors": [{"given": "Narayanamoorthy", "family": "Nanditha", "affiliation": [{"original_name": "York University", "normalized_name": "York University", "country": "Canada", "identifiers": {"ror": "https://ror.org/05fq50484", "GRID": "grid.21100.32"}}]}], "publisher": "Open Library of the Humanities", "date": "2020", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "10", "issue": "1", "ISSN": [{"value": "1918-3666", "type": "electronic"}]}