{"url": "http://dx.doi.org/10.16995/dscn.292", "identifier": {"string_id": "10.16995/dscn.292", "id_scheme": "DOI"}, "abstract": "This study examines how social media networks are changing the ways party politics and election campaigns are conducted in Nigeria, especially how these technologies are encouraging new ways of wooing voters and engaging ordinary citizens. Specifically, this study focuses on the growing awareness of the use of Twitter for election campaigns and civic engagement between 2012 and 2015. The theoretical framework used in the study adopts approaches from Computer-Mediated Communication (CMC) and Computer-Mediated Discourse Analysis (CMDA- e.g. Herring 2001, 2004). The data set consists of selected microblogging posts extracted from the Twitter handles of two major political parties and their political candidates. Additional Twitter posts on the election-related issues trending during the period provided supplemental data. The data collection procedures comprised media monitoring and use of computer software packages (e.g. SketchEngine, Topsy, AntConc) for online data harvesting over a period of fourteen months. This method was supplemented with manual downloading using google search. The analytical procedure follows the content analysis of significant textual features and discourse patterns in the online political conversation that sheds light on the persuasive use of technologies as discourse strategy. The study thus highlights the sociality of politics and socio-communicative features of Twitter as a campaign tool to mobilise support and woo voters in an emerging democracy.", "article_title": "The Twittersphere as Political Engagement Space: A Study of Social Media Usage in Election Campaigns in Nigeria", "authors": [{"given": "Tunde", "family": "Opeibi", "affiliation": [{"original_name": "University of Lagos", "normalized_name": "University of Lagos", "country": "Nigeria", "identifiers": {"ror": "https://ror.org/05rk03822", "GRID": "grid.411782.9"}}]}], "publisher": "Open Library of the Humanities", "date": "2019", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "9", "issue": "1", "ISSN": [{"value": "1918-3666", "type": "electronic"}]}