{"url": "http://dx.doi.org/10.1093/llc/fqt028", "identifier": {"string_id": "10.1093/llc/fqt028", "id_scheme": "DOI"}, "abstract": "The frequencies of individual words have been the mainstay of computer-assisted authorial attribution over the past three decades. The usefulness of this sort of data is attested in many benchmark trials and in numerous studies of particular authorship problems. It is sometimes argued, however, that since language as spoken or written falls into word sequences, on the ‘idiom principle’, and since language is characteristically produced in the brain in chunks, not in individual words, n-grams with n higher than 1 are superior to individual words as a source of authorship markers. In this article, we test the usefulness of word n-grams for authorship attribution by asking how many good-quality authorship markers are yielded by n-grams of various types, namely 1-grams, 2-grams, 3-grams, 4-grams, and 5-grams. We use two ways of formulating the n-grams, two corpora of texts, and two methods for finding and assessing markers. We find that when using methods based on regularly occurring markers, and drawing on all the available vocabulary, 1-grams perform best. With methods based on rare markers, and all the available vocabulary, strict 3-gram sequences perform best. If we restrict ourselves to a defined word-list of function-words to form n-grams, 2-grams offer a striking improvement on 1-grams.", "article_title": "Language chunking, data sparseness, and the value of a long marker list: explorations with word n-grams and authorial attribution", "authors": [{"given": " Alexis", "family": "Antonia", "affiliation": [{"original_name": "Centre for Literary and Linguistic Computing, University of Newcastle, Australia", "normalized_name": "University of Newcastle Australia", "country": "Australia", "identifiers": {"ror": "https://ror.org/00eae9z71", "GRID": "grid.266842.c"}}]}, {"given": " Hugh", "family": "Craig", "affiliation": [{"original_name": "Centre for Literary and Linguistic Computing, University of Newcastle, Australia", "normalized_name": "University of Newcastle Australia", "country": "Australia", "identifiers": {"ror": "https://ror.org/00eae9z71", "GRID": "grid.266842.c"}}]}, {"given": " Jack", "family": "Elliott", "affiliation": [{"original_name": "Centre for Literary and Linguistic Computing, University of Newcastle, Australia", "normalized_name": "University of Newcastle Australia", "country": "Australia", "identifiers": {"ror": "https://ror.org/00eae9z71", "GRID": "grid.266842.c"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}