{"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/52795", "identifier": {"string_id": "10.11588/dah.2019.4.52795", "id_scheme": "DOI"}, "abstract": "The technological progress of the past decades has had a transformative effect on both cultural institutions and academic research. It is generally accepted that mass digitization projects led by museums, libraries and archives have allowed institutions to reach new audiences and increase the impact of their collections, while the emergence of digital libraries and other types of digital resources has opened up new opportunities for scholars in terms of accessing diverse types of information. Yet, our knowledge of the impact of these resources on the scholarly workflow beyond the stage of discovery remains limited; this paper argues for the importance of understanding user behavior and needs for building digital resources that have a positive effect on the whole scholarly workflow. By employing an ethnographic approach to the study of art historians’ habits we get a detailed view of the effect that digitization and digital resource design can have on scholars’ work, from the seeking of the information to the construction of the research argument. The complex information behavior of art historians and the challenges they often face when interacting with digital resources make them a great example to demonstrate the impact that these can have on the research process.", "article_title": "The impact of digitization and digital resource design on the scholarly workflow in art history", "authors": [{"given": "Christina", "family": "Kamposiori", "affiliation": [{"original_name": "University College London", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": "Simon", "family": "Mahony", "affiliation": [{"original_name": "University College London", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": "Claire", "family": "Warwick", "affiliation": [{"original_name": "Durham University", "normalized_name": "Durham University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01v29qb04", "GRID": "grid.8250.f"}}]}], "publisher": null, "date": "2020-02-25", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}