{"url": "http://dx.doi.org/10.1093/llc/fqz048", "identifier": {"string_id": "10.1093/llc/fqz048", "id_scheme": "DOI"}, "abstract": "Word sense disambiguation (WSD) is the task of selecting correct sense for an ambiguous word in its context. Since WSD is one of the most challenging tasks in various text processing systems, improving its accuracy can be very beneficial. In this article, we propose a new unsupervised method based on co-occurrence graph created by monolingual corpus without any dependency on the structure and properties of the language itself. In the proposed method, the context of an ambiguous word is represented as a sub-graph extracted from a large word co-occurrence graph built based on a corpus. Most of the words are connected in this graph. To clarify the exact sense of an ambiguous word, its senses and relations are added to the context graph, and various similarity functions are employed based on the senses and context graph. In the disambiguation process, we select senses with highest similarity to the context graph. As opposite to other WSD methods, the proposed method does not use any language-dependent resources (e.g. WordNet) and it just uses a monolingual corpus. Therefore, the proposed method can be employed for other languages. Moreover, by increasing the size of corpus, it is possible to enhance the accuracy of WSD. Experimental results on English and Persian datasets show that the proposed method is competitive with existing supervised and unsupervised WSD approaches.", "article_title": "Co-occurrence graph-based context adaptation: a new unsupervised approach to word sense disambiguation", "authors": [{"given": " Saeed", "family": "Rahmani", "affiliation": [{"original_name": "Computer Science and Engineering Department, Shiraz University, Shiraz, Iran", "normalized_name": "Shiraz University", "country": "Iran", "identifiers": {"ror": "https://ror.org/028qtbk54", "GRID": "grid.412573.6"}}]}, {"given": " Seyed Mostafa", "family": "Fakhrahmad", "affiliation": [{"original_name": "Computer Science and Engineering Department, Shiraz University, Shiraz, Iran", "normalized_name": "Shiraz University", "country": "Iran", "identifiers": {"ror": "https://ror.org/028qtbk54", "GRID": "grid.412573.6"}}]}, {"given": " Mohammad Hadi", "family": "Sadreddini", "affiliation": [{"original_name": "Computer Science and Engineering Department, Shiraz University, Shiraz, Iran", "normalized_name": "Shiraz University", "country": "Iran", "identifiers": {"ror": "https://ror.org/028qtbk54", "GRID": "grid.412573.6"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}