{"identifier": {"string_id": "10.16995/dm.51", "id_scheme": "DOI"}, "abstract": "With relatively few scholars and a large number of texts whose manuscript transmission has yet to be mapped, Icelandic literature would benefit from efficient ways of establishing stemmas, to facilitate the study of literature, linguistics, scribal culture, and so Icelandic history more generally. This is also true for much medieval literature. Meanwhile, in saga-studies as in stemmatology generally, there has been little discussion of the role of sampling in textual criticism, even though most scholars must make heavy use of it. This article tests the viability of creating a stemma using a small sample of text by independently drawing a stemma of Konráðs saga keisarasonar, whose stemma was previously established in Zitzelsberger (1981, 1983, 1987), and testing it against these prior publications. Although the approach has limitations, at worst it produces “known unknowns” which can then be resolved through targeted study; in practice it produces results very similar to those of Zitzelsberger; and in some cases it actually allows us to improve on his work. The article also capitalises on internet publication rigorously to include all underlying data and to experiment with new, more transparent, ways of publishing stemmas; and to use digitised data to provide a new overview of the long manuscript tradition of medieval Icelandic romance sagas. Finally, it describes and filiates two new manuscripts of the saga identified in Winnipeg by Katelin Parsons. It concludes by sketching what the stemma of Konráðs saga can tell us about Icelandic scribal culture during its long post-medieval history.", "article_title": "Making stemmas with small samples, and digital approaches to publishing them: testing the stemma of Konráðs saga keisarasonar", "authors": [{"given": "Alaric", "family": "Hall", "affiliation": [{"original_name": "University of Leeds", "normalized_name": "University of Leeds", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/024mrxd33", "GRID": "grid.9909.9"}}]}, {"given": "Katelin", "family": "Parsons", "affiliation": [{"original_name": "With a description of Winnipeg, Elizabeth Dafoe Library, ISDA JB6 1 4to and JB3 6 8vo by University of Iceland", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Open Library of the Humanities", "date": "2017-05-31", "keywords": null, "journal_title": "Digital Medievalist", "volume": "9", "issue": null, "ISSN": [{"value": "1715-0736", "type": "electronic"}], "url": "http://dx.doi.org/10.16995/dm.51"}