{"url": "http://dx.doi.org/10.1093/llc/fqv039", "identifier": {"string_id": "10.1093/llc/fqv039", "id_scheme": "DOI"}, "abstract": "Our hypothesis was simple enough: undergraduates would better understand a historic document online if, instead of having a traditional textual introduction, the same information was made available in bite-size balloons invoked by the users clicking on pins distributed throughout the document. Half the students had a pinned edition and half a more traditional one, while they all had several hours to explore the same eight-page crew agreement from the late 19th century. They then filled out quizzes, short answer tests, and went through an extensive debriefing. The results surprised us. Form made no difference whatsoever, none of the students understood the document’s content. We concluded their difficulty stemmed from living in the immediate, rather than in a temporally informed present, and so they could not fathom the profundity of the past. Seeking to understand this dramatic foreshortening of the analytics of existence, an issue of general interest to humanists, we searched for guidance in the digital humanities and educational literatures with little success. Borrowing from more progressive writings on academic literacy, our solution is a Friere-inspired approach that privileges points of entry for our undergraduates that build on their already-existing knowledge, rather than requiring them to acquire a canonical and frankly out-dated learned past. We argue this critical approach allows our students a democratizing experience that permits them to more fully engage the world as informed citizens.", "article_title": "Realizing the Democratic Potential of Online Sources in the Classroom", "authors": [{"given": " Valerie", "family": "Burton", "affiliation": [{"original_name": "Memorial University of Newfoundland, NL, Canada", "normalized_name": "Memorial University of Newfoundland", "country": "Canada", "identifiers": {"ror": "https://ror.org/04haebc03", "GRID": "grid.25055.37"}}]}, {"given": " Robert C. H.", "family": "Sweeny", "affiliation": [{"original_name": "Memorial University of Newfoundland, NL, Canada", "normalized_name": "Memorial University of Newfoundland", "country": "Canada", "identifiers": {"ror": "https://ror.org/04haebc03", "GRID": "grid.25055.37"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2015-10-02", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}