{"url": "http://dx.doi.org/10.1145/2583115", "identifier": {"string_id": "10.1145/2583115", "id_scheme": "DOI"}, "abstract": "Coin classification is one of the main aspects of numismatics. The introduction of an automated image-based coin classification system could assist numismatists in their everyday work and allow hobby numismatists to gain additional information on their coin collection by uploading images to a respective Web site. For Roman Republican coins, the inscription is one of the most significant features, and its recognition is an essential part in the successful research of an image-based coin recognition system. This article presents a novel way for the recognition of ancient Roman Republican coin legends. Traditional optical character recognition (OCR) strategies were designed for printed or handwritten texts and rely on binarization in the course of their recognition process. Since coin legends are simply embossed onto a piece of metal, they are of the same color as the background and binarization becomes error prone and prohibits the use of standard OCR. Therefore, the proposed method is based on state-of-the-art scene text recognition methods that are rooted in object recognition. Sift descriptors are computed for a dense grid of keypoints and are tested using support vector machines trained for each letter of the respective alphabet. Each descriptor receives a score for every letter, and the use of pictorial structures allows one to detect the optimal configuration for the lexicon words within an image; the word causing the lowest costs is recognized. Character and word recognition capabilities of the proposed method are evaluated individually; character recognition is benchmarked on three and word recognition on different datasets. Depending on the Sift configuration, lexicon, and dataset used, the word recognition rates range from 29% to 67%.", "article_title": "Reading the legends of Roman Republican coins", "authors": [{"given": "Albert", "family": "Kavelar", "affiliation": [{"original_name": "Vienna University of Technology, Vienna, Austria", "normalized_name": "TU Wien", "country": "Austria", "identifiers": {"ror": "https://ror.org/04d836q62", "GRID": "grid.5329.d"}}]}, {"given": "Sebastian", "family": "Zambanini", "affiliation": [{"original_name": "Vienna University of Technology, Vienna, Austria", "normalized_name": "TU Wien", "country": "Austria", "identifiers": {"ror": "https://ror.org/04d836q62", "GRID": "grid.5329.d"}}]}, {"given": "Martin", "family": "Kampel", "affiliation": [{"original_name": "Vienna University of Technology, Vienna, Austria", "normalized_name": "TU Wien", "country": "Austria", "identifiers": {"ror": "https://ror.org/04d836q62", "GRID": "grid.5329.d"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2014", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "7", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}