{"url": "http://dx.doi.org/10.1093/llc/fqt023", "identifier": {"string_id": "10.1093/llc/fqt023", "id_scheme": "DOI"}, "abstract": "This study is designed to analyze the use of nominalization in English translations of Chinese literary prose based on eight English translations of Chinese novels. It follows ‘Lees, R. (1963). The Grammar of English Nominalizations. The Hague: Mouton’ in defining English nominalization as a nominalized transform of a finite verbal form and ‘Mathesius, V. (1975). Selected Writings in English and General Linguistics. The Hague: Mouton’ theory of ‘complex condensation of the sentence’. It describes English nominalization from the formal-syntactic level as adverbial, in the positions of subject and object, condensing a finite clausal structure. In the qualitative analysis, various effects of the use of nominalization are described based on three English versions of the Chinese classic novel Hong Lou Meng. In the quantitative analysis, three general patterns of the use of nominalization are found in the eight English translations of Chinese novels: it is predominantly used as adverbial (as opposed to in the positions of object and subject), in the form of gerundive nominalization (as opposed to derived and zero-derived nominalizations), and in the narrative (as opposed to dialogues). In comparison with nominalization used in some English novels, it is found that nominalization is significantly more used in the English translations of Chinese novels at large.", "article_title": "A corpus-based study of nominalization in English translations of Chinese literary prose", "authors": [{"given": " Yu", "family": "Hou", "affiliation": [{"original_name": "Yanshan University, Qinhuangdao, China", "normalized_name": "Yanshan University", "country": "China", "identifiers": {"ror": "https://ror.org/02txfnf15", "GRID": "grid.413012.5"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013-05-14", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "30", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}