{"url": "http://dx.doi.org/10.16995/dscn.22", "identifier": {"string_id": "10.16995/dscn.22", "id_scheme": "DOI"}, "abstract": "This paper makes a contribution to the growing literatures on critical media literacy and intellectual property. While new forms of participatory culture, social production, user-generated content and new forms of social engagement have developed through the use of digital technology, those very forms of engagement are shaped by legal definitions and commercial practices that constitute the operating system of the digital economy. It will be shown that a shift toward propertization has occurred in copyright, trademark and the right of publicity. Further, each of these forms of intellectual property law has been strengthened, lengthened and, increasingly, used in relation to the others. The objects of various intellectual property forms (creative works, marks, and publicity rights) are abstracted from their original contexts and treated in an analogous way – as property, by the information and entertainment industries, the courts, and legislators, and even the general public. In such a media ecology it makes sense to see cultural properties as transpropertied, where the multi-faceted character of such intellectual artifacts requires the interaction and protection of formerly distinct forms of IP protection. Using examples from literature, cinema, and comic books the paper will trace the development of transproperty and will offer suggestions for how an understanding of transproperty strengthens our media literacy.", "article_title": "Transproperty: Intellectual property and the ideal property form", "authors": [{"given": "Daniel", "family": "Downes", "affiliation": [{"original_name": "University of New Brunswick", "normalized_name": "University of New Brunswick", "country": "Canada", "identifiers": {"ror": "https://ror.org/05nkf0n29", "GRID": "grid.266820.8"}}]}], "publisher": "Open Library of the Humanities", "date": "2016", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "6", "issue": "1", "ISSN": [{"value": "1918-3666", "type": "electronic"}]}