{"url": "http://dx.doi.org/10.1353/dph.2019.0013", "identifier": {"string_id": "10.1353/dph.2019.0013", "id_scheme": "DOI"}, "abstract": "An important trend in scholarship is attending to the metamorphoses of particular folktales across regions, periods, and religions, tracking what such changes reveal about the direction of cultural transmission. Part of this trend is looking beyond circulation in Europe to circulation across south-south boundaries, or even from south to north, the latter of which I have done much to try to forward. In this essay, however, I consider an instance of ostensible Europe-to-Africa textual transfer: the body of folktales that circulated around the medieval world about miracles performed by Saint Mary, the mother of Jesus. The Ethiopian Marian tales, which appear in a compilation text titled Täˀammərä Maryam (Miracles of Mary), are sometimes mistakenly said to have arisen solely in Europe. To explore the issue of influence, I examine a Marian tale innovated in Ethiopia titled \"The Cannibal of Qəmər\" (or \"The Miracle of the Man-Eater\" or \"The Story of Belai\"). Reading the cannibal tale diachronically, relationally, allegorically, and intertextually reveals much. The Marian tale template first devised in the Levant persists across multiple boundaries yet was radically adapted in Ethiopia, underscoring why care is required when discussing African narrative adaptation of outside texts.", "article_title": "Mary Saves the Man-Eater: Value in the Medieval Ethiopian Marian Miracle Tale of \"The Cannibal of Qəmər\"", "authors": [{"given": "Wendy Laura", "family": "Belcher", "affiliation": [{"original_name": "Princeton University", "normalized_name": "Princeton University", "country": "United States", "identifiers": {"ror": "https://ror.org/00hx57361", "GRID": "grid.16750.35"}}]}], "publisher": "Johns Hopkins University Press", "date": "2019-07-21", "keywords": null, "journal_title": "Digital Philology: A Journal of Medieval Cultures", "volume": "8", "issue": "1", "ISSN": [{"value": "2162-9552", "type": "electronic"}]}