{"url": "http://dx.doi.org/10.1145/3117801", "identifier": {"string_id": "10.1145/3117801", "id_scheme": "DOI"}, "abstract": "Virtual environment has the potential to be used as a medium to facilitate cultural learning. However, this requires guidelines on how to design the environment. This article provides a conceptual framework that guides the design of a virtual environment that facilitates cultural learning for casual users. The exploratory sequential mixed-method design approach was used as the basis for the overall research design. Five studies involving experts and end users were performed to identify and evaluate the framework components. The framework consists of four important components: (i) Information Design, (ii) Information Presentation, (iii) Navigation Mechanism, and (iv) Environment Setting, and outlines two types of design elements: basic elements, which are essential for cultural learning to take place, and extended elements, which provide options for enhanced user experience. Results from the framework evaluation suggest that the proposed design elements are useful in facilitating learning and that the experience of using the virtual environment affected the end users’ sense of awareness and appreciation toward heritage value and preservation.", "article_title": "A Conceptual Framework for Designing Virtual Heritage Environment for Cultural Learning", "authors": [{"given": "Nazrita", "family": "Ibrahim", "affiliation": [{"original_name": "Universiti Tenaga Nasional, Selangor, Malaysia", "normalized_name": "Universiti Tenaga Nasional", "country": "Malaysia", "identifiers": {"ror": "https://ror.org/03kxdn807", "GRID": "grid.484611.e"}}]}, {"given": "Nazlena Mohamad", "family": "Ali", "affiliation": [{"original_name": "Universiti Kebangsaan Malaysia, Selangor, Malaysia", "normalized_name": "National University of Malaysia", "country": "Malaysia", "identifiers": {"ror": "https://ror.org/00bw8d226", "GRID": "grid.412113.4"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2018-04-13", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "11", "issue": "2", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}