{"url": "http://dx.doi.org/10.1093/llc/fqi036", "identifier": {"string_id": "10.1093/llc/fqi036", "id_scheme": "DOI"}, "abstract": "Although there has been an increased uptake of technology-based outputs and methods in humanities research, substantial barriers remain to the full realization of potential benefits in this area. Some of these barriers resonate with the most basic challenges defined by the field of Human–Computer Interaction, including the move from computational to faciliatory computing, non-user-centred industrial design of research tools, the application of inappropriate experience models by users, and a cultural mismatch between researchers and technicians. This article develops a model of digital development in the humanities as a ‘value chain’, along which critical gaps appear when the only actors in the chain are the researcher and the technical support staff. Having identified these gaps, the article then goes on to suggest ways in which a dedicated Digital Humanities Intermediary (DHI) is able to provide much needed skills and support of a non-specifically technical nature at critical moments in the projects' development. This kind of intermediary can be instrumental in increasing technology use among humanities research staff, providing a wide range of technical knowledge and other support functions to the relevant faculties in a form that fits well with their own language and preferred ways of working. The success of the position is dependant on solid networks and the enlightened support of the University, however, as it is still very much at the stage of reacting and capitalizing on opportunities as they are encountered, rather than simply slotting in to a stable, static, proven structure.", "article_title": "The Role of the Professional Intermediary in Expanding the Humanities Computing Base", "authors": [{"given": " Jennifer", "family": "Edmond", "affiliation": [{"original_name": "University of Nottingham, UK", "normalized_name": "University of Nottingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ee9ar58", "GRID": "grid.4563.4"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2005", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "20", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}