{"url": "http://dx.doi.org/10.1093/llc/fqu020", "identifier": {"string_id": "10.1093/llc/fqu020", "id_scheme": "DOI"}, "abstract": "For more than 40 years now, modern theories of literature insist on the role of paraphrases, rewritings, citations, reciprocal borrowings, and mutual contributions of many kinds. The notions of ‘intertextuality’, ‘transtextuality’, and ‘hypertextuality/hypotextuality’ were introduced in the seventies and eighties to approach these phenomena. Through the Phœbus project, computer scientists from the computer science laboratory of the University Pierre and Marie Curie collaborate with the literary teams of Paris-Sorbonne University to develop efficient tools for literary studies that take advantage of modern computer science techniques to detect borrowings of huge masses of texts and to help put them in context. In this context, we have developed a piece of software that automatically detects and explores networks of textual reuses in classical literature. This article describes the principles on which our program is based, the significant results that have already been obtained and the prospective for the near future. It is divided into four parts. The first part recalls the distinction between various types of borrowings like plagiarism, pastiches, citations, etc. The second enumerates the criteria that are retained to characterize reuses and citations on which we are focusing here. The third part describes the implementation and shows its efficiency by comparison with manual detection. Finally, we show some of the results that have already been obtained with the Phœbus program.", "article_title": "Automatic detection of reuses and citations in literary texts", "authors": [{"given": " Jean-Gabriel", "family": "Ganascia", "affiliation": [{"original_name": "ACASA team, LIP6 - University Pierre and Marie Curie, Paris, France", "normalized_name": "Marie Curie", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02aqv1x10", "GRID": "grid.419428.2"}}, {"original_name": "Labex OBVIL, PRES Sorbonne University, Paris, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Peirre", "family": "Glaudes", "affiliation": [{"original_name": "Littérature française, XIXe-XXIe siècles, Paris-Sorbonne University, Paris, France", "normalized_name": "Sorbonne University", "country": "France", "identifiers": {"ror": "https://ror.org/02en5vm52", "GRID": "grid.462844.8"}}, {"original_name": "Labex OBVIL, PRES Sorbonne University, Paris, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Andrea", "family": "Del Lungo", "affiliation": [{"original_name": "ALITHILA, Université Charles de Gaulle, Lille 3, Lille, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014-06-26", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}