{"url": "http://dx.doi.org/10.1093/llc/fqx062", "identifier": {"string_id": "10.1093/llc/fqx062", "id_scheme": "DOI"}, "abstract": "For the first time, historians of higher education have large data sets of primary sources that reflect the complete output of academic institutions at their disposal. To analyze this unprecedented abundance of digital materials, scholars have access to a large suite of computational methods developed in the field of Natural Language Processing. However, when the intention is to move beyond exploratory studies and use the results of such analyses as quantitative evidences, historians need to take into account the reliability of these techniques. The main goal of this article is to investigate the performance of different text mining methods for a specific task: the automatic identification of interdisciplinary works from a corpus of PhD dissertation abstracts. Based on the output of our study, we provide the research community of a new data set for analyzing recent changes in interdisciplinary practices in a large sample of European universities. We show the potential of this collection by tracking the growth in adoption of computational approaches across different research fields, during the past 30 years.", "article_title": "Toward a computational history of universities: Evaluating text mining methods for interdisciplinarity detection from PhD dissertation abstracts", "authors": [{"given": " Federico", "family": "Nanni", "affiliation": [{"original_name": "International Centre for the History of Universities and Science, University of Bologna", "normalized_name": "University of Bologna", "country": "Italy", "identifiers": {"ror": "https://ror.org/01111rn36", "GRID": "grid.6292.f"}}, {"original_name": "Data and Web Science Group, University of Mannheim", "normalized_name": "University of Mannheim", "country": "Germany", "identifiers": {"ror": "https://ror.org/031bsb921", "GRID": "grid.5601.2"}}]}, {"given": " Laura", "family": "Dietz", "affiliation": [{"original_name": "Department of Computer Science, University of New Hampshire, USA", "normalized_name": "University of New Hampshire", "country": "United States", "identifiers": {"ror": "https://ror.org/01rmh9n78", "GRID": "grid.167436.1"}}]}, {"given": " Simone Paolo", "family": "Ponzetto", "affiliation": [{"original_name": "Data and Web Science Group, University of Mannheim", "normalized_name": "University of Mannheim", "country": "Germany", "identifiers": {"ror": "https://ror.org/031bsb921", "GRID": "grid.5601.2"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2017", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}