{"url": "http://dx.doi.org/10.1093/llc/19.3.321", "identifier": {"string_id": "10.1093/llc/19.3.321", "id_scheme": "DOI"}, "abstract": "This paper discusses the utilization of content‐based image retrieval (CBIR) for searching and retrieving images, to enhance access to digital image collections. Organizations have taken advantage of new technologies and funding opportunities to digitize their image collections, resulting in a greater need for efficient storage and retrieval systems. Images are used by a wide and diverse group of people, including picture researchers, historians and design professionals. Research into image use indicates that some image users have very specific needs, others are more interested in material conveying abstract concepts, and some do not want specific images but want to browse for inspiration. Cataloguing and indexing practices vary considerably, despite the existence of several tools to aid the process. Many organizations use in‐house schemes or no formal methods at all. Manual indexing effectiveness is a problem area that affects both practitioners and users. Image seeking behaviour is a complex interaction between contextual factors that ultimately affect how a user searches, selects, and uses images. CBIR is a technique in which images are selected via features automatically extracted from the images. Research into CBIR in practice found that, whilst user views were mixed, there was sufficient evidence that visual searching for images could be a useful feature of a digital image library, particularly if used in combination with text‐based descriptors.", "article_title": "Enhancing Visual Resources for Searching and Retrieval--Is Content-based Image Retrieval a Solution?", "authors": [{"given": "M. E.", "family": "Graham", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "19", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}