{"url": "http://dx.doi.org/10.1093/llc/fqs057", "identifier": {"string_id": "10.1093/llc/fqs057", "id_scheme": "DOI"}, "abstract": "A careful investigation of synchronic patterns of linguistic variation with underlying linguistic features can lead to important insights into the comprehension of diachronic phonetic processes. In this article, we showed that the method of spectral partitioning of bipartite graphs applied to synchronic dialectal data can effectively and reliably be used to investigate diachronic processes, thus contributing to a deeper understanding of the relationship between synchronic variation and diachronic change. This was illustrated through a case study carried out on Tuscan dialects, focusing on so-called Tuscan ‘gorgia’, a lenition process consisting of the spirantization of stop consonants. In particular, from a quantitative analysis of the sound correspondences involving voiceless and voiced stops, we tracked the evolution of the spirantization phenomenon in several respects. First, we tracked spirantization geographically, across Tuscany from the influential center of Florence to the peripheral areas. Second, we tracked it phonologically, from voiceless to voiced stops, and within each voicing class from velars to dentals and then to bilabials. Finally, we tracked it demographically, with young speakers using the most innovative sound correspondences more than old speakers. The fact that these results are in line with the literature on the topic of Tuscan ‘gorgia’ demonstrates the potential of the method of spectral partitioning of bipartite graphs with respect to the reconstruction of diachronic processes starting from diatopically distributed synchronic dialectal data.", "article_title": "Synchronic patterns of Tuscan phonetic variation and diachronic change: Evidence from a dialectometric study", "authors": [{"given": " Simonetta", "family": "Montemagni", "affiliation": [{"original_name": "Istituto di Linguistica Computazionale ‘Antonio Zampolli’ – CNR, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Martijn", "family": "Wieling", "affiliation": [{"original_name": "Center for Language and Cognition Groningen, University of Groningen, The Netherlands", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}, {"given": " Bob", "family": "de Jonge", "affiliation": [{"original_name": "Center for Language and Cognition Groningen, University of Groningen, The Netherlands", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}, {"given": " John", "family": "Nerbonne", "affiliation": [{"original_name": "Center for Language and Cognition Groningen, University of Groningen, The Netherlands", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}, {"original_name": "Freiburg Institute of Advanced Studies, Germany", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}