{"url": "http://dx.doi.org/10.1145/3317552", "identifier": {"string_id": "10.1145/3317552", "id_scheme": "DOI"}, "abstract": "In this article, the design, development, and evaluation of augmented reality (AR)-based mobile application for a tour guide are discussed. The objectives of this article are twofold. First, the research focuses on the development of a complete working set of a mobile tour application furnished with AR. For such an application to be successfully adopted by the general public, user requirements and application usability are investigated, and the application is designed and implemented to fulfill those findings. Second, the developed application is demonstrated by applying it to a UNESCO designated World Heritage site, Hwaseong Fortress in Suwon, South Korea, and evaluated via a survey instrument developed explicitly for mobile application evaluation. A systematically developed survey instrument from the fields of tourism, information systems, and human-computer interaction is tailored to fit into this research and employed for the application evaluation. The application’s operation flow consists of three main functions: navigation to the points of interest, visualization of information with AR technology, and interactive learning activities with AR-based serious games. Efforts are made to provide a more immersive and interactive experience of the historical, cultural, and architectural details of the heritage site utilizing novel AR visualization methods. The evaluation returned positive results with suggestions of possible refinements for future works. The proposed device-aided tour mechanism is anticipated to enhance tourists’ experiences as well as being important guidance in future mobile tourism application development as to how the application should be designed and implemented to be accepted by the general public.", "article_title": "Development of an Augmented Reality Tour Guide for a Cultural Heritage Site", "authors": [{"given": "Seungbum", "family": "Koo", "affiliation": [{"original_name": "Engineering Research Institute, Ajou University, Yeongtong-gu, Suwon-si, Gyeonggi-do, Republic of Korea", "normalized_name": "Ajou University", "country": "South Korea", "identifiers": {"ror": "https://ror.org/03tzb2h73", "GRID": "grid.251916.8"}}]}, {"given": "Jinyoung", "family": "Kim", "affiliation": [{"original_name": "Department of Architectural Engineering, Ajou University, Yeongtong-gu, Suwon-si, Gyeonggi-do, Republic of Korea", "normalized_name": "Ajou University", "country": "South Korea", "identifiers": {"ror": "https://ror.org/03tzb2h73", "GRID": "grid.251916.8"}}]}, {"given": "Changhyuk", "family": "Kim", "affiliation": [{"original_name": "Korea Institute of Civil Engineering and Building Technology, Goyang-daero, Ilsanseo-gu, Goyang-si, Gyeonggi-do, Republic of Korea", "normalized_name": "Korea Institute of Civil Engineering and Building Technology", "country": "South Korea", "identifiers": {"ror": "https://ror.org/035enhp47", "GRID": "grid.453485.b"}}]}, {"given": "Jeeyeop", "family": "Kim", "affiliation": [{"original_name": "Department of Architecture, Sungkyunkwan University, Republic of Korea", "normalized_name": "Sungkyunkwan University", "country": "South Korea", "identifiers": {"ror": "https://ror.org/04q78tk20", "GRID": "grid.264381.a"}}]}, {"given": "Hee Sung", "family": "Cha", "affiliation": [{"original_name": "Department of Architectural Engineering, Ajou University, Yeongtong-gu, Suwon-si, Gyeonggi-do, Republic of Korea", "normalized_name": "Ajou University", "country": "South Korea", "identifiers": {"ror": "https://ror.org/03tzb2h73", "GRID": "grid.251916.8"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2020", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "12", "issue": "4", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}