{"url": "http://www.jstor.org/stable/30204901", "identifier": {"string_id": "10.2307/30204901", "id_scheme": "DOI"}, "abstract": "Measuring dialect distances can be based on the comparison of words, and the comparison words should be based on the comparison of sounds. In this research we used an adjusted version of an articulation-based system, developed by Almeida and Braun (1986) for finding sound distances, using the IPA system. For comparison of two pronunciations of a word corresponding with two different varieties, we used the Levenshtein algorithm, which finds the easiest way in which one word can be changed into the other by inserting, deleting or substituting sounds. As operations weights of these three operations we used distances as found with the Almeida & Braun system. The dialect distance is now equal to the average of a range of word distances. We applied the technique to 360 Dutch dialects. The transcriptions of 125 words for each dialect are taken from the Reeks Nederlandse Dialectatlassen (Blancquaert and Peé, 1925-1982). We get a division with clear similarities to traditional dialect maps when classifying dialects. Using logarithmic sound distances improves results compared to results based on constant sound distances.", "article_title": "The Use of the Almeida-Braun System in the Measurement of Dutch Dialect Distances", "authors": [{"given": "Wilbert", "family": "Heeringa", "affiliation": [{"original_name": "Faculty of Arts, Humanities Computing, University of Groningen, the Netherlands", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}, {"given": "Angelika", "family": "Braun", "affiliation": [{"original_name": "Institute of Germanic Linguistics, Phonetics, Philips-University of Marburg", "normalized_name": "Philipp University of Marburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/01rdrb571", "GRID": "grid.10253.35"}}]}], "publisher": "Springer", "date": "2003-01-01", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "37", "issue": "3", "ISSN": [{"value": "00104817", "type": "print"}]}