{"url": "http://dx.doi.org/10.2218/ijdc.v9i1.301", "identifier": {"string_id": "10.2218/ijdc.v9i1.301", "id_scheme": "DOI"}, "abstract": " We present a case study of data integration and reuse involving 12 researchers who published datasets in Open Context, an online data publishing platform, as part of collaborative archaeological research on early domesticated animals in Anatolia. Our discussion reports on how different editorial and collaborative review processes improved data documentation and quality, and created ontology annotations needed for comparative analyses by domain specialists. To prepare data for shared analysis, this project adapted editor-supervised review and revision processes familiar to conventional publishing, as well as more novel models of revision adapted from open source software development of public version control. Preparing the datasets for publication and analysis required significant investment of effort and expertise, including archaeological domain knowledge and familiarity with key ontologies. To organize this work effectively, we emphasized these different models of collaboration at various stages of this data publication and analysis project. Collaboration first centered on data editors working with data contributors, then widened to include other researchers who provided additional peer-review feedback, and finally the widest research community, whose collaboration is facilitated by GitHub’s version control system. We demonstrate that the “publish” and “push” models of data dissemination need not be mutually exclusive; on the contrary, they can play complementary roles in sharing high quality data in support of research. This work highlights the value of combining multiple models in different stages of data dissemination. ", "article_title": "Publishing and Pushing: Mixing Models for Communicating Research Data in Archaeology", "authors": [{"given": "Eric C.", "family": "Kansa", "affiliation": [{"original_name": "Open Context", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}, {"original_name": "University ofCalifornia, Berkeley", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Sarah Whitcher", "family": "Kansa", "affiliation": [{"original_name": "Open Context", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Benjamin", "family": "Arbuckle", "affiliation": [{"original_name": "The University of North Carolina,Chapel Hill", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Edinburgh University", "date": "2014-05-30", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "9", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}