{"url": "http://dx.doi.org/10.2218/ijdc.v8i1.251", "identifier": {"string_id": "10.2218/ijdc.v8i1.251", "id_scheme": "DOI"}, "abstract": "ISO 16363:2012, Space Data and Information Transfer Systems - Audit and Certification of Trustworthy Digital Repositories (ISO TRAC), outlines actions a repository can take to be considered trustworthy, but research examining whether the repository’s designated community of users associates such actions with trustworthiness has been limited. Drawing from this ISO document and the management and information systems literatures, this paper discusses findings from interviews with 66 archaeologists and quantitative social scientists. We found similarities and differences across the disciplines and among the social scientists. Both disciplinary communities associated trust with a repository’s transparency. However, archaeologists mentioned guarantees of preservation and sustainability more frequently than the social scientists, who talked about institutional reputation. Repository processes were also linked to trust, with archaeologists more frequently citing metadata issues and social scientists discussing data selection and cleaning processes. Among the social scientists, novices mentioned the influence of colleagues on their trust in repositories almost twice as much as the experts. We discuss the implications our findings have for identifying trustworthy repositories and how they extend the models presented in the management and information systems literatures.", "article_title": "Trust in Digital Repositories", "authors": [{"given": "Elizabeth", "family": "Yakel", "affiliation": [{"original_name": "University of Michigan", "normalized_name": "University of Michigan–Ann Arbor", "country": "United States", "identifiers": {"ror": "https://ror.org/00jmfr291", "GRID": "grid.214458.e"}}]}, {"given": "Ixchel M.", "family": "Faniel", "affiliation": [{"original_name": "OCLC Research", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Adam", "family": "Kriesberg", "affiliation": [{"original_name": "University of Michigan", "normalized_name": "University of Michigan–Ann Arbor", "country": "United States", "identifiers": {"ror": "https://ror.org/00jmfr291", "GRID": "grid.214458.e"}}]}, {"given": "Ayoung", "family": "Yoon", "affiliation": [{"original_name": "University of North Carolina", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Edinburgh University", "date": "2013", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "8", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}