{"url": "http://dx.doi.org/10.2218/ijdc.v9i2.294", "identifier": {"string_id": "10.2218/ijdc.v9i2.294", "id_scheme": "DOI"}, "abstract": " Video games are a cultural phenomenon; a medium like no other that has become one of the largest entertainment sectors in the world. While the UK boasts an enviable games development heritage, it risks losing a major part of its cultural output through an inability to preserve the games that are created by the country’s independent games developers. The issues go deeper than bit rot and other problems that affect all digital media; loss of context, copyright and legal issues, and the throwaway culture of the ‘next’ game all hinder the ability of fans and academics to preserve video games and make them accessible in the future.  This study looked at the current attitudes towards preservation in the UK’s independent (‘indie’) video games industry by examining current record-keeping practices and analysing the views of games developers. The results show that there is an interest in preserving games, and possibly a desire to do so, but issues of piracy and cost prevent the industry from undertaking preservation work internally, and from allowing others to assume such responsibility. The recommendation made by this paper is not simply for preservation professionals and enthusiasts to collaborate with the industry, but to do so by advocating the commercial benefits that preservation may offer to the industry. ", "article_title": "Video Game Preservation in the UK: A Survey of Records Management Practices", "authors": [{"given": "Alasdair", "family": "Bachell", "affiliation": [{"original_name": "Perth and Kinross Council Archives", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Matthew", "family": "Barr", "affiliation": [{"original_name": "HATII, University of Glasgow", "normalized_name": "University of Glasgow", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vtgdb53", "GRID": "grid.8756.c"}}]}], "publisher": "Edinburgh University", "date": "2014-10-29", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "9", "issue": "2", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}