{"url": "http://www.jstor.org/stable/30204685", "identifier": {"string_id": "10.2307/30204685", "id_scheme": "DOI"}, "abstract": "We present statistical models for morphological disambiguation in agglutinative languages, with a specific application to Turkish. Turkish presents an interesting problem for statistical models as the potential tag set size is very large because of the productive derivational morphology. We propose to handle this by breaking up the morhosyntactic tags into inflectional groups, each of which contains the inflectional features for each (intermediate) derived form. Our statistical models score the probability of each morhosyntactic tag by considering statistics over the individual inflectional groups and surface roots in trigram models. Among the four models that we have developed and tested, the simplest model ignoring the local morphotactics within words performs the best. Our best trigram model performs with 93.95% accuracy on our test data getting all the morhosyntactic and semantic features correct. If we are just interested in syntactically relevant features and ignore a very small set of semantic features, then the accuracy increases to 95.07%.", "article_title": "Statistical Morphological Disambiguation for Agglutinative Languages", "authors": [{"given": "Dilek Z.", "family": "Hakkani-Tür", "affiliation": [{"original_name": "AT&T Labs-Research, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Kemal", "family": "Oflazer", "affiliation": [{"original_name": "Faculty of Engineering and Natural Sciences, Sabanci University", "normalized_name": "Sabancı University", "country": "Turkey", "identifiers": {"ror": "https://ror.org/049asqa32", "GRID": "grid.5334.1"}}]}, {"given": "Gökhan", "family": "Tür", "affiliation": [{"original_name": "AT&T Labs-Research, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Springer", "date": "2002", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "36", "issue": "4", "ISSN": [{"value": "00104817", "type": "print"}]}