{"url": "http://dx.doi.org/10.2218/ijdc.v6i1.168", "identifier": {"string_id": "10.2218/ijdc.v6i1.168", "id_scheme": "DOI"}, "abstract": "For millions of legacy documents, correct rendering depends upon resources such as fonts that are not generally embedded within the document structure. Yet there is a significant risk of information loss due to missing or incorrectly substituted fonts. Large document collections depend on thousands of unique fonts not available on a common desktop workstation, which typically has between 100 and 200 fonts. Silent substitution of fonts, performed by applications such as Microsoft Office, can yield poorly rendered documents. In this paper we use a collection of 230,000 Word documents to assess the difficulty of matching font requirements with a database of fonts. We describe the identifying information contained in common font formats, font requirements stored in Word documents, the API provided by Windows to support font requests by applications, the documented substitution algorithms used by Windows when requested fonts are not available, and the ways in which support software might be used to control font substitution in a preservation environment.", "article_title": "Born Broken: Fonts and Information Loss in Legacy Digital Documents", "authors": [{"given": "Geoffrey", "family": "Brown", "affiliation": [{"original_name": "Indiana University Bloomington", "normalized_name": "Indiana University Bloomington", "country": "United States", "identifiers": {"ror": "https://ror.org/02k40bc56", "GRID": "grid.411377.7"}}]}, {"given": "Kam", "family": "Woods", "affiliation": [{"original_name": "Indiana University Bloomington", "normalized_name": "Indiana University Bloomington", "country": "United States", "identifiers": {"ror": "https://ror.org/02k40bc56", "GRID": "grid.411377.7"}}]}], "publisher": "Edinburgh University", "date": "2011", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "6", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}