{"url": "http://dx.doi.org/10.2218/ijdc.v10i1.289", "identifier": {"string_id": "10.2218/ijdc.v10i1.289", "id_scheme": "DOI"}, "abstract": "In order to better understand the factors that most influence where researchers deposit their data when they have a choice, we collected survey data from researchers who deposited phylogenetic data in either the TreeBASE or Dryad data repositories. Respondents were asked to rank the relative importance of eight possible factors. We found that factors differed in importance for both TreeBASE and Dryad, and that the rankings differed subtly but significantly between TreeBASE and Dryad users. On average, TreeBASE users ranked the domain specialization of the repository highest, while Dryad users ranked as equal highest their trust in the persistence of the repository and the ease of its data submission process. Interestingly, respondents (particularly Dryad users) were strongly divided as to whether being directed to choose a particular repository by a journal policy or funding agency was among the most or least important factors. Some users reported depositing their data in multiple repositories and archiving their data voluntarily.", "article_title": "What Factors Influence Where Researchers Deposit their Data? A Survey of Researchers Submitting to Data Repositories", "authors": [{"given": "Shea", "family": "Swauger", "affiliation": [{"original_name": "Colorado State University", "normalized_name": "Colorado State University", "country": "United States", "identifiers": {"ror": "https://ror.org/03k1gpj17", "GRID": "grid.47894.36"}}]}, {"given": "Todd J.", "family": "Vision", "affiliation": [{"original_name": "University of North Carolina at Chapel Hill", "normalized_name": "University of North Carolina at Chapel Hill", "country": "United States", "identifiers": {"ror": "https://ror.org/0130frc33", "GRID": "grid.10698.36"}}]}], "publisher": "Edinburgh University", "date": "2015", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "10", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}