{"url": "http://www.jstor.org/stable/30204906", "identifier": {"string_id": "10.2307/30204906", "id_scheme": "DOI"}, "abstract": "The aim of this study is to show how cluster analysis can shed light on very complex variation in a transitional dialect zone in eastern Finland. In the course of history this area has been on the border between Sweden and Russia and the population has clearly been of two kinds: the Savo people and the Karelians. It is a well-known fact that there is variation among these dialects, but the spread and extent of the variation has not been demonstrated previously. The idiolects of the area were studied in the light of ten phonological and morphological features. The material consisted of recordings of 198 idiolects, totalling around 195 hours and representing 19 parishes. The variation was analysed using hierarchical cluster analysis. While the analysis showed the extent of the variation between idiolects and parishes, it also demonstrated how the effects of the old parishes, borders and settlements are still visible in the dialects. On the parish level, the data formed clear clusters that correspond with the main dialects in the area and its surroundings. On the idiolect level, however, the speakers from the surrounding areas formed fairly homogenous clusters but the idiolects from the Savonlinna area were spread across almost all clusters.", "article_title": "Neighbours or Enemies? Competing Variants Causing Differences in Transitional Dialects", "authors": [{"given": "Marjatta", "family": "Palander", "affiliation": [{"original_name": "Department of Finnish Language and Cultural Research, University of Joensuu", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Lisa Lena", "family": "Opas-Hänninen", "affiliation": [{"original_name": "University of Oulu, Finland", "normalized_name": "University of Oulu", "country": "Finland", "identifiers": {"ror": "https://ror.org/03yj89h83", "GRID": "grid.10858.34"}}]}, {"given": "Fiona", "family": "Tweedie", "affiliation": [{"original_name": "University of Edinburgh, UK", "normalized_name": "University of Edinburgh", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01nrxwf90", "GRID": "grid.4305.2"}}]}], "publisher": "Springer", "date": "2003", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "37", "issue": "3", "ISSN": [{"value": "00104817", "type": "print"}]}