{"url": "http://www.jstor.org/stable/30204931", "identifier": {"string_id": "10.2307/30204931", "id_scheme": "DOI"}, "abstract": "The purpose of our research is to consider how the paradigms of EuroWordNet and SIMPLE linguistic projects on the one hand and the OIL methodology on the other hand may affect each other. OIL (Ontology Inference Layer) aims at implementing the \"semantic\" Web idea and is based on the notion of ontology, which is also employed in EuroWordNet and SIMPLE. In both latter projects the meanings of words are partially described by means of the finite sets of relations to other meanings of words, whereas in OIL the user is free to define the arbitrary relations of this kind. The relations considered in EuroWordNet and SIMPLE were defined on the basis of a careful observation of the large linguistic area, and they aim at reflecting the meaning as precisely as possible, therefore it seems useful to merge them with OIL. Moreover, the valuable feature of OIL is its formal language with precisely defined semantics. All things considered, we suggest how certain EuroWordNet and SIMPLE definitions may be expressed in OIL.", "article_title": "Semantic Roles as Slots in OIL Ontologies", "authors": [{"given": "Jolanta", "family": "Cybulka", "affiliation": [{"original_name": "Instytut Automatyki i Inzynierii Informatycznej, Politechnika Poznafiska, pl. M. Sklodowskiej-Curie, 5, 60-965 Poznari, Poland", "normalized_name": "Poznań University of Technology", "country": "Poland", "identifiers": {"ror": "https://ror.org/00p7p3302", "GRID": "grid.6963.a"}}]}, {"given": "Jacek", "family": "Martinek", "affiliation": [{"original_name": "Instytut Automatyki i Inzynierii Informatycznej, Politechnika Poznafiska, pl. M. Sklodowskiej-Curie, 5, 60-965 Poznari, Poland", "normalized_name": "Poznań University of Technology", "country": "Poland", "identifiers": {"ror": "https://ror.org/00p7p3302", "GRID": "grid.6963.a"}}]}], "publisher": "Springer", "date": "2004", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "38", "issue": "2", "ISSN": [{"value": "00104817", "type": "print"}]}