{"url": "http://dx.doi.org/10.2218/ijdc.v6i1.181", "identifier": {"string_id": "10.2218/ijdc.v6i1.181", "id_scheme": "DOI"}, "abstract": "Many digital preservation scenarios are based on the migration strategy, which itself is heavily tool-dependent. For popular, well-defined and often open file formats – e.g., digital images, such as PNG, GIF, JPEG – a wide range of tools exist. Migration workflows become more difficult with proprietary formats, as used by the several text processing applications becoming available in the last two decades. If a certain file format can not be rendered with actual software, emulation of the original environment remains a valid option. For instance, with the original Lotus AmiPro or Word Perfect, it is not a problem to save an object of this type in ASCII text or Rich Text Format. In specific environments, it is even possible to send the file to a virtual printer, thereby producing a PDF as a migration output. Such manual migration tasks typically involve human interaction, which may be feasible for a small number of objects, but not for larger batches of files.We propose a novel approach using a software-operated VNC abstraction layer in order to replace humans with machine interaction. Emulators or virtualization tools equipped with a VNC interface are very well suited for this approach. But screen, keyboard and mouse interaction is just part of the setup. Furthermore, digital objects need to be transferred into the original environment in order to be extracted after processing. Nevertheless, the complexity of the new generation of migration services is quickly rising; a preservation workflow is now comprised not only of the migration tool itself, but of a complete software and virtual hardware stack with recorded workflows linked to every supported migration scenario. Thus the requirements of OAIS management must include proper software archiving, emulator selection, system image and recording handling. The concept of view-paths could help either to automatically determine the proper pre-configured virtual environment or to set up system images for certain migration workflows. View-paths may rise in demand, as the generation of PDF output files from Word Perfect input could be cached as pre-fabricated emulator system images. The current groundwork provides several possible optimizations, such as using the automation features of the original environments.", "article_title": "Automation of Flexible Migration Workflows", "authors": [{"given": "Dirk", "family": "Von Suchodoletz", "affiliation": [{"original_name": "University of Freiburg", "normalized_name": "University of Freiburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/0245cg223", "GRID": "grid.5963.9"}}]}, {"given": "Klaus", "family": "Rechert", "affiliation": [{"original_name": "University of Freiburg", "normalized_name": "University of Freiburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/0245cg223", "GRID": "grid.5963.9"}}]}, {"given": "Randolph", "family": "Welte", "affiliation": [{"original_name": "University of Freiburg", "normalized_name": "University of Freiburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/0245cg223", "GRID": "grid.5963.9"}}]}, {"given": "Maurice", "family": "Van den Dobbelsteen", "affiliation": [{"original_name": "National Archives of the Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Bill", "family": "Roberts", "affiliation": [{"original_name": "National Archives of the Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Jeffrey", "family": "Van der Hoeven", "affiliation": [{"original_name": "Koninklijke Bibliotheek", "normalized_name": "National Library of the Netherlands", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/02w4jbg70", "GRID": "grid.425631.7"}}]}, {"given": "Jasper", "family": "Schroder", "affiliation": [{"original_name": "IBM Netherlands B.V.", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Edinburgh University", "date": "2011", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "6", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}