{"url": "http://dx.doi.org/10.2218/ijdc.v6i1.180", "identifier": {"string_id": "10.2218/ijdc.v6i1.180", "id_scheme": "DOI"}, "abstract": "The Web is increasingly becoming a platform for linked data. This means making connections and adding value to data on the Web. As more data becomes openly available and more people are able to use the data, it becomes more powerful. An example is file format registries and the evaluation of format risks. Here the requirement for information is now greater than the effort that any single institution can put into gathering and collating this information. Recognising that more is better, the creators of PRONOM, JHOVE, GDFR and others are joining to lead a new initiative: the Unified Digital Format Registry. Ahead of this effort, a new RDF-based framework for structuring and facilitating file format data from multiple sources, including PRONOM, has demonstrated it is able to produce more links, and thus provide more answers to digital preservation questions - about format risks, applications, viewers and transformations - than the native data alone. This paper will describe this registry, P2, and its services, show how it can be used, and provide examples where it delivers more answers than the contributing resources. The P2 Registry is a reference platform to allow and encourage publication of preservation data, and also an examplar of what can be achieved if more data is published openly online as simple machine-readable documents. This approach calls for the active participation of the digital preservation community to contribute data by simply publishing it openly on the Web as linked data.", "article_title": "Where the Semantic Web and Web 2.0 Meet Format Risk Management: P2 Registry", "authors": [{"given": "David", "family": "Tarrant", "affiliation": [{"original_name": "University of Southampton", "normalized_name": "University of Southampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ryk1543", "GRID": "grid.5491.9"}}]}, {"given": "Steve", "family": "Hitchcock", "affiliation": [{"original_name": "University of Southampton", "normalized_name": "University of Southampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ryk1543", "GRID": "grid.5491.9"}}]}, {"given": "Leslie", "family": "Carr", "affiliation": [{"original_name": "University of Southampton", "normalized_name": "University of Southampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ryk1543", "GRID": "grid.5491.9"}}]}], "publisher": "Edinburgh University", "date": "2011-03-08", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "6", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}