{"url": "http://www.jstor.org/stable/30204869", "identifier": {"string_id": "10.2307/30204869", "id_scheme": "DOI"}, "abstract": "Cross-language information retrieval (CLIR), where queries and documents are in different languages, has of late become one of the major topics within the information retrieval community. This paper proposes a Japanese/English CLIR system, where we combine a query translation and retrieval modules. We currently target the retrieval of technical documents, and therefore the performance of our system is highly dependent on the quality of the translation of technical terms. However, the technical term translation is still problematic in that technical terms are often compound words, and thus new terms are progressively created by combining existing base words. In addition, Japanese often represents loanwords based on its special phonogram. Consequently, existing dictionaries find it difficult to achieve sufficient coverage. To counter the first problem, we produce a Japanese/English dictionary for base words, and translate compound words on a word-by-word basis. We also use a probabilistic method to resolve translation ambiguity. For the second problem, we use a transliteration method, which corresponds words unlisted in the base word dictionary to their phonetic equivalents in the target language. We evaluate our system using a test collection for CLIR, and show that both the compound word translation and transliteration methods improve the system performance.", "article_title": "Japanese/English Cross-Language Information Retrieval: Exploration of Query Translation and Transliteration", "authors": [{"given": "Atsushi", "family": "Fujii", "affiliation": [{"original_name": "University of Library and Information Science, Japan", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Tetsuya", "family": "Ishikawa", "affiliation": [{"original_name": "University of Library and Information Science, Japan", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Springer", "date": "2001", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "35", "issue": "4", "ISSN": [{"value": "00104817", "type": "print"}]}