{"url": "http://dx.doi.org/10.2218/ijdc.v10i2.346", "identifier": {"string_id": "10.2218/ijdc.v10i2.346", "id_scheme": "DOI"}, "abstract": " Digital data are accumulating rapidly, yet issues relating to data production remain unexamined. Data sharing efforts in particular are nascent, disunited and incomplete. We investigate the development of data products tailored for diverse communities with differing knowledge bases. We explore not the technical aspects of how, why, or where data are made available, but rather the socio-scientific aspects influencing what data products are created and made available for use. These products differ from compact data summaries often published in journals. We report on development by a national data center of two data collections describing the changing polar environment. One collection characterizes sea ice products derived from satellite remote sensing data and development unfolds over three decades. The second collection characterizes the Greenland Ice Sheet melt where development of an initial collection of data products over a period of several months was informed by insights gained from earlier experience. In documenting the generation of these two collections, a data product development cycle supported by a data product team is identified as key to mobilizing scientific knowledge. The collections reveal a co-evolution of data products and designated communities where community interest may be triggered by events such as environmental disturbance and new modes of communication. These examples of data product development in practice illustrate knowledge mobilization in the earth sciences; the collections create a bridge between data producers and a growing number of audiences interested in making evidence-based decisions.    ", "article_title": "Scientific Knowledge Mobilization: Co-evolution of Data Products and Designated Communities", "authors": [{"given": "Karen S.", "family": "Baker", "affiliation": [{"original_name": "Center for Informatics Research in Science and Scholarship Graduate School of Library and Information Science University of Illinois at Urbana-Champaign, IL", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}, {"given": "Ruth E.", "family": "Duerr", "affiliation": [{"original_name": "National Snow and Ice Data Center University of Colorado at Boulder, CO", "normalized_name": "University of Colorado Boulder", "country": "United States", "identifiers": {"ror": "https://ror.org/02ttsq026", "GRID": "grid.266190.a"}}]}, {"given": "Mark A.", "family": "Parsons", "affiliation": [{"original_name": "Research Data Alliance Rensselaer Polytechnic Institute, NY", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Edinburgh University", "date": "2016-05-12", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "10", "issue": "2", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}