{"url": "http://dx.doi.org/10.2218/ijdc.v10i1.343", "identifier": {"string_id": "10.2218/ijdc.v10i1.343", "id_scheme": "DOI"}, "abstract": "User-defined metadata is useful for curating and helping to provide context for experiment records, but our previous investigations have demonstrated that simply providing the facility to add metadata is not enough to ensure that metadata is added, let alone to ensure that the metadata is of high quality. For metadata to be useful it first has to be present, but enforcing metadata generation is of no benefit if it is low quality, inconsistent, or irrelevant. Researchers need support. One strategy to encourage more effective metadata creation is to design user interfaces that invite users to add metadata by asking them questions. If we ask users specific questions about their experiments and other activities then we could capture more relevant or useful metadata, although there is a risk that asking the wrong questions may lead to loss of valuable metadata terms or the creation of irrelevant material. In this paper we report on a study to investigate how different questions could be used to generate metadata by eliciting information in three different conditions: free recall, changing perspective by thinking about search terms to help someone else, and providing cues by using a set of topic-based questions. We also investigate how responses varied with different information types. The results of the study show that different terms are created under the different conditions, as expected. The use of cues generates the highest numbers of terms and the most diverse range, including elements that are not captured in other conditions. However, important themes generated in other conditions are not produced because the cues to create them are missing. The study also generated a number of unexpected findings, including responses describing information that is not in the original material: personal opinions and experiences, and comments about the information text itself. These unexpected responses have both positive and negative consequences for the generation of metadata and the curation of scientific records. The results of studies using these techniques to capture metadata for chemistry experiments are also discussed. ", "article_title": "User-Defined Metadata: Using Cues and Changing Perspectives", "authors": [{"given": "Cerys", "family": "Willoughby", "affiliation": [{"original_name": "University of Southampton", "normalized_name": "University of Southampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ryk1543", "GRID": "grid.5491.9"}}]}, {"given": "Colin", "family": "Bird", "affiliation": [{"original_name": "University of Southampton", "normalized_name": "University of Southampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ryk1543", "GRID": "grid.5491.9"}}]}, {"given": "Jeremy", "family": "Frey", "affiliation": [{"original_name": "University of Southampton", "normalized_name": "University of Southampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ryk1543", "GRID": "grid.5491.9"}}]}], "publisher": "Edinburgh University", "date": "2015", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "10", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}