{"url": "http://dx.doi.org/10.2218/ijdc.v8i1.237", "identifier": {"string_id": "10.2218/ijdc.v8i1.237", "id_scheme": "DOI"}, "abstract": "The preservation of artistic works with technological components, such as musical works, is recognised as an issue by both the artistic community and the archival community. Preserving such works involves tackling the difficulties associated with digital information in general, but also raises its own specific problems, such as constantly evolving digital instruments embodied within software and idiosyncratic human-computer interactions. Because of these issues, standards in place for archiving digital information are not always suitable for the preservation of these works. The impact on the organisation and the descriptions of such archives need to be conceptualised in order to provide these technological components with readability, authenticity and intelligibility. While previous projects emphasized readability and authenticity, less effort has been dedicated to addressing intelligibility issues. The research into the specification of significant properties and its extension, namely significant knowledge, offers some grounds for reflecting on this question. Furthermore, the relevance of taking into account the creative process involved in the production of technological components offers an opportunity to redefine the status of technological agents in the performative aspect of digital records. Altogether, the research on significant knowledge and creative processes provide us with a conceptual framework that we propose to bring together with digital archives models to form a coherent framework. ", "article_title": "A Digital Archives Framework for the Preservation of Cultural Artifacts with Technological Components", "authors": [{"given": "Guillaume", "family": "Boutard", "affiliation": [{"original_name": "McGill University", "normalized_name": "McGill University", "country": "Canada", "identifiers": {"ror": "https://ror.org/01pxwe438", "GRID": "grid.14709.3b"}}]}, {"given": "Catherine", "family": "Guastavino", "affiliation": [{"original_name": "McGill University", "normalized_name": "McGill University", "country": "Canada", "identifiers": {"ror": "https://ror.org/01pxwe438", "GRID": "grid.14709.3b"}}]}, {"given": "James", "family": "Turner", "affiliation": [{"original_name": "Université de Montréal", "normalized_name": "University of Montreal", "country": "Canada", "identifiers": {"ror": "https://ror.org/0161xgx34", "GRID": "grid.14848.31"}}]}], "publisher": "Edinburgh University", "date": "2013-06-14", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "8", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}