{"url": "http://www.jstor.org/stable/30204830", "identifier": {"string_id": "10.2307/30204830", "id_scheme": "DOI"}, "abstract": "William Faulkner's non-chronological story telling style has long been a challenge to critics and a puzzle to beginning literature students. \"A Rose for Emily,\" one of Faulkner's most frequently anthologized stories, exemplifies the complexity of Faulkner's treatment of time. In this paper, we apply a constraint-based problem solving method to an analysis of the chronology of \"A Rose for Emily.\" Constraint logic programming is a declarative programming language paradigm that solves problems by enforcing constraints among variables. CLP's ability to sort numeric variables that do not yet have definite values makes it possible to sort the events of \"A Rose for Emily\" with only fragmented and relative time information. In attempting to sort the events of the story, we find an inconsistency in the temporal references scattered throughout the narrative. After removing this inconsistency, we are able to compare our chronology with earlier ones and discuss the thematic relevance of Faulkner's nonlinear plots.", "article_title": "Using Constraint Logic Programming to Analyze the Chronology in \"A Rose for Emily\"", "authors": [{"given": "Jennifer", "family": "Burg", "affiliation": [{"original_name": "Department of Computer Science, Wake Forest University", "normalized_name": "Wake Forest University", "country": "United States", "identifiers": {"ror": "https://ror.org/0207ad724", "GRID": "grid.241167.7"}}]}, {"given": "Anne", "family": "Boyle", "affiliation": [{"original_name": "Department of English, Wake Forest University", "normalized_name": "Wake Forest University", "country": "United States", "identifiers": {"ror": "https://ror.org/0207ad724", "GRID": "grid.241167.7"}}]}, {"given": "Sheau-Dong", "family": "Lang", "affiliation": [{"original_name": "School of Computer Science, University of Central Florida", "normalized_name": "University of Central Florida", "country": "United States", "identifiers": {"ror": "https://ror.org/036nfer12", "GRID": "grid.170430.1"}}]}], "publisher": "Springer", "date": "2000", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "34", "issue": "4", "ISSN": [{"value": "00104817", "type": "print"}]}