{"url": "http://dx.doi.org/10.2218/ijdc.v6i1.174", "identifier": {"string_id": "10.2218/ijdc.v6i1.174", "id_scheme": "DOI"}, "abstract": "Rescuing data from inaccessible or damaged storage media for the purpose of preserving the digital data for the long term is one of the dimensions of digital archaeology. With the current pace of technological development, any system can become obsolete in a matter of years and hence the data stored in a specific storage media might not be accessible anymore due to the unavailability of the system to access the media. In order to preserve digital records residing in such storage media, it is necessary to extract the data stored in those media by some means.One early storage medium for home computers in the 1980s was audio tape. The first home computer systems allowed the use of standard cassette players to record and replay data. Audio cassettes are more durable than old home computers when properly stored. Devices playing this medium (i.e. tape recorders) can be found in working condition or can be repaired, as they are usually made out of standard components. By re-engineering the format of the waveform and the file formats, the data on such media can then be extracted from a digitised audio stream and migrated to a non-obsolete format.In this paper we present a case study on extracting the data stored on an audio tape by an early home computer system, namely the Philips Videopac+ G7400. The original data formats were re-engineered and an application was written to support the migration of the data stored on tapes without using the original system. This eliminates the necessity of keeping an obsolete system alive for enabling access to the data on the storage media meant for this system. Two different methods to interpret the data and eliminate possible errors in the tape were implemented and evaluated on original tapes, which were recorded 20 years ago. Results show that with some error correction methods, parts of the tapes are still readable even without the original system. It also implies that it is easier to build solutions while original systems are still available in a working condition.", "article_title": "Migrating Home Computer Audio Waveforms to Digital Objects: A Case Study on Digital Archaeology", "authors": [{"given": "Mark", "family": "Guttenbrunner", "affiliation": [{"original_name": "Vienna University of Technology,Vienna, Austria", "normalized_name": "TU Wien", "country": "Austria", "identifiers": {"ror": "https://ror.org/04d836q62", "GRID": "grid.5329.d"}}]}, {"given": "Mihai", "family": "Ghete", "affiliation": [{"original_name": "Vienna University of Technology,Vienna, Austria", "normalized_name": "TU Wien", "country": "Austria", "identifiers": {"ror": "https://ror.org/04d836q62", "GRID": "grid.5329.d"}}]}, {"given": "Annu", "family": "John", "affiliation": [{"original_name": "Vienna University of Technology,Vienna, Austria", "normalized_name": "TU Wien", "country": "Austria", "identifiers": {"ror": "https://ror.org/04d836q62", "GRID": "grid.5329.d"}}]}, {"given": "Chrisanth", "family": "Lederer", "affiliation": [{"original_name": "Vienna University of Technology,Vienna, Austria", "normalized_name": "TU Wien", "country": "Austria", "identifiers": {"ror": "https://ror.org/04d836q62", "GRID": "grid.5329.d"}}]}, {"given": "Andreas", "family": "Rauber", "affiliation": [{"original_name": "Vienna University of Technology,Vienna, Austria", "normalized_name": "TU Wien", "country": "Austria", "identifiers": {"ror": "https://ror.org/04d836q62", "GRID": "grid.5329.d"}}]}], "publisher": "Edinburgh University", "date": "2011", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "6", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}