{"url": "http://dx.doi.org/10.2218/ijdc.v3i2.59", "identifier": {"string_id": "10.2218/ijdc.v3i2.59", "id_scheme": "DOI"}, "abstract": "We present performance data relating to the use of migration in a system we are creating to provide web access to heterogeneous document collections in legacy formats. Our goal is to enable sustained access to collections such as these when faced with increasing obsolescence of the necessary supporting applications and operating systems. Our system allows searching and browsing of the original files within their original contexts utilizing binary images of the original media. The system uses static and dynamic file migration to enhance collection browsing, and emulation to support both the use of legacy programs to access data and long-term preservation of the migration software. While we provide an overview of the architectural issues in building such a system, the focus of this paper is an in-depth analysis of file migration using data gathered from testing our software on 1,885 CD-ROMs and DVDs. These media are among the thousands of collections of social and scientific data distributed by the United States Government Printing Office (GPO) on legacy media (CD-ROM, DVD, floppy disk) under the Federal Depository Library Program (FDLP) over the past 20 years.", "article_title": "Migration Performance for Legacy Data Access", "authors": [{"given": "Kam", "family": "Woods", "affiliation": [{"original_name": "Indiana University", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}, {"given": "Geoffrey", "family": "Brown", "affiliation": [{"original_name": "Indiana University", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}], "publisher": "Edinburgh University", "date": "2008", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "3", "issue": "2", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}