{"url": "http://dx.doi.org/10.2218/ijdc.v14i1.556", "identifier": {"string_id": "10.2218/ijdc.v14i1.556", "id_scheme": "DOI"}, "abstract": "This article presents the findings of the Ibadan/Liverpool Digital Curation Curriculum Review Project, a research project conducted to formally benchmark the teaching of digital curation in the archival education programmes at the University of Liverpool, United Kingdom and the University of Ibadan, Nigeria. It provides background to the history and establishment of both universities and the development of their archives curricula. A matrix was developed using the DigCurV Curriculum Framework to assess whether digital curation skills and knowledge outlined in the framework are being taught, practised and tested in the Master’s programmes. These skills and knowledge were assessed according to the four domains outlined in DigCurV: Knowledge and Intellectual Abilities (KIA), Personal Qualities (PQ), Professional Conduct (PC), and Management and Quality Assurance (MQA), to levels appropriate to practitioners and managers. The exercise identified skill and knowledge areas where teaching materials could be shared between the universities, and areas where new materials are needed. ", "article_title": "Digital Curation Education at the Universities of Ibadan and Liverpool", "authors": [{"given": "Abiola", "family": "Abioye", "affiliation": [{"original_name": "University of Ibadan", "normalized_name": "University of Ibadan", "country": "Nigeria", "identifiers": {"ror": "https://ror.org/03wx2rr30", "GRID": "grid.9582.6"}}]}, {"given": "James", "family": "Lowry", "affiliation": [{"original_name": "University of Liverpool", "normalized_name": "University of Liverpool", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04xs57h96", "GRID": "grid.10025.36"}}]}, {"given": "Rosemary", "family": "Lynch", "affiliation": [{"original_name": "University of Liverpool", "normalized_name": "University of Liverpool", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04xs57h96", "GRID": "grid.10025.36"}}]}], "publisher": "Edinburgh University", "date": "2019", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "14", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}