{"url": "http://dx.doi.org/10.2218/ijdc.v11i1.425", "identifier": {"string_id": "10.2218/ijdc.v11i1.425", "id_scheme": "DOI"}, "abstract": "The ability to measure the use and impact of published data sets is key to the success of the open data/open science paradigm. A direct measure of impact would require tracking data (re)use in the wild, which is difficult to achieve. This is therefore commonly replaced by simpler metrics based on data download and citation counts. In this paper we describe a scenario where it is possible to track the trajectory of a dataset after its publication, and show how this enables the design of accurate models for ascribing credit to data originators. A Data Trajectory (DT) is a graph that encodes knowledge of how, by whom, and in which context data has been re-used, possibly after several generations. We provide a theoretical model of DTs that is grounded in the W3C PROV data model for provenance, and we show how DTs can be used to automatically propagate a fraction of the credit associated with transitively derived datasets, back to original data contributors. We also show this model of transitive credit in action by means of a Data Reuse Simulator. In the longer term, our ultimate hope is that credit models based on direct measures of data reuse will provide further incentives to data publication. We conclude by outlining a research agenda to address the hard questions of creating, collecting, and using DTs systematically across a large number of data reuse instances in the wild. ", "article_title": "Data trajectories: tracking reuse of published data for transitive credit attribution", "authors": [{"given": "Paolo", "family": "Missier", "affiliation": [{"original_name": "NewcastleUniversity,UK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Edinburgh University", "date": "2016", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "11", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}