{"url": "http://dx.doi.org/10.2218/ijdc.v4i1.72", "identifier": {"string_id": "10.2218/ijdc.v4i1.72", "id_scheme": "DOI"}, "abstract": " The Digital Preservation Program of the California Digital Library (CDL) is engaged in a process of reinvention involving significant transformations of its outlook, effort, and infrastructure. This includes a re-articulation of its mission in terms of digital curation, rather than preservation; encouraging a programmatic, rather than a project-oriented approach to curation activities; and a renewed emphasis on services, rather than systems. This last shift was motivated by a desire to deprecate the centrality of the repository as place. Having the repository as the locus for curation activity has resulted in the deployment of a somewhat cumbersome monolithic system that falls short of desired goals for responsiveness to rapidly changing user needs and operational and administrative sustainability. The Program is pursuing a path towards a new curation environment based on the principle of devolving curation function to a set of small, simple, loosely coupled services. In considering this new infrastructure, the Program is relying upon a highly deliberative process starting from first principles drawn from library and archival science. This is followed by a stagewise progression of identifying core preservable values, devising strategies promoting those values, defining abstract services embodying those strategies, and, finally, developing systems that instantiate those services. This paper presents a snapshot of the Program's transformative efforts in its early phase.", "article_title": "Preservation Is Not a Place", "authors": [{"given": "Stephen", "family": "Abrams", "affiliation": [{"original_name": "California Digital Library, University of California", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}, {"given": "Patricia", "family": "Cruse", "affiliation": [{"original_name": "California Digital Library, University of California", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}, {"given": "John", "family": "Kunze", "affiliation": [{"original_name": "California Digital Library, University of California", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}], "publisher": "Edinburgh University", "date": "2009", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "4", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}