{"url": "http://www.jstor.org/stable/30204823", "identifier": {"string_id": "10.2307/30204823", "id_scheme": "DOI"}, "abstract": "This article presents an overview of developments in computer-aided history teaching in higher education in the UK and the US, which have focused primarily on providing students with access to primary sources in order to enhance their understanding of historical methods and content. From an initial emphasis on research training for postgraduates, which taught quantitative methods, or the use of drill-style question-and-answer programs, advances in hardware capacity and software provision have led to more varied methods of analysis. Computer-assisted learning lends itself particularly to the growing emphasis on students' use of primary sources, as more texts become available in electronic format on CD-ROM or the World Wide Web. Hypermedia can provide a unique learning environment in which students are exposed to different genres of sources such as images, texts and numerical data, encouraging them to discover interconnections and complexities, while learning at their own pace. Students can be expected to develop critical skills by comparing primary sources and forming their own historical interpretations. The various problems and methods of locating and assessing relevant information in cyberspace also foster critical thinking and a spirit of investigation. A computer-assisted course taught in Glasgow showed that students value the ease of access to relevant source materials offered by customised resource packs, which left them with more time to evaluate their contents critically.", "article_title": "Computers and Resource-Based History Teaching: A UK Perspective", "authors": [{"given": "Donald A.", "family": "Spaeth", "affiliation": [{"original_name": "School of History and Archaeology, University of Glasgow, UK", "normalized_name": "University of Glasgow", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vtgdb53", "GRID": "grid.8756.c"}}]}, {"given": "Sonja", "family": "Cameron", "affiliation": [{"original_name": "CTICH, University of Glasgow, UK", "normalized_name": "University of Glasgow", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vtgdb53", "GRID": "grid.8756.c"}}]}], "publisher": "Springer", "date": "2000-01-01", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "34", "issue": "3", "ISSN": [{"value": "00104817", "type": "print"}]}