{"url": "http://dx.doi.org/10.2218/ijdc.v7i1.216", "identifier": {"string_id": "10.2218/ijdc.v7i1.216", "id_scheme": "DOI"}, "abstract": "Genomic and environmental sciences represent two poles of scientific data. In the first, highly parallel sequencing facilities generate large quantities of sequence data. In the latter, loosely networked remote and field sensors produce intermittent streams of different data types. Yet both genomic and environmental sciences are said to be moving to data intensive research. This paper explores and contrasts data flow in these two domains in order to better understand how data intensive research is being done. Our case studies are next generation sequencing for genomics and environmental networked sensors.Our objective was to enrich understanding of the ‘intensive’ processes and properties of data intensive research through a ‘sociology’ of data using methods that capture the relational properties of data flows. Our key methodological innovation was the staging of events for practitioners with different kinds of expertise in data intensive research to participate in the collective annotation of visual forms. Through such events we built a substantial digital data archive of our own that we then analysed in terms of three traits of data flow: durability, replicability and metrology.Our findings are that analysing data flow with respect to these three traits provides better insight into how doing data intensive research involves people, infrastructures, practices, things, knowledge and institutions. Collectively, these elements shape the topography of data and condition how it flows. We argue that although much attention is given to phenomena such as the scale, volume and speed of data in data intensive research, these are measures of what we call ‘extensive’ properties rather than intensive ones. Our thesis is that extensive changes, that is to say those that result in non-linear changes in metrics, can be seen to result from intensive changes that bring multiple, disparate flows into confluence.If extensive shifts in the modalities of data flow do indeed come from the alignment of disparate things, as we suggest, then we advocate the staging of workshops and other events with the purpose of developing the ‘missing’ metrics of data flow.", "article_title": "Understanding the ‘Intensive’ in ‘Data Intensive Research’: Data Flows in Next Generation Sequencing and Environmental Networked Sensors", "authors": [{"given": "Ruth", "family": "McNally", "affiliation": [{"original_name": "ESRC Cesagen, Lancaster University", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}, {"given": "Adrian", "family": "Mackenzie", "affiliation": [{"original_name": "ESRC Cesagen, Lancaster University", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}, {"given": "Allison", "family": "Hui", "affiliation": [{"original_name": "Hong Kong Baptist University", "normalized_name": "Hong Kong Baptist University", "country": "China", "identifiers": {"ror": "https://ror.org/0145fw131", "GRID": "grid.221309.b"}}]}, {"given": "Jennifer", "family": "Tomomitsu", "affiliation": [{"original_name": "University of the Arts, London", "normalized_name": "University of the Arts", "country": "United States", "identifiers": {"ror": "https://ror.org/040w1dr55", "GRID": "grid.441309.b"}}]}], "publisher": "Edinburgh University", "date": "2012-03-09", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "7", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}