{"url": "http://dx.doi.org/10.2218/ijdc.v6i1.183", "identifier": {"string_id": "10.2218/ijdc.v6i1.183", "id_scheme": "DOI"}, "abstract": "Within information systems, a significant aspect of search and retrieval across information objects, such as datasets, journal articles, or images, relies on the identity construction of the objects. This paper uses identity to refer to the qualities or characteristics of an information object that make it definable and recognizable, and can be used to distinguish it from other objects. Identity, in this context, can be seen as the foundation from which citations, metadata and identifiers are constructed.In recent years the idea of including datasets within the scientific record has been gaining significant momentum, with publishers, granting agencies and libraries engaging with the challenge. However, the task has been fraught with questions of best practice for establishing this infrastructure, especially in regards to how citations, metadata and identifiers should be constructed. These questions suggests a problem with how dataset identities are formed, such that an engagement with the definition of datasets as conceptual objects is warranted.This paper explores some of the ways in which scientific data is an unruly and poorly bounded object, and goes on to propose that in order for datasets to fulfill the roles expected for them, the following identity functions are essential for scholarly publications: (i) the dataset is constructed as a semantically and logically concrete object, (ii) the identity of the dataset is embedded, inherent and/or inseparable, (iii) the identity embodies a framework of authorship, rights and limitations, and (iv) the identity translates into an actionable mechanism for retrieval or reference.", "article_title": "Linking to Scientific Data: Identity Problems of Unruly and Poorly Bounded Digital Objects", "authors": [{"given": "Laura", "family": "Wynholds", "affiliation": [{"original_name": "University of California, Los Angeles", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}], "publisher": "Edinburgh University", "date": "2011", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "6", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}