{"url": "http://dx.doi.org/10.2218/ijdc.v8i1.246", "identifier": {"string_id": "10.2218/ijdc.v8i1.246", "id_scheme": "DOI"}, "abstract": "The fast growth of scientific and non-scientific digital data, as well as the proliferation of new types of digital content, has led – among many other things – to a lot of innovative work on the concept of the identifier. Digital identifiers have become the key to preserving and accessing content, just as physical identifier tags have been the key to accessing paper-based content and other physical entities for millennia. Two main schools of thought have emerged: on the one hand, librarians and public repositories have pushed the concept of the Persistent Identifier (PI) as a way to guarantee long term identification and (sometimes) access; on the other hand, the extraordinary success of the web has led several researchers and web experts to push the concept of the Cool URI as the universal mechanism for identifying and accessing digital content. Both views have their pros and cons, but so far (with only a few exceptions) the two visions have developed in parallel, sometimes with a subtle underlying hostility. In this paper, we present the evolution of the Entity Name System (ENS), an open service-based platform developed as part of the OKKAM EU co-funded project, which can reconcile these two approaches. The new system, called ENS2.0, is currently under development and will enable data creators and curators to combine the technical strengths and opportunities of the (Semantic) Web vision with the organizational, economical and social requirements legitimately raised by the PI community and stakeholders. ", "article_title": "Can Persistent Identifiers Be Cool?", "authors": [{"given": "Barbara", "family": "Bazzanella", "affiliation": [{"original_name": "DISI, University of Trento", "normalized_name": "University of Trento", "country": "Italy", "identifiers": {"ror": "https://ror.org/05trd4x28", "GRID": "grid.11696.39"}}]}, {"given": "Stefano", "family": "Bortoli", "affiliation": [{"original_name": "DISI, University of Trento", "normalized_name": "University of Trento", "country": "Italy", "identifiers": {"ror": "https://ror.org/05trd4x28", "GRID": "grid.11696.39"}}]}, {"given": "Paolo", "family": "Bouquet", "affiliation": [{"original_name": "DISI, University of Trento", "normalized_name": "University of Trento", "country": "Italy", "identifiers": {"ror": "https://ror.org/05trd4x28", "GRID": "grid.11696.39"}}]}], "publisher": "Edinburgh University", "date": "2013", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "8", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}