{"url": "http://dx.doi.org/10.2218/ijdc.v4i3.114", "identifier": {"string_id": "10.2218/ijdc.v4i3.114", "id_scheme": "DOI"}, "abstract": "In the highly competitive engineering industry, product innovations are created with the help of a product lifecycle management (PLM) tool chain. In order to support fast-paced product development, a major company goal is the reuse of product designs and product descriptions. Due to the product’s complexity, the design of a product not only consists of geometry data but also of valuable engineering knowledge that is created during the various PLM phases. The need to preserve such intellectual capital leads engineering companies to introduce knowledge management and archiving their machine-readable formal representation. However, archived knowledge is in danger of becoming unusable since it is very likely that knowledge semantics and knowledge representation will evolve over long time periods, for example during the 50 operational years of some products. Knowledge evolution and knowledge representation technology changes are crucial issues since a reuse of the archived product information can only be ensured if its rationale and additional knowledge are interpretable with future software and technologies. Therefore, in order to reuse design data fully, knowledge about the design must also be migrated to be interoperable with future design systems and knowledge representation methods. This paper identifies problems, issues, requirements, challenges and solutions that arise while tackling the long-term preservation of engineering knowledge.", "article_title": "Enabling Product Design Reuse by Long-term Preservation of Engineering Knowledge", "authors": [{"given": "Jörg", "family": "Brunsmann", "affiliation": [{"original_name": "Fernuniversität Hagen, Germany", "normalized_name": "University of Hagen", "country": "Germany", "identifiers": {"ror": "https://ror.org/04tkkr536", "GRID": "grid.31730.36"}}]}, {"given": "Wolfgang", "family": "Wilkes", "affiliation": [{"original_name": "Fernuniversität Hagen, Germany", "normalized_name": "University of Hagen", "country": "Germany", "identifiers": {"ror": "https://ror.org/04tkkr536", "GRID": "grid.31730.36"}}]}], "publisher": "Edinburgh University", "date": "2009", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "4", "issue": "3", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}