{"url": "http://dx.doi.org/10.2218/ijdc.v8i1.252", "identifier": {"string_id": "10.2218/ijdc.v8i1.252", "id_scheme": "DOI"}, "abstract": "In contemporary scientific research, standard-making and standardization are key processes for the sharing and reuse of data. The goals of this paper are twofold: 1) to stress that collaboration is crucial to standard-making, and 2) to urge recognition of metadata standardization as part of the scientific process. To achieve these goals, a participatory framework for developing and implementing scientific metadata standards is presented. We highlight the need for ongoing, open dialogue within and among research communities at multiple levels. Using the Long Term Ecological Research network adoption of the Ecological Metadata Language as a case example in the natural sciences, we illustrate how a participatory framework addresses the need for active coordination of the evolution of scientific metadata standards. The participatory framework is contrasted with a hierarchical framework to underscore how the development of scientific standards is a dynamic and continuing process. The roles played by ‘best practices’ and ‘working standards’ are identified in relation to the process of standardization.", "article_title": "Towards Standardization: A Participatory Framework for Scientific Standard-Making", "authors": [{"given": "Lynn", "family": "Yarmey", "affiliation": [{"original_name": "University of Colorado at Boulder", "normalized_name": "University of Colorado Boulder", "country": "United States", "identifiers": {"ror": "https://ror.org/02ttsq026", "GRID": "grid.266190.a"}}]}, {"given": "Karen S.", "family": "Baker", "affiliation": [{"original_name": "University of Illinois at Urbana-Champaign", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}], "publisher": "Edinburgh University", "date": "2013", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "8", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}