{"url": "http://dx.doi.org/10.2218/ijdc.v4i3.116", "identifier": {"string_id": "10.2218/ijdc.v4i3.116", "id_scheme": "DOI"}, "abstract": "The curation of scientific research data at U.S. universities is a story of enterprising individuals and of incremental progress. A small number of libraries and data centers who see the possibilities of becoming “digital information management centers” are taking entrepreneurial steps to extend beyond their traditional information assets and include managing scientific and scholarly research data. The Georgia Institute of Technology (GT) has had a similar development path toward a data curation program based in its library. This paper will articulate GT’s program development, which the author offers as an experience common in U.S. universities. The main characteristic is a program devoid of top-level mandates and incentives, but rich with independent, “bottom-up” action. The paper will address program antecedents and context, inter-institutional partnerships that advance the library’s curation program, library organizational developments, partnerships with campus research communities, and a proposed model for curation program development. It concludes that despite the clear need for data curation put forth by researchers such as the groups of neuroscientists and bioscientists referenced in this paper, the university experience examined suggests that gathering resources for developing data curation programs at the institutional level is proving to be a quite onerous. However, and in spite of the challenges, some U.S. research universities are beginning to establish perceptible data curation programs.", "article_title": "Data Curation Program Development in U.S. Universities: The Georgia Institute of Technology Example", "authors": [{"given": "Tyler O.", "family": "Walters", "affiliation": [{"original_name": "Library and Information Center, Georgia Institute of Technology", "normalized_name": "Georgia Institute of Technology", "country": "United States", "identifiers": {"ror": "https://ror.org/01zkghx44", "GRID": "grid.213917.f"}}]}], "publisher": "Edinburgh University", "date": "2009", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "4", "issue": "3", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}