{"url": "http://dx.doi.org/10.2218/ijdc.v1i1.3", "identifier": {"string_id": "10.2218/ijdc.v1i1.3", "id_scheme": "DOI"}, "abstract": "A defining characteristic of contemporary copyright law is the willingness of governments to accept the argument that the impact of digital technologies requires copyright owners to be given ever greater control over the use of their works, regardless of the detriment to the copyright regime's 'public interest' elements. Yet a one-size-fits-all 'all rights reserved' copyright regime clearly fails to meet the requirements of many rightsholders. One response has been the Creative Commons movement which seeks, through licences based on existing copyright laws, to provide a simple mechanism for rightsholders to disseminate their works under less restrictive conditions. The Creative Commons' initial success has led to suggestions that its principles could be equally applied to scientific research outputs, such as publications, licensing of research materials, and datasets. This article argues that the Science Commons approach, if based on the Creative Commons model, and premised at its root on utilitarian copyright law, will both fail to address contemporary policy drivers in research, or to provide researchers with the type of rights that they actually want. It suggests that constructing an appropriate set of rights for the Science Commons, particularly for datasets, will require a willingness to step outside the utilitarian model and look to the Continental copyright tradition, which sets less store in economic rights and gives greater weight to moral rights.", "article_title": "Digital Curation, Copyright, and Academic Research", "authors": [{"given": "Andrew", "family": "Charlesworth", "affiliation": [{"original_name": "University of Bristol", "normalized_name": "University of Bristol", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0524sp257", "GRID": "grid.5337.2"}}]}], "publisher": "Edinburgh University", "date": "2008", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "1", "issue": "", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}