{"url": "http://dx.doi.org/10.2218/ijdc.v7i1.212", "identifier": {"string_id": "10.2218/ijdc.v7i1.212", "id_scheme": "DOI"}, "abstract": "The majority of information about science, culture, society, economy and the environment is born digital, yet the underlying technology is subject to rapid obsolescence. One solution to this obsolescence, format migration, is widely practiced and supported by many software packages, yet migration has well known risks. For example, newer formats – even where similar in function – do not generally support all of the features of their predecessors, and, where similar features exist, there  may be significant differences of interpretation.There appears to be a conflict between the wide use of migration and its known risks. In this paper  we explore a simple hypothesis – that, where migration paths exist, the majority of data files can be safely migrated leaving only a few that must be handled more carefully – in the context of several scientific data formats that are or were widely used. Our approach is to gather information about  potential migration mismatches and, using custom tools, evaluate a large collection of data files for the incidence of these risks. Our results support our  initial hypothesis, though with some caveats.  Further, we found that writing a tool to identify “risky” format features is considerably easier than  writing a migration tool.", "article_title": "Assessing Migration Risk for Scientific Data Formats", "authors": [{"given": "Chris", "family": "Frisz", "affiliation": [{"original_name": "Indiana University", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}, {"given": "Geoffrey", "family": "Brown", "affiliation": [{"original_name": "Indiana University", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}, {"given": "Samuel", "family": "Waggoner", "affiliation": [{"original_name": "Indiana University", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}], "publisher": "Edinburgh University", "date": "2012-03-09", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "7", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}