{"url": "http://dx.doi.org/10.2218/ijdc.v12i1.532", "identifier": {"string_id": "10.2218/ijdc.v12i1.532", "id_scheme": "DOI"}, "abstract": "Workflows processing data from research activities and driving in silico experiments are becoming an increasingly important method for conducting scientific research. Workflows have the advantage that not only can they be automated and used to process data repeatedly, but they can also be reused – in part or whole – enabling them to be evolved for use in new experiments. A number of studies have investigated strategies for storing and sharing workflows for the benefit of reuse. These have revealed that simply storing workflows in repositories without additional context does not enable workflows to be successfully reused. These studies have investigated what additional resources are needed to facilitate users of workflows and in particular to add provenance traces and to make workflows and their resources machine-readable. These additions also include adding metadata for curation, annotations for comprehension, and including data sets to provide additional context to the workflow. Ultimately though, these mechanisms still rely on researchers having access to the software to view and run the workflows. We argue that there are situations where researchers may want to understand a workflow that goes beyond what provenance traces provide and without having to run the workflow directly; there are many situations in which it can be difficult or impossible to run the original workflow. To that end, we have investigated the creation of an interactive workflow visualization that captures the flow chart element of the workflow with additional context including annotations, descriptions, parameters, metadata and input, intermediate, and results data that can be added to the record of a workflow experiment to enhance both curation and add value to enable reuse. We have created interactive workflow visualisations for the popular workflow creation tool KNIME, which does not provide users with an in-built function to extract provenance information that can otherwise only be viewed through the tool itself. Making use of the strengths of KNIME for adding documentation and user-defined metadata we can extract and create a visualisation and curation package that encourages and enhances curation@source, facilitating effective communication, collaboration, and reuse of workflows. ", "article_title": "Documentation and Visualisation of Workflows for Effective Communication, Collaboration and Publication @ Source", "authors": [{"given": "Cerys", "family": "Willoughby", "affiliation": [{"original_name": "University of Southampton", "normalized_name": "University of Southampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ryk1543", "GRID": "grid.5491.9"}}]}, {"given": "Jeremy G.", "family": "Frey", "affiliation": [{"original_name": "University of Southampton", "normalized_name": "University of Southampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ryk1543", "GRID": "grid.5491.9"}}]}], "publisher": "Edinburgh University", "date": "2017", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "12", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}