{"url": "http://dx.doi.org/10.2218/ijdc.v4i2.91", "identifier": {"string_id": "10.2218/ijdc.v4i2.91", "id_scheme": "DOI"}, "abstract": "This paper presents LORE (Literature Object Re-use and Exchange), a light-weight tool which is designed to allow literature scholars and teachers to author, edit and publish compound information objects encapsulating related digital resources and bibliographic records. LORE enables users to easily create OAI-ORE-compliant compound objects, which build on the IFLA FRBR model, and also enables them to describe and publish them to an RDF repository as Named Graphs. Using the tool, literary scholars can create typed relationships between individual atomic objects using terms from a bibliographic ontology and can attach metadata to the compound object. This paper describes the implementation and user interface of the LORE tool, as developed within the context of an ongoing case study being conducted in collaboration with AustLit: The Australian Literature Resource, which focuses on compound objects for teaching and research within the Australian literature studies community.", "article_title": "A Compound Object Authoring and Publishing Tool for Literary Scholars based on the IFLA-FRBR", "authors": [{"given": "Anna", "family": "Gerber", "affiliation": [{"original_name": "University of Queensland,St Lucia, Queensland, Australia", "normalized_name": "University of Queensland", "country": "Australia", "identifiers": {"ror": "https://ror.org/00rqy9422", "GRID": "grid.1003.2"}}]}, {"given": "Jane", "family": "Hunter", "affiliation": [{"original_name": "University of Queensland,St Lucia, Queensland, Australia", "normalized_name": "University of Queensland", "country": "Australia", "identifiers": {"ror": "https://ror.org/00rqy9422", "GRID": "grid.1003.2"}}]}], "publisher": "Edinburgh University", "date": "2009", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "4", "issue": "2", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}