{"url": "http://dx.doi.org/10.2218/ijdc.v10i1.328", "identifier": {"string_id": "10.2218/ijdc.v10i1.328", "id_scheme": "DOI"}, "abstract": " This article considers digital curation in doctoral study and the role of the doctoral supervisor and institution in facilitating students’ acquisition of digital curation skills, including some of the potentially problematic expectations of the supervisory relationship with regards to digital curation. Research took the form of an analysis of the current digital curation training landscape, focussing on doctoral study and supervision. This was followed by a survey (n=116) investigating attitudes towards importance, expertise, and responsibilities regarding digital curation. This research confirms that digital curation is considered to be very important within doctoral study but that doctoral supervisors and particularly students consider themselves to be largely unskilled at curation tasks. It provides a detailed picture of curation activity within doctoral study and identifies the areas of most concern. A detailed analysis demonstrates that most of the responsibility for curation is thought to lie with students and that institutions are perceived to have very low responsibility and that individuals tend to over-assign responsibility to themselves. Finally, the research identifies which types of support system for curation are most used and makes suggestions for ways in which students, supervisors, institutions, and others can effectively and efficiently address problematic areas and improve digital curation within doctoral study. ", "article_title": "Digital Curation and Doctoral Research", "authors": [{"given": "Daisy", "family": "Abbott", "affiliation": [{"original_name": "Glasgow School of Art", "normalized_name": "Glasgow School of Art", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01s033b11", "GRID": "grid.420422.2"}}]}], "publisher": "Edinburgh University", "date": "2015", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "10", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}