{"url": "http://www.jstor.org/stable/30204790", "identifier": {"string_id": "10.2307/30204790", "id_scheme": "DOI"}, "abstract": "In this paper we present some observations concerning an experiment of (manual/ automatic) semantic tagging of a small Italian corpus performed within the framework of the SENSEVAL/ROMANSEVAL initiative. The main goal of the initiative was to set up a framework for evaluation of Word Sense Disambiguation systems (WSDS) through the comparative analysis of their performance on the same type of data. In this experiment there are two aspects which are of relevance: first, the preparation of the reference annotated corpus, and, second, the evaluation of the systems against it. In both aspects we are mainly interested here in the analysis of the linguistic side which can lead to a better understanding of the problem of semantic annotation of a corpus, be it manual or automatic annotation. In particular, we will investigate, firstly, the reasons for disagreement between human annotators, secondly, some linguistically relevant aspects of the performance of the Italian WSDS and, finally, the lessons learned from the present experiment.", "article_title": "Senseval/Romanseval: The Framework for Italian", "authors": [{"given": "Nicoletta", "family": "Calzolari", "affiliation": [{"original_name": "Istituto di Linguistica Computazionale (ILC) - CNR", "normalized_name": "Institute for Computational Linguistics “A. Zampolli”", "country": "Italy", "identifiers": {"ror": "https://ror.org/028g3pe33", "GRID": "grid.503055.6"}}]}, {"given": "Ornella", "family": "Corazzari", "affiliation": [{"original_name": "Istituto di Linguistica Computazionale (ILC) - CNR", "normalized_name": "Institute for Computational Linguistics “A. Zampolli”", "country": "Italy", "identifiers": {"ror": "https://ror.org/028g3pe33", "GRID": "grid.503055.6"}}]}], "publisher": "Springer", "date": "2000", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "34", "issue": "1/2", "ISSN": [{"value": "00104817", "type": "print"}]}