{"url": "http://dx.doi.org/10.2218/ijdc.v8i1.247", "identifier": {"string_id": "10.2218/ijdc.v8i1.247", "id_scheme": "DOI"}, "abstract": "‘Big Science’ - that is, science which involves large collaborations with dedicated facilities, and involving large data volumes and multinational investments – is often seen as different when it comes to data management and preservation planning. Big Science handles its data differently from other disciplines and has data management problems that are qualitatively different from other disciplines. In part, these differences arise from the quantities of data involved, but possibly more importantly from the cultural, organisational and technical distinctiveness of these academic cultures. Consequently, the data management systems are typically and rationally bespoke, but this means that the planning for data management and preservation (DMP) must also be bespoke. These differences are such that ‘just read and implement the OAIS specification’ is reasonable Data Management and Preservation (DMP) advice, but this bald prescription can and should be usefully supported by a methodological ‘toolkit’, including overviews, case-studies and costing models to provide guidance on developing best practice in DMP policy and infrastructure for these projects, as well as considering OAIS validation, audit and cost modelling. In this paper, we build on previous work with the LIGO collaboration to consider the role of DMP planning within these big science scenarios, and discuss how to apply current best practice. We discuss the result of the MaRDI-Gross project (Managing Research Data Infrastructures – Big Science), which has been developing a toolkit to provide guidelines on the application of best practice in DMP planning within big science projects. This is targeted primarily at projects’ engineering managers, but intending also to help funders collaborate on DMP plans which satisfy the requirements imposed on them. ", "article_title": "Data Management and Preservation Planning for Big Science", "authors": [{"given": "Juan", "family": "Bicarregui", "affiliation": [{"original_name": "Scientific Computing Department, STFC", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Norman", "family": "Gray", "affiliation": [{"original_name": "University of Glasgow", "normalized_name": "University of Glasgow", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vtgdb53", "GRID": "grid.8756.c"}}]}, {"given": "Rob", "family": "Henderson", "affiliation": [{"original_name": "University of Lancaster", "normalized_name": "Lancaster University Ghana", "country": "Ghana", "identifiers": {"ror": "https://ror.org/01g3dya06", "GRID": "grid.472314.7"}}]}, {"given": "Roger", "family": "Jones", "affiliation": [{"original_name": "University of Lancaster", "normalized_name": "Lancaster University Ghana", "country": "Ghana", "identifiers": {"ror": "https://ror.org/01g3dya06", "GRID": "grid.472314.7"}}]}, {"given": "Simon", "family": "Lambert", "affiliation": [{"original_name": "Scientific Computing Department, STFC", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Brian", "family": "Matthews", "affiliation": [{"original_name": "Scientific Computing Department, STFC", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Edinburgh University", "date": "2013-06-14", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "8", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}