{"url": "http://www.jstor.org/stable/30204924", "identifier": {"string_id": "10.2307/30204924", "id_scheme": "DOI"}, "abstract": "Current term recognition algorithms have centred mostly on the notion of term based on the assumption that terms are monoreferential and as such independent of context. The characteristics and behaviour of terms in real texts are however far removed from this ideal because factors such as text type or communicative situation greatly influence the linguistic realisation of a concept. Context, therefore, is important for the correct identification of terms (Dubuc and Lauriston, 1997). Based on this assumption, we have shifted our emphasis from terms towards surrounding linguistic context, namely verbs, as verbs are considered the central elements in the sentence. More specifically, we have set out to examine whether verbs and verbal syntax in particular, could help us towards the task of automatic term recognition. Our findings suggest that term occurrence varies significantly in different argument structures and different syntactic positions. Additionally, deviant grammatical structures have proved rich environments for terms. The analysis was carried out in three different specialised subcorpora in order to explore how the effectiveness of verbal syntax as a potential indicator of term occurrence can be constrained by factors such as subject matter and text type.", "article_title": "An Analysis of Verb Subcategorization Frames in Three Special Language Corpora with a View towards Automatic Term Recognition", "authors": [{"given": "Eugenia", "family": "Eumeridou", "affiliation": [{"original_name": "Department of Information and Communication Systems, University of the Aegean, Karlovassi, Samos, Greece", "normalized_name": "University of the Aegean", "country": "Greece", "identifiers": {"ror": "https://ror.org/03zsp3p94", "GRID": "grid.7144.6"}}]}, {"given": "Blaise", "family": "Nkwenti-Azeh", "affiliation": [{"original_name": "Centre for Computational Linguistics, UMIST P.O. Box 88, Sackville Street, Manchester M60, IQD, UK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "John", "family": "McNaught", "affiliation": [{"original_name": "Department of Computation, UMIST P.O. Box 88, Sackville Street, Manchester M60 1QD, UK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Springer", "date": "2004", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "38", "issue": "1", "ISSN": [{"value": "00104817", "type": "print"}]}