{"url": "http://dx.doi.org/10.2218/ijdc.v5i1.142", "identifier": {"string_id": "10.2218/ijdc.v5i1.142", "id_scheme": "DOI"}, "abstract": "Towards Interoperable Preservation Repositories (TIPR) is a project funded by the Institute of Museum and Library Services to create and test a Repository eXchange Package (RXP). The package will make it possible to transfer complex digital objects between dissimilar preservation repositories.  For reasons of redundancy, succession planning and software migration, repositories must be able to exchange copies of archival information packages with each other. Every different repository application, however, describes and structures its archival packages differently. Therefore each system produces dissemination packages that are rarely understandable or usable as submission packages by other repositories. The RXP is an answer to that mismatch. Other solutions for transferring packages between repositories focus either on transfers between repositories of the same type, such as DSpace-to-DSpace transfers, or on processes that rely on central translation services.  Rather than build translators between many dissimilar repository types, the TIPR project has defined a standards-based package of metadata files that can act as an intermediary information package, the RXP, a lingua franca all repositories can read and write.", "article_title": "Towards Interoperable Preservation Repositories: TIPR", "authors": [{"given": "Priscilla", "family": "Caplan", "affiliation": [{"original_name": "Florida Center for Library Automation", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "William R.", "family": "Kehoe", "affiliation": [{"original_name": "Cornell University Library", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Joseph", "family": "Pawletko", "affiliation": [{"original_name": "Bobst Library, New York University", "normalized_name": "New York University", "country": "United States", "identifiers": {"ror": "https://ror.org/0190ak572", "GRID": "grid.137628.9"}}]}], "publisher": "Edinburgh University", "date": "2010-06-22", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "5", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}