{"url": "http://www.jstor.org/stable/30204860", "identifier": {"string_id": "10.2307/30204860", "id_scheme": "DOI"}, "abstract": "This paper describes how traditional and non-traditional methods were used to identify seventeen previously unknown articles that we believe to be by Stephen Crane, published in the New-York Tribune between 1889 and 1892. The articles, printed without byline in what was at the time New York City's most prestigious newspaper, report on activities in a string of summer resort towns on New Jersey's northern shore. Scholars had previously identified fourteen shore reports as Crane's; these possible attributions more than double that corpus. The seventeen articles confirm how remarkably early Stephen Crane set his distinctive writing style and artistic agenda. In addition, the sheer quantity of the articles from the summer of 1892 reveals how vigorously the twenty-year-old Crane sought to establish himself in the role of professional writer. Finally, our discovery of an article about the New Jersey National Guard's summer encampment reveals another way in which Crane immersed himself in nineteenth-century military culture and help to explain how a young man who had never seen a battle could write so convincingly of war in his soon-to-come masterpiece, The Red Badge of Courage. We argue that the joint interdisciplinary approach employed in this paper should be the way in which attributional research is conducted.", "article_title": "Stephen Crane and the \"New-York Tribune\": A Case Study in Traditional and Non-Traditional Authorship Attribution", "authors": [{"given": "David I.", "family": "Holmes", "affiliation": [{"original_name": "The College of New Jersey, USA", "normalized_name": "Princeton University", "country": "United States", "identifiers": {"ror": "https://ror.org/00hx57361", "GRID": "grid.16750.35"}}]}, {"given": "Michael", "family": "Robertson", "affiliation": [{"original_name": "The College of New Jersey, USA", "normalized_name": "Princeton University", "country": "United States", "identifiers": {"ror": "https://ror.org/00hx57361", "GRID": "grid.16750.35"}}]}, {"given": "Roxanna", "family": "Paez", "affiliation": [{"original_name": "The College of New Jersey, USA", "normalized_name": "Princeton University", "country": "United States", "identifiers": {"ror": "https://ror.org/00hx57361", "GRID": "grid.16750.35"}}]}], "publisher": "Springer", "date": "2001-01-01", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "35", "issue": "3", "ISSN": [{"value": "00104817", "type": "print"}]}