{"url": "http://www.jstor.org/stable/30204870", "identifier": {"string_id": "10.2307/30204870", "id_scheme": "DOI"}, "abstract": "It is important to give useful clues for selecting desired content from a number of retrieval results obtained (usually) from a vague search request. Compared with monolingual retrieval, such a support framework is inevitable and much more significant for filtering given translingual retrieval results. This paper describes an attempt to provide appropriate translation of major keywords in each document in a cross-language information retrieval (CLIR) result, as a browsing support for users. Our idea of determining appropriate translation of major keywords is based on word cooccurrence distribution in the translation target language, considering the actual situation of WWW content where it is difficult to obtain aligned parallel (multilingual) corpora. The proposed method provides higher quality of keyword translation to yield a more effective support in identifying the target documents in the retrieval result. We report the advantage of this browsing support technique through evaluation experiments including comparison with conditions of referring to a translated document summary, and discuss related issues to be examined towards more effective cross-language information extraction.", "article_title": "A Method for Supporting Document Selection in Cross-Language Information Retrieval and Its Evaluation", "authors": [{"given": "Masami", "family": "Suzuki", "affiliation": [{"original_name": "KDD Research and Development Laboratories Inc., Japan", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Naomi", "family": "Inoue", "affiliation": [{"original_name": "KDD Research and Development Laboratories Inc., Japan", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Kazuo", "family": "Hashimoto", "affiliation": [{"original_name": "KDD Research and Development Laboratories Inc., Japan", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Springer", "date": "2001", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "35", "issue": "4", "ISSN": [{"value": "00104817", "type": "print"}]}