{"url": "http://www.jstor.org/stable/30204939", "identifier": {"string_id": "10.2307/30204939", "id_scheme": "DOI"}, "abstract": "This paper reports on a method for exploiting a bitext as the primary linguistic information source for the design of a generation environment for specialized bilingual documentation. The paper discusses such issues as Text Encoding Initiative (TEI), proposals for specialized corpus tagging, text segmentation and alignment of translation units and their allocation into translation memories, Document Type Definition (DTD), abstraction from tagged texts, and DTD deployment for bilingual text generation. The parallel corpus used for experimentation has two main features: - It contains bilingual documents from a dedicated domain of legal and administrative publications rich in specialized jargon. - It involves two languages, Spanish and Basque, which are typologically very distinct (both lexically and morpho-syntactically). Starting from an annotated bitext we show how Standard Generalized Markup Language (SGML) elements can be recycled to produce complementary language resources. Several translation memory databases are produced. Furthermore, DTDs for source and target documents are derived and put into correspondence. This paper discusses how these resources are automatically generated and applied to an interactive bilingual authoring system.", "article_title": "Bitext Generation through Rich Markup", "authors": [{"given": "Arantza", "family": "Casillas", "affiliation": [{"original_name": " 'Departamento Electridad y Electronica, Facultad de Ciencia y Tecnologia, UPV-EHU, Madrid, Spain", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Raquel", "family": "Martínez", "affiliation": [{"original_name": "Departamento Informdtica, Estadistica y Telematica, Universidad Rey Juan Carlos, Spain", "normalized_name": "King Juan Carlos University", "country": "Spain", "identifiers": {"ror": "https://ror.org/01v5cv687", "GRID": "grid.28479.30"}}]}], "publisher": "Springer", "date": "2004", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "38", "issue": "3", "ISSN": [{"value": "00104817", "type": "print"}]}