{"url": "http://dx.doi.org/10.2218/ijdc.v11i1.401", "identifier": {"string_id": "10.2218/ijdc.v11i1.401", "id_scheme": "DOI"}, "abstract": "The development of e-Research infrastructure has enabled data to be shared and accessed more openly. Policy mandates for data sharing have contributed to the increasing availability of research data through data repositories, which create favourable conditions for the re-use of data for purposes not always anticipated by original collectors. Despite the current efforts to promote transparency and reproducibility in science, data re-use cannot be assumed, nor merely considered a ‘thrifting’ activity where scientists shop around in data repositories considering only the ease of access to data. The lack of an integrated view of individual, social and technological influential factors to intentional and actual data re-use behaviour was the key motivator for this study. Interviews with 13 social scientists produced 25 factors that were found to influence their perceptions and experiences, including both their unsuccessful and successful attempts to re-use data. These factors were grouped into six theoretical variables: perceived benefits, perceived risks, perceived effort, social influence, facilitating conditions, and perceived re-usability. These research findings provide an in-depth understanding about the re-use of research data in the context of open science, which can be valuable in terms of theory and practice to help leverage data re-use and make publicly available data more actionable.   ", "article_title": "Factors Influencing Research Data Reuse in the Social Sciences: An Exploratory Study", "authors": [{"given": "Renata Gonçalves", "family": "Curty", "affiliation": [{"original_name": "Universidade Estadual de Londrina, Brazil", "normalized_name": "Londrina State University", "country": "Brazil", "identifiers": {"ror": "https://ror.org/01585b035", "GRID": "grid.411400.0"}}]}], "publisher": "Edinburgh University", "date": "2016-10-05", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "11", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}