{"url": "http://dx.doi.org/10.2218/ijdc.v1i1.4", "identifier": {"string_id": "10.2218/ijdc.v1i1.4", "id_scheme": "DOI"}, "abstract": "The use of digital technologies within research has led to a proliferation of data, many new forms of research output and new modes of presentation and analysis. Many scientific communities are struggling with the challenge of how to manage the terabytes of data and new forms of output, they are producing. They are also under increasing pressure from funding organizations to publish their raw data, in addition to their traditional publications, in open archives. In this paper I describe an approach that involves the selective encapsulation of raw data, derived products, algorithms, software and textual publications within “scientific publication packages”. Such packages provide an ideal method for: encapsulating expert knowledge; for publishing and sharing scientific process and results; for teaching complex scientific concepts; and for the selective archival, curation and preservation of scientific data and output. They also provide a bridge between technological advances in the Digital Libraries and eScience domains. In particular, I describe the RDF-based architecture that we are adopting to enable scientists to construct, publish and manage “scientific publication packages” - compound digital objects that encapsulate and relate the raw data to its derived products, publications and the associated contextual, provenance and administrative metadata.", "article_title": "Scientific Publication Packages – A Selective Approach to the Communication and Archival of Scientific Output", "authors": [{"given": "Jane", "family": "Hunter", "affiliation": [{"original_name": "University of Queensland", "normalized_name": "University of Queensland", "country": "Australia", "identifiers": {"ror": "https://ror.org/00rqy9422", "GRID": "grid.1003.2"}}]}], "publisher": "Edinburgh University", "date": "2008", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "1", "issue": "", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}