{"url": "http://www.jstor.org/stable/30204925", "identifier": {"string_id": "10.2307/30204925", "id_scheme": "DOI"}, "abstract": "This study investigates the writing style change of two Turkish authors, Çetin Altan and Yaşar Kemal, in their old and new works using respectively their newspaper columns and novels. The style markers are the frequencies of word lengths in both text and vocabulary, and the rate of usage of most frequent words. For both authors, t-tests and logistic regressions show that the length of the words in new works is significantly longer than that of the old. The principal component analyses graphically illustrate the separation between old and new texts. The works are correctly categorized as old or new with 75 to 100% accuracy and 92% average accuracy using discriminant analysisbased cross validation. The results imply higher time gap may have positive impact in separation and categorization. For Altan a regression analysis demonstrates a decrease in average word length as the age of his column increases. One interesting observation is that for one word each author has similar preference changes over time.", "article_title": "Change of Writing Style with Time", "authors": [{"given": "Fazli", "family": "Can", "affiliation": [{"original_name": "Computer Science and Systems Analysis Department, Miami University, Oxford, OH 45056, USA", "normalized_name": "Miami University", "country": "United States", "identifiers": {"ror": "https://ror.org/05nbqxr67", "GRID": "grid.259956.4"}}]}, {"given": "Jon M.", "family": "Patton", "affiliation": [{"original_name": "Miami Computing and Information Services, Miami University, Oxford, OH 45056, USA", "normalized_name": "Miami University", "country": "United States", "identifiers": {"ror": "https://ror.org/05nbqxr67", "GRID": "grid.259956.4"}}]}], "publisher": "Springer", "date": "2004-01-01", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "38", "issue": "1", "ISSN": [{"value": "00104817", "type": "print"}]}