{"url": "http://dx.doi.org/10.2218/ijdc.v14i1.586", "identifier": {"string_id": "10.2218/ijdc.v14i1.586", "id_scheme": "DOI"}, "abstract": "Digital/data curation curricula have been around for a couple of decades. Currently, several ALA-accredited LIS programs offer digital/data curation courses and certificate programs to address the high demand for professionals with the knowledge and skills to handle digital content and research data in an ever-changing information environment.  In this study, we aimed to examine the topical scopes of digital/data curation curricula in the context of the LIS field.  We collected 16 syllabi from the digital/data curation courses, as well as textual descriptions of the 11 programs and their core courses offered in the U.S., Canada, and the U.K. The collected data were analyzed using a probabilistic topic modeling technique, Latent Dirichlet Allocation, to identify both common and unique topics. The results are the identification of 20 topics both at the program- and course-levels. Comparison between the program- and course-level topics uncovered a set of unique topics, and a number of common topics.  Furthermore, we provide interactive visualizations for digital/data curation programs and courses for further analysis of topical distributions. We believe that our combined approach of a topic modeling and visualizations may provide insight for identifying emerging trends and co-occurrences of topics among digital/data curation curricula in the LIS field. ", "article_title": "Identifying Topical Coverages of Curricula using Topic Modeling and Visualization Techniques: A Case of Digital and Data Curation", "authors": [{"given": "Seungwon", "family": "Yang", "affiliation": [{"original_name": "Louisiana State University", "normalized_name": "Louisiana State University", "country": "United States", "identifiers": {"ror": "https://ror.org/05ect4e57", "GRID": "grid.64337.35"}}]}, {"given": "Boryung", "family": "Ju", "affiliation": [{"original_name": "Louisiana State University", "normalized_name": "Louisiana State University", "country": "United States", "identifiers": {"ror": "https://ror.org/05ect4e57", "GRID": "grid.64337.35"}}]}, {"given": "Haeyong", "family": "Chung", "affiliation": [{"original_name": "The University of Alabama in Huntsville", "normalized_name": "University of Alabama in Huntsville", "country": "United States", "identifiers": {"ror": "https://ror.org/02zsxwr40", "GRID": "grid.265893.3"}}]}], "publisher": "Edinburgh University", "date": "2019", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "14", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}