{"url": "http://dx.doi.org/10.2218/ijdc.v13i1.630", "identifier": {"string_id": "10.2218/ijdc.v13i1.630", "id_scheme": "DOI"}, "abstract": "For open science to flourish, data and any related digital outputs should be discoverable and re-usable by a variety of potential consumers. The recent FAIR Data Principles produced by the Future of Research Communication and e-Scholarship (FORCE11) collective provide a compilation of considerations for making data findable, accessible, interoperable, and re-usable. The principles serve as guideposts to ‘good’ data management and stewardship for data and/or metadata. On a conceptual level, the principles codify best practices that managers and stewards would find agreement with, exist in other data quality metrics, and already implement. This paper reports on a secondary purpose of the principles: to inform assessment of data’s FAIR-ness or, put another way, data’s fitness for use. Assessment of FAIR-ness likely requires more stratification across data types and among various consumer communities, as how data are found, accessed, interoperated, and re-used differs depending on types and purposes. This paper’s purpose is to present a method for qualitatively measuring the FAIR Data Principles through operationalizing findability, accessibility, interoperability, and re- usability from a re-user’s perspective. The findings may inform assessments that could also be used to develop situationally-relevant fitness for use frameworks. ", "article_title": "Measuring FAIR Principles to Inform Fitness for Use", "authors": [{"given": "Carolyn", "family": "Hank", "affiliation": [{"original_name": "University of Tennessee", "normalized_name": "University of Tennessee at Knoxville", "country": "United States", "identifiers": {"ror": "https://ror.org/020f3ap87", "GRID": "grid.411461.7"}}]}, {"given": "Bradley Wade", "family": "Bishop", "affiliation": [{"original_name": "University of Tennessee", "normalized_name": "University of Tennessee at Knoxville", "country": "United States", "identifiers": {"ror": "https://ror.org/020f3ap87", "GRID": "grid.411461.7"}}]}], "publisher": "Edinburgh University", "date": "2018", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "13", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}