{"url": "http://dx.doi.org/10.22148/001c.12049", "identifier": {"string_id": "10.22148/001c.12049", "id_scheme": "DOI"}, "abstract": "This paper compares social media traces from Goodreads to data from the MLA International Bibliography and the Open Syllabus Project, in order to better understand the preferences of readers of Victorian literature from different but overlapping communities. We find that the majority of works of Victorian literature that are indicated as being read on Goodreads occur about as often as they are taught or written about in the academy, although books aimed at an adult audience are written about more frequently in peer-reviewed venues. Interestingly, those works that are statistical outliers in terms of their greater popularity with a general audience than an academic audience tend to feature women authors, children’s literature, and works with a strong female protagonist. Turning to an analysis of the written reviews on Goodreads of three outliers that were more popular with a general audience--A Tale of Two Cities, Jane Eyre, and The Secret Garden--we find that readers tend to comment on plot (especially in Dickens), feminist themes (in Jane Eyre), and the importance of characters (in all three works). In conclusion, we suggest ways in which postsecondary teachers might draw on these results to inform their syllabi and formulate strategies for teaching Victorian literature. We argue that in terms of outliers, popular taste in Victorian literature among Goodreads users reflects more general reading preferences among this user group, as readers turn to the Victorian era to read children’s literature and books featuring strong female characters.", "article_title": "The Social Lives of Books: Reading Victorian Literature on Goodreads", "authors": [{"given": "Karen", "family": "Bourrier", "affiliation": [{"original_name": "University of Calgary, Alberta", "normalized_name": "University of Calgary", "country": "Canada", "identifiers": {"ror": "https://ror.org/03yjb2x39", "GRID": "grid.22072.35"}}]}, {"given": "Mike", "family": "Thelwall", "affiliation": [{"original_name": "University of Wolverhampton, England", "normalized_name": "University of Wolverhampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01k2y1055", "GRID": "grid.6374.6"}}]}], "publisher": "Department of Languages, Literatures, and Cultures", "date": "2020-02-20", "keywords": null, "journal_title": "Journal of Cultural Analytics", "volume": null, "issue": null, "ISSN": [{"value": "2371-4549", "type": "electronic"}]}