{"url": "http://dx.doi.org/10.2218/ijdc.v4i3.117", "identifier": {"string_id": "10.2218/ijdc.v4i3.117", "id_scheme": "DOI"}, "abstract": "This paper presents a brief literature review and then introduces the methods, design, and construction of the Data Curation Profile, an instrument that can be used to provide detailed information on particular data forms that might be curated by an academic library. These data forms are presented in the context of the related sub-disciplinary research area, and they provide the flow of the research process from which these data are generated. The profiles also represent the needs for data curation from the perspective of the data producers, using their own language. As such, they support the exploration of data curation across different research domains in real and practical terms. With the sponsorship of the Institute of Museum and Library Services, investigators from Purdue University and the University of Illinois interviewed 19 faculty subjects to identify needs for discovery, access, preservation, and reuse of their research data. For each subject, a profile was constructed that includes information about his or her general research, data forms and stages, value of data, data ingest, intellectual property, organization and description of data, tools, interoperability, impact and prestige, data management, and preservation. Each profile also presents a specific dataset supplied by the subject to serve as a concrete example. The Data Curation Profiles are being published to a public wiki for questions and discussion, and a blank template will be disseminated with guidelines for others to create and share their own profiles. This study was conducted primarily from the viewpoint of librarians interacting with faculty researchers; however, it is expected that these findings will complement a wide variety of data curation research and practice outside of librarianship and the university environment.", "article_title": "Constructing Data Curation Profiles", "authors": [{"given": "Michael", "family": "Witt", "affiliation": [{"original_name": "Distributed Data Curation Center, Purdue University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Jacob", "family": "Carlson", "affiliation": [{"original_name": "Distributed Data Curation Center, Purdue University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "D. Scott", "family": "Brandt", "affiliation": [{"original_name": "Distributed Data Curation Center, Purdue University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Melissa H.", "family": "Cragin", "affiliation": [{"original_name": "University of Illinois at Urbana-Champaign", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}], "publisher": "Edinburgh University", "date": "2009", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "4", "issue": "3", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}