{"url": "http://dx.doi.org/10.2218/ijdc.v10i2.321", "identifier": {"string_id": "10.2218/ijdc.v10i2.321", "id_scheme": "DOI"}, "abstract": "A study of 56 professors at five American universities found that a majority had little understanding of principles, well-known in the field of data curation, informing the ongoing administration of digital materials and chose to manage and store work-related data by relying on the use of their own storage devices and cloud accounts. It also found that a majority of them had experienced the loss of at least one work-related digital object that they considered to be important in the course of their professional career. Despite such a rate of loss, a majority of respondents expressed at least a moderate level of confidence that they would be able to make use of their digital objects in 25 years. The data suggest that many faculty members are unaware that their data is at risk. They also indicate a strong correlation between faculty members’ digital object loss and their data management practices. University professors producing digital objects can help themselves by becoming aware that these materials are subject to loss. They can also benefit from awareness and use of better personal data management practices, as well as participation in university-level programmatic digital curation efforts and the availability of more readily accessible, robust infrastructure for the storage of digital materials. ", "article_title": "Intellectual Capital at Risk: Data Management Practices and Data Loss by Faculty Members at Five American Universities", "authors": [{"given": "Jaime", "family": "Schumacher", "affiliation": [{"original_name": "Northern Illinois University", "normalized_name": "Northern Illinois University", "country": "United States", "identifiers": {"ror": "https://ror.org/012wxa772", "GRID": "grid.261128.e"}}]}, {"given": "Drew", "family": "VandeCreek", "affiliation": [{"original_name": "Northern Illinois University", "normalized_name": "Northern Illinois University", "country": "United States", "identifiers": {"ror": "https://ror.org/012wxa772", "GRID": "grid.261128.e"}}]}], "publisher": "Edinburgh University", "date": "2015-07-31", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "10", "issue": "2", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}