{"url": "http://dx.doi.org/10.2218/ijdc.v6i1.170", "identifier": {"string_id": "10.2218/ijdc.v6i1.170", "id_scheme": "DOI"}, "abstract": "MESSAGE (Mobile Environmental Sensing System Across Grid Environments) was an ambitious, multi-partner, interdisciplinary e-Science research project, jointly funded by the Engineering and Physical Sciences Research Council (EPSRC) and the UK Department for Transport (DfT) between 2006 and 2009. It aimed to develop and demonstrate the potential of diverse, low cost sensors to provide heterogeneous data for the planning, management and control of the environmental impacts of transport activity at urban, regional and national level. During the last year of the project, the Digital Curation Centre (DCC) interviewed and observed members of the project team in order to identify and analyse key aspects of their data-related activities, recording attitudes towards the data that they create and/or re-use. This paper describes the major issues identified over the course of the case study, which are presented in parallel with the perspectives of the project team in order to demonstrate the multiplicity of views that may be projected onto a single dataset. It concludes with a contextualisation of the case study's themes with those of a number of contemporary reports.", "article_title": "The Milieu and the MESSAGE: Talking to Researchers about Data Curation Issues in a Large and Diverse e-Science Project", "authors": [{"given": "Martin", "family": "Donnelly", "affiliation": [{"original_name": "University of Edinburgh", "normalized_name": "University of Edinburgh", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01nrxwf90", "GRID": "grid.4305.2"}}]}, {"given": "Robin", "family": "North", "affiliation": [{"original_name": "Imperial College London", "normalized_name": "Imperial College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/041kmwe10", "GRID": "grid.7445.2"}}]}], "publisher": "Edinburgh University", "date": "2011", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "6", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}