{"url": "http://dx.doi.org/10.2218/ijdc.v10i1.324", "identifier": {"string_id": "10.2218/ijdc.v10i1.324", "id_scheme": "DOI"}, "abstract": "This paper aims to give state-of-the-art information about digital preservation activities in the Czech Republic during the last decade to an English-speaking audience. We briefly describe major phases of the “digital” projects. These were mainly in libraries, with some references to museums, galleries and archives. We focus on aspects related to the preservation of collected born-digital and digitised content. Even now, digital preservation activities in heritage institutions are often on the periphery of the interest of all stakeholders and the infrastructure supporting digital preservation of data in heritage institutions is not well financed or coordinated. Even though the “long decade”, which lasted from the dramatic events of 2002 until approximately 2014, saw a number of successful projects creating digital data in Czech libraries, the handful of projects which were in part focused on digital preservation were not flexible enough to accommodate user requirements and were failing to meet expectations. There is still much room for further development in the area of long-term preservation of digital data in the Czech Republic. This article is a shortened version of one of the analyses written under the “Strategy of the research, development and innovation for the years 2010–2015” program of the Moravian Library in Brno, Czech Republic. ", "article_title": "The long decade of digital preservation in heritage institutions in the Czech Republic: 2002–2014", "authors": [{"given": "Jan", "family": "Hutař", "affiliation": [{"original_name": "Archives New Zealand", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Marek", "family": "Melichar", "affiliation": [{"original_name": "Charles University, Prague", "normalized_name": "Charles University", "country": "Czechia", "identifiers": {"ror": "https://ror.org/024d6js02", "GRID": "grid.4491.8"}}]}], "publisher": "Edinburgh University", "date": "2015", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "10", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}