{"url": "http://dx.doi.org/10.2218/ijdc.v9i1.298", "identifier": {"string_id": "10.2218/ijdc.v9i1.298", "id_scheme": "DOI"}, "abstract": " Citizen Cyberscience Projects (CCPs) that recruit members of the public as volunteers to process and produce large datasets promise a great deal of benefits to scientists and science. However, if this promise is to be realised, and citizen science-produced datasets are to be widely used by scientists, it is essential that these datasets win the trust of the scientific community. This task of securing credibility involves, in part, applying standard scientific procedures to clean up datasets formed by volunteer contributions. However, the management of volunteers’ behaviour in terms of how they contribute also plays a significant role in improving both the quality of individual contributions and the overall robustness of the resultant datasets. This can assist CCPs in securing a reputation for producing trustworthy datasets. Through a case study of Galaxy Zoo, a CCP set up to generate datasets based on volunteer classifications of galaxy morphologies, this paper explores how those involved in running the project manage volunteers. In particular, it focuses on how methods for crediting volunteer contributions motivate volunteers to provide higher quality contributions and to behave in a way that better corresponds to statistical assumptions made when combining volunteer contributions into datasets. These methods have made a significant contribution to the success of the project in securing trust in these datasets, which have been well used by other scientists. Implications for practice are then presented for CCPs, providing a list of considerations to guide choices regarding how to credit volunteer contributions to improve the quality and trustworthiness of citizen science-produced datasets. ", "article_title": "Managing the Public to Manage Data: Citizen Science and Astronomy", "authors": [{"given": "Peter", "family": "Darch", "affiliation": [{"original_name": "University of California Los Angeles", "normalized_name": "University of California, Los Angeles", "country": "United States", "identifiers": {"ror": "https://ror.org/046rm7j60", "GRID": "grid.19006.3e"}}]}], "publisher": "Edinburgh University", "date": "2014", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "9", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}