{"url": "http://dx.doi.org/10.31400/dh-hun.2019.2.387", "identifier": {"string_id": "10.31400/dh-hun.2019.2.387", "id_scheme": "DOI"}, "abstract": "While at the end of the 20th century information technology research offered an optimistic vision about the future of the cyber world, where the technology first of all, would help our access to the information and knowledge of humanity, in the early 21st century our cyber world has become Searle’s Chinese room: we have started to lose control over the inputs and outputs, the information, the content, or sometimes even our own private sphere. The first part of the study examines the emergence of various forms of cyberbullying through the „Jung Joon-yung scandal” in the K-pop world. This section analyses different forms of online shaming from cyber-stalking, to sharing of non-consensual pornography, and even the cyber-pillory. The second part of the paper interprets some manifestations of virtual or cyber-love with the help of Baudrillard’s concept of simulacrum. It is more than interesting how similarly the false (or elusive) love of the obsessive fans of Korean pop/TV/movie stars is constructed to that of simulacra, ie. robots and other imaginary heroes. The virtual communication not just simply makes it easier to express our different kinds of human emotions by overcoming some of the factors such as self-reflection that make real communication difficult for us. At the same time, virtual communication simplifies what we say (“dislike”, “love” etc.), but it also influences our way of thinking. We become different human beings by doing things in cyberspace that we would not do in real life. The simulacrum problem is interpreted through different Korean TV-drama-series, as the “I’m not a Robot,” the “Are you human too” and the “W”. The paper concludes with the discussion of some ethical problems concerning the digitized human consciousness.", "article_title": "A Design for Living in the Chinese Room I.", "authors": [{"given": "Tünde", "family": "Tóth", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2020", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "2", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}