{"url": "https://doi.org/10.3366/ijhac.2016.0164", "identifier": {"string_id": "10.3366/ijhac.2016.0164", "id_scheme": "DOI"}, "abstract": " This paper discusses issues concerning the creation of conversion tables for East Asian (Chinese, Japanese, Korean) and European calendars and describes the development of an open source calendar database as part of the history of converting East Asian calendars. East Asian calendars encode both astronomical and political cycles. As a result, date conversion must in practice rely on complex look-up tables and cannot be done merely algorithmically. We provide a detailed overview of the history of such conversion tables and find that the modelling of these tables into the digital follows a trend of increasingly detailed computation of chronological time. The Buddhist Studies Time Authority Database was designed to allow computational conversion of the Chinese, the Japanese and the Korean Calendar, between each other, as well as with the Gregorian, proleptic Gregorian and Julian calendar. It relies on the Julian Day Number (JDN) as common referent for all conversions. ", "article_title": "Modelling East Asian Calendars in an Open Source Authority Database", "authors": [{"given": "Marcus", "family": "Bingenheimer", "affiliation": [{"original_name": "Temple University, Philadelphia, PA, USA", "normalized_name": "Temple University", "country": "United States", "identifiers": {"ror": "https://ror.org/00kx1jb78", "GRID": "grid.264727.2"}}]}, {"given": "Jen-Jou", "family": "Hung", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Simon", "family": "Wiles", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Zhang", "family": "Boyong", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2016", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "10", "issue": "2", "ISSN": [{"value": null, "type": null}]}