{"url": "https://doi.org/10.3366/ijhac.2019.0234", "identifier": {"string_id": "10.3366/ijhac.2019.0234", "id_scheme": "DOI"}, "abstract": " For over half-a-century (1803–54), the Australian colony of Van Diemen's Land (Tasmania), played a key part in Britain's globe-spanning unfree diaspora. Today, a rich built and archaeological landscape, augmented by an exhaustive and relatively intact documentary archive, stand as eloquent markers to this convict legacy. As historical archaeologists, we have spent countless hours querying the physical and documentary residues in a bid to understand how the penological, social and economic imperatives of Britain and the colony shaped the management of convict labour. In particular, our task has centred upon the recovery of individual narratives – of both gaoler and gaoled – from such residues, moving away from a traditional focus on the broader outlines of the convict system. This paper illustrates how spatial history methodological processes have been used to relocate individual historic lives back into the convict industrial landscape of the Tasman Peninsula (Tasmania). Focusing on the male-only penal station of Port Arthur (1830–77), we will illustrate how we have reunited the physicality of past spaces and places, with the lives and labours of those who created and navigated them. Simple methodologies have been used to achieve this, designed with onward applicability in mind. A complex series of documents, convict conduct records, have been mined for spatial markers, allowing events and people to be relocated back into space. Through these processes of linkage and visualisation, we have been encouraged to ask further questions about the management of the unfree labour force and how this came to create the landscape we see today. ", "article_title": "Repopulating Landscapes: Using Offence Data to Recreate Landscapes of Incarceration and Labour at the Port Arthur Penal Station, 1830–1877", "authors": [{"given": "Richard", "family": "Tuffin", "affiliation": [{"original_name": "University of New England: Armidale, NSW, AU", "normalized_name": "University of New England", "country": "United States", "identifiers": {"ror": "https://ror.org/02n2ava60", "GRID": "grid.266826.e"}}]}, {"given": "Martin", "family": "Gibbs", "affiliation": [{"original_name": "University of New England: Armidale, NSW, AU", "normalized_name": "University of New England", "country": "United States", "identifiers": {"ror": "https://ror.org/02n2ava60", "GRID": "grid.266826.e"}}]}], "publisher": "Edinburgh University Press", "date": "2019-10-16", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "13", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}