{"url": "https://doi.org/10.3366/ijhac.2018.0220", "identifier": {"string_id": "10.3366/ijhac.2018.0220", "id_scheme": "DOI"}, "abstract": " This article joins calls for literary scholarship to move beyond the limitations of binary oppositions between ‘close’ and ‘distant’ reading and towards the development of approaches that exploit the macroanalytic potential of digital methods alongside the nuanced analysis that characterises literary scholarship. Drawing on a customised corpus of writing about the English Lake District, we model the application of a multiscalar approach known as geographical text analysis (GTA), which combines aspects of close reading and distant reading, and, in doing so, introduces a new method for literary research. Here, we focus on historical descriptions of the Lake District's soundscape to demonstrate both how perceptions of sound changed over the course of the eighteenth and nineteenth centuries, and how multi-scalar methods can uniquely uncover such historical-literary shifts. Sound, we argue, offers a particularly useful focus since it allows us to draw fruitful parallels between our methods and those applied by the writers we study. In this way, this article advocates for digital humanities scholarship that advances our disciplines in conversation with appropriate historical modes. ", "article_title": "Combining Close and Distant Reading: A Multiscalar Analysis of the English Lake District's Historical Soundscape", "authors": [{"given": "Joanna E.", "family": "Taylor", "affiliation": [{"original_name": "Lancaster University", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}, {"original_name": "The University of Manchester", "normalized_name": "University of Manchester", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/027m9bs27", "GRID": "grid.5379.8"}}]}, {"given": "Ian N.", "family": "Gregory", "affiliation": [{"original_name": "Lancaster University", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}, {"given": "Christopher", "family": "Donaldson", "affiliation": [{"original_name": "Lancaster University", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}], "publisher": "Edinburgh University Press", "date": "2018", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "12", "issue": "2", "ISSN": [{"value": null, "type": null}]}