{"url": "https://doi.org/10.3366/ijhac.2015.0140", "identifier": {"string_id": "10.3366/ijhac.2015.0140", "id_scheme": "DOI"}, "abstract": " This paper discusses the development of digital intellectual and technological geographies showing spatial distributions of information and proposes to combine these with network representations of actors and documents relevant for the history knowledge exchange in Early Modern Europe. The amount of technical and fortification drawings that were copied throughout Europe and the New World and the different nature of networks in which they were exchanged raises the question whether they belonged to the Republic of Letters, as some authors claim. We argue that instead of trying to explain knowledge exchange in Early Modern Europe by focusing on The Republic of Letters as one entity consisting of scholars , it might be more useful to reconstruct the spatial distribution of actors and of (non-)textual documents in virtual networks of knowledge. Inspired by the term “deep maps” coined by David Bodenhamer, we will introduce the concept of “deep networks” and explore the requirements for their future development. Hereto, we focus on the representation of historical evidence and of uncertainties in analyses of intellectual and technological letters and drawings and hybrid combinations of these. ", "article_title": "Mapping Knowledge Exchange in Early Modern Europe: Intellectual and Technological Geographies and Network Representations", "authors": [{"given": "Charles", "family": "Van Den Heuvel", "affiliation": [{"original_name": "Royal Netherlands Academy of Arts and Sciences", "normalized_name": "Royal Netherlands Academy of Arts and Sciences", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/043c0p156", "GRID": "grid.418101.d"}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2015", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "9", "issue": "1", "ISSN": [{"value": null, "type": null}]}