{"url": "http://dx.doi.org/10.31400/dh-hun.2020.3.443", "identifier": {"string_id": "10.31400/dh-hun.2020.3.443", "id_scheme": "DOI"}, "abstract": "In recent decades, the controversy over distant versus close reading has revolved around the question of scaling. Participants in the debate have either advocated distance (or speed), or have insisted on proximity (or slowness). On a meta-critical level, some have even argued for the need for any reading to be able to shift between, and thus combine, different scales. Very little has been said, however, about the limitations of scaling as such, and the irreducibility of reading to the logic of scales. Starting out from a few intricate formulations by some proponents of close and distant reading, this paper attempts to investigate the potentials and limitations of scaling, first by references to “Stanford” (the university as well as its founder), then by looking into Walter Benjamin’s treatment of film, and finally, though most importantly, by re-reading some passages in Poe’s detective story “The Purloined Letter.” These three points of reference (Stanford, Benjamin, Poe) seem analogous in the way they lay mutual emphasis on both serialization and segmentation, fast and slow motion, or distance and proximity. On a closer (or more distant?) look, however, Poe’s text goes even beyond such a scheme of scaling. It testifies to a logic of detection which surpasses mere zooming-in or zooming-out strategies, and points to a notion of reading that is “escalated” not simply because of its extraordinary range in terms of velocity or distance, but more radically because, although it still binds reading to specific scales, it also has an aspect that is utterly heterogeneous to any logic of scaling. The paper attempts to highlight this radically “escalated” (out-of-scale) aspect of reading.", "article_title": "Escalated Reading", "authors": [{"given": "György", "family": "Fogarasi", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2020", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "3", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}