{"url": "https://doi.org/10.3366/ijhac.2020.0249", "identifier": {"string_id": "10.3366/ijhac.2020.0249", "id_scheme": "DOI"}, "abstract": " Larry McMurtry's Pulitzer Prize winning counter-western Lonesome Dove (part of a tetralogy, set between 1840 and 1900) and the works of LA Noir detective fiction writers (from the 1940s to 1997) represent the American west and urban southwest of Los Angeles as a dynamic mosaic of human and environmental borderlandscapes. McMurtry's perspective provides an Anglo-European eye, influenced by Cervantean Iberian literary tropes on the transformation of the West from indigenous and Spanish trails to American rail-road tracks. The LA Noirscapes map phenomenologically illustrates how the location of novel settings cluster in contiguous and convergent places on a street grid palimpsest of Los Angeles between 1949 and 1997. Employing HumGIS methods, this essay considers the marriage of empirical cartography and impressionistic topography; the former concerned with latitude, longitude and space, the latter with plotting literary, historical and cultural perceptions and experiences of place. By engaging the concept of Euclidian space with the phenomenology of place, geographers can contextualize field work, and other methods with literary, cartographical and GIS analysis to uncover the means to craft new avenues to study the dynamic and symbiotic formations of historical landscapes, identities, senses of place and location. ", "article_title": "Historical and Imagined GIS Borderlandscapes of the American West: Larry McMurtry's Lonesome Dove Tetralogy and LA Noirscapes", "authors": [{"given": "Charles", "family": "Travis", "affiliation": [{"original_name": "University of Texas at Arlington", "normalized_name": "The University of Texas at Arlington", "country": "United States", "identifiers": {"ror": "https://ror.org/019kgqr73", "GRID": "grid.267315.4"}}]}], "publisher": "Edinburgh University Press", "date": "2020", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "14", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}