{"url": "http://dx.doi.org/10.3389/fdigh.2016.00006", "identifier": {"string_id": "10.3389/fdigh.2016.00006", "id_scheme": "DOI"}, "abstract": "With the increased application of network analysis in archeology to form hypotheses, particularly concerning the research on mobility, a need has arisen to validate the network analysis results. This paper presents a case study of a local transport network in the Dutch part of the Roman limes between 70 and 270 AD created using a least-cost approach, and tests the robustness of the local network metric of betweenness centrality and the archeological interpretation thereof. It is demonstrated that while the majority of sites have a robust and thus reliable betweenness centrality, there are still a large number of sites for which the network measurements are very dependent on the precise structure of the network present. Testing robustness of network analysis results thus proves a useful tool for both validating the network modeling results and the archeological interpretations of that network.", "article_title": "Testing the Robustness of Local Network Metrics in Research on Archeological Local Transport Networks", "authors": [{"given": "Mark R.", "family": "Groenhuijzen", "affiliation": [{"original_name": "Faculty of Humanities, CLUE+ Research Institute for Culture, History and Heritage, Vrije Universiteit Amsterdam, Netherlands", "normalized_name": "VU Amsterdam", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/008xxew50", "GRID": "grid.12380.38"}}]}, {"given": "Philip", "family": "Verhagen", "affiliation": [{"original_name": "Faculty of Humanities, CLUE+ Research Institute for Culture, History and Heritage, Vrije Universiteit Amsterdam, Netherlands", "normalized_name": "VU Amsterdam", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/008xxew50", "GRID": "grid.12380.38"}}]}], "publisher": "Frontiers Media SA", "date": "2016", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "3", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}