{"url": "https://doi.org/10.3366/ijhac.2020.0253", "identifier": {"string_id": "10.3366/ijhac.2020.0253", "id_scheme": "DOI"}, "abstract": " Researchers from the spatial humanities can play an active role in the ongoing discussion around representation and uncertainty in geosocial data. Opportunistic geosocial data from crowdsourced and user contributions are typically available in large quantities, however, these data are generally not sampled or collected with intentionality for research purposes. Therefore, digital traces from geolocationally-enabled devices may not provide data that are directly relevant to addressing precise questions or being used in applications of societal interest. It is crucial to first understand characteristics of geosocial data prior to proceeding with interpretation. The spatial humanities could encourage realization of the role data analysts and researchers play in creating narrative in light of large opportunistic data with many facets of uncertainty. An approach is proposed that suggests directions of inquiry into data limitations based on the characteristics of the source and the properties of the data. Finally, this article notes that the digital world influences the activities of individuals in real-life so the generalizability of the behaviour of users may be limited. Integrating other forms of relevant spatial data can help to bound uncertainty and constrain the interpretation of geosocial data. ", "article_title": "Representation in Geosocial Data: Grappling with Uncertainty in Digital Traces of Human Activity", "authors": [{"given": "Carolynne", "family": "Hultquist", "affiliation": [{"original_name": "Pennsylvania State University", "normalized_name": "Pennsylvania State University", "country": "United States", "identifiers": {"ror": "https://ror.org/04p491231", "GRID": "grid.29857.31"}}]}], "publisher": "Edinburgh University Press", "date": "2020-02-26", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "14", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}