{"url": "https://doi.org/10.3366/ijhac.2016.0169", "identifier": {"string_id": "10.3366/ijhac.2016.0169", "id_scheme": "DOI"}, "abstract": " This article is an exploratory study using a smallholding diary and GIS to project the spatio-temporal pattern of a smallholding's travel in late nineteenth century Sweden. Through time-series of smallholding's daily diary notes, we develop an understanding for how smallholders adjusted to and participated in Swedish government policy, which resulted in the process termed ‘agrarian revolution’. Between 1872–1892, Tomtas Smallholding altered its spatio-temporal patterns from seasonal travels to production according to market demands and along new lines of transportation like railways. While the smallholding also used railways to visit distant places, it was primarily their produce that travelled further unto international markets. This also influenced the smallholding demography, from an extended household towards a nuclear family. As market demands shifted from subsistence to dairy products, the smallholding contracted primarily female farm servants due to their specialisation in milking. ", "article_title": "Smallholding Travel in the Agrarian Revolution: Using a Farmer Diary to Map Spatio-temporal Patterns in Late Nineteenth Century Sweden", "authors": [{"given": "Johan", "family": "Gärdebo", "affiliation": [{"original_name": "KTH Royal Institute of Technology", "normalized_name": "Royal Institute of Technology", "country": "Sweden", "identifiers": {"ror": "https://ror.org/026vcq606", "GRID": "grid.5037.1"}}]}, {"given": "Daniel", "family": "Löwenborg", "affiliation": [{"original_name": "Uppsala University", "normalized_name": "Uppsala University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/048a87296", "GRID": "grid.8993.b"}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2016", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "10", "issue": "2", "ISSN": [{"value": null, "type": null}]}