{"url": "https://doi.org/10.3366/ijhac.2015.0136", "identifier": {"string_id": "10.3366/ijhac.2015.0136", "id_scheme": "DOI"}, "abstract": " Place name mentions in text may have more than one potential referent (e.g. Peru, the country vs. Peru, the city in Indiana). The Edinburgh Language Technology Group (LTG) has developed the Edinburgh Geoparser, a system that can automatically recognise place name mentions in text and disambiguate them with respect to a gazetteer. The recognition step is required to identify location mentions in a given piece of text. The subsequent disambiguation step, generally referred to as georesolution, grounds location mentions to their corresponding gazetteer entries with latitude and longitude values, for example, to visualise them on a map. Geoparsing is not only useful for mapping purposes but also for making document collections more accessible as it can provide additional metadata about the geographical content of documents. Combined with other information mined from text such as person names and date expressions, complex relations between such pieces of information can be identified. The Edinburgh Geoparser can be used with several gazetteers including Unlock and GeoNames to process a variety of input texts. The original version of the Geoparser was a demonstrator configured for modern text. Since then, it has been adapted to georeference historic and ancient text collections as well as modern-day newspaper text.1,2,3,4 Currently, the LTG is involved in three research projects applying the Geoparser to historical text collections of very different types and for a variety of end-user applications. This paper discusses the ways in which we have customised the Geoparser for specific datasets and applications relevant to each project. ", "article_title": "Adapting the Edinburgh Geoparser for Historical Georeferencing", "authors": [{"given": "Beatrice", "family": "Alex", "affiliation": [{"original_name": "University of Edinburgh, UK", "normalized_name": "University of Edinburgh", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01nrxwf90", "GRID": "grid.4305.2"}}]}, {"given": "Kate", "family": "Byrne", "affiliation": [{"original_name": "University of Edinburgh, UK", "normalized_name": "University of Edinburgh", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01nrxwf90", "GRID": "grid.4305.2"}}]}, {"given": "Claire", "family": "Grover", "affiliation": [{"original_name": "University of Edinburgh, UK", "normalized_name": "University of Edinburgh", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01nrxwf90", "GRID": "grid.4305.2"}}]}, {"given": "Richard", "family": "Tobin", "affiliation": [{"original_name": "University of Edinburgh, UK", "normalized_name": "University of Edinburgh", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01nrxwf90", "GRID": "grid.4305.2"}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2015", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "9", "issue": "1", "ISSN": [{"value": null, "type": null}]}