{"url": "http://dx.doi.org/10.3389/fdigh.2018.00028", "identifier": {"string_id": "10.3389/fdigh.2018.00028", "id_scheme": "DOI"}, "abstract": "The Everyday Sexism Project documents everyday examples of sexism reported by volunteer contributors from all around the world. It collected 100,000 entries in 13+ languages within the first 3 years of its existence. The content of reports in various languages submitted to Everyday Sexism is a valuable source of crowdsourced information with great potential for feminist and gender studies. In this paper, we take a computational approach to analyze the content of reports. We use topic-modeling techniques to extract emerging topics and concepts from the reports, and to map the semantic relations between those topics. The resulting picture closely resembles and adds to that arrived at through qualitative analysis, showing that this form of topic modeling could be useful for sifting through datasets that had not previously been subject to any analysis. More precisely, we come up with a map of topics for two different resolutions of our topic model and discuss the connection between the identified topics. In the low-resolution picture, for instance, we found Public space/Street, Online, Work related/Office, Transport, School, Media harassment, and Domestic abuse. Among these, the strongest connection is between Public space/Street harassment and Domestic abuse and sexism in personal relationships. The strength of the relationships between topics illustrates the fluid and ubiquitous nature of sexism, with no single experience being unrelated to another.", "article_title": "Topic Modeling of Everyday Sexism Project Entries", "authors": [{"given": "Sophie", "family": "Melville", "affiliation": [{"original_name": "Oxford Internet Institute, University of Oxford, United Kingdom", "normalized_name": "University of Oxford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/052gg0110", "GRID": "grid.4991.5"}}]}, {"given": "Kathryn", "family": "Eccles", "affiliation": [{"original_name": "Oxford Internet Institute, University of Oxford, United Kingdom", "normalized_name": "University of Oxford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/052gg0110", "GRID": "grid.4991.5"}}]}, {"given": "Taha", "family": "Yasseri", "affiliation": [{"original_name": "Oxford Internet Institute, University of Oxford, United Kingdom", "normalized_name": "University of Oxford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/052gg0110", "GRID": "grid.4991.5"}}]}], "publisher": "Frontiers Media SA", "date": "2019", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "5", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}