{"url": "https://doi.org/10.3366/ijhac.2014.0130", "identifier": {"string_id": "10.3366/ijhac.2014.0130", "id_scheme": "DOI"}, "abstract": " Linking historical census data is an important task for the study of the social, economic, and demographic aspects of families and society in the past. Although various (semi-) automatic linking methods have been proposed, state-of-the-art methods have only been targeted at linking records that correspond to individuals. In this paper, we introduce an automatic method aimed at linking both individuals and households across several historical census datasets. The proposed method contains several steps, including data quality analysis and enhancement, household identity detection, as well as individual and household record linking. We have applied this method to a set of six census datasets collected from the district of Rawtenstall in North-East Lancashire in the United Kingdom between 1851 and 1901. Experimental results show that the proposed method can greatly reduce the ambiguity arising from the individual record linkage, and facilitate the accurate matching of households across several decades. ", "article_title": "Automatic Record Linkage of Individuals and Households in Historical Census Data", "authors": [{"given": "Zhichun", "family": "Fu", "affiliation": [{"original_name": "The Australian National University", "normalized_name": "Australian National University", "country": "Australia", "identifiers": {"ror": "https://ror.org/019wvm592", "GRID": "grid.1001.0"}}]}, {"given": "H.M.", "family": "Boot", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Peter", "family": "Christen", "affiliation": [{"original_name": "The Australian National University", "normalized_name": "Australian National University", "country": "Australia", "identifiers": {"ror": "https://ror.org/019wvm592", "GRID": "grid.1001.0"}}]}, {"given": "Jun", "family": "Zhou", "affiliation": [{"original_name": "Griffith University, School of Information and Communication Technology, Nathan, QLD, Australia", "normalized_name": "Griffith University", "country": "Australia", "identifiers": {"ror": "https://ror.org/02sc3r913", "GRID": "grid.1022.1"}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2014", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "8", "issue": "2", "ISSN": [{"value": null, "type": null}]}