{"url": "https://doi.org/10.3366/ijhac.2017.0184", "identifier": {"string_id": "10.3366/ijhac.2017.0184", "id_scheme": "DOI"}, "abstract": " This paper describes several aspects of a formal digital semantic model that expresses some issues presented by medieval charters. Surprisingly, perhaps, this model does not deal directly with a charter's text and is not mark-up based. Instead, it draws on the authors’ experience with the construction of three highly structured factoid-oriented prosopographical databases that drew heavily on charter sources, and that also did not explicitly contain a digital representation of the charter texts. The paper explains the way in which the structured data model thus derived differs from text-oriented approaches such as TEI/CEI work that has been done so far on charters. It presents a view on why this factoid-based model seems to capture more readily some of the complexity in the apparent meanings of the charters, and suggests that this is because it is also more likely to relate to a richer conception of the broader medieval world in which these charters were created than text-oriented work does. Finally, drawing on recent work on the ChartEx project, it explores how a combined approach, that takes the best of both text-markup and structured data modelling techniques, could evolve in the future. ", "article_title": "Exploring a Model for the Semantics of Medieval Legal Charters", "authors": [{"given": "John", "family": "Bradley", "affiliation": [{"original_name": "King's College London, Department of Digital Humanities, UK", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}]}, {"given": "Dauvit", "family": "Broun", "affiliation": [{"original_name": "University of Glasgow", "normalized_name": "University of Glasgow", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vtgdb53", "GRID": "grid.8756.c"}}]}, {"given": "Alice", "family": "Rio", "affiliation": [{"original_name": "King's College London", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}]}, {"given": "Matthew", "family": "Hammond", "affiliation": [{"original_name": "King's College London", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}]}], "publisher": "Edinburgh University Press", "date": "2019", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "13", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}