{"url": "https://doi.org/10.3366/ijhac.2018.0222", "identifier": {"string_id": "10.3366/ijhac.2018.0222", "id_scheme": "DOI"}, "abstract": " The abundance of information contained in nineteenth-century texts means the traditional ‘close reading’ of Victorian culture has limitations. With the burgeoning availability of newspapers in digital format, there is a pressing need to look at how we might effectively and efficiently use these digital resources to help answer research questions and add to key historical and geographical debates. Focusing on the analysis of a large digital corpus, this paper has two key foci: (I) to apply an innovative digital methodology, that combines corpus linguistics and geospatial technologies, to a very large corpus of newspaper texts and; (II) apply said methodology to a case study assessing the presentation of health and disease in a nineteenth-century newspaper. The paper illustrates that by linking existing techniques with new and innovative approaches it is possible to temporally and spatially analyse and map themes of interest in large digital corpora on a scale not possible through more traditional close reading methods. ", "article_title": "Space and Time in 100 Million Words: Health and Disease in a Nineteenth-century Newspaper", "authors": [{"given": "Catherine", "family": "Porter", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Paul", "family": "Atkinson", "affiliation": [{"original_name": "Cardiff University", "normalized_name": "Cardiff University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/03kk7td41", "GRID": "grid.5600.3"}}]}, {"given": "Ian N.", "family": "Gregory", "affiliation": [{"original_name": "Lancaster University, UK", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}], "publisher": "Edinburgh University Press", "date": "2018-10-22", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "12", "issue": "2", "ISSN": [{"value": null, "type": null}]}