{"url": "https://doi.org/10.3366/ijhac.2011.0004", "identifier": {"string_id": "10.3366/ijhac.2011.0004", "id_scheme": "DOI"}, "abstract": " The present study deploys acoustic theory and digital analysis to investigate the dynamics of the inter-relationship of architecture and music. It assesses the impact of the built environment on music composition and performance. Drawing upon the science that underpins both architecture and music, it is also informed by the qualitative and artistic attributes of both. Reference to a specific case study, St. Patrick's Cathedral in Dublin, describes the design and implementation of a methodology designed to allow for context and era-specific assessment. The research design is interdisciplinary, bridging theory and practice. The methodology is firmly based on the use of digital technologies, which allow for efficient, accurate and replicable procedure. Data capture, analysis and mapping of the architectural site was supplemented by reference to primary archived material. Digital preservation of primary material was an integral part of the project; the resulting record created a more complete digital repository of the cathedral, combining the information which can be read in the structure itself with documents relating to its history. This article makes use of Victor Hugo's concept of the ‘Book of Stone’ to comment on the information gleaned from paper records and digital analysis of the architecture and acoustics of St Patrick's Cathedral, Dublin. ", "article_title": "Drawing on the digital: Analysis and modelling in architecture and music", "authors": [{"given": "Fiona", "family": "Smyth", "affiliation": [{"original_name": "University of Dublin Trinity College", "normalized_name": "Trinity College", "country": "Canada", "identifiers": {"ror": "https://ror.org/019dhar59", "GRID": "grid.440018.9"}}]}, {"given": "Donal", "family": "Lennon", "affiliation": [{"original_name": "University College Dublin", "normalized_name": "RCSI & UCD Malaysia Campus", "country": "Malaysia", "identifiers": {"ror": "https://ror.org/0474gs458", "GRID": "grid.417196.c"}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2011", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "4", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}