{"url": "http://dx.doi.org/10.3389/fdigh.2015.00008", "identifier": {"string_id": "10.3389/fdigh.2015.00008", "id_scheme": "DOI"}, "abstract": "This article describes the use of latent Dirichlet allocation (LDA), or topic modeling, to explore the discursive makeup of the eighteenth century Encyclopédie of Denis Diderot and Jean le Rond d’Alembert (1751–1772). Expanding upon previous work modeling the Encyclopédie’s ontology, or classification scheme, we examine the abstractions used by its editors to visualize the various “systems” of knowledge that the work proposes, considered here as heuristic tools for navigating the complex information space of the Encyclopédie. Using these earlier experiments with supervised machine-learning models as a point of reference, we introduce the notion of topic modeling as a “discourse analysis tool” for Enlightenment studies. In so doing, we draw upon the tradition of post-structuralist French discourse analysis, one of the first fields to embrace computational approaches to discursive text analysis. Our particular use of LDA is thus aimed primarily at uncovering interdisciplinary “discourses” in the Encyclopédie that run alongside, under, above, and through the original classifications. By mapping these discourses and discursive practices, we can begin to move beyond the organizational (and physical) limitations of the print edition, suggesting several possible avenues of future research. These experiments thus attest once again to the enduring relevance of the Encyclopédie as an exemplary Enlightenment text. Its rich dialogical structure, whether studied using traditional methods of close reading or through the algorithmic processes described in this article, is perhaps only now coming fully to light thanks to recent developments in digital resources and methods.", "article_title": "Discourses and Disciplines in the Enlightenment: Topic Modeling the French Encyclopédie", "authors": [{"given": "Glenn", "family": "Roe", "affiliation": [{"original_name": "Centre for Digital Humanities Research, Australian National University, Australia", "normalized_name": "Australian National University", "country": "Australia", "identifiers": {"ror": "https://ror.org/019wvm592", "GRID": "grid.1001.0"}}]}, {"given": "Clovis", "family": "Gladstone", "affiliation": [{"original_name": "The ARTFL Project (American and French Research on the Treasury of the French Language), University of Chicago, USA", "normalized_name": "University of Chicago", "country": "United States", "identifiers": {"ror": "https://ror.org/024mw5h28", "GRID": "grid.170205.1"}}]}, {"given": "Robert", "family": "Morrissey", "affiliation": [{"original_name": "The ARTFL Project (American and French Research on the Treasury of the French Language), University of Chicago, USA", "normalized_name": "University of Chicago", "country": "United States", "identifiers": {"ror": "https://ror.org/024mw5h28", "GRID": "grid.170205.1"}}]}], "publisher": "Frontiers Media SA", "date": "2016", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "2", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}