{"url": "https://doi.org/10.3366/ijhac.2017.0176", "identifier": {"string_id": "10.3366/ijhac.2017.0176", "id_scheme": "DOI"}, "abstract": " This project explores the power of lines to tell stories. For architects, lines are elemental devices: they catalyze and structure our ability to describe space. But can they describe time and experience? The following case study explores this question in depth while tracking the historical expansion of suburban life in San Antonio, Texas. The research focuses on five roads, re-imagining them as a series of concentric timelines that stretch from the city's historical center to its suburban periphery. To date the multi-disciplinary team—led by architect Ian Caine with collaboration from a historian and an urban geographer—has utilized three distinct media to represent the chronological growth of San Antonio: 1) a large two-dimensional timeline that the team exhibited in a museum gallery, 2) a video-based spatial-temporal narrative that simulated the experience of driving through the city, and 3) a web-based interactive timeline.1 This article establishes the merits of the first two approaches—which are both complete—before speculating about the potential of the web-based version to recast the timeline as a narrative device capable of illuminating the complex relationship between time, space and experience in the contemporary city. ", "article_title": "Inhabiting the Line: A Digital Chronology of Suburban Expansion for San Antonio, Texas", "authors": [{"given": "Ian", "family": "Caine", "affiliation": [{"original_name": "University of Texas at San Antonio", "normalized_name": "The University of Texas at San Antonio", "country": "United States", "identifiers": {"ror": "https://ror.org/01kd65564", "GRID": "grid.215352.2"}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2017", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "11", "issue": "1", "ISSN": [{"value": null, "type": null}]}