{"url": "https://doi.org/10.3366/ijhac.2011.0020", "identifier": {"string_id": "10.3366/ijhac.2011.0020", "id_scheme": "DOI"}, "abstract": " In this paper we describe how historical land use information has been derived for the whole of Europe, using the World Atlas of Agriculture, scale 1: 2,500,000. This paper describes the process of converting the analog land-use maps to a digital European historical land-use database, the Historical Land Use Database 1960 (HISLU60). The processing techniques that are applied in this process are commonly used for the processing of satellite imagery. The paper maps were scanned and geo-referenced. Image filtering techniques were used to eliminate the cartographic elements like text and boundaries. Land-use classes were created from the colours in the maps using image classification techniques. As a last step, GIS filtering functions were used to eliminate remaining cartographic elements and small classification errors. The HISLU60 database contains six land-use classes; arable land, grassland, forest, non-agricultural land, inland water and urban. It is a raster dataset with a cell size of 250 meters. The HISLU60 database was validated by performing a statistical comparison with three reference datasets. The overall classification accuracy is around 50 percent. Despite its limitations, the HISLU60 database gives an overview of the pan-European land use around 1960. ", "article_title": "Historical land use databases: a new layer of information for geographical research", "authors": [{"given": "H. (Henk)", "family": "Kramer", "affiliation": [{"original_name": "Wageningen University & Research", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "C.A. (Sander)", "family": "Mücher", "affiliation": [{"original_name": "Wageningen University & Research", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "G.W. (Gerard)", "family": "Hazeu", "affiliation": [{"original_name": "Wageningen University & Research", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2011", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "5", "issue": "1", "ISSN": [{"value": null, "type": null}]}