{"url": "https://doi.org/10.3366/E1753854809000408", "identifier": {"string_id": "10.3366/E1753854809000408", "id_scheme": "DOI"}, "abstract": " In this paper the role of concept characteristics in lexical dialectometric research is examined in three consecutive logical steps. First, a regression analysis of data taken from a large lexical database of Limburgish dialects in Belgium and The Netherlands is conducted to illustrate that concept characteristics such as concept salience, concept vagueness and negative affect contribute to the lexical heterogeneity in the dialect data. Next, it is shown that the relationship between concept characteristics and lexical heterogeneity influences the results of conventional lexical dialectometric measurements. Finally, a dialectometric procedure is proposed which downplays this undesired influence, thus making it possible to obtain a clearer picture of the ‘truly’ regional variation. More specifically, a lexical dialectometric method is proposed in which concept characteristics form the basis of a weighting schema that determines to which extent concept specific dissimilarities can contribute to the aggregate dissimilarities between locations. ", "article_title": "The Role of Concept Characteristics in Lexical Dialectometry", "authors": [{"given": "Dirk", "family": "Speelman", "affiliation": [{"original_name": "University of Leuven", "normalized_name": "KU Leuven", "country": "Belgium", "identifiers": {"ror": "https://ror.org/05f950310", "GRID": "grid.5596.f"}}]}, {"given": "Dirk", "family": "Geeraerts", "affiliation": [{"original_name": "University of Leuven", "normalized_name": "KU Leuven", "country": "Belgium", "identifiers": {"ror": "https://ror.org/05f950310", "GRID": "grid.5596.f"}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2009", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "2", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}