{"url": "https://doi.org/10.3366/ijhac.2015.0148", "identifier": {"string_id": "10.3366/ijhac.2015.0148", "id_scheme": "DOI"}, "abstract": " Using ArcGIS, this article maps the narrative locations of French cinema's box office successes and César du meilleur film winners against a self-consciously international version of prestige, the French submission for best foreign language film at the Oscars from 1976 (when the Césars began) to 2012. Mapping domestic consumption and prestige against the for-American-consumption vision of prestige and possible box office appeal will identify the settings that are associated with domestic and international locations of Frenchness. Do films that succeed at the box office connect themselves to France's main population centers—Paris, Lyon, Marseille, Lille—or to less-populated and economically vibrant regions, as with Bienvenue Chez les Ch'tis (2008) in Bergues? To what extent do prestige films seek out marginalized areas in which to set their stories, as in the Paris banlieues of La Haine (1996) or Sète in La Graine et le mullet (2008)? Do the films that France proposes to the Oscar voters address an imagined American preference for one part of France—Paris—over another, or do they turn to other, less globally-integrated locations? Where are the overlaps among these three categories? And where are the empty spaces that neither box office nor prestige address? This article will be a spatial history, drawing on Franco Moretti's ‘distant reading’ approach to groups of films to demonstrate the critical potential for mapping narrative locations as a way to conceive of the multiple nations—in this case France—that cinema imagines for its domestic and international audiences. ", "article_title": "Where is France in French Cinema, 1976–2013?", "authors": [{"given": "Christian B.", "family": "Long", "affiliation": [{"original_name": "University of Queensland: Brisbane, AU", "normalized_name": "University of Queensland", "country": "Australia", "identifiers": {"ror": "https://ror.org/00rqy9422", "GRID": "grid.1003.2"}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2015-10-16", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "9", "issue": "2", "ISSN": [{"value": null, "type": null}]}