{"url": "https://doi.org/10.3366/ijhac.2017.0180", "identifier": {"string_id": "10.3366/ijhac.2017.0180", "id_scheme": "DOI"}, "abstract": " This paper showcases a counter-mapping project with the Tlingit and Tagish peoples of the circumpolar north. Engaging critically with the evolving theory and practice of deep mapping we reveal how collaborative water research designed to provide a framework for indigenous water legislation is expressed visually on a Google Earth platform. This aquatic counter-map, or as we call it, a deep chart, not only empowers the Tlingit and Tagish, but reclaims and revitalises critical cultural values, whilst simultaneously preserving linguistic and cultural memory in a digital form. More broadly, the deep chart is currently being brought into global water ethic debates as a visual ethno-cartographic example of an alternative relationship humans might have with water, paving the way for a new water consciousness. This is in direct contrast to current, dominant and sometimes destructive global water governance and water management models and practices. We showcase a participatory and aqua-centric deep charting paradigm that is evolving through Geographics Information Science (GIS) platforms in collaboration with the CTFN (Tlingit and Tagish) community and government. This research challenges the contemporary cartography of the dominant Anglo-American valuing of water. It also presents an alternative water vision that we argue can shift ‘terra-centric’ thinking towards ‘aqua-centric’ thinking. It further provides a blueprint for informing global water ethics debates. ", "article_title": "A Deep Chart (the Aqua-Face of Deep Mapping)", "authors": [{"given": "Eleanor", "family": "Hayman", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Mark", "family": "Wedge", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Colleen", "family": "James", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2017", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "11", "issue": "1", "ISSN": [{"value": null, "type": null}]}