{"url": "https://doi.org/10.3366/ijhac.2016.0170", "identifier": {"string_id": "10.3366/ijhac.2016.0170", "id_scheme": "DOI"}, "abstract": " Historians and historical quantitative social scientists, motivated by a renewed interest in quantitative history and by sophisticated tools for digital infrastructure, are developing data repositories for global-scale and collaborative analysis. However, their archives have been slow to grow. This article is directed toward historians who are contemplating such projects. Repository development is very valuable. On the other hand, studies show that repository projects that rely upon voluntary contribution from numerous researchers seldom reach critical mass. Our surveys and our study of the Collaborative for Historical Information and Analysis Data Hoover Project confirm this assessment. We conclude that historical data repositories remain poorly aligned with present day scholarly practices and are unlikely to realize their promise until the social life of data becomes a part of the profession. Because we believe that this is possible we introduce four strategies, each one backed by a successful project, that will help to make data sharing a part of professional practice. These suggestions are: 1) hiring ‘data hoovers’ to solicit and curate data, 2) appealing to close-knit communities and networking their domain-specific archives, 3) rightsizing crowdsourcing tasks, and 4) incorporating peer review. ", "article_title": "Don't Just Build It, They Probably Won't Come: Data Sharing and the Social Life of Data in the Historical Quantitative Social Sciences", "authors": [{"given": "Ruth", "family": "Mostern", "affiliation": [{"original_name": "University of Pittsburgh", "normalized_name": "University of Pittsburgh", "country": "United States", "identifiers": {"ror": "https://ror.org/01an3r305", "GRID": "grid.21925.3d"}}]}, {"given": "Marieka", "family": "Arksey", "affiliation": [{"original_name": "University of Wyoming", "normalized_name": "University of Wyoming", "country": "United States", "identifiers": {"ror": "https://ror.org/01485tq96", "GRID": "grid.135963.b"}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2016", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "10", "issue": "2", "ISSN": [{"value": null, "type": null}]}