{"url": "https://doi.org/10.3366/ijhac.2020.0254", "identifier": {"string_id": "10.3366/ijhac.2020.0254", "id_scheme": "DOI"}, "abstract": " Most people in developed countries, and many in developing countries, interact with Artificial Intelligence (AI) developed algorithms on an almost daily basis, yet very few are aware of those interactions or of their effect upon people's daily lives.1 Using machine learning, automated reasoning, and other forms of AI, algorithms deployed in information systems take actions according to criteria set up by software developers to maximize profits regardless of the overall effects on the autonomy or welfare of individuals or on society as a whole.2 Those criteria almost always involve location-based and place-based data. In this paper, we consider effects of those computational tools on individual choice and autonomy and on societal structure from the humanistic perspectives of philosophy and jurisprudence. Specifically, we: •review contemporaneous literature and quantitative economic evidence on the effects of pervasive tracking and algorithmic controls on individuals and on society in general, •summarize a range of suggested solutions for lessening the adverse effects, and •describe and expand upon selected legal solutions from the literature. ", "article_title": "Being Human in an Algorithmically Controlled World", "authors": [{"given": "Harlan", "family": "Onsrud", "affiliation": [{"original_name": "University of Maine", "normalized_name": "University of Maine", "country": "United States", "identifiers": {"ror": "https://ror.org/01adr0w49", "GRID": "grid.21106.34"}}]}, {"given": "James", "family": "Campbell", "affiliation": [{"original_name": "University of Maine", "normalized_name": "University of Maine", "country": "United States", "identifiers": {"ror": "https://ror.org/01adr0w49", "GRID": "grid.21106.34"}}]}], "publisher": "Edinburgh University Press", "date": "2020", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "14", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}