{"url": "http://dx.doi.org/10.3389/fdigh.2017.00007", "identifier": {"string_id": "10.3389/fdigh.2017.00007", "id_scheme": "DOI"}, "abstract": "Recent approaches have described the evolutionary dynamics of the first Neolithic societies as a cycle of rise and fall. Several authors, using mainly c14 dates as a demographic proxy, identified a general pattern of a boom in population coincident with the arrival of food production economies followed by a rapid decline some centuries afterward in multiple European regions. Concerning Iberia, we also noted that this phenomenon correlates with an initial development of archeological entities (i.e., “cultures”) over large areas (e.g., the Impresso-Cardial in West Mediterranean), followed by a phase of “cultural fragmentation” by the end of Early Neolithic. This results in a picture of higher cultural diversity as an effect of more limited spread of cultural artifacts. In this work, we propose to apply a network approach to the analysis of material culture. In particular, we consider the spatiotemporal patterns of material culture as an emergent effect of local interaction processes. As recent research has pointed out, the spatiotemporal variability of material culture is an emergent phenomenon resulting from individual and group interactions whose structure resembles those of spatially structured complex networks. Our results suggest that the observed global patterns could be explained by the network dynamics, especially by structural (measured as the betweenness centrality) and geographical position of some nodes. The appearance and disappearance of nodes in specific positions correlate with the observed changes in the pattern of material culture distribution throughout the Early Neolithic (c. 7700–6700 cal BP) in East Iberia. In our view, this could be explained by the special role played by those nodes facilitating or limiting the information flow over the entire network. Network growth and posterior fragmentation seem to be the key drivers behind these dynamics.", "article_title": "Iberian Neolithic Networks: The Rise and Fall of the Cardial World", "authors": [{"given": "Joan", "family": "Bernabeu Aubán", "affiliation": [{"original_name": "Research Group PREMEDOC INV-GIUV-270642, Departament de Prehistòria, Arqueologia i Història Antiga, Universitat de València, Spain", "normalized_name": "University of Valencia", "country": "Spain", "identifiers": {"ror": "https://ror.org/043nxc105", "GRID": "grid.5338.d"}}]}, {"given": "Sergi", "family": "Lozano", "affiliation": [{"original_name": "Institut Català de Paleoecologia Humana i Evolució Social, Campus Sescelades, Spain", "normalized_name": "Catalan Institute of Human Paleoecology and Social Evolution", "country": "Spain", "identifiers": {"ror": "https://ror.org/02zbs8663", "GRID": "grid.452421.4"}}]}, {"given": "Salvador", "family": "Pardo-Gordó", "affiliation": [{"original_name": "Universitat Rovira y Virgili (URV), Área de Prehistoria, Spain", "normalized_name": "Rovira i Virgili University", "country": "Spain", "identifiers": {"ror": "https://ror.org/00g5sqv46", "GRID": "grid.410367.7"}}]}], "publisher": "Frontiers Media SA", "date": "2017", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "4", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}