{"url": "https://doi.org/10.3366/ijhac.2011.0009", "identifier": {"string_id": "10.3366/ijhac.2011.0009", "id_scheme": "DOI"}, "abstract": " The digitisation of museum collections provides great opportunities for broad communication and access. However, currently the majority of online ‘virtual’ museums present information two-dimensionally. Three-dimensional data capture using laser scanning provides the potential to generate 3D virtual objects that can be used for a much greater interactive experience. This paper presents the results of a JISC-funded project aimed at the generation of a 3D online museum of an internationally important collection of Egyptological artefacts that have not previously been publicly available. The results from the project demonstrate the value of 3D museums, in addition to highlighting some of the future possibilities for interaction with objects and the ways in which such virtual museums can revolutionise access to collections for education and public interest. It also stresses ways in which such collections can benefit scholars in terms of reference collections, object analysis and interpretation. The question of objectivity and authenticity of virtual collections, in comparison with real objects is raised. ", "article_title": "The Eton Myers collection virtual museum", "authors": [{"given": "Henry P.", "family": "Chapman", "affiliation": [{"original_name": "University of Birmingham", "normalized_name": "University of Birmingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/03angcq70", "GRID": "grid.6572.6"}}]}, {"given": "Vincent L.", "family": "Gaffney", "affiliation": [{"original_name": "University of Bradford", "normalized_name": "University of Bradford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vs8d940", "GRID": "grid.6268.a"}}]}, {"given": "Helen L.", "family": "Moulden", "affiliation": [{"original_name": "University of Birmingham", "normalized_name": "University of Birmingham", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/03angcq70", "GRID": "grid.6572.6"}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2011", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "4", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}