{"url": "https://doi.org/10.3366/ijhac.2017.0194", "identifier": {"string_id": "10.3366/ijhac.2017.0194", "id_scheme": "DOI"}, "abstract": " Interpretation is widely regarded as the core activity of literary studies. Still, the appropriate balance between the plurality and the limitation of possible interpretations is a non-trivial issue. Whereas it is sensible to accept that literary texts can generally have various meanings, it should not be possible to attribute any kind of meaning to a text. Therefore, while interpreters must be allowed to disagree in their analyses, it must at the same time be possible to review whether a disagreement is actually based on adequate reasons like, for example, textual ambiguity or polyvalence. In this paper, we propose a best practice model as one effective means to review disagreement in accordance with literary studies principles. The model has been developed during the collaborative, computer-assisted annotation of literary texts in a project in which short stories have been analyzed narratologically. The examination of inconsistently annotated text passages revealed four types of reasons for disagreement: misinterpretations, deficient definitions of the categories of analysis, dependencies of the relevant categories on preliminary analyses, and textual ambiguity/polyvalence. We argue that only disagreements based on textual ambiguity are considered legitimate or valuable cases of disagreement, whereas the other three types of disagreement can be resolved in a systematic way. ", "article_title": "The Hermeneutic Profit of Annotation: On Preventing and Fostering Disagreement in Literary Analysis", "authors": [{"given": "Evelyn", "family": "Gius", "affiliation": [{"original_name": "TU Darmstadt: Darmstadt, DE", "normalized_name": "TU Darmstadt", "country": "Germany", "identifiers": {"ror": "https://ror.org/05n911h24", "GRID": "grid.6546.1"}}]}, {"given": "Janina", "family": "Jacke", "affiliation": [{"original_name": "University of Hamburg", "normalized_name": "Universität Hamburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00g30e956", "GRID": "grid.9026.d"}}]}], "publisher": "Edinburgh University Press", "date": "2017-10-17", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "11", "issue": "2", "ISSN": [{"value": null, "type": null}]}