{"url": "https://doi.org/10.3366/ijhac.2015.0146", "identifier": {"string_id": "10.3366/ijhac.2015.0146", "id_scheme": "DOI"}, "abstract": " As the study of cinema has increasingly turned to the examination of economic ebbs and industrial flows, rather than focussing its attention solely on the critical evaluation of the films themselves, new analytic techniques and tools have been adopted (and adapted) by film scholars. Key amongst these is the use of innovative visualization techniques that can assist in the understanding of the spatial and temporal features of film industry practices. However, like the cinema itself, visualization carries its own spatial and temporal dimension. This article explores some of the benefits and limitations that derive from the use of spatial visualization technologies in the field of cinema studies. In particular, this research presents a new holistic multivariate approach to spatio-temporal visualization for point based historical data. This method has been developed through extending the spatial presence in timeline graphics and through meaningful spatial classification and representation. ", "article_title": "Petal Diagrams: A New Technique for Mapping Historical Change in the Film Industry", "authors": [{"given": "Alwyn", "family": "Davidson", "affiliation": [{"original_name": "Deakin University", "normalized_name": "Deakin University", "country": "Australia", "identifiers": {"ror": "https://ror.org/02czsnj07", "GRID": "grid.1021.2"}}]}, {"given": "Deb", "family": "Verhoeven", "affiliation": [{"original_name": "Deakin University", "normalized_name": "Deakin University", "country": "Australia", "identifiers": {"ror": "https://ror.org/02czsnj07", "GRID": "grid.1021.2"}}]}, {"given": "Colin", "family": "Arrowsmith", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2015-10-16", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "9", "issue": "2", "ISSN": [{"value": null, "type": null}]}