{"url": "https://doi.org/10.3366/ijhac.2013.0085", "identifier": {"string_id": "10.3366/ijhac.2013.0085", "id_scheme": "DOI"}, "abstract": " This article offers a critique of the transfer of a technological-scientific paradigm of research infrastructure to the field of the humanities. This critique is informed by our experience of formulating user requirements for the European Holocaust Research Infrastructure (EHRI) project, and especially by a series of interviews we undertook with user-facing archivists working at EHRI partner institutions. We argue that the archival voices we recovered during these interviews articulate a range of concerns that clash with some of the major assumptions which frame current discussions about research infrastructure. In particular, we demonstrate that archival research is currently heavily mediated by archivists. And yet, inter-mediation is a theme that is insufficiently explored in recent theorising about research infrastructure. Contextualising our findings within some recent trends in archival science, we show that an infrastructure such as the EHRI must be build around the complex relationship between scholar, archivist and archive. We conclude by indicating how building infrastructures for humanities research may enable us to fruitfully re-conceptualise and re-energise this relationship by transposing it from the physical world to digital environments. ", "article_title": "The Missing Voice: Archivists and Infrastructures for Humanities Research", "authors": [{"given": "Reto", "family": "Speck", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Petra", "family": "Links", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2013", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "7", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}