{"url": "https://doi.org/10.3366/ijhac.2015.0151", "identifier": {"string_id": "10.3366/ijhac.2015.0151", "id_scheme": "DOI"}, "abstract": " This paper explores the limits of spatial representation for understanding historic mobilities in a rural Australian setting. For this research, an historical GIS was populated from paper map archives denoting where and when bitumen roads were sealed in the Bega Valley, NSW. Using existing geospatial methods, a temporally sensitive network analysis was conducted, revealing a picture of regional mobility reshaped by modernist infrastructure improvements. Yet a straightforward binary pitting sealed roads as ‘good’ vs unsealed roads as ‘bad’ was challenged in subsequent qualitative interviews with long-time residents. Instead, a range of opinions emerged about the role that differing road surfaces played in everyday and historic mobilities. A fuller picture of the motivations and cultural associations of bitumen vs dirt road driving resulted from deploying humanities research methods of interviewing and discourse analysis. Such an approach revealed preferences and motivations that sometimes challenged inferences gained from mapping results alone. There are limits then in relying solely on historical cartographic data to produce maps and spatial representations and existing humanities techniques may hold, in some instances, greater explanatory power. ", "article_title": "Maps and Mobilities: On the Possibilities and Limits of Spatial Technologies for Humanities Research", "authors": [{"given": "Chris", "family": "Brennan-Horley", "affiliation": [{"original_name": "University of Wollongong", "normalized_name": "University of Wollongong", "country": "Australia", "identifiers": {"ror": "https://ror.org/00jtmb277", "GRID": "grid.1007.6"}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2015-10-16", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "9", "issue": "2", "ISSN": [{"value": null, "type": null}]}