{"url": "https://doi.org/10.3366/ijhac.2020.0243", "identifier": {"string_id": "10.3366/ijhac.2020.0243", "id_scheme": "DOI"}, "abstract": "At the University of Limoges in the center of France, we started developing an Historical Atlas of the region of Limousin (AHL) in 2014. The Atlas is one part of a project to gather spatial-temporal information and historical sources about the history of the region. It offers an editorial space and cartographic interface where the regional and scientific community can interact, share, and disseminate their historical knowledge and data. As such, this project represents a close interdisciplinary exchange between historians, archeologists, geographers, GIS and data scientists, as well as varied data producers such as public actors (universities, local authorities, archives), private societies (archeology and tourist operators) and associations. This article tells the story of this dialogue and explains the interdisciplinary, multimedia and spatial-temporal data model and public interface that resulted from it. ", "article_title": "Construction and Management of a Geo-Historical Information System for an Interdisciplinary and Contributory Atlas: The Historical Atlas of Limousin", "authors": [{"given": "Juliette", "family": "Morel", "affiliation": [{"original_name": "Sorbonne Université", "normalized_name": "Sorbonne University", "country": "France", "identifiers": {"ror": "https://ror.org/02en5vm52", "GRID": "grid.462844.8"}}]}, {"given": "Rémi", "family": "Crouzevialle", "affiliation": [{"original_name": "Université de Limoges", "normalized_name": "University of Limoges", "country": "France", "identifiers": {"ror": "https://ror.org/02cp04407", "GRID": "grid.9966.0"}}]}, {"given": "Anne", "family": "Massoni", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Edinburgh University Press", "date": "2020", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "14", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}