{"url": "https://doi.org/10.3366/E1753854809000329", "identifier": {"string_id": "10.3366/E1753854809000329", "id_scheme": "DOI"}, "abstract": " In the present investigation we aim to determine to which degree various linguistic factors contribute to the intelligibility of Swedish words among Danes. We correlated the results of an experiment on word intelligibility with eleven linguistic factors and carried out logistic regression analyses. In the experiment, the intelligibility of 384 frequent Swedish words was tested among Danish listeners via the Internet. The choice of eleven linguistic factors was motivated by their contribution to intelligibility in earlier studies. The highest correlation was found in the negative correlation between word intelligibility and phonetic distances. Also word length, different syllable numbers, foreign sounds, neighbourhood density, word frequency, orthography, and the absence of the prosodic phenomenon of ‘stød’ in Swedish contribute significantly to intelligibility. Although the results thus show that linguistic factors contribute to the intelligibility of single words, the amount of explained variance was not very large (R2 (Cox and Snell)=.16, R2 (Nagelkerke)=.21) when compared with earlier studies which were based on aggregate intelligibility. Partly, the lower scores result from the logistic regression model used. It was necessary to use logistic regression in our study because the intelligibility scores were coded in a binary variable. Additionally, we attribute the lower correlation to the higher number of idiosyncrasies of single words compared with the aggregate intelligibility and linguistic distance used in earlier studies. Based on observations in the actual data from the intelligibility experiment, we suggest further steps to be taken to improve the predictability of word intelligibility. ", "article_title": "Linguistic Determinants of the Intelligibility of Swedish Words among Danes", "authors": [{"given": "Sebastian", "family": "Kürschner", "affiliation": [{"original_name": "University of Erlangen-Nürnberg", "normalized_name": "University of Erlangen-Nuremberg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00f7hpc57", "GRID": "grid.5330.5"}}]}, {"given": "Charlotte", "family": "Gooskens", "affiliation": [{"original_name": "University of Groningen", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}, {"given": "Renée", "family": "van Bezooijen", "affiliation": [{"original_name": "University of Nijmegen", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2009-09-17", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "2", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}