{"url": "https://doi.org/10.3366/E1753854809000391", "identifier": {"string_id": "10.3366/E1753854809000391", "id_scheme": "DOI"}, "abstract": " Levenshtein distance, also known as string edit distance, has been shown to correlate strongly with both perceived distance and intelligibility in various Indo-European languages (Gooskens and Heeringa, 2004; Gooskens, 2006). We apply Levenshtein distance to dialect data from Bai (Allen, 2004), a Sino-Tibetan language, and Hongshuihe (HSH) Zhuang (Castro and Hansen, accepted), a Tai language. In applying Levenshtein distance to languages with contour tone systems, we ask the following questions: 1) How much variation in intelligibility can tone alone explain? and 2) Which representation of tone results in the Levenshtein distance that shows the strongest correlation with intelligibility test results? This research evaluates six representations of tone: onset, contour and offset; onset and contour only; contour and offset only; target approximation (Xu & Wang, 2001), autosegments of H and L, and Chao's (1930) pitch numbers. For both languages, the more fully explicit onset-contour-offset and onset-contour representations showed significantly stronger inverse correlations with intelligibility. This suggests that, for cross-dialectal listeners, the optimal representation of tone in Levenshtein distance should be at a phonetically explicit level and include information on both onset and contour. ", "article_title": "Representing Tone in Levenshtein Distance", "authors": [{"given": "Cathryn", "family": "Yang", "affiliation": [{"original_name": "La Trobe University", "normalized_name": "La Trobe University", "country": "Australia", "identifiers": {"ror": "https://ror.org/01rxfrp27", "GRID": "grid.1018.8"}}]}, {"given": "Andy", "family": "Castro", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2009", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "2", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}