{"url": "https://doi.org/10.3366/ijhac.2013.0090", "identifier": {"string_id": "10.3366/ijhac.2013.0090", "id_scheme": "DOI"}, "abstract": " The spatial turn within the humanities and need for data richness has led to the re-conceptualisation and exploration of maps as ‘deep maps.’ Building narratives of place is becoming increasingly contingent on data landscapes as opposed to the physical landscapes within which they are situated. To make the assumption that GIS can form the basis for deep maps is to privilege the spatial dimension (and spatial data) over all others. We have sought in our experimentation to take a more open, balanced approach as to how a deep map might be organised as a way of learning/reflecting on what elements a framework should contain. Our subject matter here necessitated attention to the challenges and potentialities of deep mapping ‘things deemed religious.’ We found spatial navigation to be useful for visualizing physical and metaphysical linkages, integrating the geographical portions of our spatial narrative as well as organizing thoughts off the map. ", "article_title": "Envisioning Deep Maps: Exploring the Spatial Navigation Metaphor in Deep Mapping", "authors": [{"given": "Katie", "family": "Oxx", "affiliation": [{"original_name": "Saint Joseph's University (PA, USA)", "normalized_name": "Saint Joseph's University", "country": "United States", "identifiers": {"ror": "https://ror.org/05q87sg56", "GRID": "grid.262952.8"}}]}, {"given": "Allan", "family": "Brimicombe", "affiliation": [{"original_name": "University of East London", "normalized_name": "University of East London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/057jrqr44", "GRID": "grid.60969.30"}}]}, {"given": "Johnathan", "family": "Rush", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2013", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "7", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}