{"url": "https://doi.org/10.3366/ijhac.2015.0150", "identifier": {"string_id": "10.3366/ijhac.2015.0150", "id_scheme": "DOI"}, "abstract": " Situated in the wake of the first and second waves of the Digital Humanities, the Digital Literary Atlas of Ireland, 1922–1949 website provides interactive mapping and timeline features for academics and members of the public who are interested in the intersection of Irish literary culture, history, and environment. The site hosts Google Earth software produced interfaces with the EXHIBIT Timeline functions made available by the Semantic Interoperability of Metadata and Information in unLike Environments (SIMILE) project, developed and hosted by the Massachusetts Institute of Technology's (MIT) Computer Science and Artificial Intelligence Laboratory (CSAIL) and Library. This paper's case study maps the biographical lifepath of the writer Samuel Beckett using digital humanities techniques such as ergodicity, and deformance. The geo-digital-timeline mapping of his biography allows us to visualize the shift in Beckett's literary perspective from a latent Cartesian verisimilitude to more phenomenological and fragmented, existential impressions of time and place. The atlas's visualizations of his Wanderjahre years in various European metropoles chart the intellectual and aesthetic influences shaping the Beckettian literary landscapes of his later and better-known works, such as En Attendant Godot (1953). Beckett's thought, works, and shifts in perception provide insight into how digital cultural mapping practices and third wave digital humanities methodologies and tools can be conceptualized and operationalized. ", "article_title": "Acts of Perception: Samuel Becket, Time, Space and the Digital Literary Atlas of Ireland, 1922–1949", "authors": [{"given": "Charles", "family": "Travis", "affiliation": [{"original_name": "University of Dublin Trinity College: Dublin, IE", "normalized_name": "Trinity College", "country": "Canada", "identifiers": {"ror": "https://ror.org/019dhar59", "GRID": "grid.440018.9"}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2015", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "9", "issue": "2", "ISSN": [{"value": null, "type": null}]}