{"url": "https://doi.org/10.3366/ijhac.2020.0247", "identifier": {"string_id": "10.3366/ijhac.2020.0247", "id_scheme": "DOI"}, "abstract": " Finding and selecting interesting and relevant information in large online digital text archives can be challenging. We tackle this information access problem from a geographic information science perspective using a case study exploring a semi-structured historical encyclopedia. We propose a three-pronged approach for this, based around (1) automatic retrieval of spatio-temporal and thematic information from digital text documents; (2) transformation of the extracted information to spatialize and visualize spatio-temporal and thematic structures; and (3) integration of the spatialized displays in an interactive web interface driven by a user-centered design and evaluation approach. We implemented an interactive spatialized network display to allow identification of spatio-temporal relationships hidden in the text archive, complemented by an interactive self-organizing map display to visualize thematic relationships in these text documents. We evaluated the utility and usability of the developed interface in a user study with digital humanities scholars. Empirical results show that the developed interface supports target users in the humanities uncovering latent spatio-temporal and thematic relationships and generated new insights through the spatialized text collection. Adopting this approach, we illustrate one avenue to addressing the information access problem in the digital humanities from a GIScience perspective. ", "article_title": "How Can Geographic Information in Text Documents be Visualized to Support Information Exploration in the Humanities?", "authors": [{"given": "André", "family": "Bruggmann", "affiliation": [{"original_name": "University of Zurich", "normalized_name": "University of Zurich", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02crff812", "GRID": "grid.7400.3"}}]}, {"given": "Sara I.", "family": "Fabrikant", "affiliation": [{"original_name": "University of Zurich", "normalized_name": "University of Zurich", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02crff812", "GRID": "grid.7400.3"}}]}, {"given": "Ross S.", "family": "Purves", "affiliation": [{"original_name": "University of Zurich", "normalized_name": "University of Zurich", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02crff812", "GRID": "grid.7400.3"}}]}], "publisher": "Edinburgh University Press", "date": "2020", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "14", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}