{"url": "https://doi.org/10.3366/ijhac.2011.0008", "identifier": {"string_id": "10.3366/ijhac.2011.0008", "id_scheme": "DOI"}, "abstract": " The paper describes the key concepts and formal grammatical structures underpinning the design of a domain specific language (DSL) developed for dynamically specifying the logical choice-relationships between events and cues within live performance. A brief survey of existing approaches to describing and modelling live performance is given, both those based on generic terms together with approaches specific to particular genres and styles. The development of a generalised model of performer-activity in live performance is then introduced together with logical structures developed from the generic model which inform the language design and allow it to integrate with a wide range of performance traditions and genres. The implementation and application of these ideas in developing the Emerge language is explored through both a formal grammar and a discussion of the choices that had to be made between ease of use for the intended target users and grammatical simplicity. The features of the prototype software and language are briefly described showing how they might enable artists, both individually and collaboratively, to specify decision-making structures in advance of a performance and participate in shaping a performance as it proceeds. ", "article_title": "Words of power: Emerge, a language for the dynamic control of live performance", "authors": [{"given": "Ian", "family": "Willcock", "affiliation": [{"original_name": "University of Hertfordshire", "normalized_name": "University of Hertfordshire", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0267vjk41", "GRID": "grid.5846.f"}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2011-03-24", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "4", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}