{"url": "http://dx.doi.org/10.3389/fdigh.2017.00003", "identifier": {"string_id": "10.3389/fdigh.2017.00003", "id_scheme": "DOI"}, "abstract": "The rapid progress of deep neural network architectures is allowing both to automate the production of artworks and to extend the domain of creative expression. As such, it is opening new ground for professional and amateur artists alike. A major asset of these new computer processes is their capacity to derive, from a training phase, a generative model from which new artifacts can be produced. This attribute allows for a wide range of novel applications. New music or paintings in the style of famous artists can be produced at the click of a button, or combined to form new artworks. New graphical compositions can be “hallucinated” by the deep algorithmic models to produce striking, unexpected, visual forms. By the same token, the dependence on preexisting, protected, artworks lays the ground for potential zones of friction with the rights holders of the source data that helped shape the generative model. This articulation, between the popular creative movement initiated by the deep neural architectures and the preexisting rights of the authors, leads to a confrontation between the present legal framework for the protection of artistic creations and the new modalities offered by these new technological objects. The present work will address the conditions of protection of creations generated by deep neural networks under the main copyright regimes.", "article_title": "Deep Creations: Intellectual Property and the Automata", "authors": [{"given": "Jean-Marc", "family": "Deltorn", "affiliation": [{"original_name": "Laboratory EA 4375, Centre d’études internationales de la propriété intellectuelle, Strasbourg University, France", "normalized_name": "University of Strasbourg", "country": "France", "identifiers": {"ror": "https://ror.org/00pg6eq24", "GRID": "grid.11843.3f"}}]}], "publisher": "Frontiers Media SA", "date": "2017-02-01", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "4", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}