{"url": "http://dx.doi.org/10.3389/fdigh.2017.00004", "identifier": {"string_id": "10.3389/fdigh.2017.00004", "id_scheme": "DOI"}, "abstract": "The period between the beginning of the Early Iron Age and the end of the Archaic Period is a time of changes and developments in the Italian Peninsula, which led to the creation of regional ethnic and political groups and to the formation of the first city-states in Western Europe. In the present study, we focus on the evolution of terrestrial route network in the Tyrrhenian region of Latium vetus as it has been hypothesized by scholars from the archeological evidence. Our main goal is to investigate the mechanisms linking decision making processes and the structure of transportation networks. We first attempted to replicate some of its features applying three models previously elaborated for the neighboring region of Southern Etruria. Since it was not possible to attain entirely satisfactory results, we modified the model that performed better in the Etruscan region by including a tunable amount of rich-get-richer bias, which improved considerably its performance. Our results suggest that coordinated decision making with a slightly unbalanced power was responsible for the peculiar characteristics of the route network topology of Latium vetus. Moreover, the mechanism implemented by this model implies that places located at favorable positions can build on their initial advantage and get more and more powerful. This fits very well with the picture elaborated by different scholars on the nature of power balance and dynamics in this region.", "article_title": "Coordinated Decisions and Unbalanced Power. How Latin Cities Shaped Their Terrestrial Transportation Network", "authors": [{"given": "Francesca", "family": "Fulminante", "affiliation": [{"original_name": "Division of Humanities, Università degli Studi Roma Tre, Italy", "normalized_name": "Roma Tre University", "country": "Italy", "identifiers": {"ror": "https://ror.org/05vf0dg29", "GRID": "grid.8509.4"}}]}, {"given": "Luce", "family": "Prignano", "affiliation": [{"original_name": "Division of Archaeology, University of Cambridge, UK", "normalized_name": "University of Cambridge", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/013meh722", "GRID": "grid.5335.0"}}]}, {"given": "Ignacio", "family": "Morer", "affiliation": [{"original_name": "Departament de Fisica de la Matèria Condensada, Universitat de Barcelona, Spain", "normalized_name": "University of Barcelona", "country": "Spain", "identifiers": {"ror": "https://ror.org/021018s57", "GRID": "grid.5841.8"}}]}, {"given": "Sergi", "family": "Lozano", "affiliation": [{"original_name": "Departament de Fisica de la Matèria Condensada, Universitat de Barcelona, Spain", "normalized_name": "University of Barcelona", "country": "Spain", "identifiers": {"ror": "https://ror.org/021018s57", "GRID": "grid.5841.8"}}]}], "publisher": "Frontiers Media SA", "date": "2017-02-13", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "4", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}