{"url": "https://doi.org/10.3366/ijhac.2016.0156", "identifier": {"string_id": "10.3366/ijhac.2016.0156", "id_scheme": "DOI"}, "abstract": " At the heart of the emergence and development of the Digital Humanities has been the potential to move beyond the out-dated epistemological and metaphysical dichotomies of the later 20th century including quantitative-qualitative, pure-applied, and campus-community. Despite significant steps forward, this potential has been only partially realized as illustrated by DH pioneer Edward L. Ayers’ recent question, ‘Does Digital Scholarship have a future?’ As a way to think through current challenges and opportunities, this paper reflects on the building and initial use of the Canadian Century Research Infrastructure (CCRI). As one of the largest projects in the history of the social sciences and humanities, CCRI enables research on the making of modern Canada by offering complex databases that cover the first half of the twentieth century. Built by scholars from multiple disciplines from coast-to-coast and in collaboration with government agencies and the private sector, CCRI team members came to grips with key DH questions especially those faced by interdisciplinary, multi-institutional, cross-sectoral and internationally-connected initiatives. Thinking through this experience does not generate simple recipes or lessons-learned but does offer promising practices as well as new questions for future scholarly consideration. ", "article_title": "Mindset and Guidelines: Insights to Enhance Collaborative, Campus-wide, Cross-sectoral Digital Humanities Initiatives", "authors": [{"given": "Chad", "family": "Gaffield", "affiliation": [{"original_name": "University of Ottawa", "normalized_name": "University of Ottawa", "country": "Canada", "identifiers": {"ror": "https://ror.org/03c4mmv16", "GRID": "grid.28046.38"}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2016", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "10", "issue": "1", "ISSN": [{"value": null, "type": null}]}