{"url": "https://doi.org/10.3366/ijhac.2020.0252", "identifier": {"string_id": "10.3366/ijhac.2020.0252", "id_scheme": "DOI"}, "abstract": " The importance of spatial precision in geographic information science is not limited to quantitative data. As spatial data can also exist in qualitative form, modifying a discourse quality index from the field of discourse ethics can help understand whether mentioning specific spatial locations changes the quality of spatial narratives. The discourse quality index was modified by incorporating an item into the index that detected the presence and magnitude of a spatial precision construct. The spatial narratives analyzed with this modified index were 151 public comments submitted during a public policy revision process, for a national forest plan revision at the Chugach National Forest in Alaska, USA. Analysis showed when discourse quality values underwent a comparison of means test, the values were significantly changed between comments with no spatial precision versus those considered to have spatial precision. The results suggest, preliminarily, that employing spatial precision in narratives changes discourse quality during deliberative activities. Further, the way in which people use spatial precision to communicate during a policy revision process can impact how spatial narratives are understood and valued. ", "article_title": "The Role of Precision in Spatial Narratives: Using a Modified Discourse Quality Index to Measure the Quality of Deliberative Spatial Data", "authors": [{"given": "Christopher", "family": "Marder", "affiliation": [{"original_name": "USC Dorsnife Spatial Sciences Institute", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Jennifer", "family": "Bernstein", "affiliation": [{"original_name": "USC Dorsnife Spatial Sciences Institute", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Edinburgh University Press", "date": "2020", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "14", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}