{"url": "http://dx.doi.org/10.3389/fdigh.2018.00002", "identifier": {"string_id": "10.3389/fdigh.2018.00002", "id_scheme": "DOI"}, "abstract": "The field of Spatial Humanities has advanced substantially in the past years. The identification and extraction of toponyms and spatial information mentioned in historical text collections has allowed its use in innovative ways, making possible the application of spatial analysis and the mapping of these places with geographic information systems. For instance, automated place name identification is possible with Named Entity Recognition (NER) systems. Statistical NER methods based on supervised learning, in particular, are highly successful with modern datasets. However, there are still major challenges to address when dealing with historical corpora. These challenges include language changes over time, spelling variations, transliterations, OCR errors, and sources written in multiple languages among others. In this article, considering a task of place name recognition over two collections of historical correspondence, we report an evaluation of five NER systems and an approach that combines these through a voting system. We found that although individual performance of each NER system was corpus dependent, the ensemble combination was able to achieve consistent measures of precision and recall, outperforming the individual NER systems. In addition, the results showed that these NER systems are not strongly dependent on preprocessing and translation to Modern English.", "article_title": "Ensemble Named Entity Recognition (NER): Evaluating NER Tools in the Identification of Place Names in Historical Corpora", "authors": [{"given": "Miguel", "family": "Won", "affiliation": [{"original_name": "Instituto Superior Técnico, INESC-ID, Universidade de Lisboa, Portugal", "normalized_name": "University of Lisbon", "country": "Portugal", "identifiers": {"ror": "https://ror.org/01c27hj86", "GRID": "grid.9983.b"}}]}, {"given": "Patricia", "family": "Murrieta-Flores", "affiliation": [{"original_name": "History Department, Digital Humanities Hub, Lancaster University, United Kingdom", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}, {"given": "Bruno", "family": "Martins", "affiliation": [{"original_name": "Instituto Superior Técnico, INESC-ID, Universidade de Lisboa, Portugal", "normalized_name": "University of Lisbon", "country": "Portugal", "identifiers": {"ror": "https://ror.org/01c27hj86", "GRID": "grid.9983.b"}}]}], "publisher": "Frontiers Media SA", "date": "2018", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "5", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}