{"url": "https://doi.org/10.3366/ijhac.2017.0193", "identifier": {"string_id": "10.3366/ijhac.2017.0193", "id_scheme": "DOI"}, "abstract": " While most literary scholars wish to help readers understand literary texts by providing them with explanatory annotations, we want to go a step further and enable them, on the basis of structured information, to arrive at interpretations of their own. We therefore seek to establish a concept of explanatory annotation that is reader-oriented and combines hermeneutics with the opportunities provided by digital methods. In a first step, we are going to present a few examples of existing annotations that apparently do not take into account readerly needs. To us, they represent seven types of common problems in explanatory annotation. We then introduce a possible model of best practice which is based on categories and structured along the lines of the following questions: What kind(s) of annotations do improve text comprehension? Which contexts must be considered when annotating? Is it possible to develop a concept of the reader on the basis of annotations—and can, in turn, annotations address a particular kind of readership, i.e.: in how far can annotations be(come) individualised? ", "article_title": "Explanatory Annotation of Literary Texts and the Reader: Seven Types of Problems", "authors": [{"given": "Matthias", "family": "Bauer", "affiliation": [{"original_name": "University of Tübingen", "normalized_name": "University of Tübingen", "country": "Germany", "identifiers": {"ror": "https://ror.org/03a1kwz48", "GRID": "grid.10392.39"}}]}, {"given": "Angelika", "family": "Zirker", "affiliation": [{"original_name": "Universität Tübingen", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Edinburgh University Press", "date": "2017-10-17", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "11", "issue": "2", "ISSN": [{"value": null, "type": null}]}