{"url": "http://dx.doi.org/10.3389/fdigh.2019.00004", "identifier": {"string_id": "10.3389/fdigh.2019.00004", "id_scheme": "DOI"}, "abstract": "The promise of digitization of historical archives lies in their indexation at the level of contents. Unfortunately, this kind of indexation does not scale, if done manually. In this article we present a method to bootstrap the deployment of a content-based information system for digitized historical archives, relying on historical indexing tools. Commonly prepared to search within homogeneous records when the archive was still current, such indexes were as widespread as they were disconnected, that is to say situated in the very records they were meant to index. We first present a conceptual model to describe and manipulate historical indexing tools. We then introduce a methodological framework for their use in order to guide digitization campaigns and index digitized historical records. Finally, we exemplify the approach with a case study on the indexation system of the X Savi alle Decime in Rialto, a Venetian magistracy in charge for the exaction—and related record keeping—of a tax on real estate in early modern Venice.", "article_title": "Index-Driven Digitization and Indexation of Historical Archives", "authors": [{"given": "Giovanni", "family": "Colavizza", "affiliation": [{"original_name": "Digital Humanities Laboratory, École Polytechnique Fédérale de Lausanne, The Alan Turing Institute, Switzerland", "normalized_name": "The Alan Turing Institute", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/035dkdb55", "GRID": "grid.499548.d"}}]}, {"given": "Maud", "family": "Ehrmann", "affiliation": [{"original_name": "The Alan Turing Institute, United Kingdom", "normalized_name": "The Alan Turing Institute", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/035dkdb55", "GRID": "grid.499548.d"}}]}, {"given": "Fabio", "family": "Bortoluzzi", "affiliation": [{"original_name": "Centre for Science and Technology Studies (CWTS), Leiden University, Netherlands", "normalized_name": "Leiden University", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/027bh9e22", "GRID": "grid.5132.5"}}]}], "publisher": "Frontiers Media SA", "date": "2019", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "6", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}