{"url": "https://doi.org/10.3366/ijhac.2018.0205", "identifier": {"string_id": "10.3366/ijhac.2018.0205", "id_scheme": "DOI"}, "abstract": " John Milton's 1644 declaration that ‘Books are not absolutely dead things’ makes him a rock star among undergraduate English majors who are covetous of the material, reassuringly physical book. This essay explores that metonymic dichotomy through a project that combined the ‘old’ technology of the hand-press book and the ‘new’ technology of GIS story-telling. Using a visiting special collection of rare books for students at a small college, the project approached hand-press era books in three phases: 1) a bibliographic description and transcription; 2) book forensics, and 3) a ‘deep map’ of a book. With mapping—understood as an expression of spatial thinking—as a guide, students recognized that the singular text, even the dialogic text, is far less remarkable than locating and articulating the links between history, place, literature, and culture. Students engaged with terminology (descriptive bibliography), recognized the temporal lines of the book as an object (provenance), followed the development of a book as a polyglotous intellectual entity, and reviewed the geographic/historical experiences of the author and of the book (biography, publishing). The spatial turn allowed students to construct (and in some cases, deconstruct) the cultural world in which texts, authors and printers collide. ", "article_title": "‘Books are not absolutely dead things’: English Literature, Material Culture and Mapping Text", "authors": [{"given": "Catherine R.", "family": "Eskin", "affiliation": [{"original_name": "Florida Southern College", "normalized_name": "Florida Southern College", "country": "United States", "identifiers": {"ror": "https://ror.org/026hjc247", "GRID": "grid.454559.c"}}]}], "publisher": "Edinburgh University Press", "date": "2018-03-14", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "12", "issue": "1", "ISSN": [{"value": null, "type": null}]}