{"url": "https://doi.org/10.3366/ijhac.2019.0230", "identifier": {"string_id": "10.3366/ijhac.2019.0230", "id_scheme": "DOI"}, "abstract": " This article responds to the widespread and oft-noted challenges digital humanists face in working with data that is uncertain and characterised by complex narratives. Using an example drawn from the vast archives of post-war interviews with Holocaust survivors, it draws on approaches developed in Qualitative Spatial Representation (QSR) to explore how two key spatial aspects of survivor's narratives – their uncertain wartime trajectories and the slippage in scales as these are retold – can be represented. Spatial information in narratives tends to not provide the exact coordinates necessary to store the information in geospatial databases. Instead, narratives rely much more on often less precise qualitative spatial relations such as ‘near’, ‘next to’, ‘at the corner of’ without precise geometric interpretations. Given that relational databases are ill-equipped to store this kind of relational spatial knowledge from natural language sources, the article argues for a need for digital humanists to return to first principles and reconsider database design. Descriptive triple-based graph representations, which have been devised to accommodate this kind of highly irregular, semi-structured relational knowledge, have the potential to work with, rather than against, the grain of the narrative sources that underlie the work of much of the digital humanities. ", "article_title": "Geographies of the Holocaust: Experiments in GIS, QSR, and Graph Representations", "authors": [{"given": "Tim", "family": "Cole", "affiliation": [{"original_name": "University of Bristol", "normalized_name": "University of Bristol", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0524sp257", "GRID": "grid.5337.2"}}]}, {"given": "Torsten", "family": "Hahmann", "affiliation": [{"original_name": "University of Maine", "normalized_name": "University of Maine", "country": "United States", "identifiers": {"ror": "https://ror.org/01adr0w49", "GRID": "grid.21106.34"}}]}], "publisher": "Edinburgh University Press", "date": "2019-10-16", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "13", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}