{"url": "https://doi.org/10.3366/ijhac.2019.0231", "identifier": {"string_id": "10.3366/ijhac.2019.0231", "id_scheme": "DOI"}, "abstract": " For some time now, the field of Spatial Humanities has acknowledged the need for a system capable of the spatial exploration of historical and archaeological phenomena beyond Geographic Information Systems (GIS). This idea comes from the need to analyse holistically spatial information, including that which is not geographic (i.e. vague, symbolic and imaginary space). In addition, this need becomes more apparent when dealing with traditions that do not conform to the Modern/European/Cartesian conception of space in which GIS is rooted. This article, explores the use of Qualitative Spatial Representation (QSR) and Semantic Triples as possible alternative means to model complex and diverse expressions of spatial information, including social and symbolic conceptions in 16th century Mexican maps. Using as case study the map from the region of Atengo-Misquiahuala (Hidalgo) which combine the Mesoamerican and European traditions, we explore how these approaches might open new venues of research, potentially shedding light to long discussed and problematic Mesoamerican spatial categories. Focusing on a contained and partial example, we examine from a theoretical perspective and as a starting point, the possible future implementation of these approaches for historical and archaeological research. ", "article_title": "Spatial Humanities 3.0: Qualitative Spatial Representation and Semantic Triples as New Means of Exploration of Complex Indigenous Spatial Representations in Sixteenth Century Early Colonial Mexican Maps", "authors": [{"given": "Patricia", "family": "Murrieta-Flores", "affiliation": [{"original_name": "Lancaster University", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}, {"original_name": "University of Chester", "normalized_name": "University of Chester", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01drpwb22", "GRID": "grid.43710.31"}}]}, {"given": "Mariana", "family": "Favila-Vázquez", "affiliation": [{"original_name": "Museo Templo Mayor, Mexico City, MX", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Aban", "family": "Flores-Morán", "affiliation": [{"original_name": "Universidad Nacional Autónoma de México", "normalized_name": "National Autonomous University of Mexico", "country": "Mexico", "identifiers": {"ror": "https://ror.org/01tmp8f25", "GRID": "grid.9486.3"}}]}], "publisher": "Edinburgh University Press", "date": "2019", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "13", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}