{"url": "http://dx.doi.org/10.3389/fdigh.2019.00014", "identifier": {"string_id": "10.3389/fdigh.2019.00014", "id_scheme": "DOI"}, "abstract": "The conventional history of urban growth defines agrarian-based cities prior to the nineteenth century CE as densely inhabited and commonly bounded by defenses such as walls. By contrast industrial-based cities are viewed as more spread out and without marked boundaries. Since the 1960s a trajectory toward extensive, low-density urbanism with sprawling, scattered suburbs surrounding a denser core has been formally recognized and given various names such as megalopolis in the West and desakota in southern and eastern Asia. These sprawling industrial cities have been regarded as a unique derivative of modern phenomena such as mechanized transport and the commercial property market. However, this set of premises are not valid. The agrarian-based world also contained dispersed, low-density urbanism—on its grandest scale, the vast circa 1,000 sq km urban complex of Greater Angkor and the famous Maya cities of lowland Central America with maximum areas of about 200 sq km. The Maya only used pedestrian and riverine transport so the conventional transport explanation for industrial dispersed urbanism is at best partial. There was another trajectory to extensive, low-density settlement forms for places which were generally &lt;15–20 sq km in extent but could on rare occasions reach areas as large as 40 to 90 sq km. Famous examples are Great Zimbabwe, Chaco Canyon and the European oppida of the late 1st millennium BCE. No-formally agreed term is available to refer to them. I will refer to them by default as “Giants.” The three trajectories to low-density settlement form redefine the history of settlement growth and the meanings of the term “urban.” Worryingly, none of the successive low-density settlements derive from any of the low-density cases of the preceding trajectory. Neither Angkor nor the Classic Maya cities have any connection to the industrial low-density cities. By contrast compact cities, the epitome of the obsolete definition of cities display continuity to succeeding urban forms over several 1,000 years. The implications for modern, giant, low-density cities are ominous.", "article_title": "Trajectories to Low-Density Settlements Past and Present: Paradox and Outcomes", "authors": [{"given": "Roland", "family": "Fletcher", "affiliation": [{"original_name": "Department of Archaeology, University of Sydney, Australia", "normalized_name": "University of Sydney", "country": "Australia", "identifiers": {"ror": "https://ror.org/0384j8v12", "GRID": "grid.1013.3"}}]}], "publisher": "Frontiers Media SA", "date": "2019", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "6", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}