{"url": "https://doi.org/10.3366/ijhac.2018.0202", "identifier": {"string_id": "10.3366/ijhac.2018.0202", "id_scheme": "DOI"}, "abstract": " A central challenge in short-term study abroad programs is making sure that students have meaningful interactions with people abroad, something that scholarship has shown to be tremendously beneficial, both for linguistic gains and for cross-cultural exchange. This article examines the potential benefits of collaborative mapping for encouraging student interaction with local residents, while also considering the value of spatial analysis to the interdisciplinary aims of a course centered on theatre and French Studies. One author is a cultural anthropologist and professor of French, and the other is a professor of theatre. The course explores theatre as a window into French society and culture in three distinct geographic settings (Avignon and the rural Vaucluse, Marseille, and Paris). Space is important to its study of theatrical literature, of theatrical form and site-specific performance, and of the varied meanings of theatre to people living in diverse social environments, including rural settings and neighborhoods in urban centers and peripheries. Written prior to implementing the project for the 2017 version of the course, this article examines a mapping project intended to fully exploit the opportunities of study abroad for student engagement with other perspectives abroad, and for inter-disciplinary dialogue and exchange. ", "article_title": "Collaborative Mapping to Enhance Local Engagement and Interdisciplinary Dialogue in a Short-term Study Abroad Program", "authors": [{"given": "Rebecca", "family": "Free", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Mark", "family": "Ingram", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Edinburgh University Press", "date": "2018", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "12", "issue": "1", "ISSN": [{"value": null, "type": null}]}