{"url": "https://doi.org/10.3366/ijhac.2017.0181", "identifier": {"string_id": "10.3366/ijhac.2017.0181", "id_scheme": "DOI"}, "abstract": " Connection to place is important to people's individual and collective identity, a fundamental dimension of humanity. Scholars can shape place-making, but only by guiding the public to their own sense of place rather than telling them how to do so. Scholars must also be aware of the limitations inherent to all representations of place, and work to foster active engagement through multiple avenues of exploration. This paper explains a collaborative project at the Colorado Springs Pioneers Museum that uses methods definitive of a digital geohumanities to bring past landscapes alive, making the spatial connections that narrate the shaping of the city. We developed a deep mapping project where museum visitors a) interface with web-delivered, time-enabled animated maps on standing gallery tables, b) compare historic photos with adjacent contemporary street views on those maps, and c) engage with other geovisualizations that portray historical and geographical change. Visitors also have the opportunity to use mobile devices to take walking tours throughout the city, and to provide their own content and directions for the project. This hybrid of scholarly-led, multi-media narratives blended with public participation and open navigation can be a template for other deep-mapping projects to create connections to place. ", "article_title": "‘The Story of Us’: Place-Making through Public Interaction with Digital GeoHumanities in Colorado Springs", "authors": [{"given": "John", "family": "Harner", "affiliation": [{"original_name": "University of Colorado Colorado Springs", "normalized_name": "University of Colorado Colorado Springs", "country": "United States", "identifiers": {"ror": "https://ror.org/054spjc55", "GRID": "grid.266186.d"}}]}, {"given": "Kevin", "family": "Knapp", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Leah", "family": "Davis-Witherow", "affiliation": [{"original_name": "University of Colorado Colorado Springs", "normalized_name": "University of Colorado Colorado Springs", "country": "United States", "identifiers": {"ror": "https://ror.org/054spjc55", "GRID": "grid.266186.d"}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2017", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "11", "issue": "1", "ISSN": [{"value": null, "type": null}]}