{"url": "http://dx.doi.org/10.3389/fdigh.2017.00008", "identifier": {"string_id": "10.3389/fdigh.2017.00008", "id_scheme": "DOI"}, "abstract": "When data are poor, we resort to theory modeling. This is a two-step process. We have first to identify the appropriate type of model for the system under consideration and then to tailor it to the specifics of the case. To understand settlement formation, which is the concern of this article, this involves choosing not only input parameter values such as site separations but also input functions that characterizes the ease of travel between sites. Although the generic behavior of the model is understood, the details are not. Different choices will necessarily lead to different outputs (for identical inputs). We can only proceed if choices that are “close” give outcomes that are similar. Where there are local differences, it suggests that there was no compelling reason for one outcome rather than the other. If these differences are important for the historic record, we may interpret this as sensitivity to contingency. We re-examine the rise of Greek city-states as first formulated by Rihll and Wilson in 1979, initially using the same “retail” gravity model. We suggest that, although cities like Athens owe their position to a combination of geography and proximity to other sites, the rise of Thebes is the most contingent, whose success reflects social forces outside the grasp of simple network modeling.", "article_title": "Was Thebes Necessary? Contingency in Spatial Modeling", "authors": [{"suffix": "Evans", "given": "Tim S.", "family": "Evans", "affiliation": [{"original_name": "Centre for Complexity Science, Imperial College London, UK", "normalized_name": "Imperial College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/041kmwe10", "GRID": "grid.7445.2"}}]}, {"given": "Ray J.", "family": "Rivers", "affiliation": [{"original_name": "Theoretical Physics, Physics Department, Imperial College London, UK", "normalized_name": "Imperial College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/041kmwe10", "GRID": "grid.7445.2"}}]}], "publisher": "Frontiers Media SA", "date": "2017-05-09", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "4", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}