{"url": "http://dx.doi.org/10.3389/fdigh.2019.00009", "identifier": {"string_id": "10.3389/fdigh.2019.00009", "id_scheme": "DOI"}, "abstract": "Immersive technology, such as virtual reality, provides us with novel opportunities to create and explore affective experiences with a transformative potential mediated through awe. The profound emotion of awe, that is experienced in response to witnessing vastness and creates the need for accommodation that can lead to restructuring of one's worldview and an increased feeling of connectedness. An iconic example of the powers of awe is observed in astronauts who develop instant social consciousness and strong pro-environmental values in response to the overwhelming beauty of Earth observed from space. Here on Earth, awe can also be experienced in response to observing vast natural phenomenon or even sometimes in response to some forms of art, presenting vast beauty to its audience. Can virtual reality provide a new powerful tool for reliably inducing such experiences? What are some unique potentials of this emerging medium? This paper describes the evaluation of an immersive installation “AWE”—Awe-inspiring Wellness Environment. The results indicate that the experience of being in “AWE” can elicit some components of awe emotion and induce minor cognitive shifts in participant's worldview similar to the Overview Effect, while this experience also has its own attributes that might be unique to this specific medium. Comparing the results of this exploratory study to other virtual environments designed to elicit Overview Effect provides insights on the relationship between design features and participant's experience. The qualitative results highlight the importance of perceived safety, personal background and familiarity with the environment, and the induction of a small visceral fear reaction as a part of the emotional arc of the virtual journey—as some of the key contributers to the affective experience of the immersive installation. Even though the observed components of awe and a few indications of cognitive shift support the potential of Virtual Reality as a transformative medium, many more iterations of the design and research tools are required before we can achieve and fully explore a profound awe-inspiring transformative experience mediated through immersive technologies.", "article_title": "Understanding AWE: Can a Virtual Journey, Inspired by the Overview Effect, Lead to an Increased Sense of Interconnectedness?", "authors": [{"given": "Ekaterina R.", "family": "Stepanova", "affiliation": [{"original_name": "iSpace Lab, School Of Interactive Arts and Technology, Simon Fraser University, Canada", "normalized_name": "Simon Fraser University", "country": "Canada", "identifiers": {"ror": "https://ror.org/0213rcc28", "GRID": "grid.61971.38"}}]}, {"given": "Denise", "family": "Quesnel", "affiliation": [{"original_name": "iSpace Lab, School Of Interactive Arts and Technology, Simon Fraser University, Canada", "normalized_name": "Simon Fraser University", "country": "Canada", "identifiers": {"ror": "https://ror.org/0213rcc28", "GRID": "grid.61971.38"}}]}, {"given": "Bernhard E.", "family": "Riecke", "affiliation": [{"original_name": "iSpace Lab, School Of Interactive Arts and Technology, Simon Fraser University, Canada", "normalized_name": "Simon Fraser University", "country": "Canada", "identifiers": {"ror": "https://ror.org/0213rcc28", "GRID": "grid.61971.38"}}]}], "publisher": "Frontiers Media SA", "date": "2019", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "6", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}