{"url": "https://doi.org/10.3366/ijhac.2011.0028", "identifier": {"string_id": "10.3366/ijhac.2011.0028", "id_scheme": "DOI"}, "abstract": " Gazetteers play an important but largely unsung role in historical research, used with maps to help place people and events in spatial context. Recent years have seen new interest in digital gazetteers as bridges between the geospatial web and the semantic web, but many existing digital gazetteers and data models do not meet the needs of historians, as they focus on physiographic landforms rather than places of cultural meaning or administrative units. Historical researchers need to know about places whose locations are not knowable with certainty. They need to know about alternative names for places, about how names have evolved over time, and the specific historical contexts in which names were used. While GIS researchers propose temporal gazetteers, which will somehow include the precise dates at which features were created and removed, we propose historical gazetteers in which dates appear mainly in order to help reference particular instances of place names. Longer term, we need cultural gazetteers or toponymic encyclopedias that describe places as well as locate them. ", "article_title": "On historical gazetteers", "authors": [{"given": "Humphrey", "family": "Southall", "affiliation": [{"original_name": "University of Portsmouth: Portsmouth, Hampshire, GB", "normalized_name": "University of Portsmouth", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/03ykbk197", "GRID": "grid.4701.2"}}]}, {"given": "Ruth", "family": "Mostern", "affiliation": [{"original_name": "University of Pittsburgh", "normalized_name": "University of Pittsburgh", "country": "United States", "identifiers": {"ror": "https://ror.org/01an3r305", "GRID": "grid.21925.3d"}}]}, {"given": "Merrick Lex", "family": "Berman", "affiliation": [{"original_name": "Harvard University: Cambridge, MA, US", "normalized_name": "Harvard University", "country": "United States", "identifiers": {"ror": "https://ror.org/03vek6s52", "GRID": "grid.38142.3c"}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2011-10-28", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "5", "issue": "2", "ISSN": [{"value": null, "type": null}]}