{"url": "https://doi.org/10.3366/ijhac.2015.0147", "identifier": {"string_id": "10.3366/ijhac.2015.0147", "id_scheme": "DOI"}, "abstract": " In the field of cinema history, an increased interest in social experience and context has challenged the centrality of the film and the primacy of textual analysis. The ‘Early Cinema in Scotland, 1896–1927’ research project takes a contextual approach, using geo-database tools to facilitate collaboration. This article shows how spatially-enabled methods can also be mobilized to bring issues of representation back into a cinema history project. We argue that, when the films have not survived, their geographical descriptors as recorded by trade-press reviews and catalogues offer new avenues of analysis. The article argues that foregrounding location as a significant element in the film corpus creates a new point of interconnection between film text and context. The juxtapositions and divergences between the spatial patterns of film production and cinema exhibition are connected to pre-cinematic traditions of representation. The spatial distribution also sheds light on the differences between films made for local and international consumption, reflecting on Scotland's position in relation to discourses of modernity. ", "article_title": "Remote Locations: Early Scottish Scenic Films and Geo-databases", "authors": [{"given": "Maria A.", "family": "Vélez-Serna", "affiliation": [{"original_name": "University of Stirling", "normalized_name": "University of Stirling", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/045wgfr59", "GRID": "grid.11918.30"}}, {"original_name": "University of Stirling", "normalized_name": "University of Stirling", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/045wgfr59", "GRID": "grid.11918.30"}}]}, {"given": "John", "family": "Caughie", "affiliation": [{"original_name": "University of Glasgow", "normalized_name": "University of Glasgow", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vtgdb53", "GRID": "grid.8756.c"}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2015", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "9", "issue": "2", "ISSN": [{"value": null, "type": null}]}