{"url": "http://dx.doi.org/10.3389/fdigh.2015.00003", "identifier": {"string_id": "10.3389/fdigh.2015.00003", "id_scheme": "DOI"}, "abstract": "Large areas within the old urban core of American cities were destroyed in the post-war era as city leaders sought to counteract metropolitan decentralization by implementing urban renewal programs. For the most part, these places were deemed not worthy of documentation; indeed, areas declared as “blighted” were widely viewed as ugly, cancerous threats to the future health of the city and were enthusiastically demolished. For this reason, they have rarely been the object of study. This paper attempts to address the neglect of such lost landscapes by using GIS to provide a means to envision the urban past. Focusing on the case of the old Auraria district in downtown Denver, the paper pursues three aims. The first aim is to develop and test a new method for reconstructing urban landscapes at the district scale using GIS methods and data derived from historic Sanborn fire insurance maps. The second aim is to conduct preliminary analysis of this historic district-scale GIS, focusing on land use, spatial connectivity, and building massing, in order to evaluate its utility in generating new insight into the form, character, and functioning of the historic city core. The third aim is to assess the degree to which historic urban reconstructions of this kind can become valuable tools in contemporary urban planning efforts.", "article_title": "Envisioning the Urban Past: GIS Reconstruction of a Lost Denver District", "authors": [{"given": "Brian", "family": "Page", "affiliation": [{"original_name": "Department of Geography and Environmental Sciences, University of Colorado Denver, USA", "normalized_name": "University of Colorado Denver", "country": "United States", "identifiers": {"ror": "https://ror.org/02hh7en24", "GRID": "grid.241116.1"}}]}, {"given": "Eric", "family": "Ross", "affiliation": [{"original_name": "Department of Geography and Environmental Sciences, University of Colorado Denver, USA", "normalized_name": "University of Colorado Denver", "country": "United States", "identifiers": {"ror": "https://ror.org/02hh7en24", "GRID": "grid.241116.1"}}]}], "publisher": "Frontiers Media SA", "date": "2015", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "2", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}