{"url": "https://doi.org/10.3366/ijhac.2018.0218", "identifier": {"string_id": "10.3366/ijhac.2018.0218", "id_scheme": "DOI"}, "abstract": " Primary historical source materials represent a very real challenge to GIS. In contrast to modern datasets where tabulated and structured data usually correspond neatly to fixed boundary units, primary historical source materials occur in predominantly unstructured text format. In these instances, people, events, and places must be unraveled from handwritten scripts and, if possible, subsequently linked and coupled to some form of mapping. In this paper, a database solution to handling primary source material is discussed that enables the original text and its translation to be ingested into the system and for people, familial relations, events, and images to be linked and queried in real time. In particular, the system connects these databases via toponyms to a tightly coupled mapping interface. The system enables thesauri of people's names and places to be created on-the-fly and allows levels of confidence to be assigned by the investigator to these matches. Full database and toponymic search and linking capability is enabled. In addition, a mobile application supports investigation in the field to access details in the databases at the same time as ingesting additional data and information in real-time to the system. Through the use of this dynamic database coupling and union to a map interface it is proposed that the system provides a powerful platform for use with primary unstructured source material and contributes to a deeper mapping and understanding of historical place. ", "article_title": "Deepening Historical GIS: An Integrated Database Solution for Linking People, Place and Events through Unstructured Text", "authors": [{"given": "Jim", "family": "Schindling", "affiliation": [{"original_name": "Vanderbilt University", "normalized_name": "Vanderbilt University", "country": "United States", "identifiers": {"ror": "https://ror.org/02vm5rt34", "GRID": "grid.152326.1"}}]}, {"given": "Trevor M.", "family": "Harris", "affiliation": [{"original_name": "West Virginia University", "normalized_name": "West Virginia University", "country": "United States", "identifiers": {"ror": "https://ror.org/011vxgd24", "GRID": "grid.268154.c"}}]}], "publisher": "Edinburgh University Press", "date": "2018", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "12", "issue": "2", "ISSN": [{"value": null, "type": null}]}