{"url": "http://dx.doi.org/10.3389/fdigh.2018.00014", "identifier": {"string_id": "10.3389/fdigh.2018.00014", "id_scheme": "DOI"}, "abstract": "Trust is a crucial guide in interpersonal interactions, helping people to navigate through social decision-making problems and cooperate with others. In human–computer interaction (HCI), trustworthy computer agents foster appropriate trust by supporting a match between their perceived and actual characteristics. As computers are increasingly endowed with capabilities for cooperation and intelligent problem-solving, it is critical to ask under which conditions people discern and distinguish trustworthy from untrustworthy technology. We present an interactive cooperation game framework allowing us to capture human social attributions that indicate trust in continued and interdependent human–agent cooperation. Within this framework, we experimentally examine the impact of two key dimensions of social cognition, warmth and competence, as antecedents of behavioral trust and self-reported trustworthiness attributions of intelligent computers. Our findings suggest that, first, people infer warmth attributions from unselfish vs. selfish behavior and competence attributions from competent vs. incompetent problem-solving. Second, warmth statistically mediates the relation between unselfishness and behavioral trust as well as between unselfishness and perceived trustworthiness. We discuss the possible role of human social cognition for human–computer trust.", "article_title": "A Social Cognition Perspective on Human–Computer Trust: The Effect of Perceived Warmth and Competence on Trust in Decision-Making With Computers", "authors": [{"given": "Philipp", "family": "Kulms", "affiliation": [{"original_name": "Social Cognitive Systems Group, Faculty of Technology, CITEC, Bielefeld University, Germany", "normalized_name": "Bielefeld University", "country": "Germany", "identifiers": {"ror": "https://ror.org/02hpadn98", "GRID": "grid.7491.b"}}]}, {"given": "Stefan", "family": "Kopp", "affiliation": [{"original_name": "Social Cognitive Systems Group, Faculty of Technology, CITEC, Bielefeld University, Germany", "normalized_name": "Bielefeld University", "country": "Germany", "identifiers": {"ror": "https://ror.org/02hpadn98", "GRID": "grid.7491.b"}}]}], "publisher": "Frontiers Media SA", "date": "2018", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "5", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}