{"url": "https://doi.org/10.3366/ijhac.2015.0149", "identifier": {"string_id": "10.3366/ijhac.2015.0149", "id_scheme": "DOI"}, "abstract": " This article presents methodological starting points, heuristics and the results of a GIS-based analysis of the history of Slovenian literary culture from the 1780s to 1941. The ethnically Slovenian territory was multilingual and multicultural; it belonged to different state entities with distant capitals, which was reflected in the spatial dynamic of literary culture. The research results have confirmed the hypotheses of the research project ‘The Space of Slovenian Literary Culture,’ which were based on postulates of the spatial turn: the socio-geographical space influenced the development of literature and its media, whereas literature itself, through its discourse, practices and institutions, had a reciprocal influence on the apprehension and structuring of that space, as well as on its connection with the broader region. Slovenian literary discourse was able to manifest itself in public predominantly through the history of spatial factors: (a) the formation, territorial expansion and concentration of the social network of literary actors and media; (b) the persistent references of literary texts to places that were recognized by addressees as Slovenian, thereby grounding a national ideology. Taking all of this into account, and based on meta-theoretical reflection, the project aims to contribute to the development of digital humanities and spatial literary studies. ", "article_title": "Towards a GIS Analysis of Literary Cultures: The Making of the Slovenian Ethnoscape Through Literature", "authors": [{"given": "Marko", "family": "Juvan", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Joh", "family": "Dokler", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2015", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "9", "issue": "2", "ISSN": [{"value": null, "type": null}]}