{"url": "https://doi.org/10.3366/ijhac.2009.0009", "identifier": {"string_id": "10.3366/ijhac.2009.0009", "id_scheme": "DOI"}, "abstract": " There have been growing calls to develop the use of Geographical Information Systems (GIS) across the humanities. For this shift to take place, two things must be demonstrated: first, that it is technically possible to create a useful GIS of textual material, the main medium through which humanities research is conducted; and, secondly that such a database can be used to enhance our understanding of disciplines within the humanities. This paper reports on a pilot project that created a GIS of two textual accounts of tours of the Lake District: Thomas Gray's 1769 excursion and Samuel Taylor Coleridge's self-styled ‘circumcursion’ of 1802. It describes how these accounts were converted into a GIS and explores various methodologies that can then be used to explore the spatialities embedded within their respective tours. The resulting material has been placed on the Internet at http://www.lancs.ac.uk/mappingthelakes. The pilot demonstrates that it is both possible, and conceptually fruitful, to move GIS beyond the quantitative arena in which it currently resides and into more qualitative areas of humanities research. ", "article_title": "Thomas Gray, Samuel Taylor Coleridge and geographical information systems: A literary GIS of two Lake District tours", "authors": [{"given": "Ian N.", "family": "Gregory", "affiliation": [{"original_name": "Lancaster University", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}, {"given": "David", "family": "Cooper", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": " Edinburgh University Press 22 George Square, Edinburgh EH8 9LF UK ", "date": "2010", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "3", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}