{"url": "http://dx.doi.org/10.4000/jtei.974", "identifier": {"string_id": "10.4000/jtei.974", "id_scheme": "DOI"}, "abstract": "This paper attempts to make two contributions to discussions related to TEI: (1) an analysis of how tools used for working with TEI documents encourage certain values and make certain assumptions about the work of textual editing and (2) a report on a methodological framework from outside the humanities that suggests a unique way to study such systems. Borrowing models of design research from the fields of design and human-computer interaction, I argue that prototypes can be used to create new conceptual knowledge, to investigate the values and assumptions of sociotechnical systems, and to communicate alternative visions of those systems. I first analyze an existing tool, the Versioning Machine, as a way of focusing the design of a prototype that reimagines several aspects of that original—specifically, I argue that the Versioning Machine creates an environment that to some extent assumes that TEI documents are created by one editor and intended for one instantiation. The prototype presented experiments with an alternative vision of textual editing as bringing encoded texts and interpretations together in multiple and flexible instantiations. Rather than a technical problem with an optimal solution, I approach this design process as an opportunity to ask how prototypes can give designers access to conceptual issues and allow users to enact alternative values and imagine alternative futures. This research was supported by the Modernist Versions Project, which is funded by a Social Sciences and Humanities Research Council of Canada Partnership Development Grant.", "article_title": "A Design Methodology for Exploring and Communicating System Values and Assumptions", "authors": [{"given": "Daniel", "family": "Carter", "affiliation": [{"original_name": "University of Texas at Austin", "normalized_name": "The University of Texas at Austin", "country": "United States", "identifiers": {"ror": "https://ror.org/00hj54h04", "GRID": "grid.89336.37"}}]}], "publisher": "OpenEdition", "date": "2014-11-15", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 7", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}