{"url": "http://dx.doi.org/10.4000/jtei.787", "identifier": {"string_id": "10.4000/jtei.787", "id_scheme": "DOI"}, "abstract": "Project Bamboo, a cyberinfrastructure initiative supported by the Andrew W. Mellon Foundation, takes as its core mission the enhancement of arts and humanities research through the development of shared technology services. Rather than developing new tools for curating or analyzing data, Project Bamboo aims to provide core infrastructure services including identity and access management, collection interoperability, and scholarly data management. The longer-term goal is for many organizations and projects to leverage those services so as to direct their own resources towards innovative tool or collection development. In addition, Bamboo seeks to model a paradigm for tool integration that focuses on tools as discrete services (such as a morphology annotation service and a geoparser service, instead of a web-based environment that does morphological annotation and geoparsing) that can be applied to texts, individually or in combination with other services, to enable complex curatorial and analytical workflows. This paper addresses points of intersection between Project Bamboo and TEI over the course of Bamboo's development, including the role of TEI in Bamboo's ongoing development work. The paper highlights the significant contributions of the TEI community to the early development of the project through active participation in the Bamboo Planning Project. The paper also addresses the influence of TEI on the Bamboo Technology Project's collection interoperability and corpus curation/analysis initiatives, as well as its role in current (as of October 2012) development work.", "article_title": "TEI and Project Bamboo", "authors": [{"given": "Quinn", "family": "Dombrowski", "affiliation": [{"original_name": "UC Berkeley", "normalized_name": "University of California, Berkeley", "country": "United States", "identifiers": {"ror": "https://ror.org/01an7q238", "GRID": "grid.47840.3f"}}]}, {"given": "Seth", "family": "Denbo", "affiliation": [{"original_name": "Maryland Institute for Technology in the Humanities", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "OpenEdition", "date": "2013", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 5", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}