{"url": "http://dx.doi.org/10.4000/jtei.790", "identifier": {"string_id": "10.4000/jtei.790", "id_scheme": "DOI"}, "abstract": "Islandora is an open-source software framework developed since 2006 by the University of Prince Edward Island's Robertson Library. The Islandora framework is designed to ease the management of security and workflow for digital assets, and to help implementers create custom interfaces for display, search, and discovery. Turnkey options are provided via tools and modules (\"solution packs\") designed to support the work of a particular knowledge domain (such as chemistry), a particular content type (such as a digitized newspaper), or a particular task (such as TEI encoding). While it does not yet have native support for TEI, Islandora provides a promising basis on which digital humanities scholars could manage the creation, editing, validation, display, and comparison of TEI-encoded text. UPEI's IslandLives project, with its forthcoming solution pack, provides insight into how an Islandora version 6 installation can support OCR text extraction, automatic structural/semantic encoding of text, and web-based TEI editing and display functions for site administrators. This article introduces the Islandora framework and its suitability for TEI, describes the IslandLives approach in detail, and briefly discusses recent work and future directions for TEI work in Islandora. The authors hope that interested readers may help contribute to the expansion of TEI-related services and features available to be used with Islandora.", "article_title": "Islandora and TEI: Current and Emerging Applications/Approaches", "authors": [{"given": "Kirsta", "family": "Stapelfeldt", "affiliation": [{"original_name": "University of Prince Edward Island's Robertson Library", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Donald", "family": "Moses", "affiliation": [{"original_name": "UPEI's Robertson Library", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "OpenEdition", "date": "2013-06-27", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 5", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}