{"url": "http://dx.doi.org/10.5399/uo/hsda.4.1.3682", "identifier": {"string_id": "10.5399/uo/hsda.4.1.3682", "id_scheme": "DOI"}, "abstract": "As part of the seminar Re-reading Petrarch in the Digital Age –taught at the University of Oregon in Winter 2014– a digital close reading of Francesco Petrarca’s Rerum Vulgarium Fragmenta (Rvf) led to a series of parallel and entwined activities and projects. Deeply integrated with the Oregon Petrarch Open Book Project (OPOB), the course was oriented towards the encoding of Petrarca’s masterpiece based on the implementation of a network of different themes (Poet, Laura, Metaphysics Nature Metamorphoses and Urban Culture). The various occurrences and data obtained from the encoding were collected into an online database that is still operating and updatable. The results of this qualitative data collection were also compared with a quantitative computer-based research of selected keywords extracted from the various themes. From the beginning of the seminar, the class was divided into groups and each of them read the Rvf focusing on one of themes chosen while at the same time paying attention to the others. The different groups considered these themes as interrelated and interdependent. The poet is the sphere in which all the topics emerge in their specific connotations. However, his sphere is related to, dependent on and intersected with the other four spheres. The encoding allowed measuring the different manifestations, levels and meanings of the intersecting relationships. The study of the visual interpretation of the Rvf in the Inc. Queriniano G V 15 paralleled the close reading and encoding activity and helped students to develop a visual rendering of their themes and a pointed and original and creative interpretation of Petrarca’s masterpiece.", "article_title": "Re-Reading Petrarca in the Digital Era", "authors": [{"given": "Massimo", "family": "Lollini", "affiliation": [{"original_name": "University of Oregon", "normalized_name": "University of Oregon", "country": "United States", "identifiers": {"ror": "https://ror.org/0293rh119", "GRID": "grid.170202.6"}}]}, {"given": "Pierpaolo", "family": "Spagnolo", "affiliation": [{"original_name": "University of Oregon", "normalized_name": "University of Oregon", "country": "United States", "identifiers": {"ror": "https://ror.org/0293rh119", "GRID": "grid.170202.6"}}]}], "publisher": "Oregon State University", "date": "2015", "keywords": null, "journal_title": "Humanist Studies & the Digital Age", "volume": "4", "issue": "1", "ISSN": [{"value": "2158-3846", "type": "electronic"}]}