{"url": "https://umanisticadigitale.unibo.it/article/view/8161", "identifier": {"string_id": "10.6092/issn.2532-8816/8161", "id_scheme": "DOI"}, "abstract": "This paper consists of the cataloguing, mapping, and the study of the street poetry of Rome, written on the walls of the Italian capital by a group of street artists who started their activity in 2012: The Poeti der Trullo (The poets of the Trullo). Through the use of digital humanities tools, the article describes the Poeti der Trullo and their district, developing some considerations on the themes and the language that characterise their poems. The aim is to understand the cultural and social roots of this street poetry phenomenon and its effects on contemporary society. This study, which combines tools such as WordSmith, TXM, RStudio, Q-GIS, CartoDB, and Gephi, explains how the Poeti der Trullo interpret and interact with society through an interdisciplinary approach. The activity of the Poeti der Trullo, which blends the tradition of Roman graffiti and Pasquinate with the urban culture of slam poetry, shows a poetic resistance towards the image of contemporary society. Through a simple gesture such as writing a poetic message on a wall, these young performers reveal the strength of a cultural tradition that discloses a new act of resistance which has a pragmatic effect on society. In only six years of existence, these poets have effectively created a movement able to generate effective change in their district.", "article_title": "Rethinking Rome as an Anthology: The Poeti der Trullo’s Street Poetry", "authors": [{"given": "Giovanni Pietro", "family": "Vitali", "affiliation": [{"original_name": "Université de Poitiers", "normalized_name": "University of Poitiers", "country": "France", "identifiers": {"ror": "https://ror.org/04xhy8q59", "GRID": "grid.11166.31"}}]}], "publisher": "Bologna: AlmaDL", "date": "2018", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}