{"url": "http://dx.doi.org/10.6853/DADH.201910_(4).0001", "identifier": {"string_id": "10.6853/DADH.201910_(4).0001", "id_scheme": "DOI"}, "abstract": "Applying natural language processing techniques to the analysis of digital historical texts has become an important topic in digital human studies. Considering the actual needs of historical event research, this study starts with the needs of individual researchers and designs a set of tools for historical text event analysis, and the effectiveness of the method is further evaluated by applying it to study pirate events in the Ming Dynasty. Since pirates continued to invade China's coastal areas almost throughout the Ming Dynasty, the Maritime Prohibition Policy and coastal defense arrangements in the Ming Dynasty closely related to the growth and decline of pirates' scourge. Based on some research papers and historical document text on the theme of Chinese coastal pirates, we identify and derive event groups through the individual-use text-based historical event analysis tool, and establish a data structure that links historical events, people and place names. By analyzing the type of each pirate event group, we found that it includes war cases and coastal defense affairs, and we can further track their spatiotemporal transition characteristics by name entities in each event group. This study aims to develop an individual-use text-based historical event analysis tool, and integrate geographic information system with digital humanities applications, to facilitate the possibility of digital humanities methods to historical research.", "article_title": "Digital Humanities and Integrated Spatio-Temporal Information Analysis: An Individual-Use Text-Based Historical Event Analysis Tool and Its Application in Studying Ming Pirates Events", "authors": [{"given": "Pi-ling", "family": "Pai", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Cheng-han", "family": "Wu", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Jung-yi", "family": "Tsai", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Richard Tzong-han", "family": "Tsai", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "I-chun", "family": "Fan", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2019", "keywords": ["personalized research tool for historical text analysis ", " event clustering ", " automatic text markup ", " natural language processing ", " geographic information system (GIS)"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "4", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}