{"url": "http://dx.doi.org/10.6853/DADH.201804_1.0004", "identifier": {"string_id": "10.6853/DADH.201804_1.0004", "id_scheme": "DOI"}, "abstract": "This paper introduces a semi-automatic text tagging interface to help historians efficiently garner posting records from the Chinese Local Gazetteers (difangzhi 地方志) with the format of ＂who, when, which posting.＂ By turning texts into tabular data forms, this interface aims to lay the basis for analyzing Chinese local gazetteers on a large scale. Although local gazetteers from various locations all follow a general pattern when recording posting data, they still differ in details due to their substantial amount. Therefore, it is unfeasible to ask programmers to extract the posting data using a onesize- fits-all computer program. This tagging interface, on the other hand, provides a simple user interface with built-in patterns to extract the subjects' names, posting titles, dynasties, posting times, basic addresses and entry methods. This allows users to tag most of data in the text quickly, which can then be proofread by them themselves in order to check the tagging result and to correct mistakes. The interface also enables users to adjust the extraction patterns according to each text in order to accurately extract posting data from local gazetteers with distinct patterns.", "article_title": "From Text to Data: Extracting Posting Data from Chinese Local Gazetteers", "authors": [{"given": "Wai-Him", "family": "Pang", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Hui", "family": "Cheng", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Shih-Pei", "family": "Che", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018", "keywords": [" computational thinking ", " data computation ", " digital humanities ", " research implications"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "1", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}