{"url": "http://dx.doi.org/10.6853/DADH.201804_1.0002", "identifier": {"string_id": "10.6853/DADH.201804_1.0002", "id_scheme": "DOI"}, "abstract": "The field and influences of Digital Humanities are expanding significantly in recent years. This paper discusses and reviews many of the influential ideas and representative achievements that were reported in the Series on Digital Humanities and the International Conference on Digital Archives and Digital Humanities. Existing accomplishments have provided not only substantial proofs for the far-reaching promises of Digital Humanities but also further guidance for advancing the field in coming years. The increasing availability of research material and the strengthening power of computing facilities are leading us to a new era of humanistic research. In an open data environment, researchers may access information that are potentially relevant to their research targets from diverse sources with the help of information retrieval and extraction techniques. Digital tools for relating and disambiguating relevant information from abundant raw material can assist researchers to sift through documents that offer insights of varying relevancy. With the solid foundations of the availability of research data and the strength of computing supports, researchers can dig deeply into a research topic. In addition, digital tools may provide explorative search, offering opportunities of discovering new issues that are contextually related to the original research topic. With an appropriate expert-in-the- loop search mechanism, experts may uncover new research topics and may even link relationships between topics that were not previously known, perhaps forming a topic network among research topics. A truly open data environment also allows us to make results of humanistic research verifiable. Readers of a published paper may find and study both the cited papers and the researched material via information curators or data providers so that readers may acquire a deeper understanding of the viewpoints and thoughts of the paper authors. This would be hard to achieve if any part of the data is privately secured.", "article_title": "Toward Linking Open Data, Synchronizing Digital Tools, and Mapping Relevant Topics: A Survey of the Series on Digital Humanities", "authors": [{"given": "Chao-Lin", "family": "Liu", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018", "keywords": [" humanistic research ", " computational linguistics ", " digital tools ", " open data ", " topic networks"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "1", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}