{"url": "https://umanisticadigitale.unibo.it/article/view/8209", "identifier": {"string_id": "10.6092/issn.2532-8816/8209", "id_scheme": "DOI"}, "abstract": "In questo testo si presenta una guida alle strategie di conservazione nel lungo periodo di opere d’arte digitale. Oltre a una breve presentazione di ogni strategia che viene menzionata dalla letteratura sull’argomento, il lettore troverà un primo approccio alle principali problematiche e riferimenti bibliografici alle trattazioni tecniche. Gli studi consultati parlano di una serie di strategie tra le quali gli addetti dei musei e i professionisti della conservazione devono scegliere caso per caso a seconda della natura dell’opera. I lavori di arte digitale, infatti, presentano caratteristiche (le componenti fisiche, l’architettura dei programmi informatici e gli aspetti comunicativi e interattivi) estremamente multiformi e variabili durante il loro ciclo di vita. Gli esempi di opere raccolti dalla bibliografia rappresentano questo fluido scenario. Il computer permette la creazione di nuovi linguaggi artistici, di nuove forme e di nuove estetiche, come la realtà virtuale o aumentata, che mettono in crisi pratiche e principi conservativi legati alla preservazione di oggetti. Concettuale, effimera e processuale, l’arte digitale presenta similitudini con le problematiche conservative dell’arte contemporanea. Si aggiungono problemi legati all’uso delle reti di computer, alla miniaturizzazione delle componenti fisiche (hardware) e all’estrema volatilità delle istruzioni (software) in linguaggio informatico. Queste sono impartite dal programmatore/artista, nelle quali vi lascia spesso il suo “segno”. Poiché il sistema operativo, i computer e i supporti di memoria hanno un ciclo di vita breve e vengono rimpiazzati rapidamente dalla ricerca e dal mercato, senza interventi conservativi le opere digitali rimangono indietro e sono condannate all’illeggibilità in pochi anni. La letteratura sull’argomento privilegia la conservazione delle componenti immateriali e concettuali del prodotto artistico rispetto a quelle fisiche e tecnologiche. Queste ultime sono soggette a obsolescenza e possono (devono) essere sostituite o riadattate al contesto nel lungo periodo.", "article_title": "Una panoramica delle strategie di conservazione di opere d’arte digitale", "authors": [{"given": "Michele", "family": "Foti", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Bologna: AlmaDL", "date": "2018-11-30", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}