{"url": "http://dx.doi.org/10.6853/DADH.201904_3.0004", "identifier": {"string_id": "10.6853/DADH.201904_3.0004", "id_scheme": "DOI"}, "abstract": "The study aims to demonstrate how the International Image Interoperability Framework (IIIF) can be used and enhanced the use and interoperability of Buddhist art images during digital humanities research. First, it sketches out the requirements of the given field with a particular attention to the spatial structure of image and the analytical research of image. Second, it presents the image platform to drive visual-oriented research in digital humanities by drawing on four sets of the application programming interface (API) provided by the IIIF, including Image, Presentation, Content Search, and Authentication. The result are as follows: (1) the Image API provides scholars closer look at every detail of the images, which are the basis of iconography. (2) A structural display of visual data, in terms of their spatial distribution and the relative location among a group of artworks belonging to the same locale, such that the contextual information remains un-fragmented. (3) A model for annotation and categorization is developed to enable study focusing on a specific subject. (4) Inter-exchangeability of research materials among archives and institutes from different countries. (5) An authentication mechanism is set up to manage the access to materials owned by different teams.", "article_title": "The International Image Interoperability Framework (IIIF) Approach to Digital Representation, View and Annotation of Buddhist Caves and Images", "authors": [{"given": "Shu-Jiun", "family": "Chen", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Hsiang-An", "family": "Wang", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Yu-Chien", "family": "Ling", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2019", "keywords": ["International Image Interoperability Framework (IIIF) ", " Buddhist art ", " Buddhist caves and images ", " digital humanities"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "3", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}