{"url": "https://umanisticadigitale.unibo.it/article/view/7230", "identifier": {"string_id": "10.6092/issn.2532-8816/7230", "id_scheme": "DOI"}, "abstract": "Oral archives collected by professional scholars and ordinary people interested in dialects and ethnology are a precious resource for various fields of study (from linguistics to anthropology, from economy to history and politics, etc.) and may contain documents that could be labeled as products of intangible cultural heritage, thus deserving safeguard. Grammo-foni. Le soffitte della voce (Gra.fo), a two-year project jointly conducted by Scuola Normale Superiore and the University of Siena (Regione Toscana PAR FAS 2007-13), discovered, digitized, cataloged and disseminated via a web portal nearly 3000 hours of speech recordings stemming from around 30 oral archives collected by scholars and amateurs in the Tuscan territory. Having preserved such a significant collection of oral documents (e.g. oral biographies, ethno-texts, linguistic questionnaires, oral literature), Gra.fo constitutes a precious repository of Tuscan memory and provides a first-hand documentation of Tuscan language varieties from the early 1960s to the present day [7], [9]. In this article, the Gra.fo project will be described in all its stages, which involve: fostering the level of awareness on the importance of preserving this valuable cultural heritage product; contacting the oral recordings’ owners and co-signing legal agreements for the temporary borrowing of the recordings and accompanying materials; collecting and digitizing the recordings and the accompanying materials; cataloging (with the self-developed software Audiografo) and partially transcribing the oral documents; implementing the downloadable online catalog , an open-ended repository of oral texts which have hitherto been known to a very limited number of potential users. Some problematic issues related to the treatment of oral archives will also be discussed, together with the proposed solutions. These concern the carrier / document relation, the treatment of confidential information, and the cataloging of documents within other documents.", "article_title": "The Gra.fo project: from collection to dissemination", "authors": [{"given": "Silvia", "family": "Calamai", "affiliation": [{"original_name": "Dipartimento di Scienze della Formazione, Scienze Umane e della Comunicazione Interculturale, Università di Siena", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Francesca", "family": "Biliotti", "affiliation": [{"original_name": "Dipartimento di Scienze della Formazione, Scienze Umane e della Comunicazione Interculturale, Università di Siena", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Bologna: AlmaDL", "date": "2017", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}