{"url": "http://dx.doi.org/10.6853/DADH.201810_2.0004", "identifier": {"string_id": "10.6853/DADH.201810_2.0004", "id_scheme": "DOI"}, "abstract": "The main, and usually the only, purpose of most traditional digital libraries and archiving systems is to provide good contents with a retrieval system that helps one find desirable documents. This is often not sufficient for humanists who want to employ digital tools to explore properties from interesting subsets of the library or system. Humanists usually do not merely rely on the libraries or systems. They keep interesting texts in hard disks accessible for themselves. It can be hard with conventional systems to analyze properties of texts stored in personal computers. To fix this problem, it is desirable to have a platform that allows one to build personal databases that support not only common retrieval functions but also text-analytic ones. In this paper, we propose DocuSky to solve this problem. DocuSky allows a user to upload text contents to build his or her personal databass. It supports fulltext retrieval, post-classification over a search result, as well as analysis on tagged terms. Fulltext retrieval is common for searching desirable documents in a database. For any search result, post-classification groups its metadata and shows the resulting distribution. Analysis on tagged terms, on the other hand, returns a list of tagged terms occurring in that search result. They are the three major functions offered by the well-known Taiwan History Digital Library (THDL) system. In addition to these elementary functions, it also provides a couple of tools to help users analyze the contents in a database. The advance of digital humanities requires closely cooperation of computer engineers and digital humanists. DocuSky encourages tool developers and humanists to re-think about the roles of texts and content-analytics tools. In order to reduce the effort of tool development, we design a set of DocuSky APIs and widgets to ease the access to the content of a personal database.", "article_title": "DocuSky: A Platform for Constructing and Analyzing Personal Text Databases", "authors": [{"given": "Hsieh-Chang", "family": "Tu", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018", "keywords": [" DocuSky ", " personal text databases ", " system architecture ", " text analytic tools ", " platform for digital humanities"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "2", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}