{"url": "https://umanisticadigitale.unibo.it/article/view/8053", "identifier": {"string_id": "10.6092/issn.2532-8816/8053", "id_scheme": "DOI"}, "abstract": "In this paper we study, analyse and comment on rhetorical figures present in a selected body of poetry of the first half of the 20th century. These figures are at first traced back to famous poets of the past and then compared to classical Latin prose. Linguistic theory is then called upon to show how these rethorical figures can be represented in syntactic structures and classified as noncanonical structures, by positioning discontinuous or displaced linguistic elements in SpecXP projections at various levels of constituency. We then introduce LFG – Lexical Functional Grammar – as the theory that allows us to connect syntactic noncanonical structures with informational structure and psycholinguistic theories for complexity evaluation. We end up with two computational linguistics experiments and then evaluate the results. The first experiment uses the best performing online parsers of Italian to parse poetic structures; the second experiment use Getarun – a system created at the Computational Linguistics Laboratory of Ca' Foscari. As will be shown, the first approach is unable to cope with these structures because only statistical probabilistic information is used. Conversely, as a symbolic rule-based system, the second approach is much superior and facilitates both semantic and pragmatic analyses.", "article_title": "Syntax and Semantics of Italian Poetry in the First Half of the 20th Century", "authors": [{"given": "Rodolfo", "family": "Delmonte", "affiliation": [{"original_name": "Università Ca'Foscari Venezia", "normalized_name": "Ca Foscari University of Venice", "country": "Italy", "identifiers": {"ror": "https://ror.org/04yzxz566", "GRID": "grid.7240.1"}}]}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}