{"url": "https://umanisticadigitale.unibo.it/article/view/8575", "identifier": {"string_id": "10.6092/issn.2532-8816/8575", "id_scheme": "DOI"}, "abstract": "The Digital Humanities (DH), as Rob Kitchin reminds us, have always been interested in the building of infrastructure for research (Kitchin 2014, Loc. 222 of 6164). Imagining how emerging technologies could first be applied to Humanities problems and then scaled up to infrastructure for others to use has been one of the defining features of the field, by which we mean the field has evolved through projects that experimented with the application of new computing technologies to the difficult problems of the Humanities. Such experimentation began with Father Busaís Index Thomisticus (IT) project (Busa 1980; Winter 1999; Busa 1974-1980) which is why many genetic descriptions of the field returns to the Index. The Index Thomisticus (IT) project was not only the first, but also one of the largest Digital Humanities projects of all time, even though the outcome might, by today’s standards be considered “small”. The project lasted 34 years and at its peak (1962) involved a staff of as many as 70 persons all housed in a large ex-textile factory in Gallarate. For that time they were dealing with big data, we might even say really big data, and the infrastructure they had to build was unlike any ever built before. If we want to understand what is involved in scaling up to big infrastructure we should look back to the beginnings of the field and the emergence of big projects like the Index. This paper will therefore look at the Busa’s project as a way to think through big projects by first discussing the historiography of the IT project and DH projects in general. We will ask how can we study projects as bearers of ideas? What resources do we need/have? Then we will look at specific aspects of the project that shed light on DH projects in general. In particular we will look at how the project was communicated, conceived, and the data processing innovations. Finally, we will reflect on what lessons the IT project has for us at a time when big data has become an end in itself. What can we learn from Busa’s attention to data in the face of the temptations of automatically gathered data?", "article_title": "The Index Thomisticus as a Big Data Project", "authors": [{"given": "Geoffrey", "family": "Rockwell", "affiliation": [{"original_name": "University of Alberta, Canada", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}, {"given": "Marco", "family": "Passarotti", "affiliation": [{"original_name": "Università Cattolica del Sacro Cuore, Milano", "normalized_name": "Catholic University of the Sacred Heart", "country": "Italy", "identifiers": {"ror": "https://ror.org/03h7r5v07", "GRID": "grid.8142.f"}}]}], "publisher": "Bologna: AlmaDL", "date": "2019", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}