{"url": "http://dx.doi.org/10.6853/DADH.201804_1.0006", "identifier": {"string_id": "10.6853/DADH.201804_1.0006", "id_scheme": "DOI"}, "abstract": "In recent years, with the rapid development of information technology, a substantial number of Chinese Buddhist scriptures have been converted to digital format and made available to the public. The Chinese Buddhist Electronic Text Association (CBETA) has made the Chinese Electronic Tripiṭaka Collection widely available for many years and provided a resourceful platform for the Chinese Buddhist texts studies. As of the 2016 version, more than 210 million Chinese characters are freely and publicly available in digital form through the efforts of the CBETA. With the rapid emergence of digital tools, the employment of digital resources for the extraction of implicit information in the texts is a promising methodology. Owing to the privation of high-level computer programming skills and advanced statistical knowledge, the quantitative analysis of digital texts still under-perform. Therefore, there is a barrier for humanities scholars to navigate these digital tools, not to mention the application of such research concept in the field of Chinese Buddhist texts studies. It is inevitable to create a platform that assists humanities scholars in overcoming the mentioned hindrances so that the computational linguistic resources and information technology could aid in their research effort. Hence, the establishment of ＂CBETA Research Platform＂ started. This research platform provides high-quality digital content from the CBETA corpus, combining relevant references based on the latest research findings.", "article_title": "CBETA Research Platform: A Digital Tool for Studying Chinese Buddhist Texts in the New Era", "authors": [{"given": "Jen-Jou", "family": "Hung", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018", "keywords": ["Digital Buddhist Canon ", " Chinese Buddhist Electronic Text Association (CBETA) ", " database ", " buddhist studies ", " digital research platform"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "1", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}