{"url": "http://dx.doi.org/10.6853/DADH.202004_(5).0002", "identifier": {"string_id": "10.6853/DADH.202004_(5).0002", "id_scheme": "DOI"}, "abstract": "Epigraphy in Chinese Singaporean Temples preserves local documentation of social connections in pre-modern Singapore. However, this valuable historical source has not yet been comprehensively analysed, in part due to the large amount of documents to be catalogued. The present study aims at the development of a frequency analysis of sponsors appearing in epigraphic texts in the pre-modern Chinese Singaporean Temples. This research examines the influence of donors by assessing their frequency, highlights the connections among sponsors, and their active areas, i.e., the links of sponsors to specific temples. The study applies a digital humanities approach, by utilizing Text Encoding Initiative (TEI), Python, DocuSky, and Palladio. TEI is used to mark up the texts of Chinese Epigraphy in Singapore, 1819-1911. The information under various labels can be extracted by Python programming. DocuSky is applied to produce graphic presentations that analyze the frequency of sponsors, assessing terms elicited from TEI files and terms from other sources as well. Palladio and Gephi provide graphic presentations of network among sponsors through the temples. This digital humanities work allows us to map specific aspects of Singapore in history.", "article_title": "Chinese Singaporean Temples: Digital Humanities Approaches to Frequency Lists of Sponsors", "authors": [{"given": "Xu", "family": "Duoduo", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Kenneth", "family": "Dean", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Marcus", "family": "Bingenheimer", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Francis", "family": "Bond", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2020", "keywords": ["Chinese temple ", " frequency analysis of sponsors ", " digital humanities ", " Text Encoding Initiative (TEI) "], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "5", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}