{"url": "https://umanisticadigitale.unibo.it/article/view/9091", "identifier": {"string_id": "10.6092/issn.2532-8816/9091", "id_scheme": "DOI"}, "abstract": "Le edizioni scientifiche digitali (ESD) sono uno strumento necessario alla divulgazione del patrimonio culturale. Con l’affermarsi delle tecnologie del Semantic Web per la disseminazione dei dati dei beni culturali, le ESD diventano un tassello fondamentale da integrare nella Linked Open Data cloud. Linee guida per la codifica del testo e standard tecnologici vengono correntemente utilizzati nella comunità accademica per condividere i informazioni tra ricercatori e sviluppatori (p.e. XML/TEI, noSQL database, RESTful API). Nondimeno, esistono diverse lacune nella creazione di edizioni scientifiche semantiche: (1) l’assenza di un workflow per la pubblicazione di ESD come knowledge graph, (2) l’identificazione di modelli concettuali per la rappresentazione di aspetti caratterizzanti le ESD, (3) un’analisi dei costi, dei vantaggi e dei benefici derivanti dall’utilizzo di cutting-edge technology in giustapposizione alla “tradizionale” codifica del testo. In questo articolo presentiamo il proof-of-concept dell’edizione semantica digitale del quaderno di appunti di Paolo Bufalini che tenta di rispondere a tali lacune.", "article_title": "Linked Data per le edizioni scientifiche digitali. Il workflow di pubblicazione dell’edizione semantica del quaderno di appunti di Paolo Bufalini", "authors": [{"given": "Marilena", "family": "Daquino", "affiliation": [{"original_name": "Digital Humanities Advanced Research Centre (DHARC), Università di Bologna", "normalized_name": "University of Bologna", "country": "Italy", "identifiers": {"ror": "https://ror.org/01111rn36", "GRID": "grid.6292.f"}}]}, {"given": "Francesca", "family": "Giovannetti", "affiliation": [{"original_name": "Digital Humanities Advanced Research Centre (DHARC), Università di Bologna", "normalized_name": "University of Bologna", "country": "Italy", "identifiers": {"ror": "https://ror.org/01111rn36", "GRID": "grid.6292.f"}}]}, {"given": "Francesca", "family": "Tomasi", "affiliation": [{"original_name": "Digital Humanities Advanced Research Centre (DHARC), Università di Bologna", "normalized_name": "University of Bologna", "country": "Italy", "identifiers": {"ror": "https://ror.org/01111rn36", "GRID": "grid.6292.f"}}]}], "publisher": "Bologna: AlmaDL", "date": "2019-12-18", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}