{"url": "https://umanisticadigitale.unibo.it/article/view/8146", "identifier": {"string_id": "10.6092/issn.2532-8816/8146", "id_scheme": "DOI"}, "abstract": "Il contributo si propone di ragionare sulle potenzialità dell’ecdotica digitale tramite l’uso di alcuni testi esemplificativi. La finalità è quella di provare a riflettere, da un lato sul peso da dare all’atto ricostruttivo rispetto all’atto costruito; dall’altro, sulla tipologia di testo da editare. L’esemplificazione verterà su tre tipologie di testi a cui sono associate diversi modelli o ipotesi di codifica. Le tipologie testuali fanno riferimento a testi inediti nei quali non è espressa l’ultima volontà d’autore e i processi compositivi risultano fluidi e instabili; a testi inediti che pongono problemi di rappresentazione e di intelligibilità, oltre a una possibile riscrittura coatta a scopo difensivo; a testi preparatori per un progetto letterario non realizzato e documentati da diversi testimoni, uno dei quali viene pubblicato senza espressa volontà dell’autore ma secondo un principio di volontà dell’editore. I testi di riferimento sono due autografi inediti di attilio bertolucci risalenti agli anni ’30-’40 del Novecento; un estratto del manoscritto autografo 2Qq E 29 (sec. XVII ex.) di teresa di s. geronimo e del «manoscritto di Populonia» (1959-1961) di elio vittorini. Le riflessioni sui modelli di marcatura hanno l’obiettivo di far emergere il testo come soggetto dinamicamente instabile e tentare di ricostruire così la sua trans-fisicità o trans-testualità attiva, trasformandolo da reale in virtuale. Il contributo, senza nessuna pretesa esaustiva e normativa, si propone anche in dialogo con la prassi dell’ecdotica tradizionale, per ricercare modelli standardizzati di marcatura e rispondere così a possibili dubbi metodologici alla base di una edizione critica.", "article_title": "Dai testi cartacei ai testi virtuali: potenzialità dell’ecdotica digitale", "authors": [{"given": "Luciano", "family": "Longo", "affiliation": [{"original_name": "Università di Palermo", "normalized_name": "University of Palermo", "country": "Italy", "identifiers": {"ror": "https://ror.org/044k9ta02", "GRID": "grid.10776.37"}}]}], "publisher": "Bologna: AlmaDL", "date": "2018-11-30", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}