{"url": "https://arxiv.org/abs/1312.4617v2", "identifier": {"string_id": "1312.4617", "id_scheme": "arXiv"}, "abstract": "Social network has gained remarkable attention in the last decade. Accessing social network sites such as Twitter, Facebook LinkedIn and Google+ through the internet and the web 2.0 technologies has become more affordable. People are becoming more interested in and relying on social network for information, news and opinion of other users on diverse subject matters. The heavy reliance on social network sites causes them to generate massive data characterised by three computational issues namely; size, noise and dynamism. These issues often make social network data very complex to analyse manually, resulting in the pertinent use of computational means of analysing them. Data mining provides a wide range of techniques for detecting useful knowledge from massive datasets like trends, patterns and rules [44]. Data mining techniques are used for information retrieval, statistical modelling and machine learning. These techniques employ data pre-processing, data analysis, and data interpretation processes in the course of data analysis. This survey discusses different data mining techniques used in mining diverse aspects of the social network over decades going from the historical techniques to the up-to-date models, including our novel technique named TRCM. All the techniques covered in this survey are listed in the Table.1 including the tools employed as well as names of their authors. ", "article_title": "A Survey of Data Mining Techniques for Social Media Analysis", "authors": [{"given": "Mariam", "family": "Adedoyin-Olowe", "affiliation": [{"original_name": "School of Computing Science and Digital Media, Robert Gordon University", "normalized_name": "Robert Gordon University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f0qj703", "GRID": "grid.59490.31"}}]}, {"given": "Mohamed Medhat", "family": "Gaber", "affiliation": [{"original_name": "School of Computing Science and Digital Media, Robert Gordon University", "normalized_name": "Robert Gordon University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f0qj703", "GRID": "grid.59490.31"}}]}, {"given": "Frederic", "family": "Stahl", "affiliation": [{"original_name": "School of Systems Engineering, University of Reading", "normalized_name": "University of Reading", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/05v62cm79", "GRID": "grid.9435.b"}}]}], "publisher": null, "date": "2013", "keywords": null, "journal_title": "Journal of Data Mining & Digital Humanities", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}