{"url": "https://arxiv.org/abs/1402.2003v2", "identifier": {"string_id": "1402.2003", "id_scheme": "arXiv"}, "abstract": "The project presents the strategy adopted by the Rough Cilicia Archaeological Survey team for publishing its primary data and reports via three potentially transformative strategies for digital humanities: Loose coupling of digital data curation and publishing platforms. In loosely coupled systems, components share only a limited set of simple assumptions, which enables systems to evolve dynamically. Collaborative creation of map based narrative content. Connecting print scholarship (book, reports, article) to online resources via two-dimensional barcodes (2D codes) that can be printed on paper and can call up hyperlinks when scanned with a Smartphone. The three strategies are made possible by loosely coupling two autonomous services: Visible Past, dedicated to web collaboration and digital-print publishing and Open Context, which is a geo-historical data archiving and publishing service. The Rough Cilicia Archaeological Survey, Visible Past, and Open Context work together to illustrate a new genre of scholarship, which combine qualitative narratives and quantitative representations of space and social phenomena. The project provides tools for collaborative creation of rich scholarly narratives that are spatially located and for connecting print publications to the digital realm. The project is a case study for utilizing the three new strategies for creating and publishing spatial humanities scholarship more broadly for ancient historians. ", "article_title": "A New Approach to Reporting Archaeological Surveys: Connecting Rough Cilicia, Visible Past and Open Context through loose coupling and 3d codes", "authors": [{"given": "Sorin Adam", "family": "Matei", "affiliation": [{"original_name": "Purdue University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Nicholas K.", "family": "Rauh", "affiliation": [{"original_name": "Alexandria Institute, CA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Eric C.", "family": "Kansa", "affiliation": [{"original_name": "Purdue University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2014", "keywords": null, "journal_title": "Journal of Data Mining & Digital Humanities", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}