{"url": "https://arxiv.org/abs/1801.00912v3", "identifier": {"string_id": "1801.00912", "id_scheme": "arXiv"}, "abstract": "With the rapid evolution of cross-strait situation, \"Mainland China\" as a subject of social science study has evoked the voice of \"Rethinking China Study\" among intelligentsia recently. This essay tried to apply an automatic content analysis tool (CATAR) to the journal \"Mainland China Studies\" (1998-2015) in order to observe the research trends based on the clustering of text from the title and abstract of each paper in the journal. The results showed that the 473 articles published by the journal were clustered into seven salient topics. From the publication number of each topic over time (including \"volume of publications\", \"percentage of publications\"), there are two major topics of this journal while other topics varied over time widely. The contribution of this study includes: 1. We could group each \"independent\" study into a meaningful topic, as a small scale experiment verified that this topic clustering is feasible. 2. This essay reveals the salient research topics and their trends for the Taiwan journal \"Mainland China Studies\". 3. Various topical keywords were identified, providing easy access to the past study. 4. The yearly trends of the identified topics could be viewed as signature of future research directions. ", "article_title": "How the Taiwanese Do China Studies: Applications of Text Mining", "authors": [{"given": "Hsuan-Lei", "family": "Shao", "affiliation": [{"original_name": "Department of East Asian Studies, National Taiwan Normal University", "normalized_name": "National Taiwan Normal University", "country": "Taiwan", "identifiers": {"ror": "https://ror.org/059dkdx38", "GRID": "grid.412090.e"}}]}, {"given": "Sieh-Chuen", "family": "Huang", "affiliation": [{"original_name": "College of Law, National Taiwan University", "normalized_name": "National Taiwan University", "country": "Taiwan", "identifiers": {"ror": "https://ror.org/05bqach95", "GRID": "grid.19188.39"}}]}, {"given": "Yun-Cheng", "family": "Tsai", "affiliation": [{"original_name": "Center for General Education, National Taiwan University", "normalized_name": "National Taiwan University", "country": "Taiwan", "identifiers": {"ror": "https://ror.org/05bqach95", "GRID": "grid.19188.39"}}]}], "publisher": null, "date": "2018", "keywords": null, "journal_title": "Journal of Data Mining & Digital Humanities", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}