{"url": "https://hal.archives-ouvertes.fr/hal-01915730v2", "identifier": {"string_id": "hal-01915730", "id_scheme": "hal"}, "abstract": "British philosopher and reformer Jeremy Bentham (1748-1832) left over 60,000 folios of unpublished manuscripts. The Bentham Project, at University College London, is creating a TEI version of the manuscripts, via crowdsourced transcription verified by experts. We present here an interface to navigate these largely unedited manuscripts, and the language technologies the corpus was enriched with to facilitate navigation, i.e Entity Linking against the DBpedia knowledge base and keyphrase extraction. The challenges of tagging a historical domain-specific corpus with a contemporary knowledge base are discussed. The concepts extracted were used to create interactive co-occurrence networks, that serve as a map for the corpus and help navigate it, along with a search index. These corpus representations were integrated in a user interface. The interface was evaluated by domain experts with satisfactory results , e.g. they found the distributional semantics methods exploited here applicable in order to assist in retrieving related passages for scholarly editing of the corpus.", "article_title": "Mapping the Bentham Corpus: Concept-based Navigation", "authors": [{"given": "Pablo", "family": "Ruiz", "affiliation": [{"original_name": "LILPA - Linguistique, Langues et Parole ", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Thierry", "family": "Poibeau", "affiliation": [{"original_name": "LattIce - Lattice - Langues, Textes, Traitements informatiques, Cognition - UMR 8094", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2019", "keywords": ["Jeremy Bentham", "manuscripts", "corpus navigation", "entity linking", "keyphrase extraction"], "journal_title": "Journal of Data Mining & Digital Humanities", "volume": "Special Issue: Digital Humanities between knowledge and know-how (Atelier Digit_Hum)", "issue": null, "ISSN": [{"value": null, "type": null}]}