{"url": "https://hal.archives-ouvertes.fr/hal-01645124v2", "identifier": {"string_id": "hal-01645124", "id_scheme": "hal"}, "abstract": "This article explores whether and how network visualization can benefit philological and historical-linguistic study. This is illustrated with a corpus-based investigation of scribes' language use in a lemmatized and morphologically annotated corpus of documentary Latin (Late Latin Charter Treebank, LLCT2). We extract four continuous linguistic variables from LLCT2 and utilize a gradient colour palette in Gephi to visualize the variable values as node attributes in a trimodal network which consists of the documents, writers, and writing locations underlying the same corpus. We call this network the \"LLCT2 network\". The geographical coordinates of the location nodes form an approximate map, which allows for drawing geographical conclusions. The linguistic variables are examined both separately and as a sum variable, and the visualizations presented as static images and as interactive Sigma.js visualizations. The variables represent different domains of language competence of scribes who learnt written Latin practically as a second-language. The results show that the network visualization of linguistic features helps in observing patterns which support linguistic-philological argumentation and which risk passing unnoticed with traditional methods. However, the approach is subject to the same limitations as all visualization techniques: the human eye can only perceive a certain, relatively small amount of information at a time.", "article_title": "Visualizing linguistic variation in a network of Latin documents and scribes", "authors": [{"given": "Timo", "family": "Korkiakangas", "affiliation": [{"original_name": "UiO - University of Oslo", "normalized_name": "University of Oslo", "country": "Norway", "identifiers": {"ror": "https://ror.org/01xtthb56", "GRID": "grid.5510.1"}}]}, {"given": "Matti", "family": "Lassila", "affiliation": [{"original_name": "Open Science Centre [Jyväskylä]", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2018", "keywords": ["network visualization", " Latin linguistics", " Early Middle Ages", " philology"], "journal_title": "Journal of Data Mining & Digital Humanities", "volume": "Special Issue on Computer-Aided Processing of Intertextuality in Ancient Languages", "issue": null, "ISSN": [{"value": null, "type": null}]}