{"url": "https://hal.archives-ouvertes.fr/hal-01279493v2", "identifier": {"string_id": "hal-01279493", "id_scheme": "hal"}, "abstract": "Greek documentary papyri form an important direct source for Ancient Greek. It has been exploited surprisingly little in Greek linguistics due to a lack of good tools for searching linguistic structures. This article presents a new tool and digital platform, “Sematia”, which enables transforming the digital texts available in TEI EpiDoc XML format to a format which can be morphologically and syntactically annotated (treebanked), and where the user can add new metadata concerning the text type, writer and handwriting of each act of writing. An important aspect in this process is to take into account the original surviving writing vs. the standardization of language and supplements made by the editors. This is performed by creating two different layers of the same text. The platform is in its early development phase. Ongoing and future developments, such as tagging linguistic variation phenomena as well as queries performed within Sematia, are discussed at the end of the article.", "article_title": "Preprocessing Greek Papyri for Linguistic Annotation", "authors": [{"given": "Marja", "family": "Vierros", "affiliation": [{"original_name": "Department of World Cultures", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Erik", "family": "Henriksson", "affiliation": [{"original_name": "Department of World Cultures", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2017", "keywords": ["JavaScript", "Python", "MySQL", "TEI EpiDoc XML", "Greek", "papyri", "linguistic annotation", "treebank", "dependency grammar"], "journal_title": "Journal of Data Mining & Digital Humanities", "volume": "Special Issue on Computer-Aided Processing of Intertextuality in Ancient Languages", "issue": null, "ISSN": [{"value": null, "type": null}]}