{"url": "https://hal.archives-ouvertes.fr/hal-01762730v5", "identifier": {"string_id": "hal-01762730", "id_scheme": "hal"}, "abstract": "This work applies knowledge engineering’s techniques to medieval illuminations. Inside it, an illumination is considered as a knowledge graph which was used by some elites in the Middle Ages to represent themselves as a social group and exhibit the events in their lives, and their cultural values. That graph is based on combinations of symbolic elements linked each to others with semantic relations. Those combinations were used to encode visual metaphors and influential messages whose interpretations are sometimes tricky for not experts. Our work aims to describe the meaning of those elements through logical modelling using ontologies. To achieve that, we construct logical reasoning rules and simulate them using artificial intelligence mechanisms. The goal is to facilitate the interpretation of illuminations and provide, in a future evolution of current social media, logical formalisation of new encoding and information transmission services.", "article_title": "Causal reasoning and symbolic relationships in Medieval Illuminations", "authors": [{"given": "Djibril", "family": "Diarra", "affiliation": [{"original_name": "Checksem", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Martine", "family": "Clouzot", "affiliation": [{"original_name": "ARTeHiS - Archéologie, Terre, Histoire, Sociétés [Dijon]", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Christophe", "family": "Nicolle", "affiliation": [{"original_name": "Checksem", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2019", "keywords": ["Semantic relation", "Symbolic relation", "Ontology", "Social network", "Medieval illumination"], "journal_title": "Journal of Data Mining & Digital Humanities", "volume": "Special Issue on Data Science and Digital Humanities @ EGC 2018", "issue": null, "ISSN": [{"value": null, "type": null}]}