{"url": "https://hal.archives-ouvertes.fr/hal-01458216v1", "identifier": {"string_id": "hal-01458216", "id_scheme": "hal"}, "abstract": "In this paper we present a system for offline recognition cursive Arabic handwritten text which is analytical without explicit segmentation based on Hidden Markov Models (HMMs). Extraction features preceded by baseline estimation are statistical and geometric to integrate both the peculiarities of the text and the pixel distribution characteristics in the word image. These features are modelled using hidden Markov models. The HMM-based classifiercontains a training module and a recognition module. The training module estimates the parameters of each of the character HMMs uses the Baum-Welchalgorithm. In the recognition phase, feature vectors extracted from an image are passed to a network of word lexicon entries formed of character models. The character sequence providing the maximumlikelihood identifies the recognized entry. If required, the recognition can generate N best output hypotheses rather than just the single best one. To determine the best output hypotheses, the Viterbi algorithm is used.The experiments on images of the benchmark IFN/ENIT database show that the proposed system improves recognition.", "article_title": "Cursive Arabic Handwriting Recognition System Without Explicit Segmentation Based on Hidden Markov Models", "authors": [{"given": "Mouhcine", "family": "Rabi", "affiliation": [{"original_name": "IRF-SIC - Laboratoire Image et Reconnaissance de Formes - Systèmes Intelligents et Communicants", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Mustapha", "family": "Amrouch", "affiliation": [{"original_name": "IRF-SIC - Laboratoire Image et Reconnaissance de Formes - Systèmes Intelligents et Communicants", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Zouhair", "family": "Mahani", "affiliation": [{"original_name": "IRF-SIC - Laboratoire Image et Reconnaissance de Formes - Systèmes Intelligents et Communicants", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2017", "keywords": ["HMMs", "Arabic text", "handwriting", "Recognition"], "journal_title": "Journal of Data Mining & Digital Humanities", "volume": "Special Issue on Scientific and Technological Strategic Intelligence (2016)", "issue": null, "ISSN": [{"value": null, "type": null}]}