{"url": "https://hal.archives-ouvertes.fr/hal-02520508v3", "identifier": {"string_id": "hal-02520508", "id_scheme": "hal"}, "abstract": "This article proposes use the Transkribus software to report on a \"user experiment\" in a French-speaking context. It is based on the semi-automated transcription project using the diary of the jurist Eugène Wilhelm (1866-1951). This diary presents two main challenges. The first is related to the time covered by the writing process-66 years. This leads to variations in the form of the writing, which becomes increasingly \"unreadable\" with time. The second challenge is related to the concomitant use of two alphabets: Roman for everyday text and Greek for private issues. After presenting the project and the specificities related to the use of the tool, the experiment presented in this contribution is structured around two aspects. Firstly, I will summarise the main obstacles encountered and the solutions provided to overcome them. Secondly, I will come back to the collaborative transcription experiment carried out with students in the classroom, presenting the difficulties observed and the solutions found to overcome them. In conclusion, I will propose an assessment of the use of this Human Text Recognition software in a French-speaking context and in a teaching situation.", "article_title": "Optical Recognition Assisted Transcription with Transkribus: The Experiment concerning Eugène Wilhelm's Personal Diary (1885-1951)", "authors": [{"given": "Régis", "family": "Schlagdenhauffen", "affiliation": [{"original_name": "IRIS - Institut de Recherche Interdisciplinaire sur les enjeux Sociaux - sciences sociales, politique, santé", "normalized_name": "Institut de Recherche Interdisciplinaire sur les Enjeux Sociaux", "country": "France", "identifiers": {"ror": "https://ror.org/03xg8m734", "GRID": "grid.503259.8"}}]}], "publisher": null, "date": "2020", "keywords": ["TEI", "User Experience", "Human Text Recognition", "Learning process", "OCR"], "journal_title": "Journal of Data Mining & Digital Humanities", "volume": "Atelier Digit_Hum", "issue": null, "ISSN": [{"value": null, "type": null}]}