{"url": "https://hal.archives-ouvertes.fr/hal-02280013v2", "identifier": {"string_id": "hal-02280013", "id_scheme": "hal"}, "abstract": "While online crowdsourced text transcription projects have proliferated in the last decade, there is a need within the broader field to understand differences in project outcomes as they relate to task design, as well as to experiment with different models of online crowdsourced transcription that have not yet been explored. The experiment discussed in this paper involves the evaluation of newly-built tools on the Zooniverse.org crowdsourcing platform, attempting to answer the research question: \"Does the current Zooniverse methodology of multiple independent transcribers and aggregation of results render higher-quality outcomes than allowing volunteers to see previous transcriptions and/or markings by other users? How does each methodology impact the quality and depth of analysis and participation?\" To answer these questions, the Zooniverse team ran an A/B experiment on the project Anti-Slavery Manuscripts at the Boston Public Library. This paper will share results of this study, and also describe the process of designing the experiment and the metrics used to evaluate each transcription method. These include the comparison of aggregate transcription results with ground truth data; evaluation of annotation methods; the time it took for volunteers to complete transcribing each dataset; and the level of engagement with other project elements such as posting on the message board or reading supporting documentation. Particular focus will be given to the (at times) competing goals of data quality, efficiency, volunteer engagement, and user retention, all of which are of high importance for projects that focus on data from galleries, libraries, archives and museums. Ultimately, this paper aims to provide a model for impactful, intentional design and study of online crowdsourcing transcription methods, as well as shed light on the associations between project design, methodology and outcomes.", "article_title": "Individual vs. Collaborative Methods of Crowdsourced Transcription", "authors": [{"given": "Samantha", "family": "Blickhan", "affiliation": [{"original_name": "Adler Planetarium [Chicago]", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Coleman", "family": "Krawczyk", "affiliation": [{"original_name": "University of Portsmouth", "normalized_name": "University of Portsmouth", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/03ykbk197", "GRID": "grid.4701.2"}}]}, {"given": "Daniel", "family": "Hanson", "affiliation": [{"original_name": "University of Minnesota [Twin Cities]", "normalized_name": "University of Minnesota", "country": "United States", "identifiers": {"ror": "https://ror.org/017zqws13", "GRID": "grid.17635.36"}}]}, {"given": "Amy", "family": "Boyer", "affiliation": [{"original_name": "The Adler Planetarium, USA", "normalized_name": "Adler Planetarium", "country": "United States", "identifiers": {"ror": "https://ror.org/0248gc218", "GRID": "grid.299970.c"}}]}, {"given": "Andrea", "family": "Simenstad", "affiliation": [{"original_name": "University of Minnesota [Twin Cities]", "normalized_name": "University of Minnesota", "country": "United States", "identifiers": {"ror": "https://ror.org/017zqws13", "GRID": "grid.17635.36"}}]}, {"given": "Victoria", "family": "van Hyning", "affiliation": [{"original_name": "Library of Congress", "normalized_name": "Library of Congress", "country": "United States", "identifiers": {"ror": "https://ror.org/04p405e02", "GRID": "grid.241525.5"}}]}], "publisher": null, "date": "2019-12-03", "keywords": [], "journal_title": "Journal of Data Mining & Digital Humanities", "volume": "Special Issue on Collecting, Preserving, and Disseminating Endangered Cultural Heritage for New Understandings through Multilingual Approaches", "issue": null, "ISSN": [{"value": null, "type": null}]}