{"url": "https://hal.archives-ouvertes.fr/hal-02324617v2", "identifier": {"string_id": "hal-02324617", "id_scheme": "hal"}, "abstract": "In this study, we address the interesting task of classifying historical texts by their assumed period of writ-ing. This task is useful in digital humanity studies where many texts have unidentified publication dates.For years, the typical approach for temporal text classification was supervised using machine-learningalgorithms. These algorithms require careful feature engineering and considerable domain expertise todesign a feature extractor to transform the raw text into a feature vector from which the classifier couldlearn to classify any unseen valid input. Recently, deep learning has produced extremely promising re-sults for various tasks in natural language processing (NLP). The primary advantage of deep learning isthat human engineers did not design the feature layers, but the features were extrapolated from data witha general-purpose learning procedure. We investigated deep learning models for period classification ofhistorical texts. We compared three common models: paragraph vectors, convolutional neural networks (CNN) and recurrent neural networks (RNN), and conventional machine-learning methods. We demon-strate that the CNN and RNN models outperformed the paragraph vector model and the conventionalsupervised machine-learning algorithms. In addition, we constructed word embeddings for each timeperiod and analyzed semantic changes of word meanings over time.", "article_title": "Deep Learning for Period Classification of Historical Hebrew Texts", "authors": [{"given": "Chaya", "family": "Liebeskind", "affiliation": [{"original_name": "JCT - Jerusalem College of Technology", "normalized_name": "Jerusalem College of Technology", "country": "Israel", "identifiers": {"ror": "https://ror.org/002kenh51", "GRID": "grid.419646.8"}}]}, {"given": "Shmuel", "family": "Liebeskind", "affiliation": [{"original_name": "JCT - Jerusalem College of Technology", "normalized_name": "Jerusalem College of Technology", "country": "Israel", "identifiers": {"ror": "https://ror.org/002kenh51", "GRID": "grid.419646.8"}}]}], "publisher": null, "date": "2020", "keywords": ["Machine Learning", "Deep Learning", "Diachronic Corpus", "Period Classification"], "journal_title": "Journal of Data Mining & Digital Humanities", "volume": "2020", "issue": null, "ISSN": [{"value": null, "type": null}]}