{"url": "https://hal.archives-ouvertes.fr/hal-00919370v3", "identifier": {"string_id": "hal-00919370", "id_scheme": "hal"}, "abstract": "This research study tested three different NLP technologies to analyze representative journalistic discourse used in the 2007 and 2012 presidential campaigns in France. The analysis focused on the discourse in relation to the candidate's gender and/ or political party. Our findings suggest that using specific software to examine a journalistic corpus can reveal linguistic patterns and choices made on the basis of political affiliation and/or gender stereotypes. These conclusions are drawn from quantitative and qualitative analysis carried out with three different software programs: SEMY, which semi-automatically provides semantic profiles; ANTCONC, which provides useful Keywords in Context (KWIC) or abstracts of texts, as well as collocations; TERMOSTAT, which reveals discourse specificities, frequencies and the most common morpho-syntactic patterns. Analysis of our data point to convergent asymmetries between female and male candidates in journalistic discourse (however conditionally) for the 2007 and the 2012 French presidential campaigns. We conclude that social gender (i.e., stereotypical expectations of who will be a typical member of a given category) and / or political favoritism may affect the representation of leadership in discourse, which, in turn, may influence the readership, hence the electorate. Thus the study recommends the use of corpus linguistic tools for the semi-automatic investigation of political texts.", "article_title": "ANALYSING JOURNALISTIC DISCOURSE AND FINDING OPINIONS SEMI-AUTOMATICALLY?: A CASE STUDY OF THE 2007 AND 2012 PRESIDENTIAL FRENCH CAMPAIGNS", "authors": [{"given": "Fabienne", "family": "Baider", "affiliation": [{"original_name": "UCY - University of Cyprus", "normalized_name": "University of Cyprus", "country": "Cyprus", "identifiers": {"ror": "https://ror.org/02qjrjx09", "GRID": "grid.6603.3"}}]}], "publisher": null, "date": "2014-05-02", "keywords": ["semi-automatic reading", "gender stereotypes", "political favoritism", "journalistic discourse", "French presidential campaign", "lecture automatique", "stéréotypes de genre", "biais politique", "discours journalistique", "campagne présidentielle française"], "journal_title": "Journal of Data Mining & Digital Humanities", "volume": "2014", "issue": null, "ISSN": [{"value": null, "type": null}]}