{"url": "https://hal.archives-ouvertes.fr/hal-01443713v1", "identifier": {"string_id": "hal-01443713", "id_scheme": "hal"}, "abstract": "Cloud Computing and Big Data are the upcoming Information Technology (IT) computing models. These groundbreaking paradigms are leading IT to a new set of rules that aims to change computing resources delivery and exploitation model, thus creating a novel business market that is exponentially growing and attracting more and more investments from both providers and end users that are looking forward to make profits from these innovative models of computing. In the same context, researchers and investigators are wrestling time in order to develop, test and optimize Cloud Computing and Big Data platforms, whereas several studies are ongoing to determine and enhance the essential aspects of these computing models especially compute resources allocation. The processing power scheduling is crucial when it comes to Cloud Computing and Big Data because of the data growth management and delivery design proposed by these new computing models, that requires faster responses from platforms and applications. Hence originates the importance of developing high efficient scheduling algorithms that are compliant with these computing models platforms and infrastructures requirement.", "article_title": "Smarter Round Robin Scheduling Algorithm for Cloud Computing and Big Data", "authors": [{"given": "Hicham", "family": "Gibet Tani", "affiliation": [{"original_name": "LIST - Laboratoire d'Informatique, Système et Télécommunications", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Chaker", "family": "El Amrani", "affiliation": [{"original_name": "LIST - Laboratoire d'Informatique, Système et Télécommunications", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2017-01-23", "keywords": ["Scheduling Algorithms", "Cloud Computing Simulation", "First Come First Served", "Cloud Computing", "Big Data", "Algorithme de planification", "Simulation Cloud Computing", "Round Robin", "Premier Arrivé Premier Servi"], "journal_title": "Journal of Data Mining & Digital Humanities", "volume": "Special Issue on Scientific and Technological Strategic Intelligence (2016)", "issue": null, "ISSN": [{"value": null, "type": null}]}