{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " In the emerging field of digital style analysis, scholars have been dwelling on a perceived irreconcilability of distant reading and close reading . This situation is somewhat reminiscent of the paradigm wars in social science, where for years, one could either adhere to a quantitative or a qualitative mindset. Taking seriously both the hermeneutic and the empirical traditions of (digital) stylistic research, the present paper proposes a mixed-methods coalition of approaches. To establish links between the mixed-methods paradigm from Social Sciences and stylistic practices within Digital Humanities (DH), the present article discusses common methods of distant, close, and ‘scalable reading’ as well as a flexibly adjustable definition of style . In the practical part of the paper, I report a ‘mixed-methods digital stylistics’ study on Franz Kafka’s prose. Scaling the degree of abstraction and contextuality of the data according to particular research questions, I combine (1) quantitative hypothesis testing (examining Kafka’s stylistic uniqueness by means of a stylometric measure); (2) quantitative exploration (analyzing the first hundred statistically overrepresented words in Kafka); and (3) qualitative text analysis (KWIC and close reading to investigate the functions of a particular style marker in the context of Kafka’s The Judgment [Das Urteil]). Generally, for digital stylistics, I propose (a) raising epistemological and methodological awareness within the field, and (b) framing the research within the mixed-method paradigm that in fact seems very well suited to DH. ", "article_title": "In a test bed with Kafka. Introducing a mixed-method approach to digital stylistics", "date": "2018", "volume": "011", "issue": "4", "authors": [{"given": "J. Berenike", "family": "Herrmann", "affiliation": [{"original_name": "Basel University", "normalized_name": "University of Basel", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02s6k3f65", "GRID": "grid.6612.3"}}]}], "keywords": ["text analysis", "digital stylistics", "stylometry", "scalable reading", "distant reading", "close reading", "empirical method", "digital hermeneutics", "DH", "epistemology", "methodology", "mixed methods", "20th Century German literature", "style"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}