{"url": "http://computerphilologie.digital-humanities.de/jg06/czfrineu.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "According to the Berlin Declaration on Open Access in the Sciences and Humanities, which was signed by the President of the Academy, an initiative was founded to provide a sustainable, interactive and transparent way to inspire activities in supporting research, communication and presentation with electronic media. This initiative is called Telota – the electronic life of the academy. One part of Telota is the so called Telota – Project of the month (TPM) working group which started work in February 2005. The main aims of this working group are to provide solutions for the mentioned issues which are cost efficient, future proven (especially to be independent from commercial vendors) and freely extensible. Every month the data of a selected academy project is processed, (re)structured and presented on the web to give humanities researchers, scholars and the interested public a new view in the extensive knowledge inventory of the academy. Identification and processing information of the long term projects is one of the central features of TPM. All the applied technologies and third party tools are reused, like all the gained experience is transferred from one project to the next. In addition new technologies are adopted to the working group’s portfolio. Thus the Project of the month is able to react properly to the monthly changing requirements. This paper exemplarily presents two systems for humanities projects from the viewpoint of an »in-house« working group. It tries to show the possibilities of developing electronic resources of long term projects in a very short time period.", "article_title": "Mehr XML – Die digitalen Projekte an der Berlin-Brandenburgischen Akademie der Wissenschaften.", "authors": [{"given": "Alexander", "family": "Czmiel", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}, {"given": "Christiane", "family": "Fritze", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}, {"given": "Gerald", "family": "Neumann", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}], "publisher": null, "date": "2007", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}