{"url": "http://computerphilologie.digital-humanities.de/jg06/fanta.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Walter Fanta is the co-editor of the ‚Klagenfurt Robert Musil Edition’ due to appear on November 6th, 2008 in DVD format, of which a twenty-volume edition of the reading text is also planned in book form. In the article the annotated digital Musil edition is offered as a model for historic-critical complete editions and presented for discussion. The particularity of the Austrian author Robert Musil is shown in his most important work, the novel ‚The Man without Qualities’, published by Musil in two volumes (1930 and 1932). For this work Musil left behind more than 12.000 unpublished pages of manuscript which partly contain preliminary sketches (1903-1925) and partly various options for the continuation of the book (1933-1942). In the protracted editing history of this book hitherto this has led to incomplete, one-sided editorial solutions satisfying only a restricted portion of the reading public. The new Klagenfurt Edition wishes to unite all the various approaches and offer a satisfactory solution for all those interested in the literary text, as well as for translators and scholars active in this field, by offering a reading text and in addition more than 15.000 pages of original manuscript and printed matter all connected with hypertext commentaries. Detailed reasons are given why this goal can only be attained by a digital edition: the complex relations in the texts and between the texts can only be depicted identically in this way - through the use of hyperlinks. Three fields of discussion with open and partially controversial questions concern not just Musil alone but rather general questions of digital editing and are still of concern to the editors of the Klagenfurt Edition. These are as follows: 1) The possibilities of text-genetic depiction, reconstruction of the reading text and the presentation of all levels through original documents, in the Klagenfurt Edition both of which are put into effect at the same time. Here the generating of ‚open’ reading texts with a multitude of undecided variants for the continuation of the novel turns out to be a creative game with many options in which the users of the Edition can also be involved. 2) Secondly there is the question of ‚open’ commentary which in the depiction of intertextuality through weblinks always appears to be in need of supplementation and extrapolation. 3) Thirdly the ‚open source’ discussion, the question of independence from commercial systems and the difficulties involved in the long-term-filing of highly complex hypertext systems, still unsolved in the case of the Musil Edition as conceded by the editors.", "article_title": "Die Klagenfurter Ausgabe Robert Musil Historisch-kritisches Edieren am Computer", "authors": [{"given": "Walter", "family": "Fanta", "affiliation": [{"original_name": "Robert Musil-Institut für Literaturforschung", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2007", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}