{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " These days, we are constantly looking for an image of ourselves in the historical past. “The first ever information revolution,” begins a typical book jacket blurb, “began with the advent of the printed book, enabling Renaissance scholars to formulate new ways of organizing and disseminating knowledge” . A communications scholar offers a view of our place in history that has echoes in countless other publications and presentations: “At present we are witnessing an information revolution whose significance parallels and perhaps even surpasses that of the information revolution caused by the printing press in the fifteenth century” . Publishers, both academic and trade, have created a new genre of book titles that confidently find the digital sizzle in the analog past: The Renaissance Computer (on printed books), The Victorian Internet (on the telegraph), Social Media: The First 2,000 Years (on letters, pamphlets, and graffiti). Scholars give talks with titles like Books as Social Media (Leah Price), Blogging Now and Then (250 Years Ago) (Robert Darnton), and What’s in a Visitor’s Book? Social Media and Volcanic Tourism in the Nineteenth Century (John Brewer). Surrounded as we are by these analogies — by these claims in favor of specific ways of construing the relationship between the past and the present, and by the significance claims that go with them — it seems fair to ask what purposes they serve. There is no doubt that we feel ourselves to be in the midst of a period of dramatic change in our media and information environments. My interest in this essay lies not in these environments themselves, but rather in our popular uses of historical metaphor to explain them. Why, in particular, do we turn to the rise of the printing press, out of all the options available, as our standard analogy for the rise of the internet? What value does this metaphor hold for us, what does it enable and what does it constrain, and what value does metaphoric thinking in general hold for analysis in media studies? It is as common for us today to use the printing press as a unit of measure in estimations of information history as it is for us to discuss our current circumstances in terms of an information revolution. But how historically accurate are these kinds of description? What do they mean for the ways in which we as futurists make use of history — and what do they mean for the ways in which we as historians take the long view? ", "article_title": "The Printing Press as Metaphor", "date": "2016", "volume": "010", "issue": "3", "authors": [{"given": "Elyse", "family": "Graham", "affiliation": [{"original_name": "SUNY Stony Brook", "normalized_name": "Stony Brook University", "country": "United States", "identifiers": {"ror": "https://ror.org/05qghxh33", "GRID": "grid.36425.36"}}]}], "keywords": ["digital humanities", "book history", "rhetoric", "history of the discipline"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}