{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Medievalists typically resort to parchment for primary research and when editing their sources. Not always accurately catalogued, manuscripts copied onto animal skins may have started life in the same workshop but over the centuries have become dispersed, coming to rest in libraries all over the world; bringing these together entails travel, microfilm purchases and reassembly and collation of the data within reach of a microfilm reader. These unwieldy machines afford only moderate scope for exploring single manuscripts at close quarters. High-resolution digitisation yields not just better surrogates in full colour; it allows for the development of additional research tools using image compression and manipulation, and new modes of representation, e.g. juxtaposed display of several related witnesses. This paper outlines research questions underpinning the development of an electronic tool for viewing, transcribing and manipulating manuscripts; it moves on to show how the viewer can be adapted for access from remote sites, to compare and annotation one or more witnesses (interactively and in real time), and for use as an integral part of an online edition. Finally, it explores how it can be deployed for use on projects taking knowledge outside the academy: in museums, galleries and other public spaces. ", "article_title": "e-Science for Medievalists: Options, Challenges, Solutions and Opportunities", "date": "2010", "volume": "003", "issue": "4", "authors": [{"given": "Peter", "family": "Ainsworth", "affiliation": [{"original_name": "Dept of French and Humanities Research Institute, University of Sheffield", "normalized_name": "University of Sheffield", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/05krs5044", "GRID": "grid.11835.3e"}}]}, {"given": "Michael", "family": "Meredith", "affiliation": [{"original_name": "Humanities Research Institute, University of Sheffield", "normalized_name": "University of Sheffield", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/05krs5044", "GRID": "grid.11835.3e"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}