{"url": "http://computerphilologie.digital-humanities.de/jg02/rockwell.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "While we are tired of discussing whether humanities computing is a discipline or an interdisciplinary field, it is still worth looking at what it is to become a discipline. Starting with a discussion of disciplinarity I argue that when a field begins to control the means of its academic reproduction through programmes it becomes a discipline. This founding moment of rupture with the surrounding disciplines should not be overlooked, nor should the dangers inherent in the defining of a field that happens through formalization in educational structures. In multimedia, in particular, there is a rupture around the place of the crafts of digital creation that places us in conflict with ideas about the liberal and servile (applied) arts. This will be the contribution of the digital humanities – a reorientation to craft and creative art in the humanities. There is no more stunning fact about the academic profession anywhere in the world than the simple one that academics are possessed by disciplines, fields of study, even as they are located in institutions. With the growth of specialization in the last century, the discipline has become everywhere an imposing, if not dominating, force in the working lives of the vast majority of academics. A discipline is born when a field takes control of its means of reproduction, specifically the ability to produce ›disciples‹ or students. The founding of a discipline is a rupture in the existing structure of institutions, one which is outside the founded discipline, being the condition of its becoming. The founding of a discipline is a liminal moment that defines the relationship between the discipline and those surrounding institutions. Humanities computing (HC) is becoming a discipline as it struggles to understand itself, struggles with existing disciplines and finds a new place within institutions. This paper will look at the emergence of humanities computing programmes as the founding of a discipline and the possibilities for rupture.", "article_title": "MULTIMEDIA, IS IT A DISCIPLINE? THE LIBERAL AND SERVILE ARTS IN HUMANITIES COMPUTING", "authors": [{"given": "Geoffrey", "family": "Rockwell", "affiliation": [{"original_name": "School of the Arts, Humanities Computing Centre, McMaster University, Hamilton", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}], "publisher": null, "date": "2002", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}