{"url": "http://projects.chass.utoronto.ca/chwp/CHC2007/Dyck_Williams/Dyck_Williams.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper describes an intermediate point in the development of an electronic edition of a unique and complex early modern book. At this stage, we the authors have done extensive research on the book itself and have also begun thinking about appropriate ways of rendering information about the book electronically. This essay describes the book, a gospel harmony or 'concordance' made for King Charles I in the mid-1630s by the Ferrars of Little Gidding, England, particularly in light of its construction and intended functions. It goes on to explore the appropriateness of electronic forms for describing the book, ending by postulating possible tools for delivery. In particular, it describes the complexity of the Little Gidding concordance, which rearranges and combines the text of the four canonical gospels into a single narrative of 150 chapters. We have found, somewhat paradoxically, that XML provides a natural-feeling platform for gathering data about this document (contrasted with a word processor), but that the document's complexity makes it a difficult fit with TEI markup. We note that since the biblical text is already marked up, and that the Ferrars have added another layer of markup, the real difficulty as well as the promise of this project is in using digital markup to further enable the complex and powerful reading machine that is the Little Gidding concordance.", "article_title": "Toward an Electronic Edition of an Early Modern Assembled Book", "authors": [{"given": "Paul", "family": "Dyck", "affiliation": [{"original_name": "Canadian Mennonite University", "normalized_name": "Canadian Mennonite University", "country": "Canada", "identifiers": {"ror": "https://ror.org/046qgfw50", "GRID": "grid.440058.d"}}]}, {"given": "Stuart", "family": "Williams", "affiliation": [{"original_name": "Independent scholar, Winnipeg", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2008", "keywords": ["Little Gidding concordance, Ferrar family, markup"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}