{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Classifying and categorizing the activities that comprise digital humanities has been a longstanding area of interest for many practitioners in this field, fueled by ongoing attempts to define digital humanities both within the academy and in the public sphere. The emergence of directories that cross traditional disciplinary boundaries has also spurred interest in categorization, with the practical goal of helping scholars identify, for instance, projects that take a similar technical approach, even if their subject matter is vastly different. This paper tracks the development of TaDiRAH, the Taxonomy of Digital Research Activities in the Humanities developed by representatives from DARIAH, the European cyberinfrastructure initiative, and DiRT, a digital humanities tool directory. TaDiRAH was created specifically to connect people with information on DiRT and in a DARIAH-DE bibliography, but with the goal of adoption by other directory-like sites. To ensure that TaDiRAH would be usable by other projects, the developers opened drafts for public feedback, a process which fundamentally altered the structure of the taxonomy and improved it in numerous ways. By actively seeking feedback from the digital humanities community and reviewing data about how the source taxonomies are actually used in order to inform term selection, the development of TaDiRAH provides a model that may benefit other taxonomy efforts. ", "article_title": "TaDiRAH: a Case Study in Pragmatic Classification", "date": "2016", "volume": "010", "issue": "1", "authors": [{"given": "Luise", "family": "Borek", "affiliation": [{"original_name": "Technical University of Darmstadt", "normalized_name": "TU Darmstadt", "country": "Germany", "identifiers": {"ror": "https://ror.org/05n911h24", "GRID": "grid.6546.1"}}]}, {"given": "Quinn", "family": "Dombrowski", "affiliation": [{"original_name": "Miami University ", "normalized_name": "Miami University", "country": "United States", "identifiers": {"ror": "https://ror.org/05nbqxr67", "GRID": "grid.259956.4"}}]}, {"given": "Jody", "family": "Perkins", "affiliation": [{"original_name": "Miami University", "normalized_name": "Miami University", "country": "United States", "identifiers": {"ror": "https://ror.org/05nbqxr67", "GRID": "grid.259956.4"}}]}, {"given": "Christof", "family": "Schöch", "affiliation": [{"original_name": "University of Würzburg", "normalized_name": "University of Würzburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00fbnyb24", "GRID": "grid.8379.5"}}]}], "keywords": ["taxonomy", "classification", "directories"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}