{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Over the past decades the advancement of technology and its subsequent introduction to the humanities has led to the development of several applications that enhance study and research in areas such as Classics, archaeology, epigraphy, and linguistics. The focus of digital humanists and other humanities scholars has turned to the efficient storage of information that facilitates search, comparative studies, accessibility, and consequently research. The common point of reference for the aforementioned applications is that they do not involve the need for the scholar to physically be in a virtual space. In areas, such as archaeology and epigraphy, the creation of projects that provide access to 3D models of the artifacts as well as to virtual replications of ancient sites has resulted in the opening of new areas of research and reconsideration of traditional research issues. Also, argue that digital visualizations may make the ancient world more accessible to a larger audience. One may comprehend the structure of a vase and analyze its artistic patterns by zooming and relighting it. A problem that is yet to be considered, though, is how a scholar and a student are to perceive Classical drama, the theatrical space, the distances between the actors, the chorus, and the audience, the logistics of the performance, and the cultural aspects at play. This paper discusses the importance of experiential learning and the use of virtual reality as a means of promoting traditional edification methods, virtually recreating the actuality of the stage, and presents the Magic Mirror Theater, a web application designed to facilitate the study of Classical drama. ", "article_title": "Reviving Classical Drama: virtual reality and experiential learning in a traditional classroom", "date": "2018", "volume": "012", "issue": "3", "authors": [{"given": "Eleni", "family": "Bozia", "affiliation": [{"original_name": "University of Florida", "normalized_name": "University of Florida", "country": "United States", "identifiers": {"ror": "https://ror.org/02y3ad647", "GRID": "grid.15276.37"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}