{"url": "http://computerphilologie.digital-humanities.de/jg02/boesken.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The past decade has seen the rise of quite a few new technologies. The computer and the internet have undoubtedly reached the status of mass media by now and discussions have been led about whether this phenomenon will finally force the exodus of ›the book‹ and of ›reading‹ – discussions that are well known from earlier times as in regard to the assumed competition between other electronic technologies, e.g. television, and the print media. This essay aims to take a closer look at these theories and tries to distinguish two different levels of the discussion that tend to be mixed up easily, as on one hand arguments are presented that relate to the medium itself and on the other hand arguments that relate to its products, such as the hypertext. Further to this, the essay aims to oppose the mentioned theories and assumptions with factual reality and examine their validity. It builds up on the results of a representative study investigating the attitude towards media in Germany in 2000 and it concludes that – at the time being – no extrusion of ›the book‹ or ›reading‹ in favour of the use of new technologies can be observed. Moreover, this essay aims to show that the assumed ›added value‹ of the hypertext (compared to linear presentation of printed text) should be studied more carefully. Hypertext does indeed offer some added value, but also bears the risk of disorientation and stress which might transform ›extra value‹ to ›less value‹.", "article_title": "LESEN AM COMPUTER – MEHRWERT ODER MEHR VERWIRRUNG? UNTERSUCHUNGEN ZUR ›KONKURRENZ‹ ZWISCHEN BUCH UND HYPERTEXT", "authors": [{"given": "Gesine", "family": "Boesken", "affiliation": [{"original_name": "Köln", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2002", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}