{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " The fate of the medieval Aesop during the early age of print reveals the tensions that arise between corporeal and proprietary understandings of artistic production. Building upon the highly accumulative, various, and expandable Aesopic tradition that thrived in the Middle Ages within scholastic manuscripts, the fifteenth-century fables of Robert Henryson and William Caxton confront movements to consolidate and transform Aesop’s sprawling literary corpus into a singular printable property. At the same time that a single series of Aesop’s fables, now known as the elegiac Romulus, became increasingly standardized within printed books, woodcut illustrations and textual descriptions increasingly beautified Aesop’s body, transforming him from an inarticulate slave to an eloquent aristocrat. The simultaneous metamorphosis of Aesop’s poetic and visual corpus reveals the premodern underpinnings for current efforts by publishing industries to immunize digital work from rogue acts of appropriation, mashup, and remix, practices which had previously defined Aesopic textuality. As a response to this textual vulnerability, the collapse of Aesopic work into a singular entity reimagines the allegorical relationship between the author or publisher and the work as proprietary, not corporeal. Rather than an extension of a generative, deeply somatic, and grotesque process of multiple fabular authors and commentators, the modernized Aesop obtains value as a property, paving the way for the notion that creative corpuses can be owned, effectively stealing away corporeal features from intellectual production. ", "article_title": "Stealing a Corpus: Appropriating Aesop’s Body in the Early Age of Print ", "date": "2018", "volume": "012", "issue": "2", "authors": [{"given": "Alex", "family": "Mueller", "affiliation": [{"original_name": "University of Massachusetts Boston", "normalized_name": "University of Massachusetts Boston", "country": "United States", "identifiers": {"ror": "https://ror.org/04ydmy275", "GRID": "grid.266685.9"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}