{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " As humanities scholars increasingly recognize the value of public engagement, and as the proportion of tenure-track faculty positions available to new graduates continues to decline, many humanities programs are focusing renewed attention on equipping graduate students for careers as scholars both within and beyond academe. To support those efforts, the Scholarly Communication Institute has carried out a study investigating perceptions about career preparation provided by humanities graduate programs. The survey results help to create a more solid foundation on which to base curricular reform and new initiatives by moving the conversation about varied career paths from anecdote to data. The findings make it clear that there are a number of effective interventions that programs can undertake. Many of the skills that people working beyond the tenure track identify as crucial to their positions — things like project management, collaboration, and communication — are also highly beneficial to those working within the professoriate. Structuring courses and projects in a way that emphasizes the acquisition of these skills not only contributes to the success of students who pursue employment outside the tenure track, but also to the vibrant research, teaching, and service of those who pursue academic roles. With the availability of new data to work from and the recommendations above as possible guiding principles, graduate programs have a robust set of tools available that can help facilitate curricular assessment and new initiatives. As the importance of assessing the effectiveness of existing structures and considering potential benefits of reform continues to grow, humanities programs have a strong incentive to demonstrate the ways that their graduate programs contribute to the vitality of the university and the broader public sphere. Equipping graduate students with the skills and literacies needed for 21st century scholarly work — from technical fluency to an understanding of organizational structures — is critical to ensuring continued rigorous and creative research, scholarship, and teaching. ", "article_title": "Humanities Unbound: Supporting Careers and Scholarship Beyond the Tenure Track", "date": "2015", "volume": "009", "issue": "1", "authors": [{"given": "Katina", "family": "Rogers", "affiliation": [{"original_name": "The Graduate Center, City University of New York", "normalized_name": "City University of New York", "country": "United States", "identifiers": {"ror": "https://ror.org/00453a208", "GRID": "grid.212340.6"}}]}], "keywords": ["careers", "alt-ac", "academic labor", "graduate education"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}