{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " The Globe is All One: Wars I Have Seen as Proto-Network Narrative charts Gertrude Stein's characterization of the human mind as an data-processor by tracing the conceptual correspondences between her writings and early information theory, including the work of Norbert Weiner, Claude Shannon, and Vannevar Bush. The article argues that Stein first sees language as data that human beings are compelled to parse in even the most contextless and semantically noisy frameworks, which shapes the purpose and form of Stein's notoriously difficult prose poem, Tender Buttons; the ease with which meaning can be exchanged emphasizes the importance of the ways in which a given meaning is selected from a set of possible meanings rather than interpreted or revealed. While this may simply reiterate the mode of Tender Buttons in different terms, the paper's crucial intervention is in its positioning of the chance selection of significance as the mode of signification that animates her wartime memoir Wars I Have Seen. Like words in the poem, political identity in occupied France is unstable and waits to be parsed in the act of encounters with others and with history. In her narrative's foregrounding of and experimental play with the conventions of memoir, Stein discovers the shifting nature of her main character (herself) in a series of ruminations and chance meetings; an early version of the network narrative emerges in the nodal structure of the story that undermines chronological and nationalist frames of signification. ", "article_title": " The Globe is All One: Wars I Have Seen as Proto-Network Narrative", "date": "2011", "volume": "005", "issue": "2", "authors": [{"given": "Stacy", "family": "Lavin", "affiliation": [{"original_name": "Independent Scholar", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}