{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " There has been much discussion about digital humanities (DH) both as a discipline and as a community of practice. This paper is based on my talk given to open the Leipzig eHumanities Seminar series and is presented here with many thanks to the organisers for their kind and generous invitation. Thanks also to the DHQ reviewers whose valuable comments have helped me to strengthen this paper. Whatever the balance of opinion, the emergence of digital scholarship in the humanities has undoubtedly had considerable impact on many disciplines; one such discipline is Classics and the study of the ancient world more generally. This article uses the Digital Classicist (DC) as an example of a DH community in a case study which traces its development and growth to examine what might be learned. As a community the DC joins together practitioners interested in the application of innovative digital methods and technology to the study of the ancient world (in its widest sense). How has this come about and perhaps more importantly, how has it been sustained and indeed provided the inspiration for other affiliated communities? What do we understand by a community and the association of individual practitioners separated by distance? It is important that members feel that they are stakeholders, that they have a sense of ownership and derive value from participation and contribution. It is argued here that a community could be seen as a symbolic and intellectual construct, one of perception rather than physicality to facilitate the exchange of ideas and so effect growth and strengthen the discipline. ", "article_title": "The Digital Classicist: building a Digital Humanities Community", "date": "2017", "volume": "011", "issue": "3", "authors": [{"given": "Simon", "family": "Mahony", "affiliation": [{"original_name": "University College London", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}], "keywords": ["Digital Classicist", "communities", "virtual community", "Digital Humanities", "collaboration", "open", "networking", "networks"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}