{"url": "http://projects.chass.utoronto.ca/chwp/heimpel2/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "How can the specificity of scholarly electronic publications (e-publications) be stressed without inviting claims of inferiority vis-à-vis paper publications (p-publications)? The response I am proposing in this article treats resistance to e-publication as an essentially ideological or conceptual problematic. Examples are drawn from both scientific and humanities scholarly publication, since the conceptual problematic analysed and the solution proposed apply to both fields. Section 2 examines how different approaches to the integration of new technologies inevitably make certain assumptions about the nature of change, its \"felicity conditions,\" and limits. In Section 3, \"Metaphor as Strategy,\" the claims of similarity between p-publications and e-publications made by incrementalist integration approaches are analysed as a kind of metaphorical argument. Section 4 describes the extreme strain and pressure exerted on the publication metaphor by the recent barrage of new printing and publishing technologies. In the final section, \"Beyond the Publication Principle,\" I argue for an alternative metaphorisation of scholarly e-publications as virtual communities. In other words, the legitimization of scholarly e-publication must be approached as a discursive or rhetorical issue: we do not need to change what we are doing, but rather how it is framed as a value that can be protected.", "article_title": "Legitimizing Electronic Scholarly Publication: A Discursive Proposal", "authors": [{"given": "Rod", "family": "Heimpel", "affiliation": [{"original_name": "University of Toronto", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}]}], "publisher": null, "date": "2000", "keywords": ["Electronic publications, paper publications, virtual communities, metaphorisation"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}