{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " While research coordinator at the Burney Centre at McGill University in Montreal, I pioneered new digital paleographical methods to support the editorial work on Frances Burney and Samuel Richardson undertaken there. Prior to my interventions, the primary method for reading faint, obscured, and obliterated manuscript texts had been multi-spectral imaging, which is prohibitively expensive, limiting its utility as a general research tool, although it is still sometimes in use. There have not been many alternative digital paleographical methodologies. The potential of image manipulation software, such as Adobe Photoshop, has been noted by a few scholars, but not explored. Working in Adobe Photoshop, I have developed a method of deciphering heavily deleted or obliterated text through the use of layering techniques, altered color levels, and the employment of certain kinds of filters. The method is more advanced than simple image enlargement techniques used by most researchers. Importantly though, it remains far less expensive than multi-spectral imaging. The technique contributed to the recovery of nearly all of the obliterated text in the first two volumes of The Court Journals and Letters of Frances Burney, which were published by Oxford University Press in 2011, and it was also used within in-progress volumes from The Cambridge Edition of the Works of Samuel Richardson. This article discusses the methodology and some of its key results from eighteenth-century manuscripts. ", "article_title": "Adobe Photoshop and Eighteenth-Century Manuscripts: A New Approach to Digital Paleography", "date": "2014", "volume": "008", "issue": "4", "authors": [{"given": "Hilary", "family": "Havens", "affiliation": [{"original_name": "University of Tennessee", "normalized_name": "University of Tennessee at Knoxville", "country": "United States", "identifiers": {"ror": "https://ror.org/020f3ap87", "GRID": "grid.411461.7"}}]}], "keywords": ["image manipulation software", "digital paleography", "eighteenth century"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}