{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " We describe two different strategies for generating the morphology of Latin verbs. First, we hand-code default inheritance hierarchies in the KATR formalism, treating inflectional exponents as markings associated with the application of rules by which complex word forms are deduced from simpler roots or stems. The high degree of similarity among verbs of different conjugation classes allows us to formulate general rules; these general rules are, however, sometimes overridden by conjugation-specific rules. This approach allows linguists to gain an appreciation for the structure of verbs, gives teachers a foundation for organizing lessons in morphology, and provides students a technique for generating forms of any verb. Second, we start with a paradigm chart, then automatically remove common parts and redundant morphosyntactic property sets (columns), combine similar conjugations (rows), and generate the KATR theory that produces a complete table of forms for a set of lexemes. This second approach automatically determines principal parts (for Latin, we verify that there are four), groups inflection classes into super-classes, and builds full paradigm charts. ", "article_title": "What Your Teacher Told You is True: Latin Verbs Have Four Principal Parts ", "date": "2009", "volume": "003", "issue": "1", "authors": [{"given": "Raphael", "family": "Finkel", "affiliation": [{"original_name": "University of Kentucky", "normalized_name": "University of Kentucky", "country": "United States", "identifiers": {"ror": "https://ror.org/02k3smh20", "GRID": "grid.266539.d"}}]}, {"given": "Gregory", "family": "Stump", "affiliation": [{"original_name": "University of Kentucky", "normalized_name": "University of Kentucky", "country": "United States", "identifiers": {"ror": "https://ror.org/02k3smh20", "GRID": "grid.266539.d"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}