{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " In this article, Cordell demonstrates the transformative possibilities of large-scale digital archives for literary history and bibliography. Focusing on the recently-uncovered reprinting history of Nathaniel Hawthorne’s short story, The Celestial Railroad, in the nineteenth-century press, the article demonstrates the central, shaping influence of religious readers and editors on Hawthorne’s early career. Cordell shows how the best traditional bibliography of Hawthorne’s works could be dramatically altered after only a few weeks’ work in digital archives of newspapers, magazines, and books, and using relatively simple search tools. Such tools not only expanded the number of known witnesses of the text, but also uncovered numerous paratexts: introductions to the story, articles reviewing or referring to the story, sermons derived from the story, etc. This social text of The Celestial Railroad, Cordell argues, lay buried amidst millions of pages that accumulated in the nineteenth century and required modern tools to be uncovered. The article also discusses how digital interpretive tools can help make better sense of such enlarged bibliographies. By comparing multiple printings of The Celestial Railroad using the Juxta Collation tool from NINES, Cordell argues that textual fluidity can tell modern readers much about how texts were understood by their original publishers and readers. The many changes to and discussions of The Celestial Railroad, for instance, indicate that the tale was popular for its perceived anti-denominational message, but nonetheless deployed as a weapon in denominational debates. ", "article_title": " Taken Possession of: The Reprinting and Reauthorship of Hawthorne's Celestial Railroad in the Antebellum Religious Press", "date": "2013", "volume": "007", "issue": "1", "authors": [{"given": "Ryan", "family": "Cordell", "affiliation": [{"original_name": "Northeastern University", "normalized_name": "Universidad del Noreste", "country": "Mexico", "identifiers": {"ror": "https://ror.org/02ahky613", "GRID": "grid.441462.1"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}