{"url": "http://projects.chass.utoronto.ca/chwp/CHC2004/gibson/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "While faculty members are beginning to use technology in their teaching, much more attention to technology integration is needed. Professional development experiences can play an important part in supporting faculty in these endeavours; however, most faculty professional development at the postsecondary level has been of an ad hoc nature involving interested individuals who have seen a need and sought out someone more skilled with computers to help them. Glenn (2002) calls for more work in the area of identifying viable models for preparing faculty to infuse technology into teacher education programs. In this paper I share some of the elements of a faculty wide professional development model designed for a large faculty of education. The Teaching with Technology in the Faculty of Education (TTFE) website was developed to provide a professional development model that includes practical resources for faculty seeking ways to make effective use of learning technologies. The model, which includes a suite of online tools and resources, integrates ideas both from people in the faculty and from other postsecondary institutions as to different ways to enhance teaching and learning. Faculty members have opportunities to engage in hands-on learning about active student-centred learning approaches as well as learning about effective use of technology for transforming their courses along these lines.", "article_title": "A Web of Possibilities: Faculty Sharing Ideas For Technology Integration In Teaching", "authors": [{"given": "Susan E.", "family": "Gibson", "affiliation": [{"original_name": "University of Alberta", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}], "publisher": null, "date": "2009", "keywords": ["Computer technology, faculty, professional development, classroom integration, stories"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}