{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " This short essay describes the difficulties and impromptu workarounds that emerged when using the video game Minecraft as the central teaching tool in several professional writing seminars. More specifically, the author discusses a key moment in the semester where students needed to move between university and non-university technology infrastructures in order to create multiplayer gamespaces that were accessible to their peers. In narrating this experience, the author will demonstrate how a discourse of access can be used to examine the oft-invisible policies, procedures, and restrictions that shape the way we compose, circulate and make visible digitally-native work. Furthermore, the author will discuss how a critical emphasis on access can help teachers and students better mediate the relationship between internal or university-supplied technological infrastructures and external platforms when creating interactive digital projects. The underlying motivation of this essay is not to lambaste universities for lack of institutional support nor is it to champion commercial organizations as saviors for helping teachers successfully use digital platforms in the classroom. Instead, the goal of this brief essay is to spur discussions surrounding the following questions: how might we use issues regarding access to better examine and navigate the hard-to-define boundaries that separate university-sanction technology use from non-university sanctioned technology use? How might calling students' attention to access refine the larger learning objectives for Digital Humanities or DH-related courses? ", "article_title": "Interlude: Gaining Access, Gaming Access: Balancing Internal and External Support For Interactive Digital Projects ", "date": "2019", "volume": "013", "issue": "2", "authors": [{"given": "Matthew", "family": "Kelly", "affiliation": [{"original_name": "University of Texas, Tyler", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}