{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Lincoln/Net (http://lincoln.lib.niu.edu), a product of the Abraham Lincoln Historical Digitization Project at Northern Illinois University Libraries, represents a new type of historically oriented digital library resource. Like many other digital libraries, it contains a large amount of searchable primary source materials. Like a number of other historically oriented online resources, project staff have organized Lincoln/Net around a specific topic, in this case Abraham Lincoln’s life and times in antebellum Illinois. In addition to Lincoln’s own papers, the project’s databases contain resources shedding light on his context, including letters, diaries, and publications prepared by his peers. Unlike most historically oriented digital libraries however, the project Web site also includes a wealth of multimedia materials, including image, sound, video, and interactive map resources. But Lincoln/Net is perhaps most unique in that it furnishes its users with an extensive set of interpretive materials. This approach suggests that historians may play an expanding role in the development of digital libraries. It can also provide them with a badly-needed means of communicating with an audience beyond their own scholarly community and students. This communication can facilitate what one digital history pioneer has described as the democratization of history, as defined by an expanded user group enjoying primary source materials and using them to engage in historical thinking . ", "article_title": " Webs of Significance: The Abraham Lincoln Historical Digitization Project, New Technology, and the Democratization of History", "date": "2007", "volume": "001", "issue": "1", "authors": [{"given": "Drew", "family": "VandeCreek", "affiliation": [{"original_name": "Northern Illinois University Libraries", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}