{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " This article describes a new method for inferring the gender of personal names using large historical datasets. In contrast to existing methods of gender prediction that treat names as if they are timelessly associated with one gender, this method uses a historical approach that takes into account how naming practices change over time. It uses historical data to measure the likelihood that a name was associated with a particular gender based on the time or place under study. This approach generates more accurate results for sources that encompass changing periods of time, providing digital humanities scholars with a tool to estimate the gender of names across large textual collections. The article first describes the methodology as implemented in the gender package for the R programming language. It goes on to apply the method to a case study in which we examine gender and gatekeeping in the American historical profession over the past half-century. The gender package illustrates the importance of incorporating historical approaches into computer science and related fields.Please see the lmullen/gender-article GitHub repository for the code used to create this article. ", "article_title": "Jane, John … Leslie? A Historical Method for Algorithmic Gender Prediction", "date": "2015", "volume": "009", "issue": "3", "authors": [{"given": "Cameron", "family": "Blevins", "affiliation": [{"original_name": "Rutgers University", "normalized_name": "Rutgers, The State University of New Jersey", "country": "United States", "identifiers": {"ror": "https://ror.org/05vt9qd57", "GRID": "grid.430387.b"}}]}, {"given": "Lincoln", "family": "Mullen", "affiliation": [{"original_name": "George Mason University", "normalized_name": "George Mason University", "country": "United States", "identifiers": {"ror": "https://ror.org/02jqj7156", "GRID": "grid.22448.38"}}]}], "keywords": ["gender", "data analysis", "R", "text analysis"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}