{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " In this paper we intend to present a tool we developed for translation studies and diachronically compare various French translations of the Odyssey. This field of study is part of the more general Classical Receptions studies that try to analyse the influence and adaptation of classical texts in modern and contemporary literature, theatre, cinema, and many other artistic fields. While Greek texts have been analysed by scholars for more than two thousand years, research about classical translations is not yet a most renown subject. In recent years this theme has raised a growing interest in the academic community. We developed a program that can align textual sequences (defined as groups of words delimited by a specified grammatical pivot, in our case proper nouns), without need of previous training. We obtained alignments for many different kinds of translationsEven free translations, a problem that wasn’t generally considered by textual aligners since recent studies. While other programs have an upper bound for one-to-many alignments (for example with a maximum of four translated elements aligned to the same original element) this algorithm allows an indefinite number of alignments, both for the source sequences and the target ones. The aligner is based on an implementation of Needleman-Wunsch algorithm and on a string-based similarity approach to textual segments. The aligner needs to establish proper names as anchor words, as they are a relatively stable feature through different translations and tend to be similar in several languages. Thanks to the alignments obtained using the program, we can explore translations in a number of ways. We will illustrate the creation of a graphical interface to visualize French Homeric translations. With our tool, it is possible to highlight aligned portions of texts and show their immediate differences or similarities, both in meaning and in syntactic distribution. We will show some resulting syntactic analyses carried out on a small sample of texts, taken from a corpus of twenty-seven unabridged French translations of the Odyssey and explore how the study of diachronic translations through algorithms of computational linguistics can produce interesting results for literary and linguistic studies. ", "article_title": "Diachronic trends in Homeric translations", "date": "2017", "volume": "011", "issue": "2", "authors": [{"given": "Yuri", "family": "Bizzoni", "affiliation": [{"original_name": "University of Gothenburg", "normalized_name": "University of Gothenburg", "country": "Sweden", "identifiers": {"ror": "https://ror.org/01tm6cn81", "GRID": "grid.8761.8"}}]}, {"given": "Marianne", "family": "Reboul", "affiliation": [{"original_name": "Université Paris-Sorbonne", "normalized_name": "University of Paris-Sud", "country": "France", "identifiers": {"ror": "https://ror.org/028rypz17", "GRID": "grid.5842.b"}}]}, {"given": "Angelo", "family": "Del Grosso", "affiliation": [{"original_name": "Institute for Computational Liguistics A. Zampolli", "normalized_name": "Institute for Computational Linguistics “A. Zampolli”", "country": "Italy", "identifiers": {"ror": "https://ror.org/028g3pe33", "GRID": "grid.503055.6"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}