{"url": "http://computerphilologie.digital-humanities.de/jg03/schicketanz-heiligenhaus.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Historical newspapers and journals are invaluable sources for the study of the past. Especially, Jewish periodicals provide a detailed impression of the cultural development of Jewry and shed a quite different light on German history. Yet, it is tremendously difficult to obtain and to investigate these sources: Besides ›normal‹ losses (paper destruction et cetera), a great stock of Jewish newspapers was destroyed under the Nazi regime or are scattered all over the world – a fact, that forces a researcher to expensive stays in different libraries or archives and compels librarians to an extra burden of work. Within the funding program Scientific Library Services and Information Systems of the Deutsche Forschungsgemeinschaft the Aachen Chair of German-Jewish Literary History, the Cologne library Germania Judaica and the Town and University Library Frankfurt/Main carry out a digitization project, which already provides more than twenty representative periodicals, containing about 300.000 images in the WWW. The essay emphasizes the implications and the broad range of problems as well as their solutions in the process of digitizing periodicals. A discussion of the project's technological goals demonstrates the single strategies und procedures to publish large amounts of images, text and bibliographical data in an economic and structured way.", "article_title": "»INSELN IM MEER DES BELIEBIGEN«. ARCHITEKTUR UND IMPLEMENTIERUNG EINES INTERNETPORTALS DEUTSCH-JÜDISCHE PERIODIKA", "authors": [{"given": "Till", "family": "Schicketanz", "affiliation": [{"original_name": "Germanistisches Institut der RWTH Aachen", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Kay", "family": "Heiligenhaus", "affiliation": [{"original_name": "Semantics Kommunikationsmanagement GmbH, Aachen", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2004", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}