{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Curating is often seen as a mediation between artist, work, and audience, with the curator firmly at the center. The central role of the curator has been further emphasized with the rise of the curator as artist and the institutional and physical limitations of museum spaces. We argue that there are important alternative spaces of meaning to be developed between object and audience. Digital curating, in particular, allows for greater audience participation, both by expanding the potential audience and by allowing visitors to navigate through the virtual galleries under their own direction. We contend that by facilitating the site visitors’ creation of their own visual arguments, a new level of audience participation in visual analysis — indeed, in a fundamental intellectual and intuitive aspect of curating — is made possible. We explore how digital resources can be modified to allow for that contextual sense of making a visual argument through arrangement. An installation at the University of Houston debuted a new tool for digital content management and allows us to make some preliminary observations about the process of visual analysis, its role in curatorial practice, and explore future directions for work. ", "article_title": "Curating Digital Spaces, Making Visual Arguments: A Case Study in New Media Presentations of Ancient Objects", "date": "2013", "volume": "007", "issue": "2", "authors": [{"given": "Daniel", "family": "Price", "affiliation": [{"original_name": "University of Houston", "normalized_name": "University of Houston", "country": "United States", "identifiers": {"ror": "https://ror.org/048sx0r50", "GRID": "grid.266436.3"}}]}, {"given": "Rex", "family": "Koontz", "affiliation": [{"original_name": "University of Houston", "normalized_name": "University of Houston", "country": "United States", "identifiers": {"ror": "https://ror.org/048sx0r50", "GRID": "grid.266436.3"}}]}, {"given": "Lauren", "family": "Lovings", "affiliation": [{"original_name": "Independent scholar", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}