{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " In this article we propose different methods of encoding, according to the TEI Guidelines, three different cases of genetic or compositional textual variants found in the autographs of the Italian contemporary poet Valerio Magrelli. These encoding experiments reflect the diverse nature of the artifacts and represent a critical assessment of the effectiveness of present encoding practices for the multidimensional and pragmatic aspects of authorial drafts. Thus far, it seems that the TEI has yet to offer a convincing theoretical model and adequate practical solutions for representing the complex temporal structures normally present in manuscripts, and in fluid textual traditions in general. Our conclusion is that there is a potential conflict between the linear and hierchical nature of current formal language systems such as XML, and the intrinsic dynamic nature of the writing process. In such cases we may have to rethink present models of document modeling, and to develop, within an adequate epistemological framework, a new theory of digital text. ", "article_title": "Digital Encoding as a Hermeneutic and Semiotic Act: The Case of Valerio Magrelli", "date": "2010", "volume": "004", "issue": "1", "authors": [{"given": "Domenico", "family": "Fiormonte", "affiliation": [{"original_name": "Università Roma Tre, Dipartimento di Italianistica", "normalized_name": "Roma Tre University", "country": "Italy", "identifiers": {"ror": "https://ror.org/05vf0dg29", "GRID": "grid.8509.4"}}]}, {"given": "Valentina", "family": "Martiradonna", "affiliation": [{"original_name": "Università di Roma, La Sapienza", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Desmond", "family": "Schmidt", "affiliation": [{"original_name": "Queensland University of Technology, Information Security Institute", "normalized_name": "Queensland University of Technology", "country": "Australia", "identifiers": {"ror": "https://ror.org/03pnv4752", "GRID": "grid.1024.7"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}