{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " The concept of literary genre is a highly complex one: not only are different genres frequently defined on several, but not necessarily the same levels of description, but consideration of genres as cognitive, social, or scholarly constructs with a rich history further complicate the matter. This contribution focuses on thematic aspects of genre with a quantitative approach, namely Topic Modeling. Topic Modeling has proven to be useful to discover thematic patterns and trends in large collections of texts, with a view to class or browse them on the basis of their dominant themes. It has rarely if ever, however, been applied to collections of dramatic texts. In this contribution, Topic Modeling is used to analyze a collection of French Drama of the Classical Age and the Enlightenment. The general aim of this contribution is to discover what semantic types of topics are found in this collection, whether different dramatic subgenres have distinctive dominant topics and plot-related topic patterns, and inversely, to what extent clustering methods based on topic scores per play produce groupings of texts which agree with more conventional genre distinctions. This contribution shows that interesting topic patterns can be detected which provide new insights into the thematic, subgenre-related structure of French drama as well as into the history of French drama of the Classical Age and the Enlightenment. ", "article_title": "Topic Modeling Genre: An Exploration of French Classical and Enlightenment Drama", "date": "2017", "volume": "011", "issue": "2", "authors": [{"given": "Christof", "family": "Schöch", "affiliation": [{"original_name": "University of Würzburg, Germany", "normalized_name": "University of Würzburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00fbnyb24", "GRID": "grid.8379.5"}}]}], "keywords": ["text analysis", "topic modeling", "literary studies", "French literature", "literary genres", "drama", "comedy", "tragedy", "seventeenth century", "eighteenth century", "Classical Age", "Enlightenment"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}