{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " In their seminal report, Our Cultural Commonwealth (2006), the American Council of Learned Societies underscored the need for scholars engaged in digital humanities work to leverage their access to data both to expand their audience to the general public and to generate new research questions. Now is the Future Now? argues that the progress made in digital humanities toward these goals has depended and will depend not only on digital data, but also on their appropriate curation. The article defines digital humanities, data, so-called Big Data, and digital curation. Next it examines digital curation initiatives in the sciences and in the humanities that occurred before the release of Our Cultural Commonwealth. It then considers and evaluates the digital curation work undertaken in the sciences and in the humanities after the report’s publication. In theory and in practice digital curation has benefited substantially from practices developed and tested first in the natural sciences and subsequently adapted for and extended in the humanities. Finally, the piece explores the future work necessary to facilitate symbiosis between digital curation and digital humanities. Collaboration and cooperation, transcending geographical, disciplinary, and institutional boundaries, data sharing, policies and planning, education and training, sustainability — all remain pressing issues in 2013. ", "article_title": "Now is the Future Now? The Urgency of Digital Curation in the Digital Humanities", "date": "2013", "volume": "007", "issue": "2", "authors": [{"given": "Alex H.", "family": "Poole", "affiliation": [{"original_name": "University of North Carolina at Chapel Hill", "normalized_name": "University of North Carolina at Chapel Hill", "country": "United States", "identifiers": {"ror": "https://ror.org/0130frc33", "GRID": "grid.10698.36"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}