{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Embedded in the rich textual record of international copyright law, we often encounter a quaint, and perhaps naïve definition of the literary around which the law has crystallized and which has the potential to influence the work of all digital humanists, whether they think of themselves as literary scholars or not. The first part of this article explores how a relatively narrow definition of the literary as a category of high or belletristic cultural production has informed the contours of U.S. copyright law, in particular. Section 101, Title 17 of the United States Code expressly defines literary works as any works, other than audiovisual works, expressed in words, numbers, or other verbal or numerical symbols or indicia, regardless of the nature of the material objects, such as books, periodicals, manuscripts, phonorecords, film, tapes, disks, or cards, in which they are embodied . US courts have, however, often employed a narrower, more commonplace understanding of the literary as an aesthetic category when sorting artifacts or content into other legally more significant categories such as idea, expression, criticism, parody, and satire. The second section of the article considers some of the potential implications and consequences of the current regulatory structure for the work of digital humanists. Judges engaging in a fair use analysis more often than not expect scholarship to come packaged in print monographs written in academic language aimed at an audience of disciplinary specialists. When they encounter scholarly artifacts that depart from those formal expectations and draw from pre-existing work, judges are less likely to find the use of pre-existing work is fair and therefore non-infringing. Finally, the article examines whether the literary as a category should be abandoned altogether, or whether digital humanists might productively redefine the literary as part of a strategy for re-imagining the institutional and legal regulations that govern academic work. ", "article_title": "Digital Humanities, Copyright Law, and the Literary", "date": "2013", "volume": "007", "issue": "1", "authors": [{"given": "Robin", "family": "Wharton", "affiliation": [{"original_name": "Independent Scholar", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}