{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " With the growing volume of user-generated classification systems arising from media tagging-based platforms (such as Flickr and Tumblr) and the advent of new crowdsourcing platforms for cultural heritage collections, determining the value and usability of crowdsourced, folksonomic, or user-generated, freely chosen keywords for libraries, museums and other cultural heritage organizations becomes increasingly essential. The present study builds on prior work investigating the value and accuracy of folksonomies by: (1) demonstrating the benefit of user-generated tags - or unregulated keywords typically meant for personal organizational purposes - for facilitating item retrieval and (2) assessing the accuracy of descriptive metadata generated via a game-based crowdsourcing application. In this study, participants (N = 16) were first tasked with finding a set of five images using a search index containing either a combination of folksonomic and controlled vocabulary metadata or only controlled vocabulary metadata. Data analysis revealed that participants in the folksonomic and controlled vocabulary search condition were, on average, six times faster to search for each image (M = 25.08 secs) compared to participants searching with access only to controlled vocabulary metadata (M = 154.1 secs), and successfully retrieved significantly more items overall. Following this search task, all participants were asked to provide descriptive metadata for nine digital objects by playing three separate single-player tagging games. Analysis showed that 88% of participant-provided tags were judged to be accurate, and that both tagging patterns and accuracy levels did not significantly differ between groups of professional librarians and participants outside of the Library Science field. These findings illustrate the value of folksonomies for enhancing item findability, or the ease with which a patron can access materials, and the ability of librarians and general users alike to contribute valid, meaningful metadata. This could significantly impact the way libraries and other cultural heritage organizations conceptualize the tasks of searching and classification. ", "article_title": "By the People, For the People: Assessing the Value of Crowdsourced, User-Generated Metadata", "date": "2015", "volume": "009", "issue": "1", "authors": [{"given": "Christina", "family": "Manzo", "affiliation": [{"original_name": "Simmons College, USA", "normalized_name": "Simmons University", "country": "United States", "identifiers": {"ror": "https://ror.org/04mbfgm16", "GRID": "grid.28203.3b"}}]}, {"given": "Geoff", "family": "Kaufman", "affiliation": [{"original_name": "Tiltfactor Laboratory, Dartmouth College, USA", "normalized_name": "Dartmouth College", "country": "United States", "identifiers": {"ror": "https://ror.org/049s0rh22", "GRID": "grid.254880.3"}}]}, {"given": "Sukdith", "family": "Punjasthitkul", "affiliation": [{"original_name": "Tiltfactor Laboratory, Dartmouth College, USA", "normalized_name": "Dartmouth College", "country": "United States", "identifiers": {"ror": "https://ror.org/049s0rh22", "GRID": "grid.254880.3"}}]}, {"given": "Mary", "family": "Flanagan", "affiliation": [{"original_name": "Tiltfactor Laboratory, Dartmouth College, USA", "normalized_name": "Dartmouth College", "country": "United States", "identifiers": {"ror": "https://ror.org/049s0rh22", "GRID": "grid.254880.3"}}]}], "keywords": ["metadata", "folksonomies", "searching", "findability", "user-generated metadata", "libraries", "gamification", "crowdsourcing", "metadata games"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}