{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " This article describes the results of a case study that applies Neural Network-based Optical Character Recognition (OCR) to scanned images of books printed between 1487 and 1870 by training the OCR engine OCRopus on the RIDGES herbal text corpus (in press). Training specific OCR models was possible because the necessary ground truth is available as error-corrected diplomatic transcriptions. The OCR results have been evaluated for accuracy against the ground truth of unseen test sets. Character and word accuracies (percentage of correctly recognized items) for the resulting machine-readable texts of individual documents range from 94% to more than 99% (character level) and from 76% to 97% (word level). This includes the earliest printed books, which were thought to be inaccessible by OCR methods until recently. Furthermore, OCR models trained on one part of the corpus consisting of books with different printing dates and different typesets (mixed models) have been tested for their predictive power on the books from the other part containing yet other fonts, mostly yielding character accuracies well above 90%. It therefore seems possible to construct generalized models trained on a range of fonts that can be applied to a wide variety of historical printings still giving good results. A moderate postcorrection effort of some pages will then enable the training of individual models with even better accuracies. Using this method, diachronic corpora including early printings can be constructed much faster and cheaper than by manual transcription. The OCR methods reported here open up the possibility of transforming our printed textual cultural heritage into electronic text by largely automatic means, which is a prerequisite for the mass conversion of scanned books. ", "article_title": "OCR of historical printings with an application to building diachronic corpora: A case study using the RIDGES herbal corpus", "date": "2017", "volume": "011", "issue": "2", "authors": [{"given": "Uwe", "family": "Springmann", "affiliation": [{"original_name": "LMU Munich", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}, {"original_name": "Humboldt-Universität zu Berlin", "normalized_name": "Humboldt University of Berlin", "country": "Germany", "identifiers": {"ror": "https://ror.org/01hcx6992", "GRID": "grid.7468.d"}}]}, {"given": "Anke", "family": "Lüdeling", "affiliation": [{"original_name": "Humboldt-Universität zu Berlin", "normalized_name": "Humboldt University of Berlin", "country": "Germany", "identifiers": {"ror": "https://ror.org/01hcx6992", "GRID": "grid.7468.d"}}]}], "keywords": ["OCR", "historical linguistics", "digitization", "cultural heritage", "corpus linguistics"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}