{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " The need for organising and digitally processing the vast amount of Cultural Heritage (CH) information has recently led to the development of formal knowledge representation models (ontologies) for the CH domain. Existing models, however, do not capture gender-related concepts. This article presents an effort to fill this gap by developing a new ontology for the representation of gendered concepts in CH resources. The new ontology, named GenderedCHContents resulted from combined research in women’s studies, gender theory, and computer science. Its primary aim is to draw attention to the presence of women within CH artefacts. The proposed ontology extends the Europeana Data Model (EDM) with twenty-two new classes, sixteen object properties and seven datatype properties. The article presents a demonstration of the GenderedCHContents ontology’s use in five different representation tasks, which describe five resources related to Pandora’s myth. Lastly, the study stresses the benefits of reasoning support (i.e. enabling computers to infer further information from a set of asserted facts) in revealing different gender ideals and inferred relationships between metaphorical concepts, along with the benefits of the Semantic Web in making information about gendered contents more easily retrievable to the users. ", "article_title": "An Ontology for Gendered Content Representation of Cultural Heritage Artefacts", "date": "2017", "volume": "011", "issue": "3", "authors": [{"given": "Ioanna", "family": "Kyvernitou", "affiliation": [{"original_name": "National University of Ireland, Galway (NUIG)", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}, {"given": "Antonis", "family": "Bikakis", "affiliation": [{"original_name": "University College London (UCL)", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}], "keywords": ["ontology", "cultural heritage", "semantic web", "gender theory"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}