{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " The use of new technologies, media and computational methods in Humanities may evolve and indeed it is already changing the contents and forms of contemporary education, opening new scenarios previously unimaginable. Nowadays Visual Mobile Devices, smartphones, tablets, etc, contribute to a range of computer-mediated activities, which are related to specific locations and times. But for such critical reflection, we need a closer look to deeper layers of our culture to unveil the characteristics of new technologies and devices. This paper describes some emerging aspects of the teaching use of visual communication techniques in primary and secondary schooling. In particular it reviews the evidence of the efficiency of visual communication for learning both in varied curriculum disciplines and of transversal socio-ethical affective skills necessary for the promotion of health and the construction of a planetary citizenship. The paper illuminates the didactic applicability and unique potential of images for the epistemological peculiarities of different disciplines, highlighting how educational use of images in creative pedagogy can be more focused given the function they perform in the more general cognitive process of individuals. The theoretical analysis of the teaching validity of the use of visual communication, as reported in the international literature, seems to receive confirmation from a case study, which provides detailed analyses of how this technique can enhance specific projects and demonstrates its significance for wider practitioners. ", "article_title": "Visual Communication and the promotion of Health: an exploration of how they intersect in Italian education", "date": "2019", "volume": "012", "issue": "4", "authors": [{"given": "Viviana", "family": "De Angelis", "affiliation": [{"original_name": "Università degli Studi di Bari Aldo Moro", "normalized_name": "University of Bari Aldo Moro", "country": "Italy", "identifiers": {"ror": "https://ror.org/027ynra39", "GRID": "grid.7644.1"}}]}, {"given": "Patricia Mannix", "family": "McNamara", "affiliation": [{"original_name": "University of Limerick", "normalized_name": "University of Limerick", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00a0n9e72", "GRID": "grid.10049.3c"}}]}, {"given": "Rosa", "family": "Gallelli", "affiliation": [{"original_name": "Università degli Studi di Bari Aldo Moro", "normalized_name": "University of Bari Aldo Moro", "country": "Italy", "identifiers": {"ror": "https://ror.org/027ynra39", "GRID": "grid.7644.1"}}]}, {"given": "Gemma", "family": "Pichierri", "affiliation": [{"original_name": "Media Training Expert", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}