{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Despite a general interest in exploring the possibilities of multimedia and web-based research, the humanities profession has been slow to accept digital scholarship as a valid form of intellectual endeavor. Questions about labor, peer-review, and co-authorship often arise in academic departments’ attempts to evaluate digital research in the tenure and promotion process. In this essay, we argue that these tensions stem from a general misunderstanding of the kinds of work that goes into producing scholarship in multimedia form. Multimedia work, we suggest, places scholars in an extended network that combines minds, bodies, machines, and institutional practices, and lays bare the fiction that scholars are disembodied intellectuals who labor only with the mind. We argue that while traditional ideas of what counts as scholarship continue to privilege content over form, intellectual labor over physical labor, and print over digital media, new media’s functional (and in some cases even biological) difference from old media contributes to a double erasure, for scholars working in multimedia, of both their intellectual contributions and their material labor. ", "article_title": "New Media in the Academy: Labor and the Production of Knowledge in Scholarly Multimedia", "date": "2011", "volume": "005", "issue": "3", "authors": [{"given": "Helen J.", "family": "Burgess", "affiliation": [{"original_name": "University of Maryland Baltimore County", "normalized_name": "University of Maryland, Baltimore County", "country": "United States", "identifiers": {"ror": "https://ror.org/02qskvh78", "GRID": "grid.266673.0"}}]}, {"given": "Jeanne", "family": "Hamming", "affiliation": [{"original_name": "Centenary College of Louisiana", "normalized_name": "Centenary College of Louisiana", "country": "United States", "identifiers": {"ror": "https://ror.org/02m2as397", "GRID": "grid.420570.4"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}