{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Academic libraries have an important role to play in supporting digital humanities projects in their communities. Librarians at Stony Brook University Libraries host Open Mic events for digital humanities researchers, teachers, and students on campus.  Inspired by a desire to better serve digital humanists with existing projects, this event was initially organized to increase the visibility of scholars and students with nascent projects and connect these digital humanists to library supported resources and to one another. For the Libraries, the Open Mic was an opportunity to understand the scope and practices of the digital humanities community at Stony Brook, and to identify ways to make meaningful interventions.   An open mic is a uniquely suitable event format in that it embodies a dynamic, permissive, multidisciplinary presentation space that is as much for exercising new and ongoing research (and technologies) as it is for making discoveries and connections.  The success of these events can be measured in the establishment of the University Libraries as a nexus for digital humanities work, consultations, instruction, workshops, and community on a campus without a designated digital humanities center.   The digital humanities Open Mic event at Stony Brook University locates the digital humanities within the library’s repertoire, while signaling that the library is — in a number of essential ways — open. ", "article_title": "Raising Visibility in the Digital Humanities Landscape: Academic Engagement and the Question of the Library’s Role", "date": "2019", "volume": "013", "issue": "2", "authors": [{"given": "Kathleen", "family": "Kasten-Mutkus ", "affiliation": [{"original_name": "Stony Brook University", "normalized_name": "Stony Brook University", "country": "United States", "identifiers": {"ror": "https://ror.org/05qghxh33", "GRID": "grid.36425.36"}}]}, {"given": "Laura", "family": "Costello", "affiliation": [{"original_name": "Rutgers University", "normalized_name": "Rutgers, The State University of New Jersey", "country": "United States", "identifiers": {"ror": "https://ror.org/05vt9qd57", "GRID": "grid.430387.b"}}]}, {"given": "Darren", "family": "Chase", "affiliation": [{"original_name": "SUNY Oneonta", "normalized_name": "SUNY Oneonta", "country": "United States", "identifiers": {"ror": "https://ror.org/02r3ym141", "GRID": "grid.264272.7"}}]}], "keywords": ["libraries", "collaboration", "interdisciplinarity"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}