{"url": "http://projects.chass.utoronto.ca/chwp/CHC2003/Roberts_Smith2.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In The Arte of English Poesie, putative author George Puttenham applies the word “tune”, which he says refers to musical structure, to poetic metre, saying “our maker by his measures and concordes of sundry proportions doth counterfait the harmonicall tunes [my italics] of the vocall and instrumentall Musickes”. He uses “tune” to refer, literally, to the number and duration of syllables, stress, spoken pitch, segmental features, or the combinations of some or all of these elements which he says create musical rhythms in spoken verse. Although his usage is not supported in citations dating from 1500-1700 in the OED, the working copy of the Lexicons of Early Modern English database provides new evidence supporting Puttenham's usage. Eleven contemporary hard-word dictionaries, bilingual dictionaries and rhetoric handbooks by Sherry (1550), Cooper (1584), Thomas (1587), Coote (1596), Minsheu (1599), Cawdrey (1604), Florio (1598, 1611), Cotgrave (1611), Cockeram (1623), and Blount (1656) use “tune” to signify musical rhythm, spoken pitch, and prosody. They also use “tune” as a synonym for “accent”, which signifies syllable duration and stress. In all eleven lexical works, “tune” is an easy word used to explain other, more difficult words, including “accent”. The lexicographers' expectation that readers will be familiar with their usage of the word “tune” suggests that people in the English Renaissance generally heard the musical elements of “tune” in spoken language. Poets who use “tune” to describe metre or rhythm, such as Ben Jonson and Shakespeare, may have exploited its musical elements (syllable duration and spoken pitch) in their poetry.", "article_title": "Puttenham rehabilitated: the significance of ‘tune’ in The Arte of English Poesie", "authors": [{"given": "Jennifer", "family": "Roberts-Smith", "affiliation": [{"original_name": "Department of English, University of Toronto", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}]}], "publisher": null, "date": "2003", "keywords": ["poetry, music, Renaissance, tune, Puttenham, The Arte of English Poesie, dictionaries, Lexicons of Early Modern English, LEME, metre, rhythm, Early Modern English"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}