{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Named Entity Recognition (NER), search, classification and tagging of names and name-like informational elements in texts, has become a standard information extraction procedure for textual data. NER has been applied to many types of texts and different types of entities: newspapers, fiction, historical records, persons, locations, chemical compounds, protein families, animals etc. In general, the performance of a NER system is genre- and domain-dependent and also used entity categories vary . The most general set of named entities is usually some version of a tripartite categorization of locations, persons, and organizations. In this paper we report trials and evaluation of NER with data from a digitized Finnish historical newspaper collection (Digi). Experiments, results, and discussion of this research serve development of the web collection of historical Finnish newspapers. Digi collection contains 1,960,921 pages of newspaper material from 1771–1910 in both Finnish and Swedish. We use only material of Finnish documents in our evaluation. The OCRed newspaper collection has lots of OCR errors; its estimated word level correctness is about 70–75 % . Our principal NE tagger is a rule-based tagger of Finnish, FiNER, provided by the FIN-CLARIN consortium. We also show results of limited category semantic tagging with tools of the Semantic Computing Research Group (SeCo) of the Aalto University. Three other tools are also evaluated briefly. This paper reports the first large scale results of NER in a historical Finnish OCRed newspaper collection. Results of this research supplement NER results of other languages with similar noisy data. As the results are also achieved with a small and morphologically rich language, they illuminate the relatively well-researched area of Named Entity Recognition from a new perspective. ", "article_title": "Old Content and Modern Tools – Searching Named Entities in a Finnish OCRed Historical Newspaper Collection 1771–1910", "date": "2017", "volume": "011", "issue": "3", "authors": [{"given": "Kimmo", "family": "Kettunen", "affiliation": [{"original_name": "National Library of Finland, Mikkeli, Finland", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Eetu", "family": "Mäkelä", "affiliation": [{"original_name": "University of Helsinki, Helsinki Centre for Digital Humanities", "normalized_name": "University of Helsinki", "country": "Finland", "identifiers": {"ror": "https://ror.org/040af2s02", "GRID": "grid.7737.4"}}]}, {"given": "Teemu", "family": "Ruokolainen", "affiliation": [{"original_name": "National Library of Finland, Mikkeli, Finland", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Juha", "family": "Kuokkala", "affiliation": [{"original_name": "University of Helsinki, Department of Modern Languages, Helsinki, Finland", "normalized_name": "University of Helsinki", "country": "Finland", "identifiers": {"ror": "https://ror.org/040af2s02", "GRID": "grid.7737.4"}}]}, {"given": "Laura", "family": "Löfberg", "affiliation": [{"original_name": "Department of Linguistics and English Language, Lancaster University, UK", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}], "keywords": ["named entity recognition", "historical newspaper collections", "Finnish"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}