{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " The Almanac Archive, a project in its early stages of development, seeks to create a corpus of annotated British almanacs from 1750-1850. Cheap and useful, the almanac was one of the most commonly purchased and frequently read print genres during the eighteenth and nineteenth centuries. By focusing on readers’ annotations in almanacs about everything from social engagements and weather to historical events and the breeding of livestock, The Almanac Archive offers insights into everyday life and ideologies of time. Creating a searchable, digital corpus of high-resolution images from annotated almanacs will encourage new research questions about the relationship between historical events, individuals’ everyday lives, and the materiality of Romantic-era interfaces for tracking time. By theorizing and sharing the ultimate goals and, indeed, challenges of the project even at its early stages, our aim in this paper is to answer Johanna Drucker’s call to pay [m]ore attention to acts of producing and [to put] less emphasis on product during the creation of an interface in order to expose and support the activity of interpretation, rather than to display finished forms . In openly describing the unfinished form of The Almanac Archive and its relationship to current scholarly trends, we outline the technical and theoretical work going into its creation. ", "article_title": "The Almanac Archive: Theorizing Marginalia and Duplicate Copies in the Digital Realm", "date": "2016", "volume": "010", "issue": "1", "authors": [{"given": "Lindsey", "family": "Eckert", "affiliation": [{"original_name": "Georgia State University", "normalized_name": "Georgia State University", "country": "United States", "identifiers": {"ror": "https://ror.org/03qt6ba18", "GRID": "grid.256304.6"}}]}, {"given": "Julia", "family": "Grandison", "affiliation": [{"original_name": "University of Toronto", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}]}], "keywords": ["database design", "archive", "marginalia", "digitization", "Romanticism", "almanacs"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}