{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Humanistic uses of digital technologies have opened up new ways to think about, communicate, and discuss historical research. The common use of digital tools to visually represent ancient cultures and sites, however, has also introduced new issues. For example, critics have argued that digital visualisations, largely synonymous with reconstruction in 3D models, often attempt to represent a photorealistic-artificial vision of the past, and may often prove to be a way to communicate history to a large(r) audience . Against this backdrop, this article will discuss precisely how technology may help immerse researchers into historically situated life, and radically advance historical research. Adding to related criticisms of ocularcentric traditions of knowledge production, we contribute to this stream of research by arguing that contemporary visual representations of the past often concentrate on visual representations and seemingly maintain antiquity as a sanitised historio-cultural ideal . More specifically, this article seeks to demonstrate the potential of digital humanities to move beyond mere representations on screen and to mobilize other senses (specifically sound) as a historically situated component for research. For this purpose, we focus on the abstract principles and overall methodology for a recreation of the experience of sounds in the Roman amphitheatre. ", "article_title": "Experiential Analogies: A Sonic Digital Ekphrasis as a Digital Humanities Project", "date": "2016", "volume": "010", "issue": "2", "authors": [{"given": "Anna", "family": "Foka", "affiliation": [{"original_name": "Umeå University", "normalized_name": "Umeå University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/05kb8h459", "GRID": "grid.12650.30"}}]}, {"given": "Viktor", "family": "Arvidsson", "affiliation": [{"original_name": "Swedish Center for Digital Innovation. Department of Informatics, University of Oslo", "normalized_name": "University of Oslo", "country": "Norway", "identifiers": {"ror": "https://ror.org/01xtthb56", "GRID": "grid.5510.1"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}