{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Artistic representations of African-descendant cultures in Latin America, the Hispanic Caribbean, and the Hispanic World have emerged as the outcome of multiple exchanges, inventions, and cultural coexistences. Such representations take part of a network where cultural, ethnic, social, artistic, literary, and racial information circulates, giving shape to centers with multiple connections at different scales. In accordance with this, the main aim of this article is to demonstrate how Cuba’s predominance for the representation of such cultural pattern is not only based on the significance of particular artistic figures, but also on the connectivity that the island as a cultural node has with respect to the ‘global’ network of African and African-descendant representations. In order to achieve this aim, we carry out two main tasks: a) network analysis looking at related concepts such as centrality, connectivity, betweenness, modularity, etc., through a methodology that takes into account topic-map analysis and the use of Page Ranking Algorithm [the algorithm used by good part of search engines such as Google] as the basic formula to filter and organize information; b) local analysis of two nodes that take part of Cuba’s cluster in order to compare the results of the analysis of networks with a more socio-literary analysis that focuses on detailed reading of some of their messages (works, paratexts, prologues, interviews, etc): Nicolás Guillén and Alejo Carpentier. As matter of conclusions, we evaluate not only our findings with regards to Cuba but also the methodology as a contribution to the field of the Digital humanities and its practices of analysis. ", "article_title": "Modeling Afro-Latin American Artistic Representations in Topic Maps: Cuba’s Prominence in Latin American Discourse", "date": "2013", "volume": "007", "issue": "1", "authors": [{"given": "Eduard A.", "family": "Arriaga", "affiliation": [{"original_name": "University of Western Ontario", "normalized_name": "Western University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02grkyz14", "GRID": "grid.39381.30"}}]}, {"given": "Fernando", "family": "Sancho Caparrini", "affiliation": [{"original_name": "University of Sevilla", "normalized_name": "University of Seville", "country": "Spain", "identifiers": {"ror": "https://ror.org/03yxnpp24", "GRID": "grid.9224.d"}}]}, {"given": "Juan Luis", "family": "Suárez", "affiliation": [{"original_name": "University of Western Ontario", "normalized_name": "Western University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02grkyz14", "GRID": "grid.39381.30"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}