{"url": "http://projects.chass.utoronto.ca/chwp/patterson/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Since the correspondences of any one writer over a lifetime document hundreds of associative links comprising perhaps thousands of interpersonal transactions, and because each letter in itself may record many other interpersonal transactions performed or desired, the mapping of such associative links requires a reliable method of storing and retrieving data generated from the letter texts for first constructing individual social network profiles and then later for comparing them. Database programs have the capacity to store, order, reconfigure, and retrieve vast amounts of data. Hypertext theory and technology suggest new approaches to reading as well as representing epistolary texts. Together these technologies can assist in representing the social associations and affiliations of epistolary discourse. The hypertextual \"Anna Jameson and her Friends Database\", designed to reflect my approach to epistolary communication as well as to generate data for the mapping of Jameson's social network profile, is both what I hope will be a useful resource in itself and the first stage of my inquiry into the networking of early to mid-nineteenth-century women writers.", "article_title": "The \"Anna Jameson and her Friends Database\": Mapping Anna Jameson's Associative Links with the Victorian Intellectual Community", "authors": [{"given": "Katharine", "family": "Patterson", "affiliation": [{"original_name": "Simon Fraser University", "normalized_name": "Simon Fraser University", "country": "Canada", "identifiers": {"ror": "https://ror.org/0213rcc28", "GRID": "grid.61971.38"}}, {"original_name": "University of British Columbia", "normalized_name": "University of British Columbia", "country": "Canada", "identifiers": {"ror": "https://ror.org/03rmrcq20", "GRID": "grid.17091.3e"}}]}], "publisher": null, "date": "2000", "keywords": ["Written correspondence, associative links, social networks, hypertext, epistolary discourse, nineteenth century, women writers"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}