{"url": "http://computerphilologie.digital-humanities.de/jg05/veit.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "From the perspective of an editor who intends to make use of the new digital technologies some of the digital libraries and numerous musical databases founded within the last years (or, in a few cases, even in the last third of the last century) prove to be very helpful for daily work. But nevertheless, digital editions in a narrow sense are very rare in the field of music. Looking for the real reason for the delay of musicology in this field of research one has to admit that music proves to be very resistant to all endeavours of encoding. The mixture of graphical and letter symbols or ›normal‹ words in musical notation and the ambiguity of many musical signs lead to a lot of problems when trying to find a good, comprehensive and lasting representing system – which is the precondition for all sorts of analytical operations and for long-term editions too. Today all editions are done with proprietary software often totally out-dated a few years after publication. So one of the most urgent tasks is to find a standard representing system for music (notation). MusicXML and the XML-Code of the Music Encoding Initiative (MEI) are important steps on the way to a form of encoding which will allow the integration of versions and variants and their future re-visualization on the screen. A further problem is the electronic ›mapping‹ of music facsimiles. (Such facsimiles are of the utmost importance for editorial arguing.) But musicologists share these problems with all scholars dealing with ›written‹ documents, and this should be a cause to take joint action. A pool of digitally accessible sources and editions following the same electronic standards may be a starting point for basic research in musicology in a form which was unthinkable until now.", "article_title": "Musikwissenschaft und Computerphilologie – eine schwierige Liaison?", "authors": [{"given": "Joachim", "family": "Veit", "affiliation": [{"original_name": "Carl-Maria-von-Weber-Gesamtausgabe, Musikwissenschaftliches Seminar Detmold/Paderborn", "normalized_name": "Musikwissenschaftliches Seminar Detmold/Paderborn", "country": "Germany", "identifiers": {"ror": "https://ror.org/023392c84", "GRID": "grid.506479.9"}}]}], "publisher": null, "date": "2005", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}