{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " We present a case study on visualizing a collection of historic drawings along its metadata structure while also allowing for close examination of the artifacts’ texture. With regards to the specific character of cultural heritage at the intersection of research, education, and public interest, the presented visualization environment aims at meeting the requirements of both researchers as well as a broader public. We present the results from a collaborative interdisciplinary research project that involved a cultural heritage foundation, art historians, designers, and computer scientists. The case study examines the potential of visualization when applied to, and developed for, cultural heritage collections. It specifically explores how techniques aimed at visualizing the quantitative structure of a collection can be coupled with a more qualitative mode that allows for detailed examination of the artifacts and their contexts by displaying high-resolution views of digitized cultural objects with detailed art historical research findings. Making use of latest web technologies, the resulting visualization environment allows for dynamic filtering and zooming of a collection of visual resources that are arranged along a contextualized timeline. We share insights from our collaborative design process and the feedback and usage data gathered during the deployment of the resulting prototype as a web application. We end with a discussion of transferability of carefully crafted and collaboratively negotiated visualizations of cultural heritage and raise questions concerning the applicability of our approach to related strands of humanities research. ", "article_title": "Past Visions and Reconciling Views: Visualizing Time, Texture and Themes in Cultural Collections", "date": "2017", "volume": "011", "issue": "2", "authors": [{"given": "Katrin", "family": "Glinka", "affiliation": [{"original_name": "University of Applied Sciences Potsdam", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Christopher", "family": "Pietsch", "affiliation": [{"original_name": "University of Applied Sciences Potsdam", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Marian", "family": "Dörk", "affiliation": [{"original_name": "University of Applied Sciences Potsdam", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "keywords": ["Visualization in the Humanities", "Digital Art History", "Zooming and Navigation Techniques", "Digital Collections"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}