{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " This article sheds an empirical light on interdisciplinary collaboration within the Digital Humanities by investigating the daily research practice of the Dutch Digital Humanities-project BRIDGE. The project developed and tested methods for automatically creating meaningful links and expanding archival television data. In the project, a high level of collaboration was required between scholars from two different disciplines: computer sciences and media studies. The majority of the epistemological encounters between the two disciplines took place in the design of the developed tools and the user studies to test the tools. The article is based on structured conversations between the two central staff members in the project, i.e. the computer science PhD-student and the media studies postdoctoral researcher. By unravelling the research project as a process of confrontation, identification and acknowledgement of situated knowledges, the article shows when and how the boundaries between the two disciplines have been maintained, crossed and blurred. The authors point to the benefits and challenges of interdisciplinary collaboration in the Digital Humanities, and formulate some best practices for future Digital Humanities-projects. ", "article_title": "Building Bridges: Collaboration between Computer Sciences and Media Studies in a Television Archive Project", "date": "2019", "volume": "013", "issue": "3", "authors": [{"given": "Jasmijn", "family": "Van Gorp", "affiliation": [{"original_name": "Utrecht University", "normalized_name": "Utrecht University", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/04pp8hn57", "GRID": "grid.5477.1"}}]}, {"given": "Marc", "family": "Bron", "affiliation": [{"original_name": "Schibsted", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}