{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " In this study, we present the first large-scale quantitative analysis of a corpus of censored historical Hebrew manuscripts that have survived through the ages. A new multi-dimensional ontology-based approach was applied to explore the geographic, temporal, actor- and subject-based distribution of censorship events. We adopted an ontology-based approach to apply statistical analysis on the metadata of censored Hebrew manuscripts for estimating the scope and quantifying the extent of the known facts on the censorship activity and its various characteristics over the years. In addition, we revealed some previously unknown phenomena and trends. Particularly, we analysed the relationship of censorship on other types of events in manuscripts’ lifecycle and compared the distribution of censored vs. non-censored manuscripts in different dimensions. We also devised a set of rules to complete the missing locations of over 50% of censorship events, which has substantially changed the big picture of spatial distribution of censorship activity. From the temporal perspective our findings demonstrate that censorship was conducted in waves and there was a decrease in the creation of new manuscripts in periods of high censorship activity. Certain subjects, such as Kabbalah and Philosophy were censored significantly more than others, and the locations and script types’ distribution in censored manuscripts differs from the non-censored manuscripts. ", "article_title": "A multi-dimensional ontology-based analysis of the Censorship of Hebrew Manuscripts", "date": "2020", "volume": "014", "issue": "1", "authors": [{"given": "Gila", "family": "Prebor", "affiliation": [{"original_name": "Department of Information Science Bar-Ilan University, Ramat Gan, 52900, Israel", "normalized_name": "Bar-Ilan University", "country": "Israel", "identifiers": {"ror": "https://ror.org/03kgsv495", "GRID": "grid.22098.31"}}]}, {"given": "Maayan", "family": "Zhitomirsky-Geffet", "affiliation": [{"original_name": "Department of Information Science Bar-Ilan University, Ramat Gan, 52900, Israel", "normalized_name": "Bar-Ilan University", "country": "Israel", "identifiers": {"ror": "https://ror.org/03kgsv495", "GRID": "grid.22098.31"}}]}, {"given": "Isaac", "family": "Miller", "affiliation": [{"original_name": "Department of Information Science Bar-Ilan University, Ramat Gan, 52900, Israel", "normalized_name": "Bar-Ilan University", "country": "Israel", "identifiers": {"ror": "https://ror.org/03kgsv495", "GRID": "grid.22098.31"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}