{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " This paper analyzes the design space for crafting systems within games. A crafting system is the collection of game mechanics which enable a player to create virtual objects within a game, with examples ranging from making a pickaxe or placing blocks in Minecraft, to combining ingredients to create items in World of Warcraft, or designing a city in SimCity. Within both game design and game journalism there is no systematic understanding of what crafting means in games — rather, the term is used in an informal I’ll know it when I see it way, with different ideas of what constitutes crafting becoming conventional for different game genres. We aim to create a more systematic analysis and language for virtual crafting, using a design space approach where we identify seven features of crafting systems; any given crafting system is understood in terms of the degree and manner in which it exemplifies these features. The features we identify are: recipe definition (how well-defined are the player steps for creating a virtual object), fidelity of action (how detailed is the player-performed enactment of crafting), completion constraints (how is creation constrained by virtual resources), variable outcome (how much can the result vary when the player performs the same crafting actions), system recognition of outcome (to what degree do other game systems understand and take account of what a player has made), player expressiveness (how big is the creative space provided to the player), and progression (how do the possibilities of crafting change over time). We apply these dimensions to the analysis of 64 crafting systems across 47 example games. This more systematic analysis of the crafting system design space provides a deeper understanding of how games function as a creative and artistic medium for players, and provides a language and framework enabling scholars, critics and developers to more deeply understand existing crafting systems as well as unexplored opportunities for future crafting systems. ", "article_title": "Crafting in Games", "date": "2017", "volume": "011", "issue": "4", "authors": [{"given": "April", "family": "Grow", "affiliation": [{"original_name": "University of California Santa Cruz", "normalized_name": "University of California, Santa Cruz", "country": "United States", "identifiers": {"ror": "https://ror.org/03s65by71", "GRID": "grid.205975.c"}}]}, {"given": "Melanie", "family": "Dickinson", "affiliation": [{"original_name": "University of California Santa Cruz", "normalized_name": "University of California, Santa Cruz", "country": "United States", "identifiers": {"ror": "https://ror.org/03s65by71", "GRID": "grid.205975.c"}}]}, {"given": "Johnathan", "family": "Pagnutti", "affiliation": [{"original_name": "University of California Santa Cruz", "normalized_name": "University of California, Santa Cruz", "country": "United States", "identifiers": {"ror": "https://ror.org/03s65by71", "GRID": "grid.205975.c"}}]}, {"given": "Noah", "family": "Wardrip-Fruin", "affiliation": [{"original_name": "University of California Santa Cruz", "normalized_name": "University of California, Santa Cruz", "country": "United States", "identifiers": {"ror": "https://ror.org/03s65by71", "GRID": "grid.205975.c"}}]}, {"given": "Michael", "family": "Mateas", "affiliation": [{"original_name": "University of California Santa Cruz", "normalized_name": "University of California, Santa Cruz", "country": "United States", "identifiers": {"ror": "https://ror.org/03s65by71", "GRID": "grid.205975.c"}}]}], "keywords": ["game studies", "crafting", "video games"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}