{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " This extended interview with Geoffrey Rockwell was carried out via Skype on the 28th April 2012. He narrates that he had been aware of computing developments when growing up in Italy but it was in college in the late 1970s that he took formal training in computing. He bought his first computer, an Apple II clone, after graduation when he was working as a teacher in the Middle East. Throughout the interview he reflects on the various computers he has used and how the mouse that he used with an early Macintosh instinctively appealed to him. By the mid-1980s he was attending graduate school in the University of Toronto and was accepted on to the Apple Research Partnership Programme, which enabled him to be embedded in the central University of Toronto Computing Services; he went on to hold a full time position there. Also taking a PhD in Philosophy, he spent many lunch times talking with John Bradley. This resulted in the building of text analysis tools and their application to Hume's Dialogues Concerning Natural Religion, as well as some of the earliest, if not the earliest, conference paper on visualisation in the digital humanities community. He reflects on the wide range of influences that shaped and inspired his early work in the field, for example, the Research Computing Group at the University of Toronto and their work in visual programming environments. In 1994 he applied, and was hired at McMaster University to what he believes was the first job openly advertised as a humanities computing position in Canada. After exploring the opposition to computing that he encountered he reflects that the image of the underdog has perhaps become a foundational myth of digital humanities and questions whether it is still a useful one. ", "article_title": " Trading Stories: an Oral History Conversation between Geoffrey Rockwell and Julianne Nyhan ", "date": "2012", "volume": "006", "issue": "3", "authors": [{"given": " Geoffrey", "family": "Rockwell", "affiliation": [{"original_name": " University of Alberta ", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}, {"given": " Julianne", "family": "Nyhan", "affiliation": [{"original_name": " University College London ", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Anne", "family": "Welsh", "affiliation": [{"original_name": "University College London", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Jessica", "family": "Salmon", "affiliation": [{"original_name": " University of Trier ", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}