{"url": "http://computerphilologie.digital-humanities.de/jg08/keating1.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In this, part one of a two part paper, we will discuss the approach taken during the creation of a digital edition of the Alcalá Account Book manuscript. The Alcalá Project was originally proposed as a digital humanities project to mark a humanities collaboration between the University of Alcalá de Henares (UAH), Spain, and the National University of Ireland, Maynooth (NUIM). The source was to be a Spanish eighteenth century account book recording the monthly expenses of the Royal Irish College of Saint George the Martyr. In the given time-frame, the source manuscript was chosen, encoded and made available in a web based, dual language, searchable and interactive environment. More importantly, a virtual framework was developed to aid the historian in answering historically pertinent research questions that are specifically prompted by the historical object – an account book. We contend that by creating a digital edition that represents the original Alcalá Account Book manuscript and its functionality, we have provided the end-user (for example the historian) with a richer environment for performing research, and a research tool that is specifically designed to be fit for purpose. The approach is informed by the discipline of the participants, and also takes account of current best practice in humanities and digital humanities. We aim here to provide a description of that digitisation process and the methodologies we used to make design decisions. Part two, Formalisation and Encoding, will address the theoretical framework and practicalities of formalising and encoding the source.", "article_title": "A Digital Edition of a Spanish 18th Century Account Book: User Driven Digitisation", "authors": [{"given": "John G", "family": "Keating", "affiliation": [{"original_name": "An Foras Feasa, National University of Ireland, Maynooth", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}, {"given": "Thomas", "family": "O’Connor", "affiliation": [{"original_name": "An Foras Feasa, National University of Ireland, Maynooth", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}, {"given": "Aja", "family": "Teehan", "affiliation": [{"original_name": "An Foras Feasa, National University of Ireland, Maynooth", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}, {"given": "Damien", "family": "Gallagher", "affiliation": [{"original_name": "An Foras Feasa, National University of Ireland, Maynooth", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}], "publisher": null, "date": "2009", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}