{"url": "http://computerphilologie.digital-humanities.de/jg00/christma/christma.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Much praised and much criticized but certainly unique: The forming of the Deutsches Wörterbuch (DWB) by Jacob and Wilhelm Grimm took far more than one hundred years and engaged generations of lexicographers who have contributed a total of approximately 350.000 entries to be collected in 67.744 dictionary columns that were published in sixteen volumes (32 sections). The DWB comprises the most thorough account of the German language and reflects a period of more than one hundred years of lexicographical, cultural, institutional, and also political history; thus it proves indispensable for research and teaching. It marks a further step in the history of this dictionary, to make it available in the electronic medium, and to recognize and encode its heterogeneous structures systematically. Since November 1998 a project team at the University of Trier prepares a computerized version of the DWB to be published on CD-ROM and also be made available via Internet. Accessibility of this outstanding dictionary will be improved thereby enlargening its user community independent of libraries' opening hours. The adaptation of the dictionary's contents will be according to international standards: The use of SGML determined by the TEI-guidelines will support the aim to obtain new possibilities in its usage: A markup of the dictionary's contents taking into account the specific demands of dictionary structures enables to provide selective access to various positions of each dictionary entry, offering far wider possibilities of dictionary usage than conventional full-text search requests can supply. Systematic analysis of quotations and its references will be ensured by interlinking those with the DWB's index volume. After a brief outline of the DWB's structure, history, and value, this paper stresses upon following the steps to a computerized version of the DWB. The stages from data input, correction procedures, and automatic markup according to SGML standards to the provision of a graphical user interface will be discussed, emphasizing on the difficulties arising from the dictionary's hetergeneous structure and contents.", "article_title": "EIN »HAUSBUCH«[1] FÜR ALLE? - DAS DEUTSCHE WÖRTERBUCH DER BRÜDER GRIMM AUF CD-ROM UND IM INTERNET", "authors": [{"given": "Thomas", "family": "Burch", "affiliation": [{"original_name": "Germanistik/Ältere deutsche Philologie, Universität Trier", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}, {"given": "Ruth", "family": "Christmann", "affiliation": [{"original_name": "Germanistik/Ältere deutsche Philologie, Universität Trier", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}, {"given": "Vera", "family": "Hildenbrandt", "affiliation": [{"original_name": "Germanistik/Ältere deutsche Philologie, Universität Trier", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}, {"given": "Thomas", "family": "Schares", "affiliation": [{"original_name": "Germanistik/Ältere deutsche Philologie, Universität Trier", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}], "publisher": null, "date": "2000", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}