{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " What is the status of digital literature in contemporary culture? Many scholars and practitioners assume that digital literature constitutes a contemporary avant-garde, which does its work of experimentation outside or in opposition to the mainstream. The notion of the avant-garde might seem thoroughly out of date in a consideration of the digital future. Important theorists (e.g. Huyssen, Drucker) have argued that the avant-garde is no longer viable even for traditional media and art practices. On the other hand, the avant-gardes of twentieth-century modernism made claims about the function of art that remain surprisingly influential today – within the art community and within popular culture. As Peter Bürger and others have discussed, an important division grew up in modernism on the question of whether art should strive for formal innovation or for sociopolitical change. Avant-gardes of the twentieth century took up positions along a spectrum from pure formalism (e.g. the Abstract Expressionists) to overt political action (e.g. the Situationists). While the digital literature community is in general committed to formal innovation, some are critical of this commitment, in part on the political grounds that (technological) innovation has become a byword for the digital culture industry. Although the modernist problem is still apparent in some digital art and digital literature today, writers such as Jason Nelson seem to be moving beyond that dialectic. ", "article_title": "Digital Literature and the Modernist Problem", "date": "2011", "volume": "005", "issue": "3", "authors": [{"given": "Maria", "family": "Engberg", "affiliation": [{"original_name": "Blekinge Institute of Technology", "normalized_name": "Blekinge Institute of Technology", "country": "Sweden", "identifiers": {"ror": "https://ror.org/0093a8w51", "GRID": "grid.418400.9"}}]}, {"given": "Jay David", "family": "Bolter", "affiliation": [{"original_name": "Georgia Institute of Technology", "normalized_name": "Georgia Institute of Technology", "country": "United States", "identifiers": {"ror": "https://ror.org/01zkghx44", "GRID": "grid.213917.f"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}