{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Thomas Paine's Rights of Man (Part I, 1791; Part II, 1792) is one of the most influential political tracts ever written. Recently, Clark (2015) has queried the long-established notion that Part I is the work of a single author, Paine himself. Clark argues that a passage of approximately 6000 words just prior to the Declaration of the Rights of Man and Citizens, near midway through the book, was written by Gilbert du Motier, Marquis de Lafayette, and inserted by Paine into his book, perhaps with some editing. Clark's assertion rests mainly on judgement of the tone and content of the queried passage, as well as a hint in a letter by Lafayette to George Washington. This paper presents the results of a stylometric study of this question. Three computational approaches to stylistic analysis — one involving a consensus of six attribution techniques — were applied to the text of the Rights of Man, Part I, along with a corpus of comparison texts from the same period. Our findings tend to corroborate Clark's contention, as well as identifying two other short passages in which Lafayette may have had a hand, thus rendering this important document ripe for re-interpretation. ", "article_title": "The Writeprints of Man: a Stylometric Study of Lafayette's Hand in Paine's 'Rights of Man'", "date": "2018", "volume": "012", "issue": "1", "authors": [{"given": "Richard", "family": "Forsyth", "affiliation": [{"original_name": "Independent Researcher", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "David", "family": "Holmes", "affiliation": [{"original_name": "Department of Statistics, George Mason University", "normalized_name": "George Mason University", "country": "United States", "identifiers": {"ror": "https://ror.org/02jqj7156", "GRID": "grid.22448.38"}}]}], "keywords": ["Authorship Attribution", "Co-Authorship", "Computational Stylistics", "Revolutionary Writings", "Stylometry", "Text Classification."], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}