{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Harold Short recounts that his interest in Computing and the Humanities goes back to when he was an undergraduate in English and French at a university in the former Rhodesia (now Zimbabwe). There, whilst undertaking summer work in the library, he saw first-hand the potential of digital methods. After arriving in London in 1972 he took an Open University degree in mathematics, computing and systems. Among his early influences he identifies the reading he did on matters related to cognitive science whilst undertaking a postgraduate certificated in education. In the UK he worked at the BBC as programmer, systems analyst and then systems manager. In 1988 he moved to King's College London to take up the post of Assistant Director in Computing Services for Humanities and Information Management. One of his first tasks was to work with the Humanities Faculty to develop an undergraduate programme in humanities and computing. The first digital humanities conference he attended was the first joint international conference of ALLC and ACH, held at the University Toronto in 1989, which c. 450 people attended. He reflects on aspects of the institutional shape of the field towards the end of the 1980s, including the key Centres that existed then, the first meeting of the Association for Literary and Linguistic Computing (ALLC) and those who were active in it such as Roy Wisbey, Susan Hockey and the late Antonio Zampolli. He gives a detailed discussion of the development of what is now the Department of Digital Humanities in King's College London, both in terms of the administrative and institutional issues involved, as well as the intellectual. He also reflects on some of the most successful collaborations that the Department has been involved in, for example, the AHRC funded Henry III Fine Rolls project, and the conditions and working practices that characterised them. He closes by discussing his impressions about the movement of scholars into and out of the discipline and of the institutional issues that have had an impact on digital humanities centres. ", "article_title": " Collaboration Must Be Fundamental or It's Not Going to Work: an Oral History Conversation between Harold Short and Julianne Nyhan ", "date": "2012", "volume": "006", "issue": "3", "authors": [{"given": " Harold", "family": "Short", "affiliation": [{"original_name": "King's College London", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}, {"original_name": "University of Western Sydney", "normalized_name": "Western Sydney University", "country": "Australia", "identifiers": {"ror": "https://ror.org/03t52dk35", "GRID": "grid.1029.a"}}]}, {"given": " Julianne", "family": "Nyhan", "affiliation": [{"original_name": " University College London ", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Anne", "family": "Welsh", "affiliation": [{"original_name": "University College London", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Jessica", "family": "Salmon", "affiliation": [{"original_name": " University of Trier ", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}