{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " The past twenty years have witnessed a mounting crisis in academic publishing. Companies such as Reed-Elsevier, Wiley-Blackwell, and Taylor and Francis have earned unprecedented profits by controlling more and more scholarly output while increasing subscription rates to academic journals. Thus publishers have consolidated their influence despite widespread hopes that digital platforms would disperse control over knowledge production. Open access initiatives dating back to the mid-1990s evidence a religious zeal for overcoming corporate interests in academic publishing, with key advocates branding their efforts as archivangelism. Little attention has been given to the legacy or implications of religious rhetoric in open access debates despite its increasing pitch in recent years. This essay shows how the Protestant imaginary reconciles–rather than opposes–open access initiatives with market economics by tracing the rhetoric of openness to free-market liberalism. Working against the tendency to accept the Reformation as an analogy for the relationship between knowledge production, publishers, and academics, we read Protestantism as a counterproductive element of the archivangelist inheritance. ", "article_title": "Open Access and the Theological Imagination", "date": "2017", "volume": "011", "issue": "4", "authors": [{"given": "Talea", "family": "Anderson", "affiliation": [{"original_name": "Washington State University", "normalized_name": "Washington State University", "country": "United States", "identifiers": {"ror": "https://ror.org/05dk0ce17", "GRID": "grid.30064.31"}}]}, {"given": "David", "family": "Squires", "affiliation": [{"original_name": "University of Louisiana at Lafayette", "normalized_name": "University of Louisiana at Lafayette", "country": "United States", "identifiers": {"ror": "https://ror.org/01x8rc503", "GRID": "grid.266621.7"}}]}], "keywords": ["open access", "open source", "scholarly communications", "digital publishing", "religion", "rhetoric"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}