{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " This extended interview with Ray Siemens was carried out on June 21st at Digital Humanities 2011, Stanford University. It explores Siemens' early training and involvement in the field that is now known as digital humanities. He recalls that his first experience with computing was as a video gamer and programmer in high school. He had the opportunity to consolidate this early experience in the mid-1980s, when he attended the University of Waterloo as an undergraduate in the department of English where he undertook, inter alia, formal training in computing. He communicates stronglythe vibrancy of the field that was already apparent during his graduate years (up to c. 1991) and identifies some of the people in places such as the University of Alberta, University of Toronto, Oxford, and the University of British Columbia who had a formative influence on him. He gives a clear sense of some of the factors that attracted him to computing, for example, the alternatives to close reading that he was able to bring to bear on his literary research from an early stage. So too he reflects on computing developments whose applications were not immediately foreseeable, for example, when in 1986 he edited IBM's TCP/IP manual he could not have foreseen that by 1989 TCP/IP would be firmly established as the communication protocol of the internet. He closes by reflecting on the prescience of the advice that his father, also an academic, gave him regarding the use of computing in his research and on his early encounters with the conference scene. ", "article_title": " Video-gaming, Paradise Lost and TCP/IP: an Oral History Conversation between Ray Siemens and Anne Welsh ", "date": "2012", "volume": "006", "issue": "3", "authors": [{"given": " ", "family": "Siemens", "affiliation": [{"original_name": " University of Victoria ", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": " ", "family": "Welsh", "affiliation": [{"original_name": "University College London", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " ", "family": "Nyhan", "affiliation": [{"original_name": " University College London ", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " ", "family": "Salmon", "affiliation": [{"original_name": " University of Trier ", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}