{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " With the Maker Movement promoting a refreshing DIY ethic in regard to creation and epistemology, the time might be ripe for scholars to adopt such techniques into their own research, particularly in the subfield of mobile communication studies. One can now relatively easily participate in the building and implementation of a variety of digital products, such as mobile apps, that can then be used to study user experiences through interactions with rhetorical forms, including a variety of types of informatics. Our experiences in several projects that use both large- and small-scale mobile apps offer a critique and lessons learned directly from engaging in this type of field experimentation, including reflections on observations, survey responses, and other types of data collection made possible through this model. Four larger issues are addressed here, about conducting research through making apps, providing potential research paths, opportunities and challenges to consider. Perhaps most importantly, this research approach offers the ability to tailor an instrument specific to research needs and then test that instrument in a natural setting, affording a true sense of how people interact with their environments in real situations and real settings. ", "article_title": "The App-Maker Model: An Embodied Expansion of Mobile Cyberinfrastructure", "date": "2016", "volume": "010", "issue": "3", "authors": [{"given": "Brett", "family": "Oppegaard", "affiliation": [{"original_name": "University of Hawaii", "normalized_name": "University of Hawaii System", "country": "United States", "identifiers": {"ror": "https://ror.org/03tzaeb71", "GRID": "grid.162346.4"}}]}, {"given": "Michael", "family": "Rabby", "affiliation": [{"original_name": "Washington State University Vancouver", "normalized_name": "Washington State University Vancouver", "country": "United States", "identifiers": {"ror": "https://ror.org/00g2fk805", "GRID": "grid.502359.8"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}