{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " This essay responds to two questions at the heart of the Invisible Labor in the Digital Humanities 2016 symposium at Florida State University: (1) what is at stake in making unseen work visible, and (2) how can DH projects equally distribute and value the labor involved in their construction? For us, the answer to these questions lies in privileging the pedagogical affordances of data construction by crafting a workflow that included undergraduates as intellectual partners, and using DH methods to visualize and make public this collaborative labor. By drawing on our work with Photogrammar, which visualizes federal New Deal documentary projects including photography and life histories, we highlight three strategies for making labor visible in the digital humanities. First, we discuss how this project served as a tool for teaching undergraduate students key methods in DH by giving them experience with conducting original research with credit on the public site. In this way, we explain how pedagogy can become a part of project development. Second, we argue that DH visualization techniques can make the labor behind DH projects visible. We focus on how Photogrammar uses a timeline and network analysis alongside the traditional About page to make visible all participants in the project. Third, we turn to an open discussion of the challenges faced in the politics of attribution when working with university, governmental and private historical organizations, including domain names and the use of organizational logos. ", "article_title": "Building Pedagogy into Project Development: Making Data Construction Visible in Digital Projects", "date": "2019", "volume": "013", "issue": "2", "authors": [{"given": "Courtney", "family": "Rivard", "affiliation": [{"original_name": "University of North Carolina, Chapel Hill", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Taylor", "family": "Arnold", "affiliation": [{"original_name": "University of Richmond", "normalized_name": "University of Richmond", "country": "United States", "identifiers": {"ror": "https://ror.org/03y71xh61", "GRID": "grid.267065.0"}}]}, {"given": "Lauren", "family": "Tilton", "affiliation": [{"original_name": "University of Richmond", "normalized_name": "University of Richmond", "country": "United States", "identifiers": {"ror": "https://ror.org/03y71xh61", "GRID": "grid.267065.0"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}