{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Referring constitutes such an essential scholarly activity across disciplines that it has been regarded by as one of the scholarly primitives. In Classics, in particular, the references to passages of the ancient texts — the so-called canonical citations (or references) — play a prominent role. The potential of these citations, however, has not been fully exploited to date, despite the attention that they have recently received in the field of Digital Humanities. In this paper I discuss two aspects of making such citations computable. Firstly, I illustrate how they can be extracted from text by using Natural Language Processing techniques, especially Named Entity Recognition. Secondly, I discuss the creation of a three-level citation network to formalise the web of relations between texts that canonical references implicitly constitute. As I outline in the conclusive section of this paper, the possible uses of the extracted citation network include the development of search applications and recommender systems for bibliography; the enhancement of digital environments to read primary sources with links to related secondary literature; and the application of these network to the study of intertextuality and text reception. ", "article_title": "Exploring Citation Networks to Study Intertextuality in Classics", "date": "2016", "volume": "010", "issue": "2", "authors": [{"given": "Matteo", "family": "Romanello", "affiliation": [{"original_name": "Deutsches Archäologisches Institut, Berlin", "normalized_name": "German Archaeological Institute", "country": "Italy", "identifiers": {"ror": "https://ror.org/023md1f53", "GRID": "grid.469439.5"}}, {"original_name": "École Polytechnique Fédérale de Lausanne", "normalized_name": "École Polytechnique Fédérale de Lausanne", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02s376052", "GRID": "grid.5333.6"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}