{"url": "http://computerphilologie.digital-humanities.de/jg07/kuwalu.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Over the last years, the digital archiving, administration, and processing of texts has become more and more important in various fields of academic research. Particularly for literary and cultural studies, the digital storage and handling of great amounts of texts – an endeavor which has already been labelled with the keyword eHumanities (enhanced Humanities) – bears an enormous potential. There is, however, still a lack of applications appropriately supporting specific approaches in these fields of research. In this article, we thus propose basic design principles of a computational environment for literary and cultural investigation, id est a platform providing advanced search facilities which are tailored to the needs of scholars of literature and culture (KUWALU = Kulturwissenschaftliche Arbeits- und Lern-Umgebung). We both sketch the theoretical fundamentals of such a platform and outline specific requirements it has to fulfil. Furthermore, we discuss possible ways of implementing these requirements, in particular focussing on computational linguistic methods from Computational Linguistics supporting »intelligent« search facilities and the need for comprehensibility and traceability of complex search queries and results.", "article_title": "KUWALU – Motivation und Grundzüge einer computergestützten Umgebung für die literatur- und kulturwissenschaftliche Recherche- und Analysearbeit", "authors": [{"given": "Martin", "family": "Butler", "affiliation": [{"original_name": "Universität Duisburg-Essen, Institut für Anglophone Studien, Fachbereich Geisteswissenschaften", "normalized_name": "University of Duisburg-Essen", "country": "Germany", "identifiers": {"ror": "https://ror.org/04mz5ra38", "GRID": "grid.5718.b"}}]}, {"given": "Wolfgang", "family": "Hoeppner", "affiliation": [{"original_name": "Universität Duisburg-Essen, Abteilung für Informatik und angewandte Kognitionswissenschaft, Fakultät für Ingenieurwissenschaften", "normalized_name": "University of Duisburg-Essen", "country": "Germany", "identifiers": {"ror": "https://ror.org/04mz5ra38", "GRID": "grid.5718.b"}}]}, {"given": "Andreas", "family": "Wagner", "affiliation": [{"original_name": "Universität Duisburg-Essen, Abteilung für Informatik und angewandte Kognitionswissenschaft, Fakultät für Ingenieurwissenschaften", "normalized_name": "University of Duisburg-Essen", "country": "Germany", "identifiers": {"ror": "https://ror.org/04mz5ra38", "GRID": "grid.5718.b"}}]}], "publisher": null, "date": "2007", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}