{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " For many years, digital humanists have responded to Alan Liu’s call for critical digital humanities. Projects such as #TornApart/Seperados and #PuertoRicoMapathon and pieces like Where is Cultural Criticism in the Digital Humanities? , All the Digital Humanists Are White, All the Nerds Are Men, but Some of Us Are Brave , and Beyond the Margins: Intersectionality and the Digital Humanities have paved the way for socially conscious developments in the field. At the same time, pressures from administrators, institutions, and funding agencies often discourage critical engagement in favor of tool development and/or high tech projects . As such, we often attempt to adapt highly rewarded tech skills, like text, sentiment, and big data analyses, for use in social justice projects. While it is possible for these two aims to be compatible, we do ourselves a disservice when we try to force them together. So, how should teacher-scholars implement an intersectional digital humanities framework in the classroom? Using my own classroom as a case study, I assert that one effective strategy is through curation, which helps students investigate topics such as race, gender, sexuality, disability, and socioeconomic status through the careful selection, arrangement, and presentation of materials. Doing so teaches students to think more critically about the act of curation, by encouraging them to participate in knowledge construction as well as the dismantling of harmful narratives and power structures. While this approach differs from the tool-based pedagogy often utilized in the field, its emphasis on knowledge production, critical thinking, digital literacy, and social justice gives students proficiency in socially conscious methodologies that can be applied to any project. Linking curation to making and breaking, two digital humanities approaches to meaning-making, provides a method for interrogating archives of humanity and developing a pedagogy grounded in cultural critique and social justice . ", "article_title": "Making and Breaking: Teaching Information Ethics through Curatorial Practice", "date": "2019", "volume": "012", "issue": "4", "authors": [{"given": "Christina", "family": "Boyles", "affiliation": [{"original_name": "Michigan State University", "normalized_name": "Michigan State University", "country": "United States", "identifiers": {"ror": "https://ror.org/05hs6h993", "GRID": "grid.17088.36"}}]}], "keywords": ["digital humanities pedagogy", "intersectionality", "curation", "feminism"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}