{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Exploratory studies have demonstrated the benefits of implementing Geographic Information Systems (GIS) technology in literary and cultural-historical research. These studies have done much to affirm the power and flexibility of GIS technology as a resource for humanities scholarship. At the same time, however, these studies share a common limitation in that they tend to rely on the analysis of point-based cartographic representations. Such representations are suitable for modelling quantitative geographical phenomena, but they are inadequate for modelling qualitative human phenomena. This inadequacy constitutes a significant problem for researchers who aspire to analyse the geographical experiences and spatial relationships represented in works of literature, including works that contain accounts of travel. The present article proposes a solution to this problem by demonstrating how advanced spatial analyses within GIS such as Cost-Surface Analysis (CSA) and Least-Cost-Path Analysis (LCP) can be used to facilitate more nuanced interpretations of historical works of travel writing and topographical literature. Specifically, the article explains how GIS, CSA and LCP can be combined to build coherent spatial models of the journeys recorded in the works of three canonical eighteenth-century British travellers, each of whom composed influential accounts of their travels through the English Lake District: the poet Thomas Gray (1716–1771), the naturalist Thomas Pennant (1726–1798) and the agriculturist Arthur Young (1741–1820). ", "article_title": "GIS and Literary History: Advancing Digital Humanities research through the Spatial Analysis of historical travel writing and topographical literature", "date": "2016", "volume": "011", "issue": "1", "authors": [{"given": "Patricia", "family": "Murrieta-Flores", "affiliation": [{"original_name": "Digital Humanities Research Centre, University of Chester", "normalized_name": "University of Chester", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01drpwb22", "GRID": "grid.43710.31"}}]}, {"given": "Christopher", "family": "Donaldson", "affiliation": [{"original_name": "History Department, Lancaster University", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}, {"given": "Ian", "family": "Gregory", "affiliation": [{"original_name": "History Department, Lancaster University", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}], "keywords": ["Spatial Humanities", "Literary GIS", "English Literature", "Travel writing", "English Lake District", "Cost Surface Analysis", "Least Cost Paths", "Digital Mapping"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}