{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " From Hans Holbein’s The Ambassadors to Robert Lazzarini’s skulls, anamorphic artworks explore the tension between mathematical models of vision and an embodied experience of space. After reviewing the ways in which anamorphosis has been deployed as a philosophical tool for investigating digital media in terms of human phenomenology, specifically through the criticism of Espen Aarseth and Mark Hansen, this paper analyzes how contemporary videogames like Sony’s Echochrome series, levelHead by Julian Oliver, and Mark ten Bosch’s forthcoming Miegakure technically, aesthetically, and conceptually explore anamorphic techniques. While The Ambassadors is famous for its anamorphically skewed skull, a classic memento mori, we propose that the anamorphic effects of videogames can be more accurately described as a memento mortem mortis: not reminders of human mortality, but of a nonhuman the death of death. By foregrounding the impossibility of ever fully resolving the human experience of computational space, the memento mortem mortis in these anamorphic games gestures toward experiential domains altogether indifferent to human phenomenology to create allegories of the beyond. ", "article_title": "Stretched Skulls: Anamorphic Games and the memento mortem mortis ", "date": "2012", "volume": "006", "issue": "2", "authors": [{"given": "Stephanie", "family": "Boluk", "affiliation": [{"original_name": "Vassar College", "normalized_name": "Vassar College", "country": "United States", "identifiers": {"ror": "https://ror.org/022x6qg61", "GRID": "grid.267778.b"}}]}, {"given": "Patrick", "family": "LeMieux", "affiliation": [{"original_name": "Duke University", "normalized_name": "Duke University", "country": "United States", "identifiers": {"ror": "https://ror.org/00py81415", "GRID": "grid.26009.3d"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}