{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " In this paper we introduce the syntagm pragmatic modelling as a productive way of contextualising research in Digital Humanities (DH). We define pragmatic modelling as a middle-out approach (neither top down nor bottom up) that combines formal and experimental modelling techniques with an effective use of language. Furthermore, in order to elucidate a pragmatic understanding of model building, we reflect on texts (considered here as objects) and modelling (or strategy of analysis) in DH research (and teaching). This paper does not identify a new practice or approach; rather it offers an explanatory framework for existing practices. As the paper explains, this framework goes beyond existing ones and allows us to think about modelling in a more integral way. Drawing on this framework, we reveal how DH modelling practices challenge epistemological and linguistic restrictions, by, for example, problematising the adoption of terminology belonging to the domain of computer sciences. Reflections on metaphorical reasoning are used to exemplify how polarities and some rigidities DH research could find itself embedded in are overcome in practice. We conclude by advocating the importance of a diachronic and historical analysis of the role of metaphors in DH to further explore the relation between theory and practice as well as to develop models of modelling integral to DH research. ", "article_title": "Circling around texts and language: towards pragmatic modelling in Digital Humanities", "date": "2016", "volume": "010", "issue": "3", "authors": [{"given": "Arianna", "family": "Ciula", "affiliation": [{"original_name": "University of Roehampton", "normalized_name": "University of Roehampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/043071f54", "GRID": "grid.35349.38"}}]}, {"given": "Cristina", "family": "Marras", "affiliation": [{"original_name": "Istituto per il Lessico Intellettuale Europeo e Storia delle Idee, Consiglio Nazionale delle Ricerche", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}