{"url": "http://computerphilologie.digital-humanities.de/jg03/schreier.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This contribution focuses on pseudo-documentaries on the internet which are regarded as the most recent example of the present-day media trend towards an increasing blurring of the line between fact and fiction. After outlining the tradition of especially audiovisual hybrid media products in which pseudo-documentaries can be seen to stand, various approaches for [distinguishing between fact and fiction are discussed and a three-pronged model for evaluating the reality status of media products is presented. On the basis of this model, pseudo-documentaries are reconstructed as a type of fiction that lacks any clear paratextual signals as to its fictional status; instead, the impression is created (as part of the plot) that product actually constitutes fact. This impression is further supported by a highly realistic production mode that is achieved by presenting a large amount of seemingly authentic material. With respect to content, however, most pseudo-documentaries contain highly implausible as well as topical elements which in turn can function as signals pointing recipients to the fictional status of these products. Content analysis of a random sample of e-mails from internet newsgroups about the pseudo-documentary horror film The Blair Witch Project shows, however, that approximately one third of these recipients are somewhat confused concerning the reality status of the film, basing their evaluation for the most part on information obtained from other media products. Even those recipients who correctly consider the film to be fiction or a hybrid hardly ever make use of the strongest signals to that effect contained in the product, but rely on mediated information instead. These results are supported by a comparison with two companion studies.", "article_title": "PSEUDO-DOKUMENTATIONEN: ZUM VERSCHWIMMEN DER GRENZE ZWISCHEN REALITÄT UND FIKTION IN DEN MEDIEN", "authors": [{"given": "Margrit", "family": "Schreier", "affiliation": [{"original_name": "International University Bremen, School of Humanities and Social Sciences", "normalized_name": "Jacobs University", "country": "Germany", "identifiers": {"ror": "https://ror.org/02yrs2n53", "GRID": "grid.15078.3b"}}]}], "publisher": null, "date": "2004", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}