{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Scholars and practitioners of the digital humanities generally recognize the importance of solid project management and oversight. But coursework and publications related to DH project management tend to focus heavily on the difficulties of planning and launching a new project rather than the challenges of maintaining an established one. Meanwhile, online advice for would-be managers is couched in the language of tips and tricks or steps for beginners. Together these phenomena downplay the professional skills needed to successfully manage a project while suggesting that project management is necessary only in the beginning stages of an endeavor. They may even give the impression that scholarship in the digital humanities is inherently ephemeral. Through a case study of project management practices at the William Blake Archive, which began publishing electronic scholarly editions in 1996, this essay details the challenges and rewards of managing an established digital humanities project. Managers of mature projects may be called upon to oversee expansions in scope and mission, research and recommend new features and tools, grow or shrink the number of project staff, seek out alternate sources of support when early grants run out, maintain continuity as collaborators join and leave the project, and develop new workflows and procedures to reflect these and other changes. ", "article_title": "Managing an Established Digital Humanities Project: Principles and Practices from the Twentieth Year of the William Blake Archive", "date": "2014", "volume": "008", "issue": "1", "authors": [{"given": "Ashley", "family": "Reed", "affiliation": [{"original_name": "University of North Carolina", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}