{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " This paper traces the little-known history of the London Stage Information Bank, a digital initiative that ran from 1970 to 1978 under the direction of Professor Ben R. Schneider, Jr. at Lawrence University. With support from the National Endowment for the Humanities, the American Council of Learned Societies, and the Mellon Foundation, Schneider’s team produced a database from the multi-volume reference work The London Stage 1660-1800 (Southern Illinois University Press, 1960-68). Today, however, most of the project’s outputs are lost or damaged, and its history has been largely forgotten in both theater studies and eighteenth-century studies. This essay traces the history of the Information Bank and my efforts to recover its damaged data and code, offering the project as an object lesson in questions of access, preservation, and institutional memory that digital humanities practitioners continue to confront in 2017. I argue that the project faded into obscurity, not only because of technological obsolescence, but also because the development team was unable to promote the kinds of research questions and behaviors that would enable their tool's widespread adoption and survival. The indifference of literary and theater scholars to the Information Bank throughout the late 1970s and early 1980s demonstrates how vital it is that digital and computational humanities work articulate its meaningfulness within existing intellectual and disciplinary traditions. While digital scholars build new avenues for inquiry that expand and transform humanities research, the survival of these approaches depends on their relationship to current humanities questions, methods, commitments, and epistemologies. ", "article_title": "Recovering the London Stage Information Bank: Lessons from an Early Humanities Computing Project", "date": "2017", "volume": "011", "issue": "3", "authors": [{"given": "Mattie", "family": "Burkert", "affiliation": [{"original_name": "Utah State University", "normalized_name": "Utah State University", "country": "United States", "identifiers": {"ror": "https://ror.org/00h6set76", "GRID": "grid.53857.3c"}}]}], "keywords": ["databases", "media archaeology", "digital preservation", "theater studies", "history of humanities computing"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}