{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " The contemporary digital media ecology is one of convergence and hybridity. As virtual and technical interfaces intersect in increasingly complex formulations, the ability to identify organic vs. technical forms has become problematic. Virtual environments predominate within everyday cultural practice arguably limiting real or unmediated human experience. The advent of social media artifacts and networks in particular — those that create fusions of personal experience and communal activity and that support and broadcast user-generated content as a foundation for media productions of real-life — have made organic bodies and personal experience difficult to discern. Extending Mark B.N. Hansen’s model for identifying embodied experience within contemporary mixed reality culture, I argue that embodied expression is more, not less, present in the contemporary media age. Organic expressions, those that emanate from primal, tactile, and motile forces and that operate prior to formal mediatization, are at the core of many social media artifacts circulated within the networks of contemporary culture and operating outside the aesthetics of traditional semiotic representation. Recovering the organic body and foregrounding its presence in such media asserts the functional non-aesthetic principles at work in many social media forms, particularly in those dependant on documenting the minutiae of real-life under-represented in mainstream and traditional media. As personal and public spaces collide, situating the me or the embodied subject within production is problematic. I identify such embodiment within contemporary social media, particularly on YouTube, to illustrate that the human body does not operate from a position of erasure within social media networks and artifacts, and its expressive value is therefore central in much current user-generated me-dia. ", "article_title": "Beyond Representation: Embodied Expression and Social Me-dia", "date": "2012", "volume": "006", "issue": "2", "authors": [{"given": "Lissa", "family": "Holloway-Attaway", "affiliation": [{"original_name": "Blekinge Tekniska Högskola", "normalized_name": "Blekinge Institute of Technology", "country": "Sweden", "identifiers": {"ror": "https://ror.org/0093a8w51", "GRID": "grid.418400.9"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}