{"url": "http://computerphilologie.digital-humanities.de/jg09/Ilsemann.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The main task of this paper deals with the exploration of frequency distributions of speech lengths. Initial investigations aimed at authorship questions and tried to contribute seriously to the recently flared up Marlowe-Shakespeare debate. Distribution curves were compared and checked by chi-square tests relying on text corpora by Marlowe, Shakespeare, and other contemporaries. The all-all text curves showed congruence between Marlowe and Shakespeare, but also conformity between Marlowe/Shakespeare and their contemporaries. Single text vs. all text curve relations resulted in cross-overs when Marlowe texts fitted better into the Shakespeare canon up to 1599 and Titus Andronicus was closer to the Marlowe range. The overall result was more than clear. Frequency distributions of speech lengths could not contribute to authorship questions. However, as an indication of style changes, the maxima values in their reduction from nine to four words opened up a totally different artistic and aesthetic concept which started around 1599 and marked the beginning of British drama in its own right after the process of incorporation of Roman plays and antique mythology. The stylistic shift certainly occurs in the wider context of rhetorical speeches and dramatic actions, as rhetoric and declamations receded and were replaced by refined acting using the spatial dimensions of the stage and speeding up events by shorter speeches. Whereas before monologues had to be seen within the framework of rhetorical devices that kept actors rambling and lamenting they now appeared as functional components of plays, adding to the aesthetic values of varietas and copia – or variety and abundance thus bearing witness to the process of commercialization and of cultural establishment of the literary genre drama at the turn of the century. All quantitative dates were derived from IDAP [1].", "article_title": "Quantitativ-statistische Dramenanalyse: Welche Aussagekraft haben Häufigkeitsverteilungen der Replikenlängen?", "authors": [{"given": "Hartmut", "family": "Ilsemann", "affiliation": [{"original_name": "Leibniz Universität Hannover", "normalized_name": "University of Hannover", "country": "Germany", "identifiers": {"ror": "https://ror.org/0304hq317", "GRID": "grid.9122.8"}}]}], "publisher": null, "date": "2013", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}