{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " John Unsworth recounts that he first became involved with computing in the Humanities c. 1989 as a new faculty member at North Carolina State University where he was hired to teach post-World War II American literature. He and his colleagues wanted to set up a new journal as only one other journal existed in that area. They were introduced to the recently released LISTSERV software and the first issue of the journal was circulated on email lists and bulletin boards. It was called Postmodern Culture and twenty-two years later is still published by Johns Hopkins University Press. It was the first peer-reviewed electronic journal in the Humanities; nevertheless, not all senior colleagues were in favour of it and, as a junior faculty member, his participation in it. He recounts that was not able to avail of formal training in computing but he did have technical knowledge of computing, mostly picked up while procrastinating on this PhD. By the early 1990s he was reading Humanist and attending conferences that focused on electronic journals where he encountered a range of academic and non-academic projects. In 1993 he moved to the University of Virginia where he directed the Institute for Advanced Technology in the Humanities (IATH). He reflects on the wide range of people and projects that he worked with and that it was around this time that he became involved with the community now known as digital humanities. He reflects in detail on the first digital humanities conference he attended in Paris in 1994 and concludes by discussing some of the changes that the advent of the Web has heralded. ", "article_title": " Postmodern Culture and More: an Oral History Conversation between John Unsworth and Anne Welsh ", "date": "2012", "volume": "006", "issue": "3", "authors": [{"given": " John", "family": "Unsworth", "affiliation": [{"original_name": "Brandeis University ", "normalized_name": "Brandeis University", "country": "United States", "identifiers": {"ror": "https://ror.org/05abbep66", "GRID": "grid.253264.4"}}]}, {"given": " Anne", "family": "Welsh", "affiliation": [{"original_name": "University College London", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Julianne", "family": "Nyhan", "affiliation": [{"original_name": " University College London ", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Jessica", "family": "Salmon", "affiliation": [{"original_name": " University of Trier ", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}