{"url": "http://projects.chass.utoronto.ca/chwp/CHC2003/Finn2.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper addresses the question: “Do We Need a New Theory in Order to Theorize Computer Games?” To answer this question, I will expand two points. The first involves the “we” in “do we need”, the second, the nature of the word theory. My solution involves an emphasis on the key compositional and formal component of computer game construction: programming. The most straightforward answer to the first question is that we are the members of the academy and critical community. Following this simple definition, this paper argues that both groups need to come up with new theoretical models to address computer games, each for their own reasons. Once we articulate these positions, we find that underlying their primary purposes is a position that involves both groups. For the second point, I will make a distinction between theory that is more broadly formal and theory that is cultural. Our answer to the question of whether or not a new theory is needed will change depending on which of these definitions we apply. As a point of departure, my paper responds to a quote from Espen Arseth, which sounds rather pessimistic about early attempts to theorize games by transferring existing models to new media. I agree with some of the spirit of Arseth's quote, but I believe that a properly instituted form of critique can answer many of his concerns, while providing for new modes of critical participation.", "article_title": "What you C is What You Get: Formalizing Computer Game Criticism", "authors": [{"given": "Patrick", "family": "Finn", "affiliation": [{"original_name": "St. Mary's College, Calgary", "normalized_name": "St. Mary's College", "country": "Japan", "identifiers": {"ror": "https://ror.org/02306qr05", "GRID": "grid.472033.1"}}]}], "publisher": null, "date": "2003", "keywords": ["Computer games, literary theory, ergotic text"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}