{"url": "http://computerphilologie.digital-humanities.de/jg02/gallet-martinet.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The technology of hypermedia presentation can be developed so as to highlight the new approaches of cultural geography, which emphasise the complexities of townscape perception. Hypermedia programs on urban history offer the options of relating maps and projects to views of built areas, or documents on social history to their cultural background, through interface elements such as windows, animations, interchangeable pictures, which structure the documents as embedded spaces, appearing as sets of options. This interactive presentation, which makes the unfolding of the program dependent on the user's choices, stresses the importance of the virtual as an essential constituent of the perception of cityscape. Historical studies of urban culture in recent years have stressed the complexities of townscape perception, favouring an interdisciplinary approach in which semiotics, including rhetoric and image analysis, are applied to cultural geography, an approach indebted to the ›linguistic turn‹ now followed by the ›visual turn‹. The technology of hypermedia presentation can be developed so as to highlight this new conceptualisation. The epistemology of hypermedia has itself undergone an evolution in the past ten years, since the first theories defined programs by their governing ›metaphors‹ whereas the more recent ones were indebted to ›constructivism‹, stressing the user's role. The argument will primarily be based on the CD-ROM Georgian Cities (authored by the research centre Cultures Anglophones et Technologies de l'Information – CATI, Université Paris-Sorbonne – Paris IV), which was designed so as to demonstrate the potential of hypermedia for urban studies.", "article_title": "HYPERMEDIA AND URBAN CULTURE: A PRESENTATION ON THE CD-ROM GEORGIAN CITIES", "authors": [{"given": "Liliane", "family": "Gallet-Blanchard", "affiliation": [{"original_name": "Centre Cultures Anglophones et Technologies de l'Information CATI, Université Paris-Sorbonne - Paris IV", "normalized_name": "University of Paris-Sud", "country": "France", "identifiers": {"ror": "https://ror.org/028rypz17", "GRID": "grid.5842.b"}}]}, {"given": "Marie-Madeleine", "family": "Martinet", "affiliation": [{"original_name": "Centre Cultures Anglophones et Technologies de l'Information CATI, Université Paris-Sorbonne - Paris IV", "normalized_name": "University of Paris-Sud", "country": "France", "identifiers": {"ror": "https://ror.org/028rypz17", "GRID": "grid.5842.b"}}]}], "publisher": null, "date": "2002", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}