{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Internet technologies are gradually reshaping the function of traditional scholarly publications. There is a growing tendency in some disciplines to publish a digital paper together with supplements such as images, videos, 3D-models and underlying data. More information requires a better usability in terms of overview and finding information, which has led to new features in journals and thus to modifying and extending this genre. These so-called enhanced publications or rich internet publications have various physical forms: PDF documents with embedded interactive models, HTML files enriched with hyperlinks to contextual information and with facilities to highlight information in the text, or aggregations of documents and other resources linked together through metadata which make them findable for semantic search engines. However, many of the originally print-based journals, particularly in the humanities and social sciences, are still rather conservative in format and offer hardly any opportunities for enhanced publishing, which leaves room for some form of self-publishing, perhaps as addition to a regular journal article. In this paper we introduce the Xpos’re tools for authoring and displaying an interactive multimedia scholarly publication, which may be created as a digital companion to a regular journal paper and published, for example, on the author or institution’s website in order to share related research products and to achieve greater visibility. We also report about practical experiences with this software in a few research projects. The Xpos’re software (see: http://xposre.nl/software/) comprises a Flash-based document reader and a set of extensions (plug-ins) that extend the basic functionality of this text browser. The extensions are used to display specific types of multimedia that provide additional functionality, such as viewing images, videos and interactive maps. The input text is XML based, which not only guarantees a durable and flexible encoding of content, but also allows automatic rendering in different formats according to the preferences of users and the limitations of their hardware. In addition, the XML source can be easily transformed to an RDF resource map to meet the requirements of the semantic web. The document reader generates output in HTML, in two flavors, namely a slide based version that uses JavaScript, and a plain HTML text (single page), which is most suitable for printing and which can be used to create e-books. This plain HTML text can also be displayed in a format similar to that of scientific journals through the Xpos’re HTML Reader, which has more features than the automatically generated slides and which can be highly customized by the user. ", "article_title": "Xpos’re: A Tool for Rich Internet Publications", "date": "2014", "volume": "008", "issue": "2", "authors": [{"given": "Leen", "family": "Breure", "affiliation": [{"original_name": "Utrecht University & DANS (Dutch Data Archive)", "normalized_name": "Utrecht University", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/04pp8hn57", "GRID": "grid.5477.1"}}]}, {"given": "Maarten", "family": "Hoogerwerf", "affiliation": [{"original_name": "DANS (Dutch Data Archive)", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "René", "family": "van Horik ", "affiliation": [{"original_name": "DANS (Dutch Data Archive)", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "keywords": ["scholarly publishing", "rich internet publication", "multimedia", "authoring", "Flash", "HTML", "RDF"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}