{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " With The Library of Digital Latin Texts (LDLT), the Digital Latin Library (DLL) is set to publish critical editions as sets of data independent of a presentational format. These datasets are meant to be reused for a variety of purposes and in a variety of presentational formats, including the DLL’s own user edition viewer and data visualization applications. It is thus vital to have a way of certifying the data as published in accordance with the DLL’s policies and procedures, central to which are its provisions for peer review. Accordingly, to facilitate the use of an edition’s data in different settings, and to promote a high degree of confidence in the quality of the data, we have introduced the DLL Review Registry Service. The DLL Review Registry Service offers a way of associating peer reviewed status with the text data rather than within any particularly visualization of that data. Any visualization of text data can consult this service and discover whether or not this data has been reviewed. In this way, we free the imprimatur from its association with any particular presentation and allow the indicators of quality to travel with the data and be communicated to end users in a plurality of visualizations. ", "article_title": "Decoupling Quality Control and Publication: The Digital Latin Library and the Traveling Imprimatur.", "date": "2019", "volume": "013", "issue": "4", "authors": [{"given": "Samuel J.", "family": "Huskey", "affiliation": [{"original_name": "University of Oklahoma", "normalized_name": "University of Oklahoma", "country": "United States", "identifiers": {"ror": "https://ror.org/02aqsxs83", "GRID": "grid.266900.b"}}]}, {"given": "Jeffrey C.", "family": "Witt", "affiliation": [{"original_name": "Loyola University Maryland", "normalized_name": "Loyola University Maryland", "country": "United States", "identifiers": {"ror": "https://ror.org/01by1wp65", "GRID": "grid.259262.8"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}