{"url": "http://computerphilologie.digital-humanities.de/jg04/gross/gross.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Heinrich-Heine-Portal (<http://www.hhp.uni-trier.de>) is a digital edition of Heinrich Heine's (1797-1856) works and letters. It was established in autumn 2002 as a cooperation between the Heinrich-Heine-Institut (HHI), Düsseldorf, and the Competence Centre for Information Retrieval and Electronic Publishing in the Humanities at the University of Trier and is being supported by the Deutsche Forschungsgemeinschaft (DFG) and the Kunststiftung Nordrhein-Westfalen. In addition to a complete, annotated scientific edition of the poet's works and letters, the Heinrich-Heine-Portal presents digital images of his manuscripts held by the Heinrich-Heine-Institut and other literary archives. Access for users is free of charge. The electronic version is based on the two reference editions of Heine: the Düsseldorfer Heine-Ausgabe (DHA) for the works and the Weimar Heine-Säkular-Ausgabe (HSA) for the letters. The edition of the letters is being revised and updated, newly-discovered letters and corrigenda are added. Not only does the portal interlink edited texts, indices, commentaries et cetera and vice-versa, it also provides the electronic facsimiles of the textual transmission in Heine's manuscripts and printed materials (i.e. First Editions, newspaper publications); it thus allows for a close study of all the primary sources still available. In addition, the portal offers digital images of contemporary pictures and paintings, including the portraits of the poet. An extensive bibliography will be added at a later date and kept up-to-date continually by the Heinrich-Heine-Institut. The HHP thus represents a comprehensive platform for research on Heinrich Heine. This paper describes the essential steps of the project from the close analysis of the printed editions and their structural and typographical characteristics, the digitizing process, the encoding principles and the encoding practices by means of TUSTEP (Tübinger System von Textverarbeitungsprogrammen), the markup according to the TEI Guidelines and, finally, the electronic publication by consistently using Open Source software such as the database management system MySQL and the content management system ZOPE.", "article_title": "DER DIGITALE HEINE – EIN INTERNETPORTAL. ALS INTEGRIERTES INFORMATIONSSYSTEM", "authors": [{"given": "Nathalie", "family": "Groß", "affiliation": [{"original_name": "Kompetenzzentrum für elektronische, Erschließungs- und Publikationsverfahren in den Geisteswissenschaften an der Universität Trier", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}], "publisher": null, "date": "2005", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}