{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Discussions of digital humanities pedagogy have often focused on discussions of scaffolding and play (alternatively, tinkering) approaches, and methods for assessing student work appropriate to both techniques. While these approaches may seem oppositional, we emphasize the need to balance them in most classroom contexts, and explore challenges with integrating new digital humanities platforms in topically-driven humanities classrooms. We examine our experiences as an instructor and a librarian partnering to include a multimedia publishing assignment sequence in a course on the history of children’s literature, and our assessment of our approach to instruction in a distance graduate education context that is not amenable to the lab-based learning usually used in person for DH learning. While discussions of assessment of DH classroom projects generally focus on the question of how to grade student work, we argue that assessment is as important for reflecting on and evaluating pedagogy, including how to balance and iteratively improve scaffolding and play approaches. These issues are important not just for experienced DH instructors, but also humanities instructors without a DH background beginning to integrate digital assignments as a new norm. ", "article_title": "Scaffolding and Play Approaches to Digital Humanities Pedagogy: Assessment and Iteration in Topically-Driven Courses", "date": "2018", "volume": "011", "issue": "4", "authors": [{"given": "Daniel G.", "family": "Tracy", "affiliation": [{"original_name": "University of Illinois at Urbana-Champaign", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}, {"given": "Elizabeth Massa", "family": "Hoiem", "affiliation": [{"original_name": "University of Illinois at Urbana-Champaign", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}], "keywords": ["digital pedagogy", "multimodal publishing"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}