{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Optical Character Recognition (OCR) on contemporary and historical data is still in the focus of many researchers. Especially historical prints require book specific trained OCR models to achieve applicable results . To reduce the human effort for manually annotating ground truth (GT) various techniques such as voting and pretraining have shown to be very efficient . Calamari is a new open source OCR line recognition software that both uses state-of-the art Deep Neural Networks (DNNs) implemented in Tensorflow and giving native support for techniques such as pretraining and voting. The customizable network architectures constructed of Convolutional Neural Networks (CNNS) and Long-Short-Term-Memory (LSTM) layers are trained by the so-called Connectionist Temporal Classification (CTC) algorithm of Graves et al. (2006). Optional usage of a GPU drastically reduces the computation times for both training and prediction. We use two different datasets to compare the performance of Calamari to OCRopy, OCRopus3, and Tesseract 4. Calamari reaches a Character Error Rate (CER) of 0.11% on the UW3 dataset written in modern English and 0.18% on the DTA19 dataset written in German Fraktur, which considerably outperforms the results of the existing softwares. ", "article_title": "Calamari − A High-Performance Tensorflow-based Deep Learning Package for Optical Character Recognition", "date": "2020", "volume": "014", "issue": "2", "authors": [{"given": "Christoph", "family": "Wick", "affiliation": [{"original_name": "Universität Würzburg, Chair of Computer Science VI", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Christian", "family": "Reul", "affiliation": [{"original_name": "Centre for Philology and Digitality; University of Würzburg", "normalized_name": "University of Würzburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00fbnyb24", "GRID": "grid.8379.5"}}]}, {"given": "Frank", "family": "Puppe", "affiliation": [{"original_name": "Universität Würzburg, Chair of Computer Science VI", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}