{"url": "http://computerphilologie.digital-humanities.de/jg04/wolber.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Freiburger Anthologie has been founded in 1999 by Klemens Wolber and Jochen Knaus. Originally it was a database of lyric poetry assembling the »most important« German poems of the period between 1720 and 1933. These data had been based on an evaluation of numerous anthologies and have been published on a web site.As part of an interdisciplinary project funded by the Deutsche Forschungsgemeinschaft (DFG) the Freiburger Anthologie is now being enlarged to cover not only poems but also traditional German folksongs and church hymns. A lot of poems and songs exist in various versions that have to be taken into account, and during the course of the work annotations and commentaries are to be added. Digital data processing of the texts and annotations ensure the special features of the website that offers the use of extensive search functions browsing the fields of the database. – This essay describes the development of the project and explains the principles used in editing and annotating lyrical texts. Finally the user numbers and target groups of the Freiburger Anthologie are presented.", "article_title": "DIE ALTE UND DIE NEUE FREIBURGER ANTHOLOGIE – EINE ANTHOLOGISCHE LYRIKDATENBANK", "authors": [{"given": "Klemens", "family": "Wolber", "affiliation": [{"original_name": "Albert-Ludwigs-Universität Freiburg", "normalized_name": "University of Fribourg", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/022fs9h90", "GRID": "grid.8534.a"}}]}, {"given": "Jochen", "family": "Knaus", "affiliation": [{"original_name": "Albert-Ludwigs-Universität Freiburg", "normalized_name": "University of Fribourg", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/022fs9h90", "GRID": "grid.8534.a"}}]}], "publisher": null, "date": "2005", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}