{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Historians have regularly debated whether advertisements can be used as a viable source to study the past. One of their main concerns centered on the question of agency. Were advertisements a reflection of historical events and societal debates, or were ad makers instrumental in shaping society and the ways people interacted with consumer goods? Using techniques from econometrics (Granger causality test) and complexity science (Adaptive Fractal Analysis), this paper analyzes to what extent advertisements shaped or reflected society. We found evidence that indicates a fundamental difference between the dynamic behavior of word use in articles and advertisements published in a century of Dutch newspapers. Articles exhibit persistent trends. Contrary to this, advertisements have a more irregular behavior characterized by short bursts and fast decay, which, in part, mirrors the dynamic through which advertisers introduced terms into public discourse. On the issue of whether advertisements shaped or reflected society, we found particular product types that seemed to be collectively driven by a Granger causality going from advertisements to articles. Generally, we found support for a complex interaction pattern, analogous to Cowan’s concept of the consumption junction. Finally, we discovered noteworthy patterns in terms of Granger causality and long-range dependencies for specific product groups. All in, this study shows how methods from econometrics and complexity science can be applied to humanities data to improve our understanding of complex cultural-historical phenomena such as the role of advertising in society. ", "article_title": "Tracking the Consumption Junction: Temporal Dependencies between Articles and Advertisements in Dutch Newspapers", "date": "2020", "volume": "014", "issue": "2", "authors": [{"given": "Melvin", "family": "Wevers", "affiliation": [{"original_name": "Digital Humanities Lab, KNAW Humanities Cluster, Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Jianbo", "family": "Gao", "affiliation": [{"original_name": "Center for Geodata and Analysis, Faculty of Geographical Science, Beijing Normal University, Beijing, China", "normalized_name": "Beijing Normal University", "country": "China", "identifiers": {"ror": "https://ror.org/022k4wk35", "GRID": "grid.20513.35"}}]}, {"given": "Kirstoffer L.", "family": "Nielbo", "affiliation": [{"original_name": "Center for Humanities Computing Aarhus, Aarhus University, Denmark", "normalized_name": "Aarhus University", "country": "Denmark", "identifiers": {"ror": "https://ror.org/01aj84f44", "GRID": "grid.7048.b"}}]}], "keywords": null, "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}