{"url": "http://projects.chass.utoronto.ca/chwp/kunstmann/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "On the web site of the Laboratoire de Français Ancien at the University of Ottawa we intend to offer free access to a query and research tool, both powerful and new, for use on Chrétien de Troyes' masterpiece the Chevalier au Lion, Chrétien being the most famous writer of medieval French romances. We are preparing a presentation of all the Chevalier au Lion manuscripts, with analysis and interpretation, that will constitute an indispensable collection of documents for future critical work – both for critical editions in general and critical editions of this particular work. Our aim is to show the educated public the text itself, accompanied by a series of indices, a study of the language and a complete lexicon of each manuscript copy. When the work is complete, the reader will be able to see images of the manuscript folios, to decipher the text by means of a first, \"archeological\" transcription (the text as is), and to understand it, through a second, critical transcription of the emended manuscripts. The series of indices will allow easy, automatic look-up of the text, and various types of query (phonetic, morphological, syntactic, lexical, semantic, literary, cultural, etc.). Morphosyntactic study will give a systematic framework for determining the meaning and import of textual forms and expressions encountered in reading. The lexicon will provide precise definitions for all the lexical words of each manuscript.", "article_title": "Chrétien de Troyes sur le Web: présentation, analyse et interprétation des manuscrits d'Yvain ou le Chevalier au Lion", "authors": [{"given": "Pierre", "family": "Kunstmann", "affiliation": [{"original_name": "Laboratoire de Français Ancien, Faculté des Arts, Université d'Ottawa", "normalized_name": "University of Ottawa", "country": "Canada", "identifiers": {"ror": "https://ror.org/03c4mmv16", "GRID": "grid.28046.38"}}]}, {"given": "France", "family": "Martineau", "affiliation": [{"original_name": "Laboratoire de Français Ancien, Faculté des Arts, Université d'Ottawa", "normalized_name": "University of Ottawa", "country": "Canada", "identifiers": {"ror": "https://ror.org/03c4mmv16", "GRID": "grid.28046.38"}}]}], "publisher": null, "date": "2000", "keywords": ["manuscript, Old French, Middle Ages"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}