{"TEI": {"@xmlns": "http://www.tei-c.org/ns/1.0", "@xmlns:cc": "http://web.resource.org/cc/", "@xmlns:rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#", "@xmlns:dhq": "http://www.digitalhumanities.org/ns/dhq", "teiHeader": {"fileDesc": {"titleStmt": {"title": {"@type": "article", "@xml:lang": "en", "#text": "Finding and Interpreting Arguments: An Important\n                    Challenge for Humanities Computing and Scholarly Practice"}, "dhq:authorInfo": [{"dhq:author_name": {"dhq:family": "Ravenscroft", "#text": "Andrew"}, "dhq:affiliation": "Cass School of Education and Communities, University of East\n                        London, UK", "email": "a.ravenscroft@uel.ac.uk", "dhq:bio": {"p": "Andrew Ravenscroft (C.Psychol, AFBPsS, PhD, FRSA) is a Psychologist and\n                            Learning Technologist who is a Professor of Education in the Cass School\n                            of Education and Communities at the University of East London (UEL),\n                            where he is Director of the International Centre for Public Pedagogy\n                            (ICPuP). He has a leading international profile in Technology Enhanced\n                            Learning (TEL) and socially responsive interdisciplinary research, with\n                            over 160 publications and being a principal or co-investigator on a\n                            broad portfolio of projects funded by various national and international\n                            agencies that have attracted over £6.4 Million. His expertise includes\n                            learning dialogue, critical thinking, design-based research, AI, big\n                            data, non-formal learning, complex educational interventions and\n                            interdisciplinary research"}}, {"dhq:author_name": {"dhq:family": "Allen", "#text": "Colin"}, "dhq:affiliation": "History and Philosophy of Science, University of Pittsburgh,\n                        USA; Philosophy, Xi’an Jiaotong University, Xi’an, China", "email": "colin.allen@pitt.edu", "dhq:bio": {"p": "Colin Allen (PhD) is Distinguished Professor of History & Philosophy\n                            of Science at the University of Pittsburgh Changjiang Chair Professor at\n                            Xi’an Jiaotong University. He was previously Provost Professor of\n                            History & Philosophy of Science & Medicine and of Cognitive\n                            Science at Indiana University, where the research described in this\n                            article was initially carried out. His research spans animal cognition,\n                            philosophy of cognitive science, text mining of historical texts, and\n                            philosophical and ethical issues arising in AI. He is also co–author of\n                            a logic textbook, and associate editor as well as principal programmer\n                            for the work flow system used to manage the Stanford Encyclopedia of\n                            Philosophy."}}]}, "publicationStmt": {"publisher": ["Alliance of Digital Humanities Organizations", "Association of Computers and the Humanities", "Association for Computers and the Humanities"], "idno": [{"@type": "DHQarticle-id", "#text": "000436"}, {"@type": "volume", "#text": "13"}, {"@type": "issue", "#text": "4"}], "date": {"@when": "2019-12-14", "#text": "14 December 2019"}, "dhq:articleType": "article", "availability": {"cc:License": {"@rdf:about": "http://creativecommons.org/licenses/by-nd/2.5/"}}}, "sourceDesc": {"p": "This is the source"}}, "encodingDesc": {"classDecl": {"taxonomy": [{"@xml:id": "dhq_keywords", "bibl": {"ref": {"@target": "http://www.digitalhumanities.org/dhq/taxonomy.xml", "#text": "http://www.digitalhumanities.org/dhq/taxonomy.xml"}, "#text": "DHQ classification scheme; full list available at"}}, {"@xml:id": "authorial_keywords", "bibl": "Keywords supplied by author; no controlled vocabulary"}]}}, "profileDesc": {"langUsage": {"language": {"@ident": "en", "@extent": "original"}}, "textClass": {"keywords": [{"@scheme": "#dhq_keywords", "list": {"@type": "simple", "item": null}}, {"@scheme": "#authorial_keywords", "list": {"@type": "simple", "item": null}}]}}, "revisionDesc": {"change": [{"@when": "2019-11-12", "@who": "murelj", "#text": "Finished encoding per authors' response to\n                encoding issues"}, {"@when": "2019-10-16", "@who": "murelj", "#text": "Created file"}]}}, "text": {"@xml:lang": "en", "@type": "original", "front": {"dhq:abstract": {"p": {"emph": "meanings", "#text": "Skillful identification and interpretation of arguments is a cornerstone of\n                    learning, scholarly activity and thoughtful civic engagement. These are\n                    difficult skills for people to learn, and they are beyond the reach of current\n                    computational methods from artificial intelligence and machine learning, despite\n                    hype suggesting the contrary. In previous work, we have attempted to build\n                    systems that scaffold these skills in people. In this paper we reflect on the\n                    difficulties posed by this work, and we argue that it is a serious challenge\n                    which ought to be taken up within the digital humanities and related efforts to\n                    computationally support scholarly practice. Network analysis, bibliometrics, and\n                    stylometrics, essentially leave out the fundamental humanistic skill of\n                    charitable argument interpretation because they touch very little on the\n                         embedded in texts. We present a problematisation of\n                    the design space for potential tool development, as a result of insights about\n                    the nature and form of arguments in historical texts gained from our attempt to\n                    locate and map the arguments in one corner of the Hathi Trust digital\n                    library."}}, "dhq:teaser": {"p": "Dicusses a technological platform and problems in scaffolding a system for\n                    argument identification and interpretation"}}, "body": {"div": [{"head": "Prologue: From Distant Reading to Close Reading", "p": [{"quote": {"@rend": "inline", "@source": "#washburn1908", "q": "angry", "#text": "We speak, for example, of an\n                             wasp."}, "hi": {"@rend": "italic", "#text": "The Animal Mind: An\n                        Introduction to Comparative Psychology"}, "cit": {"quote": {"@rend": "inline", "@source": "#allen2017", "#text": "guided serendipity"}, "ptr": {"@target": "#allen2017"}}, "#text": "This sentence appears in the first edition of\n                    Margaret Floy Washburn’s textbook , published in 1908. It occurs as\n                    part of an argument she presents against the anthropomorphic idea that we humans\n                    can use our introspection of anger to understand the emotions of organisms so\n                    physiologically and anatomically different from us. One suspects that Washburn,\n                    whose story deserves more space than we can give it here, was intimately\n                    familiar with anger. She was the first woman to earn a PhD in psychology in the\n                    United States — albeit not from Columbia University, where she wanted to study.\n                    Columbia were unwilling to set the precedent of admitting a woman for doctoral\n                    studies. Instead she received her degree from Cornell University, where she was\n                    accepted to the Sage School of Philosophy under the mentorship of Edward B.\n                    Titchener, the pioneering psychologist who pursued a combined introspective and\n                    experimental approach to the human mind. Washburn’s textbook would go through\n                    four editions, spaced roughly a decade apart, spanning one of the most\n                    consequential periods for psychology in its protracted separation from\n                    philosophy as a new experimental discipline. After World War II, Washburn’s book\n                    faded from view. We discovered it in the digital haystack of the Hathi Trust\n                    with the assistance of computational methods we deployed to help us locate\n                    argumentative needles such as the sentence leading this paragraph, the kind of\n                    process one of the present authors describes elsewhere as ."}, {"q": "angry", "#text": "Our goal in this essay is to urge more attention in the digital and computational\n                    humanities to the important scholarly practice of interpreting arguments. We\n                    describe what we learned from our attempt to take an argument–centered approach\n                    to humanistic enquiry in a big digital repository. We acknowledge that the\n                    methods and approach we adopted represents an initial attempt to explore a\n                    complex digital humanities problem, and can be improved upon, as one of our main\n                    aims is to draw attention to this problem and spur further work in this area. We\n                    believe we have provided a road map to guide future work — or, at least, an\n                    analogue to one of those early maps of the world drawn by explorers, no doubt\n                    distorting the major land masses, but better than nothing. If not dragons, wasps\n                    lie here, and although much of the work described here involved good\n                    old-fashioned human interpretation, our discovery of Washburn’s textbook and the\n                         wasps therein can be credited to the power of the computational\n                    methods we used to locate arguments about the anthropomorphic attribution of\n                    mental qualities such as anger to nonhuman animals."}, {"ptr": [{"@target": "#murdock2017"}, {"@target": "#lawrence2014"}], "q": "angry", "#text": "Some of our work has been previously outlined in other publications that focused\n                    on our multi-level computational approach  and a\n                    technical investigation of the challenges of automated argument extraction . Here, for the first time, we provide more detail\n                    about the human component of argument identification, extraction and\n                    representation scaffolded by the use of topic models to find relevant content.\n                    Through a two-stage, topic-modeling process, we drilled\n                    down from a book-level model of a large corpus (too large to read in a decade) a\n                    page-level model of a smaller subcorpus (still representing at least a year’s\n                    reading). This allowed us to select a few dozen pages from six books containing\n                    arguments that were mapped in detail within a few weeks by a team member with no\n                    prior expertise in psychology or the history & philosophy of science. The\n                    argument maps produced by this step of human interpretation allowed us to\n                    identify statements that could be fed back into a third level of topic modeling,\n                    drilling down to the level of sentences in a single book. In this way we were\n                    able to discover other relevant arguments within the same text, including the\n                    one about  wasps and another about the cognitive powers of\n                    spiders."}, {"ref": [{"@target": "#mochales2011", "#text": "Mochales and Moens, 2011"}, {"@target": "#acl2018", "#text": "ACL, 2018"}], "ptr": {"@target": "#lawrence2014"}, "#text": "Automated argument extraction, also known as argument mining, has significant\n                    challenges and remains a holy grail of artificial intelligence research (e.g.,\n                    see ; ). Our approach contributes only minimally\n                    to solving that problem  and, in fact, we doubt it\n                    is truly solvable with existing methods. Nevertheless, we propose that the\n                    digital humanities should invest more effort in developing argument-centered\n                    approaches to computational text analysis. We could be provocative and say that\n                    stylometrics and bibliometrics are the low-hanging fruit of digital humanities,\n                    and it is time for the digital humanities to take up challenges that may be\n                    harder, but which have more real-world impact. The skill of interpreting\n                    arguments is a cornerstone of education, scholarship, and civic life. Arguments\n                    are fundamental to human meaning making and to the maintenance, and reform of\n                    social norms. Even if the field of artificial intelligence is a long way from\n                    being able to properly interpret arguments in context, humanities scholars can\n                    use tools that are not so far out of reach to assist in their analysis and\n                    interpretation of the arguments that structure discourse in both academic and\n                    public domains. Interpreting arguments as they appear in historical documents\n                    brings them alive, allowing scholars, students, and citizens to understand their\n                    relevance for current issues. But before the arguments can be interpreted, they\n                    must first be found. As we demonstrate in this paper, available computational\n                    methods can strongly assist with that."}]}, {"head": "Exploring Arguments in the Digital Sphere: Animal Minds as a Proxy\n                    Domain", "p": ["We focused on the early 20th Century debate about animal minds because, in the\n                    aftermath of Darwin’s revolutionary effect on biology, it was a particularly\n                    fertile arena for historically important arguments that were still poised\n                    between scientific and literary styles of writing, and also for the pragmatic\n                    reason that it fitted our prior expertise in psychology, ethology, and\n                    philosophy of cognitive science. The debate remains lively in academic circles\n                    more than a century since Washburn published her book, and it is, of course,\n                    important to the ongoing public debates about animal welfare and animal rights.\n                    A close reading of Washburn’s text reveals to a modern reader a mixture of\n                    familiar and unfamiliar arguments, many of which deserve revisiting today. Our\n                    work also led us to five other texts (described below), which present a similar\n                    mixture of the familiar and the unfamiliar. Anyone who engages closely with the\n                    arguments in these books learns much about the trajectory that psychology in the\n                    English-speaking world was on, and also comes to understand how current debates\n                    about animal minds are dependent on the paths laid down these earlier\n                    authors.", {"q": ["anthropomorphic", "proper"], "#text": "The late 19th century and early 20th century was a period of significant\n                    development for psychology that was characterised by important and competing\n                    arguments. Experimental methods were on the rise, and psychologists, who had\n                    often been housed in the same university department as the philosophers, were\n                    professionalising, forming their own associations and journals, and their own\n                    departments. Philosophy could be seen as retreating from the arguments based on\n                    experimental evidence increasingly favored by psychologists, while psychologists\n                    were wondering which of their received concepts and theories should be\n                    jettisoned, and which could form the basis of further empirical investigation.\n                    Such questions were particularly acute in animal comparative psychology. On the\n                    one hand, Darwin’s theory of evolution exerted a strong pull towards the idea of\n                    mental continuity between humans and animals. On the other hand, many Darwinians\n                    were seemingly content with anecdotal evidence of animal intelligence to make\n                    their case on analogical grounds to human behaviour, leading experimentally\n                    inclined psychologists to reject such anecdotes and analogies as\n                        . Even as the disciplines of psychology and philosophy\n                    were formally disassociating themselves, philosophical arguments about the\n                         way to study animal psychology were becoming even more\n                    prominent among the psychologists themselves."}, {"term": "distant reading", "#text": "While comparative psychology in the immediate post-Darwin era was a particularly\n                    fertile era for the interplay between philosophy and science, the domain we\n                    selected is not special. It serves as a proxy for any domain where\n                    interpretation remains open and debate inevitably ensues. The lessons learned\n                    from our attempt to find and interpret text about anthropomorphism in\n                    comparative psychology generalise to other domains. There is no substitute for\n                    reading the relevant texts closely, but there is similarly no substitute for\n                    computational  of such a massive repository as the\n                    Hathi Trust in order to select which texts are the best candidates for close\n                    reading and extraction of their arguments."}, {"ref": [{"@target": "#wegerif2007", "#text": "Wegerif, 2007"}, {"@target": "#ravenscroft2008", "#text": "Ravenscroft and McAlister, 2008"}, {"@target": "#ravenscroft2010", "#text": "Ravenscroft 2010"}, {"@target": "#pilkington2016", "#text": "Pilkington 2016"}], "#text": "The skills involved in interpreting arguments are essential in supporting and\n                    developing critical thinking and writing skills – even, and especially, where\n                    digital media predominate (e.g., ;\n                        ; ; ). The volume and variety of\n                    this digital sphere provides opportunities for thinking, learning and writing\n                    within and across educational, professional and civic contexts. Across these\n                    contexts the need to identify, understand, and critically compare arguments is\n                    particularly important today to counteract a discourse in which accusations of\n                    ‘fake news’ and appeals to emotion are used to promote simplistic,\n                    insufficiently contextualised arguments and propositions, often overriding well\n                    evidenced and supported positions on a subject. There is a pressing need to\n                    support and promote scholarly practices focused on identifying, understanding\n                    and comparing written arguments that can occur within texts in massive data or\n                    document repositories."}, "The availability of massive document collections transforms the scale and\n                    complexity of the tasks of searching for and interpreting arguments, but these\n                    collections hold out great potential for understanding the academic and broader\n                    cultural contexts in which these arguments were historically and are presently\n                    situated. A key inspiration for our approach was to help inexperienced scholars\n                    simulate the way an experienced or expert scholar moves from macro-level views\n                    of document collections to micro-level close reading and interpretation of the\n                    key arguments in particular texts.", "Of course, there will always be ethical issues, linked to any sociological and\n                    political framing around decisions about which digital collections to focus on.\n                    For example, the extent to which these may or may not be not-for-profit and\n                    available to the public. In our case, we worked with the HathiTrust collection,\n                    because it is a consortium of mostly public state universities – spearheaded by\n                    Michigan, Illinois, and Indiana – who retain ownership of the scanned content,\n                    up to the limits of the applicable copyright laws, although Google supported\n                    work to accelerate the scanning of these materials. The original\n                    proof-of-concept tool-set that we are proposing and discussing in this article\n                    is aimed at gaining insights, both conceptual and technological, about finding\n                    and interpreting arguments in digital repositories of any kind in principle.\n                    Therefore this work is aiming to be relatively generic in its positioning around\n                    what repository to focus on, although for pragmatic reasons also, the HathiTrust\n                    was particularly suitable because project members, and one co-author (Allen),\n                    were working at Indiana University at the time of this project, which\n                    facilitated the cooperation with the HathiTrust Research Center."]}, {"head": "Investigation by Design", "p": [{"title": {"@rend": "quotes", "#text": "Investigation by Design"}, "ptr": [{"@target": "#ravenscroft2000a"}, {"@target": "#mcalister2004"}, {"@target": "#ravenscroft2007a"}, {"@target": "#ravenscroft1999"}, {"@target": "#ravenscroft2000b"}], "quote": {"@rend": "inline", "@source": "#edwards2007", "#text": "below the level of the work"}, "cit": {"quote": {"@rend": "inline", "@source": "#edwards2007", "#text": "Neither the\n                            exact implementation of standards, nor their integration into local\n                            communities of practice, can ever be wholly anticipated"}, "ptr": {"@target": "#edwards2007", "@loc": "16"}}, "ref": {"@target": "#edwards2018", "#text": "see\n                        also Edmond 2018"}, "#text": "Our approach was also inspired by prior work on the methodology of  by one of the present authors\n                        . This work was originally developed to\n                    model and simulate collaborative argumentation practices \n                     leading to learning and conceptual development\n                        \n                    . A key idea behind this approach is that\n                    technology which effectively enhances scholarship and learning practices should\n                    balance existing practices with the technological possibilities for enhancing\n                    that practice. In other words, we should not try to fundamentally disrupt the\n                    way that people approach texts, but seek to amplify and enhance their processes\n                    and practices so as to support more powerful learning and scholarly\n                    interpretation across a wider variety of contexts. In our application the\n                    existing practice consists of skimming texts for arguments followed by close\n                    critical reading of them, and the technological enhancements are (1) topic\n                    modelling to improve the searching and (2) argument mapping to improve the\n                    identification, analysis and interpretation of the arguments. The semi-formal\n                    nature of the mapping tool used in the second component forced us to reflect on\n                    what is required of close critical reading during the analysis, construction and\n                    representation processes. Furthermore, we believe the level at which we have\n                    designed our approach satisfies what Edwards et al. (2007) refer to as ,\n                    i.e., a level where  ()."}, {"ref": {"@target": "#edmond2018", "#text": "In a\n                        recent article, Jennifer Edmond (2018) laments the loss of serendipity this\n                        entails."}, "#text": "Consider the challenge facing learners and researchers confronted with massive,\n                    digitised document collections that are not readily browsable in the way that\n                    shelves of library books once were. For one thing, many of the books of interest\n                    have been physically shifted to deep storage facilities and must be called up\n                    one-by-one rather than whole shelves at a time. () For another, the digitised collection represented by the\n                    HathiTrust Digital Library is an order of magnitude larger than any single\n                    library collection, so what was one shelf may have become the digital equivalent\n                    of ten. When browsing shelves of physical books, readers might pull a book off\n                    the shelf, sample a few pages from the book, and decide whether to put it back\n                    or to check it out of the library for closer reading. In the digital library,\n                    that decision takes on a different character: on the one hand there is a sense\n                    in which we don’t have to put anything back as we can carry out macroscopic\n                    analyses of very large numbers of texts; on the other hand we must still make\n                    selections for the closer readings that provide valuable insights that are\n                    currently beyond the reach of algorithms."}, {"ref": [{"@target": "#ravenscroft2007b", "#text": "Ravenscroft et al., 2007"}, {"@target": "#andrews2009", "#text": "Andrews, 2009"}, {"@target": "#ravenscroft2010", "#text": "Ravenscroft 2010"}], "quote": [{"@rend": "inline", "#text": "sense making"}, {"@rend": "inline", "#text": "standalone"}], "ptr": {"@target": "#kirschner2012"}, "#text": "It is our view that a tool that links searching of massive document collections\n                    to close critical reading of key arguments therein would have significant value\n                    across educational contexts. It could make the practices of experienced scholars\n                    more systematic, efficient and powerful. Perhaps more importantly, it could\n                    empower and support less experienced learners to engage in systematic critical\n                    thinking and reasoning linked to identifying and understanding arguments, which\n                    is a well-attested challenge throughout education (e.g., see ; ; ). Although previous research has shown the value of\n                    argument mapping to support greater \n                    and learning in general, this work has involved  mapping tools  that do not\n                    link the maps to the larger textual and intellectual context in which they\n                    arise."}, {"ref": [{"@target": "#mcalister2014", "#text": "McAlister et al. 2014"}, {"@target": "#murdock2017", "#text": "Murdock et al. 2017"}], "ptr": {"@target": "#mcalister2014"}, "#text": "At the time we conducted the work upon which we base our discussion here, public\n                    access to the HathiTrust Digital Library was restricted to the approximately\n                    300,000 volumes outside copyright and in the public domain in the United States.\n                    The HathiTrust now provides non-consumptive access to over 17 million volumes\n                    (as of November 2019), increasing the challenge of identifying key texts from\n                    unreadable quantities of text for the purpose of close reading and argument\n                    extraction, making it even more important to develop techniques and tools such\n                    as those we discuss here. A primary challenge at this scale concerns how to\n                    identify and compare argumentation and arguments within and across texts, in a\n                    way that is analogous to the way a scholar works, moving from a macro-level view\n                    of texts to the close critical reading of particular arguments within and across\n                    texts. This work (whose technical details are reported by  and ) represented the first time\n                    that topic modeling and argument mapping had been combined in a process that\n                    allowed a scholar to identify pages within texts that should be fed into the\n                    argument mapping task, both necessitating and supporting a close critical\n                    reading of those texts by the individual engaged in the process. This work,\n                    through ostensibly technical research combining Big Data searching and AI\n                    techniques, included a broader exploration of the possibilities for integrating\n                    science mapping and visualization, along with an initial attempt at argument\n                    extraction . In this paper we provide a detailed\n                    critical examination of the nature and form of arguments that were identified in\n                    the texts, and we consider the centrality of the interpreter and the\n                    interpretative processes in extracting these arguments given their historical\n                    and cultural contexts. This critical examination supports our wider reflections\n                    on the role of such technical methods in supporting the identification,\n                    interpretation and comparison of important historical arguments. These\n                    reflections provide the basis for our ‘bigger vision’ concerning the important\n                    challenge of understanding arguments via the digital humanities, and the broader\n                    implications for any field where identifying and interpreting digital arguments\n                    is important, or vital."}]}, {"head": "Searching and interpreting as a pedagogical practice: The challenge of\n                    identifying, analysing and understanding arguments in texts", "p": ["Texts do not give up their meanings easily, and different branches of the\n                    humanities bring different interpretative strategies to bear on the very same\n                    texts. For instance, philosophy students and scholars seek to understand\n                    conceptual frameworks and arguments that are typically not fully explicit in the\n                    texts they study. History students and scholars studying the very same texts may\n                    seek different kinds of clues to assist in their interpretations, such as facts\n                    about the social and cultural milieu in which they were written, or the specific\n                    contacts and experiences that led to particular acts of authorship. Literature\n                    students and scholars may focus on narrative structure in those texts, and the\n                    extent to which a given piece of work follows or flaunts literary\n                    conventions.", {"ptr": [{"@target": "#shiffrin2004"}, {"@target": "#nadeau2007"}], "#text": "When the goal is also to exploit large datasets in support of traditional\n                    humanities research and learning, it is necessary to answer the question of how\n                    computational methods might help these kinds of students and scholars alike. For\n                    instance, consider the history scholar or student who already knows the\n                    biographical details of a 19th Century author, but wants to understand the\n                    narrative or argumentative structure of specific passages in that author's work.\n                    Scientometric methods such as the analysis of co-author and citation networks\n                        , and text mining methods such as named entity\n                    recognition  may provide hints about influences on a\n                    given author, but unless these are linked to more powerful tools for textual\n                    analysis and critical work, the role of these methods is limited to very early\n                    stages of investigation for scholars pursuing disciplinary research within the\n                    humanities. Likewise, while search engines may be useful for discovering and\n                    retrieving individual documents and even key passages, they do not help with the\n                    interpretative task of distinguishing between passages where an author is\n                    accepting a particular concept, making a particular argument, or following a\n                    particular convention, and passages where those concepts, arguments, and\n                    conventions are being attacked or rejected."}, "To serve scholars and their students well, it is necessary to develop techniques\n                    for deeper analysis of the texts they care about. Sophisticated quantitative\n                    analysis of the full contents of texts will be needed. But computational methods\n                    alone will not suffice. Progress towards more effective use of massive text\n                    repositories will require a combination of computational techniques, digital\n                    curation by experts, and a better understanding of the way texts are critically\n                    understood and used in scholarly practices. No single method alone holds the\n                    key. Researchers and students need to be able to engage with the texts and\n                    discuss them with peers. Students and interested amateurs can in turn benefit\n                    from the discussions among experts if those can be adequately summarised and\n                    represented. People participating in debates may benefit from being able quickly\n                    to locate sources, both ancient and modern, that support or controvert their\n                    positions. There are many open research questions here about the design of\n                    effective systems that can serve scholars, and facilitate the representation of\n                    their knowledge in ways that others, experts and non-experts alike, can make use\n                    of in their critical engagement with the texts."]}, {"head": "From Massive Document Repositories to Argument Identification", "p": "It is somewhat self-evident that massive document repositories offer access to an\n                    unparalleled number of texts across historical and disciplinary dimensions,\n                    opening up new possibilities for learning and scholarly activity. But, in\n                    practice, with so much choice about what to read, how do we decide which texts\n                    and parts of texts to focus on? And similarly, how can we focus on the key\n                    arguments within these texts to support the close reading and understanding of\n                    them? This is not just valuable in itself, it also counters the practice of\n                    reading texts in a fast, superficial and uncritical way, which is the temptation\n                    when we have access to such a massive quantity of text and information."}, {"head": "Why topic modelling to locate arguments?", "p": [{"ref": {"@target": "#moens2007", "#text": "Moens et al. 2007"}, "q": ["for this reason", "in virtue of", "hence", "therefore"], "ptr": {"@target": "#palau2009"}, "#text": "Previous attempts at automated argument identification (e.g., ) have focused on key words and\n                    phrases which may indicate the introduction of premises (,\n                        , etc.) or conclusions (, ,\n                    etc.). However, given a) the enormous variety of such markers, b) the\n                    historically shifting patterns of usage, and c) how many arguments are presented\n                    without such markers, such approaches can have significant limitations. Even\n                    when enhanced to use grammatical structure  they face\n                    the additional weakness that that they do not capture the semantic content of\n                    arguments."}, {"ptr": [{"@target": "#moens2007"}, {"@target": "#teufel2009"}, {"@target": "#merity2009"}], "q": ["modern", "free\n                        running", "order of magnitude"], "title": [{"@rend": "quotes", "#text": "Introduction"}, {"@rend": "quotes", "#text": "Results"}, {"@rend": "quotes", "#text": "Conclusions"}], "ref": [{"@target": "#lawrence2012", "#text": "Lawrence et al., 2012"}, {"@target": "#kirschner2012", "#text": "Kirschner et al., 2012"}], "#text": "The set of documents accessible via the HathiTrust provide a robust test of our\n                    approach, as particular difficulties of understanding arguments from this\n                    historical era are: a) not all the content is congruent with the style of\n                    scientific thought and writing that we have come to expect in the modern era\n                    (e.g., the heavier reliance on anecdotal evidence in earlier times); b) the\n                    language used even in scientific publications is indirect, and verbose compared\n                    with its modern-day equivalent (e.g., there may be long digressions), and c)\n                    what passes for acceptable argument may well have been different in that era\n                    (e.g., the variety of rhetorical strategies). This problematisation contrasts\n                    significantly with other formal approaches to argument modeling, that have\n                    focused on articles with a modern, formulaic structure, e.g., in legal contexts\n                         or in the context of  scientific\n                    articles \n                     where ,\n                        ,  etc., are explicitly identified. The type of texts we\n                    were interested in were historically and scientifically important, but written\n                    in a common and more natural style, so we were deliberately giving ourselves a\n                    hard problem, but one with high authenticity and relevance. The task of\n                    understanding, identifying and mapping arguments in these more  social science or philosophical (and historical) texts could be\n                    considered an  more challenging than previous work into\n                    argument mapping (e.g., ;\n                        )."}, {"ptr": [{"@target": "#landauer1997"}, {"@target": "#blei2003"}], "ref": {"@target": "https://code.google.com/archive/p/word2vec/", "#text": "Word2Vec"}, "emph": "So, our assumption was that the parts of texts that were rich in a\n                        particular topic would also be rich in the arguments that included that\n                        topic, and that assumption would be tested through our design and its\n                        application in the target domain.", "#text": "Most scholars are interested in arguments not simply for arguments’ sake, but\n                    because of the underlying topics and issues that are addressed in those\n                    arguments. Computational methods offer a variety of ways for capturing semantic\n                    relations in text. Some, such as Latent Semantic Analysis (LSA)  are good at capturing word-document relations,\n                    others are good at capturing word-word relationships (e.g., ). For\n                    argument analysis, however, the right “chunks” for analysis are somewhere\n                    between words and whole documents. We chose to explore LDA (Latent Dirichlet\n                    Allocation) topic modelling  as a means to find\n                    appropriately-sized, content-rich sections of text within books, which could\n                    then be subjected to further scrutiny for argument analysis and mapping."}, {"term": ["K", "K", "K"], "#text": "LDA topic modelling (LDA-TM) is by now a familiar technique in the digital\n                    humanities. It uses machine learning to represent documents as mixtures of\n                    “topics” and these are represented as probability distributions of the words in\n                    the corpus on which the model is trained. The training process automatically\n                    assigns probabilities to the topic-document and word-topic distributions in such\n                    a way that a relatively small set of topics (set by the modeler via a\n                    hyperparameter ) can account for the word distributions found in a\n                    relatively much larger set of documents comprising the corpus. As such, then,\n                    topic models accomplish a form of data compression, enabling common themes to be\n                    identified within a large corpus. Appropriate selection of the hyperparameter\n                         for the number of topics depends on various factors including\n                    the size of the corpus and the pragmatic goals of the scholars using the model.\n                    As described in more detail below, we explored several different values of\n                        , and settled on a number of topics that served our goal of\n                    identifying passages of interest for our argumentative analysis and\n                    interpretation. Also described in more detail below is the process we followed\n                    to select among and within the books. We made a number of design choices which\n                    reflected our pragmatic aim of designing a prototype toolkit that could\n                    demonstrate proof of concept, rather than pursuing a systematic investigation of\n                    the space of all possible measures and methods."}, {"ref": {"@target": "#murdock2017", "#text": "the previous overview of our work by\n                        Murdock et al. (2017)"}, "term": "drill-down", "q": "discovered\n                        arguments", "#text": "Going beyond , here we focus in more detail on the pedagogical\n                    practice, through the link between the original  topic\n                    modelling work and the nature, form and structure of the many arguments\n                    contained in these texts from the digital library. The detailed interpretation\n                    of the texts leading to semi-formal representation of the found arguments allow\n                    us, in this paper, to assess the importance and relevance of the , and to problematise the design space."}]}, {"head": "Topic Modeling and Selection of Texts", "p": [{"q": ["Darwin", "comparative\n                        psychology", "anthropomorphism", "parsimony", "what to read?"], "#text": "Automated selection from large volume sets is necessary because one cannot hope\n                    to inspect by eye the whole collection. For example, although a standard keyword\n                    search in the HathiTrust collection, using , , , and , reduced over\n                    300,000 public domain works to a list of 1,315 volumes, this many books is on\n                    the order of Charles Darwin’s entire personal library, accumulated and read over\n                    several decades. To help us to decide  we chose to adapt\n                    topic modeling to our purposes. This technique is useful for information\n                    retrieval because it allows a higher level of semantic abstraction than keyword\n                    searching."}, {"ref": {"@target": "#blei2003", "#text": "Blei\n                        et al., (2003)"}, "ptr": [{"@target": "#wei2006"}, {"@target": "#heinrich2009"}, {"@target": "#medlar2017"}, {"@target": "#tangherlini2013"}, {"@target": "#murdock2017"}], "note": [{"ref": [{"@target": "https://www.hypershelf.org/htrc1315/", "#text": "https://www.hypershelf.org/htrc1315/"}, {"@target": "https://github.com/inpho/topic-explorer/README.md", "#text": "https://github.com/inpho/topic-explorer/README.md"}], "ptr": {"@target": "#murdock2015"}, "#text": "The results of this step of the topic modeling can be explored\n                        at . All models were built using\n                        the InPhO project’s Topic Explorer open source package  available for download at ."}, {"q": "naïve", "ref": {"@target": "#murdock2017", "#text": "See Murdock et al., (2017) for details."}, "#text": "We took a  approach to this, simply using the\n                        proportions of the documents assigned by the model to the topics of\n                        interest, and then choosing a threshold on the proportions that seemed to\n                        the person making the choice to be sufficient to capture the books relevant\n                        to comparative psychology (along with many irrelevant ones; i.e., we\n                        preferred recall over precision at this stage)."}, "At this stage we preferred precision over recall.\n                        We again used a naïve approach, taking the mathematically expedient approach\n                        of summing the proportions across all pages and choosing an arbitrary\n                        threshold on the sums. Future work should explore more sophisticated\n                        information theoretic measures of relevance."], "#text": "LDA topic modelling (LDA-TM) was first introduced by , and it has been subsequently deployed in a variety of\n                    applications \n                    \n                    , including applications in the humanities . A key innovation of our approach is that we\n                    adopted a multilevel approach to a scholarly workflow . We first applied LDA-TM to these 1,315 volumes treating each book as a\n                    document.  The\n                    resulting topic model was scanned by a person who selected thresholds on the\n                        topics to extract 86\n                    volumes from the original 1,315, as those most closely related to our focus on\n                    anthropomorphism and animal minds. Amongst other advantages, the topic models\n                    allowed us to disambiguate discussions of anthropomorphism in the animal context\n                    from uses of the term in the context of comparative religion, allowing us to\n                    drill down efficiently to the most relevant materials. We then re-applied LDA-TM\n                    to these 86 volumes treating every page as a document. A further step of\n                    topic-model assisted selection rated books according to the number of pages\n                    containing a high density of the topics we were\n                    interested in. This yielded six books of central interest for our argument\n                    analysis. It was notable that none of these texts appeared in the first ten\n                    results of libraries standard keyword searching."}, "The six volumes selected by the methods described above each discuss our chosen\n                    topic of Animal Psychology:"], "list": {"@type": "ordered", "item": [{"hi": {"@rend": "italic", "#text": "The Animal Mind: A Text-Book of Comparative\n                            Psychology"}, "#text": "by Margaret Floy Washburn, 1908"}, {"hi": {"@rend": "italic", "#text": "Comparative Studies: Psychology of Ants and of Higher\n                            Animals"}, "#text": "by Eric Wasmann, 1905"}, {"hi": {"@rend": "italic", "#text": "The Principles of Heredity"}, "#text": "by G. Archdall Reid,\n                        1906"}, {"hi": {"@rend": "italic", "#text": "General Biology"}, "#text": "by James G. Needham, 1910"}, {"hi": {"@rend": "italic", "#text": "The Nature & Development of Animal Intelligence"}, "#text": "by Wesley Mills, 1898"}, {"hi": {"@rend": "italic", "#text": "Progress of Science in the Century"}, "#text": "by J. Arthur\n                        Thomson, 1908"}]}, "div": {"head": "Selection of rated pages and argument maps", "p": [{"quote": {"@rend": "inline", "#text": "sense-making"}, "ptr": [{"@target": "#kirschner2012"}, {"@target": "#reed2007"}], "ref": {"@target": "#chesnevar2006", "#text": "see Chesnevar et al. (2006)"}, "q": ["lens", "found"], "#text": "We decided to adopt the visual argument mapping approach for a number of\n                        related reasons. Previous research has strongly supported the value of\n                        argument mapping for: greater  of\n                        argumentative texts ; providing standardized\n                        and comparable semi-formal and visual representations to support the\n                        investigation and analysis of arguments generally ;\n                        and, providing visual representations that could be rendered into a generic\n                        computational format, the Argument Interchange Format (AIF), , that can be\n                        re-used and shared between applications. In our case, this meant that the\n                        argument mapping approach that we adopted (see below) supported the close\n                        critical reading of the text selections through an argument  and\n                        provided a standard representational scheme that could be applied across the\n                        different texts, showing the  arguments in each. Once mapped,\n                        these representations can be potentially re-used and shared in further\n                        argument inquiry or tool development. Further details of the mapping tool\n                        and process, and how it was used to interpret the texts and arguments that\n                        are specific to our study are provided below."}, {"ref": {"@target": "#table01", "#text": "Table 1 (below)"}, "hi": [{"@rend": "italic", "#text": "Pages"}, {"@rend": "italic", "#text": "Volume"}, {"@rend": "italic", "#text": "Maps"}, {"@rend": "italic", "#text": "Volume"}, {"@rend": "italic", "#text": "The Animal Mind,"}], "q": "argument\n                            rich", "#text": "The rating of pages according to their loading on topics of interest was\n                        taken as an indicator of material worthy or argument analysis and mapping,\n                        but these were not used to limit arguments that started before or ended\n                        after the rated pages. Thus, each argument selected by the person doing the\n                        mapping spanned rated pages, but may also have spanned unrated bordering\n                        pages occasionally. Also, not all rated pages that dealt with the chosen\n                        topic contained argument.  shows\n                        the  that were selected from each , following our topic modelling approach, and\n                        also the number of  for each . This shows that the first three of the listed volumes,\n                        according to our topic modelling returns were potentially , with their arguments therein creating 15, 10 and 8 maps\n                        respectively. For  which contained\n                        many more rated pages than listed in the table, we chose to limit our\n                        analysis to 40 pages constituting the largest blocks of contiguous pages\n                        containing pages with greater than 90% loading on the topics of\n                        interest."}, {"title": {"@rend": "italic", "#text": "General Biology"}, "q": ["facts", "pop-science", "topic rich", "argument rich"], "#text": "The latter three in the list were potentially less rich in argument, creating\n                        2, 5 and 3 maps respectively. This difference indicates the variability in\n                        writing style during this historical period, with some texts showing clearer\n                        lines of argument than others.  is a textbook that follows a\n                        more didactic, less argumentative style, and differs from Washburn’s\n                        psychology textbook, in that the there is a less controversial set of\n                        accepted  to present. The fifth text is based on predominantly\n                        personal observation, so, it is a piece of anecdotal comparative psychology,\n                        and not concerned with the methodological questions that lead to the\n                        argumentative structure of Washburn’s book. The final text has fewer\n                        arguments because it is a  book and is more engaged in\n                        telling a triumphal narrative of scientific progress, rather than dealing\n                        with controversies in the field. It does have a section on animals that\n                        emphasises the discoveries that seem to show how intelligent they are, so it\n                        does not aim for the sort of complex analysis that is provided by Washburn.\n                        So, considering these findings lends support to our assumption that the\n                             texts according to our topic modeling method also\n                        approximate the degree to which the content is ."}, {"ptr": [{"@target": "#janier2014"}, {"@target": "#reed2007"}, {"@target": "#lawrence2012"}], "ref": [{"@target": "ova.arg-tech.org", "#text": "ova.arg-tech.org"}, {"@target": "#figure01", "#text": "(e.g., Figure 1)"}], "#text": "The argument content was mapped using OVA+  an\n                        application which links blocks of text using argument nodes. OVA+ () provides a\n                        drag-and-drop interface for analysing textual arguments that it is designed\n                        to work in an online environment, running as a HTML5 canvas application in a\n                        browser. This particular tool was chosen because it builds on the\n                        established work in argument diagraming and mapping referred to above  and because it is also a widely used argument\n                        mapping tool that also incorporates and generates the standardised Argument\n                        Interchange Format (AIF) that has been used by many other projects in\n                        computational argumentation . Using this tool\n                        each argument is divided into propositions and marked up as a set of text\n                        blocks. These text blocks containing propositions were linked to\n                        propositions that they support, or undercut, to create an argument map, such\n                        as the one below ."}], "table": {"@xml:id": "table01", "head": "Page lists of analysed pages from selected volumes", "row": [{"@role": "label", "cell": [{"@role": "label", "#text": "Volume"}, {"@role": "label", "#text": "Maps"}, {"@role": "label", "#text": "Pages"}]}, {"@role": "data", "cell": [{"@role": "data", "hi": {"@rend": "italic", "#text": "The Animal Mind"}}, {"@role": "data", "#text": "15"}, {"@role": "data", "#text": "13-16, 16-21, 24-27, 28-31, 31-34, 58-64, 204-207,\n                                288-294, total = 40 pages (original page numbering)"}]}, {"@role": "data", "cell": [{"@role": "data", "hi": {"@rend": "italic", "#text": "The Psychology of Ants"}}, {"@role": "data", "#text": "10"}, {"@role": "data", "#text": "Preface, 15-19, 31-34, 48-53, 99-103, 108-112,\n                                206-209, 209-214, total = 37 pages (renumbered; Original page\n                                numbering masked by a bug.)"}]}, {"@role": "data", "cell": [{"@role": "data", "hi": {"@rend": "italic", "#text": "The Principles of\n                                Heredity"}}, {"@role": "data", "#text": "8"}, {"@role": "data", "#text": "374, 381, 382, 385, 386, 390, 394, 395, total 10 pages\n                                (renumbered)"}]}, {"@role": "data", "cell": [{"@role": "data", "hi": {"@rend": "italic", "#text": "General Biology"}}, {"@role": "data", "#text": "2"}, {"@role": "data", "#text": "434-435, 436 total = 3 pages (original page\n                                numbering)"}]}, {"@role": "data", "cell": [{"@role": "data", "hi": {"@rend": "italic", "#text": "The Nature & Development of\n                                    Animal Intelligence"}}, {"@role": "data", "#text": "5"}, {"@role": "data", "#text": "16-18, 21-26, 30-32 total = 12 pages\n                                (renumbered)"}]}, {"@role": "data", "cell": [{"@role": "data", "hi": {"@rend": "italic", "#text": "Progress of Science"}}, {"@role": "data", "#text": "3"}, {"@role": "data", "#text": "479-484, total = 6 pages (renumbered)"}]}]}, "figure": {"@xml:id": "figure01", "head": {"title": {"@rend": "italic", "#text": "The Animal\n                                Mind"}, "#text": "Argument Map of Argument 3 (Arg3) of  by Washburn (1908)"}, "graphic": {"@url": "resources/images/figure01.png"}}}}, {"head": "Argument Interpretation: Identification, Analysis, and Mapping", "p": [{"ref": [{"@target": "#lawrence2014", "#text": "described by Lawrence et al. (2014)"}, {"@target": "https://bit.ly/35CshTD", "#text": "https://bit.ly/35CshTD"}], "q": ["historical", "natural"], "#text": "To identify the form and structure of the arguments contained in the selected\n                    texts we adapted a generic approach for manual argument analysis . Through\n                    considering this work we developed a bespoke rubric that standardised and\n                    described the interpretative process that linked the analysis of our\n                         texts to the argument format of the mapping tool. This was\n                    informed by the members of the team with expertise in the humanities, who were\n                    familiar with the styles of writing about this topic for this historical period,\n                    and the researcher who was performing the mapping process. This was important in\n                    our case because, as mentioned earlier, the  arguments contained\n                    in these texts, demanded more sophisticated interpretation compared with other\n                    applications where the arguments were more clearly defined. The full detail of\n                    this interpretative rubric can be accessed online . To summarise\n                    it for the purposes of this paper:"}, {"note": {"ref": {"@target": "http://bit.ly/1bwJwF9", "#text": "http://bit.ly/1bwJwF9"}, "#text": "Online link () to\n                        volumeData on Google Drive (view only). Open volume folder, open the pass\n                        subfolder, select a PNG image and see a Preview pane – click the blue OPEN\n                        button. A new tab will open – click button 100% to zoom. Move around by\n                        dragging the diagram."}, "ref": {"@target": "#figure01", "#text": "Figure\n                        1."}, "title": {"@rend": "italic", "#text": "The Animal Mind"}, "#text": "Through interpreting and mapping the identified arguments in these texts the\n                    researcher produced the 47 OVA+ maps covering the selections from the six\n                    volumes, which can be viewed online, with the maps sequentially numbered and linked\n                    to each volume. An example is included in  It shows an argument from the first text, Argument 3 (Arg 3) from\n                        . The links drawn on the maps\n                    between propositions are of two types – supporting and counter-supporting (links\n                    labeled RA and CA respectively). Although OVA+ supports more link-types these\n                    were not used in this study. Instead we paid particular attention to\n                    interpreting the meaning and representing the sub-components of the\n                    argumentative text. Conclusions must be supported by at least one premise. Often\n                    the maps have sub-conclusions leading to main conclusions. Propositions that\n                    expand or explain other propositions are seen as lending support to them. A link\n                    connecting two propositions always links from one to another, with an arrow\n                    showing direction, where a supporting premise links to (points to) a conclusion\n                    or sub-conclusion."}, {"title": {"@rend": "italic", "#text": "The\n                        Animal Mind"}, "quote": {"@rend": "inline", "#text": "RA"}, "term": "RA", "#text": "The argument map (Arg 3) above contains text taken from  by Washburn (1908). The argument consists of 3\n                    propositions (in the large boxes on the left) that support two related\n                    conclusions (in the large boxes on the right). The  boxes contained in the directional arrows demonstrates that the\n                    propositions on the left (P1, P2, P3) support the conclusions on the right (P5,\n                    P6), where the latter are also interconnected, as indicated through pointing to\n                    a shared relation (an ). In this example P2 and P3 combine to\n                    support the conclusion P4. The close reading of the content of this argument\n                    would emphasise Washburn’s sensitivity to the contrast between Descartes’ view\n                    and that of his predecessor Montaigne, and her emphasis on his use of the\n                    exquisite functioning of the behaviour of diverse species of animal as evidence\n                    for a sophisticated view of the relationship between consciousness and thought\n                    (one that is often obscured in current presentations of Descartes’ views on\n                    animal minds) along with her sensitivity to the shifting meanings of these terms\n                    over the centuries. How this particular argument fits into the more extensive\n                    close reading of the arguments is covered in the next section."}, "This approach was particularly appropriate for the volumes that we analysed,\n                    where, in some cases, the same topic is pursued for a complete chapter and so\n                    there are opportunities to map the extended argument. Given the way the\n                    arguments were differentially expressed, with some text being more easily mapped\n                    compared to others, the mapping process was quite sophisticated, yet followed\n                    the standardised rubric to maintain consistency of interpretation."], "list": {"@type": "ordered", "item": [{"hi": {"@rend": "bold", "#text": "Initial Reading:"}, "#text": "Read through the selected text to\n                        get a broad-brush overview of the nature and meaning of the arguments in\n                        play"}, {"hi": {"@rend": "bold", "#text": "Argument Identification:"}, "q": ["because", "therefore", "suggesting that"], "#text": "Mark beginnings and ends of\n                        major argumentative chunks (could span multiple pages) from where\n                        topic/conclusion is introduced to where it is concluded. This may be\n                        informed by linguistic identifiers (e.g., , ,\n                             etc.) where these are present"}, {"hi": {"@rend": "bold", "#text": "Argument Segmenting:"}, "#text": "For each paragraph, select zero\n                        or more sentences or whole-clauses that best summarise the arguments in this\n                        text. Unless they also contribute to arguments made by the author of the\n                        text, do not select sentences or clauses from reports of arguments or other\n                        non-argumentative materials, e.g., background information. (Mark zero if the\n                        paragraph is entirely non-argumentative, e.g., descriptive or providing\n                        background context.)"}, {"hi": {"@rend": "bold", "#text": "Structuring:"}, "term": ["relations", "attack"], "#text": "Link the elements together with\n                             that show the direction of reasoning, from\n                        premise to conclusion, and whether premises are supporting or\n                        counter-argument () relations"}, {"hi": {"@rend": "bold", "#text": "Mapping:"}, "#text": "Transfer the highlighted sentences, text and\n                        their relations to OVA+ and review and interpret for accuracy and\n                        representativeness"}]}, "div": {"head": "Interpreting identified arguments to support better understanding and\n                        learning", "p": {"q": ["deep", "double lens"], "note": "The depth of analysis we were seeking in this study would\n                            not have been feasible with a multi-user study, hence we focused on the\n                            pathway of one individual towards the process of extracting arguments as\n                            scaffolded by the available technologies.", "ref": {"@target": "#mcalister2014", "#text": "McAlister et al.\n                            (2014)"}, "#text": "This  identification, representation and interpretation process\n                        linked to the subsequent argument maps, including careful reading of the\n                        identified texts provided a  onto the arguments that\n                        provided a stronger interpretative platform than if these methods had not\n                        been applied. The identification, representation and mapping process was\n                        performed by a researcher who was familiar with the basics of argument\n                        mapping, who was neither a domain expert in comparative psychology nor\n                        experienced with extracting arguments from this kind of textual\n                            material. Below we describe his\n                        interpretations. In the descriptions below, for accuracy and evidence, we\n                        refer to the argument maps that the descriptions refer to that are\n                        accessible online (see footnote 4), as there isn’t the space to display them\n                        in this article. The importance and level of scholarly merit and detail of\n                        these argument interpretations is the test of our approach. In particular,\n                        we were interested in whether a researcher who knew nothing about the domain\n                        could be supported through sophisticated and deep reading of the arguments\n                        when guided by the topic models and the argument mapping process. A sample\n                        and summary of the subsequent close readings and argument descriptions of\n                        the first two volumes, which generated the most maps (15 and 10\n                        respectively), are given below for the purposes of this paper. And these\n                        descriptions are then followed by a summary of the interpretations across\n                        the texts to demonstrate how the arguments in the individual texts could be\n                        considered collectively to improve the understanding of the topic (of Animal\n                        Psychology) in general. The full close readings of the 47 Maps linked to the\n                        six volumes is given in .The descriptions below have been paraphrased and condensed\n                        from the original, with material enclosed by square brackets representing\n                        additional qualifying comments introduced by the present authors."}, "div": [{"head": {"title": {"@rend": "italic", "#text": "The Animal Mind"}, "#text": "Volume 1 analysis – ,\n                            1908"}, "p": [{"quote": {"@rend": "inline", "#text": "seen to pause, deliberate and resolve"}, "#text": "[In this first edition of her textbook, destined for four editions]\n                            Washburn sets the context for the debate on animal consciousness. She\n                            meets the charge that animal psychology is necessarily anthropomorphic\n                            straight away, and admits there is a problem (Arg1). She introduces\n                            Montaigne’s arguments for animal intelligence based upon the similarity\n                            of human and animal behaviours (Arg2) and follows with Descartes’s\n                            opposing argument, that animals are clock-like machines, with no\n                            capacity for thought (Arg3). Washburn next presents Darwin as arguing on\n                            the basis of analogical claims, such as that animals reason because they\n                            are .\n                            She asserts that Darwin's aim of defending his theory of evolution in\n                            face of ongoing controversy about the mental and moral gulf between man\n                            and animals, means that his claims cannot be taken at face value (Arg4).\n                            In contrast many physiologists argue that psychic interpretations are\n                            less preferable than biological explanations of animal behaviour in\n                            terms such as tropism [unconscious reaction to stimulation] (Arg5)."}, {"foreign": {"@xml:lang": "la", "#text": "reductio ad\n                                absurdum"}, "#text": "Washburn next summarises three main anti-mentalist camps or positions in\n                            the field (Arg6). She criticises the physiologists, the first camp, for\n                            ignoring or simplifying phenomena to fit a predetermined theory, and she\n                            argues that their approach yields a  when applied to human behaviour (Arg7). Washburn\n                            outlines the arguments of ant expert Erich Wasmann [see next section],\n                            representing the second camp. Wasmann’s definition of intelligence\n                            explicitly excludes animals on the grounds that they act only on\n                            instinct. He readily generalises from ants to all animals, stating that\n                            ants are superior to other animals (Arg8). The third camp is represented\n                            by Bethe [who belongs to an ultra-Cartesian group], holding that animals\n                            lack even sensation. Washburn identifies an inconsistency between his\n                            acknowledging that modifiability of behaviour is an indicator of\n                            consciousness, while considering this improper if applied to animals. He\n                            condemns all psychology as subjective and unknowable, and asserts that\n                            only chemical and physiological processes should be the object of\n                            scientific investigation (Arg9 and Arg10)."}, {"quote": {"@rend": "inline", "#text": "learning by\n                                experience"}, "ptr": {"@target": "#mcalister2014", "@loc": "24–5"}, "#text": "Washburn argues for a cautious approach to animal psychology,\n                            acknowledging pitfalls and problems but seeking scientific methods to\n                            overcome them (Arg11). She introduces Lloyd Morgan’s [famous] Canon\n                            whereby the simplest level of psychic faculty for an animal should be\n                            assumed that can fully explain the facts of a case. She argues that the\n                            choice may not always be the right one, but at least it reduces\n                            anthropomorphism by compensating for a known bias (Arg12). Washburn next\n                            argues against Loeb’s suggestion that  is a conclusive criterion for mind, but cautions\n                            that absence of proof does not amount to disproof. She maintains that\n                            rapid learning practically assures mind, but holds that great\n                            uncertainty remains about consciousness in lower animals (Arg13 and\n                            Arg14). Morphology and similarity of animals’ physiology to humans’ must\n                            be taken into account in deciding if an animal is conscious or not, and\n                            degrees of similarity indicate a gradation of consciousness, from lower\n                            to higher animals, with no possibility of drawing a sharp line between\n                            animals with and without consciousness (Arg15) ."}]}, {"head": "Volume 2 analysis - Psychology of Ants, 1905", "p": ["[Eric Wasmann was a Jesuit priest and naturalist, publicly renowned for\n                            his books about the variety of amazing ant behaviours.] Wasmann’s\n                            concept that “intelligence is a spiritual power” leads him to the claim\n                            that if animals had this spiritual power “they would necessarily be\n                            capable of language”. Animals don’t speak, so animals don’t have\n                            intelligence (Arg1). He supports his views of ants by reference to\n                            observations made by Aristotle, Stagirite, St Augustine, [and Wasmann’s\n                            contemporary naturalist] Dubois-Reymond (Arg3). Wasmann denigrates\n                            suggestions by ‘modern sociologists’ that ant “states” and human\n                            republics can be equated, explaining that class differences arise from\n                            ‘conditions of life’ or ‘intelligent’ free choice in Man, but ant castes\n                            arise from organic laws of polymorphism [multiple body forms] (Arg4).\n                            Wasmann asserts animal intelligence is really sensile cognition and\n                            sensuous experience, but if higher animals are credited with\n                            intelligence, it would be inconsistent to deny ants the same (Arg5). He\n                            argues that ants achieve a more perfect level of social cooperation than\n                            even the higher vertebrates, such as apes (Arg7).", {"ptr": {"@target": "#mcalister2014", "@loc": "25–7"}, "#text": "Wasmann criticises Darwin for his anthropomorphic stance towards the\n                            ‘silence and obedience’ of a group of baboons, which Wasmann\n                            reinterprets as ‘fidelity and obedience’, and takes to imply\n                            ‘reasonable, voluntary subjection to the demands of duty and authority’.\n                            He argues that the more likely explanation is “the instinctive\n                            association of certain sensile perceptions with certain sensile\n                            impulses” (Arg6). This association removes the need to allow animals\n                            thought; instead, instinct is a sufficient explanation (Arg10). The\n                            author explains that instinct has two elements, ‘automatism’ of\n                            behaviour (generally found in lower orders of animals) and ‘plasticity’\n                            of behaviour (generally found in higher orders). Because the\n                            architecture of ants’ nests varies from species to species even when the\n                            physical attributes of the ants are highly similar, he argues that a\n                            simple explanation of the variety of architecture linked to physical\n                            attributes will not do; rather the decisive factor is the psychic\n                            disposition of the ant species (Arg8). Wasmann maintains that while ants\n                            ‘verge on heroic unselfishness’ towards their young, only ‘Man’ is\n                            conscious of duty and the morals of parental love. Although he admits\n                            that some aspects of motherly love in humans are instinctual, motherly\n                            love cannot be attributed to animals because it is ‘spiritual’, based on\n                            awareness of duty that is unique to humans (Arg9)."}]}, {"head": "Summary of interpretation of arguments across six volumes", "p": ["The section above demonstrates a sophisticated close reading of a sample\n                            of the arguments in the two selected texts, through incorporating the\n                            mapping approach into the interpretation process. For example, the\n                            comparison and contrast afforded by Washburn’s survey of the arguments\n                            in the literature and her attempt to articulate a good scientific\n                            methodology for comparative psychology. This contrasts with Wasmann’s\n                            more polemical and theological approach to the perfection of behaviour\n                            through instinct, which reveals that despite Darwin’s work, published\n                            nearly 50 years earlier, much of the controversy revolves around whether\n                            humans have a special, perhaps God-given position, separate from the\n                            animal world.", {"ref": {"@target": "#mcalister2014", "#text": "the interpretation of the arguments in the\n                                six volumes that are given in full in McAlister et al.,\n                            (2014)"}, "#text": "A number of historically important themes emerged from . These demonstrated the ability of our selection and\n                            argument mapping methods to allow a reader, who was previously\n                            unfamiliar with the scholarship in this area, to zero in on the relevant\n                            passages and then acquire an understanding of the key themes, which is a\n                            measure of the success of those methods. Although it was not a primary\n                            goal of our project to produce new insights into the domain-specific\n                            content, these would somewhat hopefully and inevitably emerge from the\n                            close critical reading of the key arguments. So it is worth making some\n                            concise, content-specific remarks here about two of the themes that\n                            emerged from the six volumes, to demonstrate the potential value of the\n                            proposed approach."}, {"hi": {"@rend": "italic", "#text": "Animal Flexibility"}, "quote": [{"@rend": "inline", "#text": "psychic variety"}, {"@rend": "inline", "#text": "mechanical automatism"}, {"@rend": "inline", "#text": "instinct"}], "#text": "(i) . All the authors,\n                            evolutionists and non-evolutionists alike, were willing to recognise\n                            hitherto unacknowledged flexibility and variability in behaviour of\n                            individual animals. They all identify the same extremes – excessive\n                            anthropomorphism on the one hand, and the conception of animals as\n                            automatic reflex machines on the other – but each claims the middle\n                            ground for their quite different positions! Even Wasmann, the lone\n                            anti-evolutionist in our sample, denies that individual ants are reflex\n                            machines, claiming that the flexibility of individual ants is of a\n                                 not , although he attributes\n                            this flexibility to  not\n                            reason."}, {"hi": {"@rend": "italic", "#text": "Developmental Approaches"}, "ref": [{"@target": "#mills1888", "#text": "Mills (1888)"}, {"@target": "#reid1906", "#text": "Reid (1906)"}, {"@target": "#needham 1910", "#text": "Needham (1910)"}], "quote": {"@rend": "inline", "#text": "nature-nurture"}, "#text": "(ii) . Three of the\n                            authors, , , and , explicitly advocate a\n                            developmental approach to the study of animal mind, operating within the\n                            framework of a strong nature-environment distinction (corresponding to\n                            today’s  distinction). They\n                            make the case for comparative developmental studies, particularly\n                            experimentally rearing animals in isolation."}, {"term": "close\n                                reading", "ref": {"@target": "#richards1987", "#text": "(e.g., Richards,\n                                1987)"}, "#text": "Although the accounts (above) of the interpretation of the arguments are\n                            relatively concise, they demonstrate a successful  of the arguments located within the selected texts.\n                            And while the themes discovered should be compared with scholarly\n                            treatments of the same , nevertheless we believe that despite the variations in\n                            language (vocabulary and style), the crisscrossing overlap among the\n                            arguments discovered in these books indicates that our methods\n                            identified pages that were thematically relevant to tracking the\n                            scientific and philosophical debates about anthropomorphic attributions\n                            to animals in the late 19th and early 20th centuries. This provides\n                            confidence in our claim that the big-data analytic technique of topic\n                            modeling, linked to argument mapping, can support close reading of texts\n                            in a content-relevant, argument-guided way."}]}]}}, {"head": "Discussion", "p": [{"q": "rendered", "#text": "The approach described in this article offers an initial prototype of a design\n                    for scholarly interaction with technology that begins with topic model-assisted\n                    search of massive document repositories and leads to close critical reading of\n                    the arguments in the texts therein. It has also produced important insights\n                    about the way these arguments are  and interpreted by a person\n                    new to such historical texts and work in the humanities. The automated content\n                    selection and categorization work described in this article demonstrated the\n                    feasibility and reliability of large-scale, fined-grained topic-based\n                    categorization across a range of topics in science and philosophy using\n                    documents defined at a variety of scales (whole books, book pages, and\n                    individual sentences in books). Categorization and selection are essential\n                    first-steps in the scholarly process of identifying further structures, such as\n                    arguments, in large data sets. Although it might have been possible to construct\n                    more sophisticated keyword searches using Boolean operators to identify the same\n                    pages of interest for our analysis, this would have required painstaking trial\n                    and error, whereas the topic modeling provided a relatively straightforward\n                    semi-automatic approach to narrowing down. A number of insights emerged from\n                    performing the human interpretation of texts that were delivered by our topic\n                    modeling techniques and then mapped in argumentative terms through the\n                    argument-mapping tool OVA+."}, {"term": ["topic rich", "argument\n                        rich", "topic rich"], "title": {"@rend": "italic", "#text": "HathiTrust"}, "ref": {"@target": "#mcalister2014", "#text": "(see McAlister et al., 2014 for a full\n                        account)"}, "#text": "Topic modeling was clearly successful in identifying the texts (chapters and\n                    pages) that contained the ‘stuff’ of arguments linked to the keywords and topics\n                    that were searched for, strongly supporting our assumption that we could\n                    approximate  texts as also being . These could be sorted through rankings that allowed just the\n                         texts to be the focus of further analysis. This is\n                    very valuable in itself, as it allowed us to identify and extract 6 argument\n                    rich texts from a big data text repository (). Secondly the (human) argument identification and\n                    analysis produced 47 argument maps (in OVA+), that provided interpretations from\n                    six volumes, that also showed how the type and degree of argument in historical\n                    texts can be quite different, with the different texts producing different\n                    amounts of argument maps (ranging from fifteen to two). So, the quantitative and\n                    qualitative methodologies that we developed also enabled us to represent and\n                    distinguish different levels of argument within texts in a broad-brush way. The\n                    outcome is a set of powerful descriptive and comparative interpretations of\n                    arguments within and across texts, and linked to particular authors ."}, {"q": "document", "title": {"@rend": "italic", "#text": "The\n                        Animal Mind"}, "quote": [{"@rend": "inline", "#text": "angry"}, {"@rend": "inline", "#text": "This, of course, does\n                        not refer to the power to judge distance,"}], "cit": {"quote": {"@rend": "block", "term": ["Argiope", "Epeira"], "emph": "judge", "#text": "Porter observed that the distance at which\n                            spiders of the genera  and  could\n                            apparently see objects was increased six or eight times if the spider\n                            was previously disturbed by shaking her web. This, of course, does not\n                            refer to the power to  distance."}, "ptr": {"@target": "#washburn1908", "@loc": "238"}, "#text": "[Italics in original.]"}, "#text": "Furthermore, we were able to leverage the human-constructed argument maps against\n                    a micro-level topic model trained on a single book with each sentence treated as\n                    a . Such an approach to Washburn’s  led us from sentences represented in the maps to\n                    sentences in other parts of the book that were judged similar within the model\n                    and despite being wholly disjoint in vocabulary, including the  wasp. Close reading was essential to determine\n                    why certain sentences were selected by this method. For example, the relevance\n                    to anthropomorphism of the sentence,  was not immediately\n                    evident. The context of this sentence in Washburn’s footnote on p.238 is as\n                    follows:  Here,\n                    then, we see Washburn cautioning the reader not to jump to a high-level\n                    interpretation of the spider behaviour. The spiders may perceive objects at\n                    various distances but they don’t judge it, where judgement is understood to be a\n                    high-level cognitive capacity. This belongs to a more elaborate argument against\n                    anthropomorphically over-interpreting the behavior of species remote from\n                    humans."}, "To summarise, here are five key points from this study:"], "list": {"@type": "ordered", "item": ["We have demonstrated that topic modelling finds topic-rich text that is\n                        also potentially argument rich and worthy of careful argumentative\n                        analysis.", "Mapping these topic-rich regions of historical texts using a computerised\n                        mapping tool (OVA+) and a suitable rubric supports, and necessitates, close\n                        critical reading of the arguments and the texts.", {"q": ["gap filling", "come alive"], "#text": "The argument mapping was often a complex process, needing interpretation\n                        and sometimes  by the mapper, but this was cognitively\n                        valuable in supporting argument identification, representation and\n                        understanding linked to close critical reading. Some types of argument,\n                        e.g., historical arguments, are not simply latent and waiting for\n                        identification and representation. Rather, the arguments \n                        through interpretation and the processes of mapping and then writing about\n                        them."}, {"ref": {"@target": "#mcalister2014", "#text": "(see also\n                            McAlister et al., 2014)"}, "#text": "The exercise of mapping the arguments required critical reading by the\n                        non-expert. It manifestly contributed to his deeper understanding of the\n                        arguments and their scientific and philosophical contexts than simply\n                        reading the books alone without the scaffolding we provided. This is\n                        evidenced by his accounts covering all the found arguments and the summary\n                        and comparison of all of these ."}, {"term": "extracted", "#text": "Further development of this approach should accept points 1-4 above, and\n                        emphasise support for the process of understanding, representing and\n                        refining argument representations and related conceptualizations. This means\n                        those who design such tools should focus more on the cognitive processes of\n                        actively reconstructing arguments from complex texts, rather than assuming\n                        that arguments might simply be identified and  from a\n                        frame provided by grammatical and terminological markers of\n                        arguments."}]}}, {"head": "Critique and Further Work", "p": ["Our emphasis on investigating and testing the feasibility of our computational\n                    tools to support existing scholarly practices of identifying and understanding\n                    arguments in digitised texts has meant that thus far we have deliberately\n                    prioritised validating technical possibilities over systematic empirical testing\n                    with different texts and/or different scholars. This suggests the need for\n                    further research that would incorporate technical and empirical strands into the\n                    development of the human-computer interaction.", {"title": [{"@rend": "italic", "#text": "MALLET"}, {"@rend": "italic", "#text": "InPhO Topic\n                        Explorer"}, {"@rend": "italic", "#text": "HathiTrust Digital Library"}], "ptr": [{"@target": "#mccallum2002"}, {"@target": "#murdock2015"}, {"@target": "#ainsworth2006"}], "ref": {"@target": "http://inpho.github.io/topic-explorer/htrc.html", "#text": "http://inpho.github.io/topic-explorer/htrc.html"}, "#text": "The technical implications are that the next tool-set, should more closely\n                    connect the topic modelling to the argument mapping. Robust tools for topic\n                    modeling already exist in the form of \n                     and the \n                    . The latter is also well integrated with the  so that now even\n                    copyrighted materials may be modeled (). However, these\n                    tools need to be better integrated with tools for visually structuring argument\n                    maps such as OVA+ so that the scholarly work potentially enhanced by these tools\n                    becomes more seamless. The system should scaffold the interpretation process\n                    from identified texts to argument mapping, as this reasoning and\n                    re-representation process is cognitively valuable in achieving better\n                    understanding of arguments. Similarly, once the text is identified and the\n                    related maps are produced, other scaffolding or visualization techniques could\n                    assist coordinating between these two related representations of argument, and\n                    among the different representations produced by learners having diverse\n                    interests and goals. In this respect, further work could draw upon the large\n                    body of work into the use of external representations for learning ."}, "Once a more integrated and user-friendly version of the toolkit is developed, it\n                    would support more systematic empirical investigation of the interaction between\n                    user and machine. Our hypotheses are that compared to unassisted argument\n                    identification and understanding, this approach would: find the argumentative\n                    parts of relevant texts much faster and with greater accuracy; scaffold deeper\n                    understanding; and, provide flexible and permanent representations that could be\n                    reflected upon, extended and re-used. Further and more generally, future work\n                    will accept the need to move towards an environment for constructing and\n                    developing representations of argument rather than simply mapping them.", {"term": "extracting", "q": "Do arguments actually exist in clearly defined forms within\n                        (certain) texts? Or, do arguments only take form when readers focus on\n                        understanding them?", "#text": "The above appears a sensible conceptualization for future work, because through\n                    implementing our methods it became apparent that arguments were rarely neatly\n                    and clearly structured and defined explicitly in the texts. The historical\n                    distance to these texts, and the shift in academic writing styles over the past\n                    century served to make the task of  the arguments even\n                    more challenging. Indeed, rather than being set structures transmitted through\n                    the texts, instead these arguments came alive through the practice of\n                    interpreting, understanding and (re)constructing them. This raises the\n                    questions,  When today’s reader encounters the seemingly verbose\n                    yet strangely enthymematic nature of yesterday’s arguments, what can we learn\n                    about the interaction between readers and texts, and about the minds of the\n                    authors and their original readers?"}, {"ref": [{"@target": "#oppenheimer2011", "#text": "Oppenheimer & Zalta 2011"}, {"@target": "#oppenheimer2017", "#text": "2017"}, {"@target": "#garbacz2012", "#text": "Garbacz\n                        2012"}], "term": "ontological argument", "#text": "While these questions are too big to be answered by our original study, their\n                    potential validity as important questions are, we argue, supported. The notion\n                    that textual arguments are constructed through human interpretation is also\n                    supported by the observation that argument structure is notoriously difficult\n                    for people, even after training, to determine (see ,  and  for an interesting example of disagreement among experts about\n                    how to formalise Anselm’s famous  in way that\n                    is adequate for computational validation). Of course, this should come as no\n                    surprise when even textbooks of argument analysis disagree with one another on\n                    the simplest of real-world examples. Yet the goal of using texts to construct\n                    arguments that satisfy disciplinary canons of interpretation of those texts\n                    defines an important scholarly activity. The abstraction provided by such\n                    efforts provides a regulative ideal that aids comprehension of difficult texts,\n                    and the representation of these abstractions in artifacts such as argument maps\n                    provides concrete targets for collaborative meaning making and deeper\n                    discussions about alternative interpretations of complex texts. The skill of\n                    generating such maps and interrogating their meanings is a legitimate aspect of\n                    mental agility and perspective taking, supporting a more sophisticated view of\n                    knowledge. The development of these skills, and the tools that support them, is\n                    essential for informed citizenship, particularly in our contemporary social\n                    media milieu."}, {"note": "Although we have\n                        argued that ‘extraction’ is the wrong metaphor, we recognise that the term\n                        ‘argument extraction’ is likely to continue to be used for the actual\n                        constructive, interpretative process involved. Similarly, we continue to\n                        talk of the sun coming up even though we know it is really just coming into\n                        view with the Earth’s rotation.", "q": ["agreeing", "disagreeing", "liking"], "#text": "Design investigations such as the one we have described here must remain mindful\n                    of the reconstructive nature of argument extraction. Despite the claims of some A.I.\n                    proponents, computer scientists seem a long way from being able to design\n                    algorithms that match the interpretive skills and subtlety of human readers.\n                    Nevertheless, we believe we have supplied one proof of the concept that machine\n                    learning applied to big data sets can support this essential aspect of human\n                    scholarship by supplying tools for both discovery and representation of specific\n                    arguments in a specific content domain. And if we now return to the broad\n                    context of critical reading and writing in which our research is placed, we\n                    argue that we have made significant technical and conceptual steps in moving\n                    towards tools that could enhance and empower this process for learners and\n                    scholars alike. This is particularly important in our contemporary digital\n                    landscape, where there is arguably an increasing need within the academy and\n                    without, to identify and understand reasoned and evidenced argument, to combat,\n                    for example, just simply  or , or\n                    , or not, simple emotive propositions and arguments."}, "In the application of digital tools to the humanities, we must also be mindful\n                    that high-sounding rhetoric about civic engagement, the democratization of\n                    scholarship, etc., can be undermined by the facts surrounding the choice of\n                    sources and limitations of access to the materials analysed. In our case,\n                    because of the association between HathiTrust and Google Books, some may worry\n                    (incorrectly in our estimation) that, despite its origins and continuation in\n                    publicly-funded universities, the HathiTrust nevertheless represents the sort of\n                    corporatisation of higher education that some find undesirable. Whereas we\n                    accept that there will always be challenging issues concerning which\n                    repositories to focus on, from a scholarly practice perspective our position is\n                    clear. We want to improve and democratize the scholarly practice of finding and\n                    interpreting arguments, so that argumentative and critical meaning making is\n                    potentially more inclusive, in addition to supporting deeper inquiry for those\n                    who are already engaging in such practice."]}, {"head": "Conclusions", "p": [{"term": "scaffolds", "q": "fit the pieces together", "#text": "The research described in this article tackled a complex problem of how to\n                    investigate and design a technological platform that empowers and supports, or\n                        , humanistic practices guiding a non-expert to perform\n                    the kind of search, argument identification, and interpretation of an\n                    experienced or expert scholar. We investigated this within our approach through\n                    using ‘drill-down’ topic modelling to move from macro-level views of a big data\n                    document repository, through identifying the main areas of interest in specific\n                    texts, then subjecting these areas to close critical reading through semi-formal\n                    argument identification, analysis and interpretation. We were also able to show\n                    how, with the argument analyses in hand, a further drill down to topic models at\n                    the sentence level of individual books could help identify content that had not\n                    been originally selected. This investigation has also provided insights into the\n                    nature, form and structure of arguments in historical texts, and how these\n                    features can be difficult to neatly isolate and also be variable, and require\n                    the human to . This work provides an important\n                    problematisation of the design space for future tool development that should\n                    arguably focus, not on automatically extracting arguments, but instead focus on\n                    how to better interrogate, manipulate and understand them: a practice that has\n                    increasing importance and relevance within and without the academy."}, {"cit": {"quote": {"@rend": "inline", "@source": "#edmond2018", "#text": "stubbornly multimodal"}, "ptr": {"@target": "#edmond2018"}}, "quote": [{"@rend": "inline", "@source": "#edmond2018", "#text": "remote\n                        storage and electronic catalogues diminish the likelihood for\n                        serendipity"}, {"@rend": "inline", "@source": "#washburn1908", "#text": "angry"}], "#text": "Edmond notes that the digital tools currently available to humanists, focused as\n                    they are on text, do not fully reflect the much broader information gathering\n                    practices of humanists, which, in her phrase, remain . She argues that a certain kind of\n                    productive distraction, following leads where they may, is essential to\n                    scholarly creativity in the humanities. With respect to staying ensconced in the\n                    world of (digitised) text we are guilty as charged, unfortunately unimodal. The\n                    digital library is our easily-accessed tree, even if we would push digital\n                    humanist towards higher-hanging fruit. But we would argue that the approach we\n                    have outlined addresses some of the problems she outlines that arise from\n                    changes in the way libraries are organised in this era of digitised texts and\n                    catalogues. While we agree that  for reasons we already mention, we believe we have\n                    outlined a digital research environment for argument-based analysis in which\n                    serendipity arises. Following the traces provided by topic models led to\n                    sampling a few books in more detail, and then to the wasps, spiders, and amoebae\n                    that occupied the thoughts of comparative psychologists a century ago: creatures\n                    that have all re-emerged in the 21st century in discussions of non-human forms\n                    of cognition. The selections were assisted but not forced, allowing the\n                    individual scholar to follow whatever leads looked promising in light of\n                    whatever background information the scholar has gleaned from other sources.\n                    Guided serendipity resulted, and thus the  wasp was found."}]}, {"@type": "acknowledgements", "head": "Acknowledgements", "p": {"title": {"@rend": "quotes", "#text": "Digging by Debating: Linking Massive Data Sets to Specific\n                        Arguments"}, "#text": "The research reported in this article derives from a project that was funded by\n                    the 2011 International Digging into Data Challenge. The project, entitled , was co-funded in the UK by Jisc, the Economic and Social\n                    Research Council (ESRC), and the Arts and Humanities Research Council (AHRC),\n                    and in the US by the National Endowment for Humanities (NEH); the project title\n                    serves as the UK grant ID and the NEH grant ID is HJ-50092-12. The authors would\n                    like to acknowledge the work and intellectual contributions of the other co-PIs\n                    to this project, the Digging by Debating team — Katy Börner, David Bourget, and\n                    Chris Reed — and the various contributions of the staff and students who worked\n                    on the project: John Lawrence, Robert Light, Simon McAlister, Jaimie Murdock,\n                    Jun Otsuka, Robert Rose, and Doori Rose (listed alphabetically). David Bourget\n                    and Colin Allen jointly developed the text-to-OVA+ argument mapping rubric with\n                    feedback from Simon McAlister. We are particularly grateful to Simon for his\n                    work on carrying out the argument mapping process itself. We are grateful, too,\n                    for the comments by an anonymous referee, who encouraged us to think more\n                    broadly about the political and ethical contexts of our work."}}]}, "back": {"listBibl": {"bibl": [{"@xml:id": "acl2018", "@label": "ACL 2018", "title": {"@rend": "italic", "#text": "ACL Proceedings of 5th\n                        Argument Mining Workshop (2018)"}, "ref": {"@target": "http://www.aclweb.org/anthology/W18-52", "#text": "http://www.aclweb.org/anthology/W18-52"}, "#text": ". The Association for Computational\n                    Linguistics (ACL), Stroudsberg, USA (2018). . Accessed December 30,\n                    2018."}, {"@xml:id": "ainsworth2006", "@label": "Ainsworth 2006", "title": [{"@rend": "quotes", "#text": "DeFT: A conceptual framework for considering learning with\n                        multiple representations"}, {"@rend": "italic", "#text": "Learning and\n                        Instruction"}], "#text": "Ainsworth, S. .  16.3 (2006): 183-198."}, {"@xml:id": "allen2017", "@label": "Allen et al. 2017", "title": [{"@rend": "quotes", "#text": "Topic Modeling the Hàn diăn Ancient Classics"}, {"@rend": "italic", "#text": "Cultural Analytics"}], "ref": {"@target": "http://culturalanalytics.org/2017/10/topic-modeling-the-han-dian-ancient-classics-%E6%B1%89%E5%85%B8%E5%8F%A4%E7%B1%8D/", "#text": "10.22148/16.016"}, "#text": "Allen, Colin, Hongliang Luo,\n                    Jaimie Murdock, Jianghuai Pu, Xioahong Wang, Yanjie Zhai, Kun Zhao. .  (October 2017). DOI: ."}, {"@xml:id": "andrews2009", "@label": "Andrews 2009", "title": {"@rend": "italic", "#text": "Argument in Higher Education"}, "#text": "Andrews, R. . Routledge (2009)."}, {"@xml:id": "blei2003", "@label": "Blei et al. 2003", "title": [{"@rend": "quotes", "#text": "Latent Dirichlet Allocation"}, {"@rend": "italic", "#text": "Journal of Machine Learning Research"}], "#text": "Blei, David, Andrew Ng, and Michael\n                    Jordan. .  3 (January 2003):\n                    993–1022."}, {"@xml:id": "chesnevar2006", "@label": "Chesnevar et al. 2006", "title": [{"@rend": "quotes", "#text": "Towards an Argument Interchange\n                        Format"}, {"@rend": "quotes", "#text": "Knowledge Engineering Review"}], "#text": "Chesnevar, C., J.\n                    McGinnis, S. Modgil, I. Rahwan, Christopher Reed, G. Simari, M. South, G.\n                    Vreeswijk and S. Willmott. . \n                    21.4 (2006): 293-316."}, {"@xml:id": "edmond2018", "@label": "Edmond 2018", "title": [{"@rend": "quotes", "emph": "is", "#text": "How scholars read now: When the signal  the noise"}, {"@rend": "italic", "#text": "Digital Humanities Quarterly"}], "ref": {"@target": "http://www.digitalhumanities.org/dhq/vol/12/2/000388/000388.html", "#text": "http://www.digitalhumanities.org/dhq/vol/12/2/000388/000388.html"}, "#text": "Edmond, Jennifer. .\n                         (2018). Accessible\n                    at: ."}, {"@xml:id": "edwards2007", "@label": "Edwards et al. 2007", "title": {"@rend": "quotes", "#text": "Understanding Infrastructure: Dynamics, Tensions, and Design"}, "ref": {"@target": "http://hdl.handle.net/2027.42/49353", "#text": "http://hdl.handle.net/2027.42/49353"}, "#text": "Edwards, Paul N., Cory P.\n                    Knobel, Steven J. Jackson, and Geoffrey C. Bowker. \n                    (2007). Accessible at: . Accessed December 27,\n                    2018."}, {"@xml:id": "garbacz2012", "@label": "Garbacz 2012", "title": [{"@rend": "quotes", "#text": "Prover9's Simplification Explained Away"}, {"@rend": "italic", "#text": "Australasian Journal of Philosophy"}], "#text": "Garbacz, Paweł. .  90.3 (2012): 585-592."}, {"@xml:id": "heinrich2009", "@label": "Heinrich 2009", "title": [{"@rend": "quotes", "#text": "A generic approach to topic models"}, {"@rend": "italic", "#text": "Proceedings ECML/PKDD"}], "ref": {"@target": "http://www.arbylon.net/publications/mixnet-gibbs.pdf", "#text": "http://www.arbylon.net/publications/mixnet-gibbs.pdf"}, "#text": "Heinrich, G. ,  (September 2009). Accessible at: ."}, {"@xml:id": "janier2014", "@label": "Janier et al. 2014", "title": [{"@rend": "quotes", "#text": "OVA+: an Argument Analysis\n                        Interface"}, {"@rend": "italic", "#text": "Proceedings of 6th International\n                        Conference on Computational Models of Argument (COMMA 2014)"}], "#text": "Janier, M., John Lawrence, and\n                    Christopher Reed. . , IOS\n                    Press (2014): 463-466."}, {"@xml:id": "kirschner2012", "@label": "Kirschner et al. 2012", "title": {"@rend": "italic", "#text": "Visualising argumentation:\n                        Software tools for collaborative and educational sense-making"}, "#text": "Kirschner, P.A, S.J.\n                    Buckingham-Shum, and C.A. Carr. .\n                    Springer (2012)."}, {"@xml:id": "landauer1997", "@label": "Landauer and Dumais 1997", "title": {"@rend": "italic", "#text": "Psychological Review"}, "#text": "Landauer, T.K. and\n                    Susan T. Dumais. A Solution to Plato's Problem: The Latent Semantic Analysis\n                    Theory of Acquisition, Induction, and Representation of Knowledge.  104 (1997): 211-240."}, {"@xml:id": "lawrence2012", "@label": "Lawrence et al. 2012", "title": [{"@rend": "quotes", "#text": "AIFdb: Infrastructure for\n                        the Argument Web"}, {"@rend": "quotes", "#text": "Proceedings of the 4th\n                        International Conference on Computational Models of Argument (COMMA\n                        2012)"}], "#text": "Lawrence, John, F. Bex,\n                    Christopher Reed, and M. Snaith. . , IOS Press (2012): 515-6."}, {"@xml:id": "lawrence2014", "@label": "Lawrence et al. 2014", "title": [{"@rend": "quotes", "#text": "Mining Arguments From 19th Century Philosophical Texts Using Topic Based\n                        Modelling"}, {"@rend": "italic", "#text": "Proceedings of the First Workshop on\n                        Argumentation Mining"}], "#text": "Lawrence, John, Christopher\n                    Reed, Colin Allen, Simon McAlister, Andrew Ravenscroft. . . Baltimore, Maryland: Association for\n                    Computational Linguistics (2014): 79–87."}, {"@xml:id": "mcalister2014", "@label": "McAlister et al. 2014", "title": {"@rend": "quotes", "#text": "From Big Data to Argument Analysis\n                        and Automated Extraction"}, "ref": {"@target": "http://repository.jisc.ac.uk/5607/", "#text": "http://repository.jisc.ac.uk/5607/"}, "#text": "McAlister, Simon, Colin\n                    Allen, Andrew Ravenscroft, Christopher Reed, David Bourget, John Lawrence, Katy\n                    Börner, Robert Light. . Final Report and Research White paper.\n                    Digging into Data Phase 2 (2014). [Programme/Project deposit], ."}, {"@xml:id": "mcalister2004", "@label": "McAlister et al. 2004", "title": [{"@rend": "quotes", "#text": "Combining interaction and\n                        context design to support collaborative argumentation using a tool for\n                        synchronous CMC"}, {"@rend": "italic", "#text": "Journal of Computer Assisted\n                        Learning"}], "#text": "McAlister, S., A.\n                    Ravenscroft, and E. Scanlon. . , Special Issue: Developing dialogue for learning 20.3\n                    (2004): 194-204."}, {"@xml:id": "mccallum2002", "@label": "McCallum 2002", "title": {"@rend": "italic", "#text": "MALLET: A Machine Learning for Language Toolkit"}, "ref": {"@target": "http://mallet.cs.umass.edu", "#text": "http://mallet.cs.umass.edu"}, "#text": "McCallum, A.K. \n                    (2002). Accessible at: ."}, {"@xml:id": "medlar2017", "@label": "Medlar and Glowacka 2017", "title": [{"@rend": "quotes", "#text": "Using Topic Models to Assess Document Relevance\n                        in Exploratory Search, User Studies"}, {"@rend": "italic", "#text": "Proceedings of Conference on Human Information Interaction and Retrieval\n                        (CHIIR)"}], "#text": "Medlar, A. and D.\n                    Glowacka. .  New York, USA (2017)."}, {"@xml:id": "merity2009", "@label": "Merity et al. 2009", "title": [{"@rend": "quotes", "#text": "Accurate Argumentative Zoning with Maximum\n                        Entropy models"}, {"@rend": "italic", "#text": "Proceedings of the 2009\n                        Workshop on Text and Citation Analysis for Scholarly Digital\n                        Libraries"}], "#text": "Merity, S., T. Murphy, and J.\n                    R. Curran. . , ACL-IJCNLP (2009): 19-26."}, {"@xml:id": "mochales2011", "@label": "Mochales and Moens 2011", "title": [{"@rend": "quotes", "#text": "Argumentation mining"}, {"@rend": "italic", "#text": "Artificial Intelligence and Law"}], "#text": "Mochales, R. and M.F.\n                    Moens. .  19.1 (2011): 1-22."}, {"@xml:id": "moens2007", "@label": "Moens et al. 2007", "title": [{"@rend": "quotes", "#text": "Automatic Detection of Arguments in\n                        Legal Texts"}, {"@rend": "italic", "#text": "Proceedings of the 11th\n                        International Conference on Artificial Intelligence and Law"}], "#text": "Moens, M.F., E. Boiy, R. Palau,\n                    and Christopher Reed. . , ACM\n                    (2007): 225-230."}, {"@xml:id": "murdock2015", "@label": "Murdock and Allen 2015", "title": [{"@rend": "quotes", "#text": "Visualization Techniques for Topic Model\n                        Checking"}, {"@rend": "italic", "#text": "Proceedings of the 29th AAAI\n                        Conference on Artificial Intelligence (AAAI-15)"}], "#text": "Murdock, Jaimie and Colin\n                    Allen. . . Austin, Texas\n                    (January 2015)."}, {"@xml:id": "murdock2017", "@label": "Murdock et al. 2017", "title": [{"@rend": "quotes", "#text": "Multi-level computational methods for interdisciplinary\n                        research in the HathiTrust Digital Library"}, {"@rend": "italic", "#text": "PLoS ONE"}], "ref": {"@target": "https://doi.org/10.1371/journal.pone.0184188", "#text": "https://doi.org/10.1371/journal.pone.0184188"}, "#text": "Murdock, Jaimie, Colin Allen,\n                    Katy Börner, Robert Light, Simon McAlister, Andrew Ravenscroft, Robert Rose,\n                    Doori Rose, Jun Otsuka, David Bourget, John Lawrence, and Christopher Reed.\n                        .  12.9 (2017): e0184188. Accessible at: ."}, {"@xml:id": "nadeau2007", "@label": "Nadeau and Sekine 2007", "title": [{"@rend": "quotes", "#text": "A survey of named entity recognition and\n                        classification"}, {"@rend": "italic", "#text": "Lingvisticæ\n                        Investigationes"}], "#text": "Nadeau, D. and Satoshi\n                    Sekine. .  30 (2007): 3-26."}, {"@xml:id": "oppenheimer2011", "@label": "Oppenheimer and Zalta 2011", "title": [{"@rend": "quotes", "#text": "A computationally-discovered\n                        simplification of the ontological argument"}, {"@rend": "italic", "#text": "Australasian Journal of Philosophy"}], "#text": "Oppenheimer, Paul\n                    and Edward N. Zalta. .  89.2 (2011): 333-349."}, {"@xml:id": "oppenheimer2017", "@label": "Oppenheimer and Zalta 2017", "title": {"@rend": "quotes", "#text": "A Computational Implementation of the\n                        Ontological Argument (Corrected)"}, "ref": {"@target": "https://mally.stanford.edu/cm/ontological-argument/", "#text": "https://mally.stanford.edu/cm/ontological-argument/"}, "#text": "Oppenheimer, Paul\n                    and Edward N Zalta.  (2017). Accessible at: . Accessed\n                    December 30, 2018."}, {"@xml:id": "palau2009", "@label": "Palau and Moens 2009", "title": [{"@rend": "quotes", "#text": "Argumentation Mining: The Detection, Classification and\n                        Structure of Arguments in Text"}, {"@rend": "italic", "#text": "Proceedings of\n                        the 12th International Conference on Artificial Intelligence and Law (ICAIL\n                        2009)"}], "#text": "Palau, R.M. and M.F. Moens.\n                        . , Barcelona, Spain (June 2009): 98-107."}, {"@xml:id": "pilkington2016", "@label": "Pilkington 2016", "title": {"@rend": "italic", "#text": "Discourse, Dialogue and Technology Enhanced Learning"}, "#text": "Pilkington, R.M. .\n                    Routledge (2016)."}, {"@xml:id": "rahwan2009", "@label": "Rahwan and Simari 2009", "title": {"@rend": "italic", "#text": "Argumentation and Artificial Intelligence"}, "#text": "Rahwan, I. and G.R. Simari.\n                        .\n                    Springer (2009)."}, {"@xml:id": "ravenscroft2010", "@label": "Ravenscroft 2010", "title": [{"@rend": "quotes", "#text": "Dialogue and Connectivism: A new approach to understanding and\n                        promoting dialogue-rich networked learning"}, {"@rend": "italic", "#text": "International Review of Open and Distance Learning"}], "#text": "Ravenscroft, A. . , Special\n                    Edition: Connectivism: Design and delivery of social networked learning, (eds.)\n                    George Siemens and Gráinne Conole, 12.3 (2010): 139-160."}, {"@xml:id": "ravenscroft2000a", "@label": "Ravenscroft and Pilkington 2000", "title": [{"@rend": "quotes", "#text": "Investigation by Design: Developing\n                        Dialogue Models to Support Reasoning and Conceptual Change"}, {"@rend": "italic", "#text": "International Journal of Artificial Intelligence in\n                        Education"}], "#text": "Ravenscroft,\n                    A. and R.M. Pilkington. . , Special Issue on Analysing Educational Dialogue\n                    Interaction: From Analysis to Models that Support Learning. 11.1 (2000):\n                    273-298."}, {"@xml:id": "ravenscroft2007a", "@label": "Ravenscroft 2007", "title": [{"@rend": "quotes", "#text": "Promoting Thinking and Conceptual Change with Digital Dialogue\n                        Games"}, {"@rend": "italic", "#text": "Journal of Computer Assisted\n                        Learning"}], "#text": "Ravenscroft, A. .  23.6 (2007): 453-465."}, {"@xml:id": "ravenscroft2000b", "@label": "Ravenscroft 2000", "title": [{"@rend": "quotes", "#text": "Designing Argumentation for Conceptual Development"}, {"@rend": "italic", "#text": "Computers & Education"}], "#text": "Ravenscroft A. .\n                        , 34 (2000):\n                    241-255."}, {"@xml:id": "ravenscroft1999", "@label": "Ravenscroft and Hartley 1999", "title": [{"@rend": "quotes", "#text": "Learning as Knowledge Refinement:\n                        Designing a Dialectical Pedagogy for Conceptual Change"}, {"@rend": "italic", "#text": "Frontiers in Artificial Intelligence and Applications Volume\n                        50, Artificial Intelligence in Education. Open Learning Environments: New\n                        Computational Technologies to Support Learning, Exploration and\n                        Collaboration"}], "#text": "Ravenscroft, A.\n                    and J.R. Hartley. (1999). . , Lajoie, S. & Vivet, M. (eds.), IOS Press (1999):\n                    155-162."}, {"@xml:id": "ravenscroft2008", "@label": "Ravenscroft and McAlister 2008", "title": [{"@rend": "quotes", "#text": "Investigating and promoting\n                        educational argumentation: towards new digital practices"}, {"@rend": "italic", "#text": "International Journal of Research and Method in\n                        Education"}], "#text": "Ravenscroft,\n                    A. and S. McAlister. . : Special Edition on Researching argumentation in\n                    educational contexts: new methods, new directions, (eds.) Caroline Coffin and\n                    Kieran O’Halloran, 31.3 (2008): 317-335."}, {"@xml:id": "ravenscroft2007b", "@label": "Ravenscroft et al. 2007", "title": [{"@rend": "quotes", "#text": "Reclaiming thinking:\n                        dialectic, dialogic and learning in the digital age"}, {"@rend": "italic", "#text": "British Journal of Educational Psychology Monograph Series,\n                        Learning through Digital Technologies"}], "#text": "Ravenscroft, A.,\n                    R.B. Wegerif, and J.R. Hartley. . , Underwood., J & Dockrell,\n                    J. (eds.), Series II, Issue 5 (2007): 39-57."}, {"@xml:id": "reed2007", "@label": "Reed at al. 2007", "title": [{"@rend": "quotes", "#text": "Argument diagramming in logic, law and artificial\n                        intelligence"}, {"@rend": "italic", "#text": "The Knowledge Engineering\n                        Review"}], "#text": "Reed, C., D. Walton, and F.\n                    Macagno. . , 22.1 (2007): 87–10."}, {"@xml:id": "richards1987", "@label": "Richards 1987", "title": {"@rend": "italic", "#text": "Darwin and the Emergence of Evolutionary Theories of Mind and\n                        Behaviour"}, "#text": "Richards, R. . University of Chicago Press (1987)."}, {"@xml:id": "shiffrin2004", "@label": "Shiffrin and Börner 2004", "title": [{"@rend": "quotes", "#text": "Mapping knowledge domains"}, {"@rend": "italic", "#text": "Proceedings of the National Academy of Science"}], "#text": "Shiffrin, R.M. and K.\n                    Börner. (2004) . s, 101\n                    (suppl. 1): 5183-5185 (2004)."}, {"@xml:id": "tangherlini2013", "@label": "Tangherlini and Leonard 2013", "title": [{"@rend": "quotes", "#text": "Trawling in the Sea of the Great Unread:\n                        Sub-corpus topic modelling and Humanities research"}, {"@rend": "italic", "#text": "Poetics"}], "#text": "Tangherlini, T.\n                    R. and P. Leonard. .  41.6 (2013): 725-749."}, {"@xml:id": "teufel2009", "@label": "Teufel and Kan 2009", "title": [{"@rend": "quotes", "#text": "Robust Argumentative Zoning for Sensemaking in\n                        Scholarly Documents"}, {"@rend": "italic", "#text": "Advanced Technologies for\n                        Digital Libraries"}], "#text": "Teufel, Simone and Min-Yen\n                    Kan. . . Springer (2009): 154-170."}, {"@xml:id": "washburn1908", "@label": "Washburn 1908", "title": {"@rend": "italic", "#text": "The Animal Mind: A Textbook of Comparative Psychology"}, "#text": "Washburn, Margaret Floy. .\n                    The Macmillan company (1908)."}, {"@xml:id": "wegerif2007", "@label": "Wegerif 2007", "title": {"@rend": "italic", "#text": "Dialogic, education and technology: Expanding the space of\n                    learning"}, "#text": "Wegerif, R. B. . Springer-Verlag (2007)."}, {"@xml:id": "wei2006", "@label": "Wei and Croft 2006", "title": [{"@rend": "quotes", "#text": "LDA-based document models for ad-hoc retrieval"}, {"@rend": "italic", "#text": "Proceedings of the 29th Annual International ACM SIGIR\n                        Conference on Research and Development in Information Retrieval (SIGIR\n                        '06)"}], "ref": {"@target": "http://dx.doi.org/10.1145/1148170", "#text": "http://dx.doi.org/10.1145/1148170"}, "#text": "Wei, Xing and W. Croft. . . ACM (2006): 178-185. DOI: ."}]}}}}}