[{"url": "http://projects.chass.utoronto.ca/chwp/Casta02/Wooldridge_casta02.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The largest electronic text database in existence, the World Wide Web, makes possible, for the first time and without any outlay of costly set-up or the expensive development of project-specific tools, the observation of current usage in a number of different languages. The Web asdatabase has also the enormous advantage over other language corpora of behaving like natural language: it is dynamic, unceasingly renewing itself and thus offering snapshots of the present state of the language, with its proportion of new, established and aging usage. The paper discusses the observation, since 1998, of French, including derivation, polysemy, homophony, syntagmatic variation and the genesis of new concepts and their linguistic naming. The language corpora observed are those of micro-systems — particular words, word families and lexical constructions — and not the macro-system of the language as a whole. The tools used in the observation are keywords and search engines, in particular Google.", "article_title": "The World Wide Web as a Linguistic Corpus", "authors": [{"given": "Russon", "family": "Wooldridge", "affiliation": [{"original_name": "University of Toronto", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}]}], "publisher": null, "date": "2005-08", "keywords": ["World Wide Web, corpus linguistics, WWW as database, polysemy, homophony, syntagmatic variation, neology"], "journal_title": "CH Working Papers", "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}]}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2007/Stoicheff/Stoicheff.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Early 20th century book collector Otto Ege removed pages from medieval texts and regrouped them into forty boxes now scattered around the United States, Canada and Europe. The University of Saskatchewan, in partnership with other institutions holding the boxes, is in the process of locating as many as possible with the goal of digitally reassembling at least one of the original texts. The project has had the unanticipated effect of focusing scholarly and public attention on the unit of the individual page as opposed to the more familiar object of scrutiny, the book.", "article_title": "Putting Humpty Together Again: Otto Ege's Scattered Leaves", "authors": [{"given": "Peter", "family": "Stoicheff", "affiliation": [{"original_name": "University of Saskatchewan", "normalized_name": "University of Saskatchewan", "country": "Canada", "identifiers": {"ror": "https://ror.org/010x8gc63", "GRID": "grid.25152.31"}}]}], "publisher": null, "date": "2008-07", "keywords": ["page, Ege, manuscript, leaf, script, Beauvais Missal, digital reconstruction, fragment"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/Casta02/Sinclair_casta02.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "There is a demonstrated need for literary text analysis tools that take advantage of networked resources and the potential graphical interfaces. Despite several initiatives over the years, there has been little success in developing text analysis tools collaboratively or in creating an interoperable framework for tools development. This article presents initial work towards a Text Analysis Markup Language (TAML) that would foster the distributed development of literary text analysis tools. Any standardization of a vocabulary requires difficult choices, but it also requires a potentially beneficial examination of the needs and practices of a community. TAML is both a technical specification and a product of sociological introspection", "article_title": "Toward Next Generation Text Analysis Tools: The Text Analysis Markup Language (TAML)", "authors": [{"given": "Stéfan", "family": "Sinclair", "affiliation": [{"original_name": "McMaster University", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}], "publisher": null, "date": "2005-08", "keywords": ["Text analysis tools, interoperability, markup languages"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2003/Sinclair2.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This article is a general description of the conception and development of SAToRBase, an online database tool that contains some 3000 occurrences of topoi (recurring motifs) in French literature from about 1200 to 1800. SAToRBase has been developed expressly for the Société d'Analyse de la Topique Romanesque (SAToR), an international literary association. The purpose of this article is not to examine in detail each aspect of SAToRBase; that would be futile for an online tool of this kind which is in constant evolution. Rather, the purpose is to present more broadly the major characteristics of SAToRBase, including a brief description of typical procedures such as searching for occurrences of topoi and proposing new occurrences. The interface of SAToRBase is likely to change considerably over time, but the core concepts will no doubt remain stable.", "article_title": "SAToRBase: A Database of Topoi for French Literature", "authors": [{"given": "Stéfan", "family": "Sinclair", "affiliation": [{"original_name": "Humanities Computing, University of Alberta", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}], "publisher": null, "date": "2003-09", "keywords": ["Société d'Analyse de Topiques Romanesques (SAToR), topoi, French literature, literary databases"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2004/sinclair/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "With the advent of miniaturization and mass data storage, it becomes possible to collect relatively large amounts of data based on aspects of everyday life. With data sets placed in flexible, organized database contexts, it becomes possible to explore data in unique and interesting ways. In this paper I will discuss my new media art works based on a data set I have created called oh, those everyday spaces (OTES). The OTES data set contains material collected while cycling in and around Toronto, Canada. During the 15 month collection period one image was captured each minute, GPS (Global Positioning System) position about three times each minute, and local weather conditions were downloaded from Environment Canada's web site each hour. OTES contains about 25,000 images. The data set becomes the basis for my explorations of place through creative works based on the data. To illuminate the variety of approaches I am using to explore place, I will discuss works based on OTES.", "article_title": "The database as a vehicle for reconceiving place through the new media art interface", "authors": [{"given": "Don", "family": "Sinclair", "affiliation": [{"original_name": "Fine Arts Cultural Studies, Faculty of Fine Arts, York University", "normalized_name": "York University", "country": "Canada", "identifiers": {"ror": "https://ror.org/05fq50484", "GRID": "grid.21100.32"}}]}], "publisher": null, "date": "2009-04", "keywords": ["Database art, sousveillance, sonification, new media art"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/Casta02/Siemens_casta02.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Beginning with the assumption that text analysis and ‘algorithmic’ approaches to textual navigation provide a foundation for the dynamic scholarly edition, in 2002 I began a number of conversations of varying degrees of formality chiefly, but not exclusively, with researchers associated with the Text Analysis Portal for Research (TAPoR) initiative. My working paper is intended to recount, generically, the salient points of these discussions, as they document an important stage in our thinking about the future of the scholarly edition.", "article_title": "Text Analysis and the Dynamic Edition? A Working Paper, Briefly Articulating Some Concerns with an Algorithmic Approach to the Electronic Scholarly Edition", "authors": [{"given": "Ray", "family": "Siemens", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}], "publisher": null, "date": "2005-08", "keywords": ["Electronic editing, text analysis, TAPoR, dynamic edition"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2003/Santos_Fortier2.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Trésor de la Langue Française (TLF) database was designed, and texts chosen for inclusion in it, in the late 1950s. This paper evaluates the choices of texts made by the TLF committee in the light of a contemporary encyclopaedia of French literature and of subsequent published research in the field of French literature, provided by the MLA (Modern Language Association) online bibliography. Spearman?s rank correlation coefficient, and outlier analysis based on Mahalanobis distance evaluate similarities in the sets of data. The conclusion is that the choices made in the mid-twentieth century were a reasonable reflection of scholarly interests both at the time the database was constituted, and subsequently up to the present. The method described in this paper is applicable to the evaluation of other full-text databases.", "article_title": "Validating choices: Texts in the Trésor de la Langue Française", "authors": [{"given": "Susy", "family": "Santos", "affiliation": [{"original_name": "Department of French, Spanish and Italian and the Centre on Aging, University of Manitoba", "normalized_name": "University of Manitoba", "country": "Canada", "identifiers": {"ror": "https://ror.org/02gfys938", "GRID": "grid.21613.37"}}]}, {"given": "Paul A.", "family": "Fortier", "affiliation": [{"original_name": "Department of French, Spanish and Italian and the Centre on Aging, University of Manitoba", "normalized_name": "University of Manitoba", "country": "Canada", "identifiers": {"ror": "https://ror.org/02gfys938", "GRID": "grid.21613.37"}}]}], "publisher": null, "date": "2003-09", "keywords": ["Literature, corpora, French, statistics, Trésor de la langue française, Modern Language Association"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2007/Ruecker_etal/Ruecker_etal.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper discusses our recent research projects in the area of information visualization systems for studying repetition in literary documents. Our rationale for these experiments is that readers typically notice repetition as part of the normal process of reading, and such moments of recognition can serve as useful means of identifying interesting elements for further inquiry; however, while ordinary reading skills are often all that are necessary for spotting repeated patterns within a single document, if the document is long or complicated, or once there are many documents involved, an automated approach combined with an appropriate interface to visualize the results can make the experience not only possible, but also interesting and pleasurable in its own right. We describe three design projects in this area, dealing respectively with an approach that accommodates the contemporary hardware configuration of monitor, keyboard, and mouse; a set of designs that strip away codex conventions; and a design that attempts to take advantage of the new affordances offered by a high-resolution wall-sized display.", "article_title": "Visualizing Repetition in Text", "authors": [{"given": "Stan", "family": "Ruecker", "affiliation": [{"original_name": "University of Alberta", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}, {"given": "Milena", "family": "Radzikowska", "affiliation": [{"original_name": "Mount Royal College", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Piotr", "family": "Michura", "affiliation": [{"original_name": "Academy of Fine Arts in Krakow", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Carlos", "family": "Fiorentino", "affiliation": [{"original_name": "University of Alberta", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}, {"given": "Tanya", "family": "Clement", "affiliation": [{"original_name": "University of Maryland", "normalized_name": "University of Maryland, College Park", "country": "United States", "identifiers": {"ror": "https://ror.org/047s2c258", "GRID": "grid.164295.d"}}]}], "publisher": null, "date": "2008-07", "keywords": ["Computer-human interaction, interface design, large screen displays, text mining, data mining, knowledge discovery"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/Casta02/Rockwell_casta02.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "One problem in humanities computing is the automatic interpretation of electronic texts. Can computers interpret texts or do they aide in the interpretation? In this paper we propose variants on the Turing Test to imagine if computer-assisted interpretation is possible. We argue that a way forward for developing models for successful machine interpreters is to work with regular expression recognition and manipulation, which is built into most programming languages in a common fashion.", "article_title": "MIMes and MeRMAids: On the Possibility of Computer-aided Interpretation", "authors": [{"given": "Geoffrey", "family": "Rockwell", "affiliation": [{"original_name": "McMaster University", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}], "publisher": null, "date": "2005-08", "keywords": ["Humanities Computing, Computer-Assisted Text Analysis, Interpretation"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2003/Roberts_Smith2.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In The Arte of English Poesie, putative author George Puttenham applies the word “tune”, which he says refers to musical structure, to poetic metre, saying “our maker by his measures and concordes of sundry proportions doth counterfait the harmonicall tunes [my italics] of the vocall and instrumentall Musickes”.  He uses “tune” to refer, literally, to the number and duration of syllables, stress, spoken pitch, segmental features, or the combinations of some or all of these elements which he says create musical rhythms in spoken verse.  Although his usage is not supported in citations dating from 1500-1700 in the OED, the working copy of the Lexicons of Early Modern English database provides new evidence supporting Puttenham's usage.  Eleven contemporary hard-word dictionaries, bilingual dictionaries and rhetoric handbooks by Sherry (1550),  Cooper (1584), Thomas (1587), Coote (1596), Minsheu (1599), Cawdrey (1604), Florio (1598, 1611), Cotgrave (1611), Cockeram (1623), and Blount (1656) use “tune” to signify musical rhythm, spoken pitch, and prosody.  They also use “tune” as a synonym for “accent”, which signifies syllable duration and stress.  In all eleven lexical works, “tune” is an easy word used to explain other, more difficult words, including “accent”.  The lexicographers' expectation that readers will be familiar with their usage of the word “tune” suggests that people in the English Renaissance generally heard the musical elements of “tune” in spoken language.  Poets who use “tune” to describe metre or rhythm, such as Ben Jonson and Shakespeare, may have exploited its musical elements (syllable duration and spoken pitch) in their poetry.", "article_title": "Puttenham rehabilitated: the significance of ‘tune’ in The Arte of English Poesie", "authors": [{"given": "Jennifer", "family": "Roberts-Smith", "affiliation": [{"original_name": "Department of English, University of Toronto", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}]}], "publisher": null, "date": "2003-09", "keywords": ["poetry, music, Renaissance, tune, Puttenham, The Arte of English Poesie, dictionaries, Lexicons of Early Modern English, LEME, metre, rhythm, Early Modern English"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/reed/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In the following cluster of papers, each author discusses her experience using technology in the \"classroom\". All three papers are primarily concerned with pedagogy – how classes changed when computers became an integral part of the course. All raise issues related to how computers change classroom dynamics and, most importantly, how the use of computers changes the structures of authority which exist in the traditional classroom.", "article_title": "Pedagogy in the Electronic English Classroom: A Cluster", "authors": [{"given": "Sabrina", "family": "Reed", "affiliation": [{"original_name": "Mount Royal College", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Alexandra", "family": "Pett", "affiliation": [{"original_name": "Mount Royal College", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Patricia", "family": "Rigg", "affiliation": [{"original_name": "Acadia University", "normalized_name": "Acadia University", "country": "Canada", "identifiers": {"ror": "https://ror.org/00839we02", "GRID": "grid.411959.1"}}]}], "publisher": null, "date": "2000-10", "keywords": ["Technology, classroom, pedagogy, classroom dynamics, authority"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/Casta02/Petter_abstract.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Our paper will cover both academic and technical development of the Graves Diary Project (1935-39)url. This project and this paper have been made possible by close collaboration between the editors and the programming staff at the University of Victoria Humanities Computing Centre.", "article_title": "Pedagogy in the Electronic English Classroom: A Cluster", "authors": [{"given": "Chris", "family": "Petter", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": "Linda", "family": "Roberts", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": "Spencer", "family": "Rose", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}], "publisher": null, "date": "2005-08", "keywords": ["Electronic text, TEI corpus, XML database, eXist, XPath, JavaScript, Laura Riding, expatriate English writers, Spanish Civil War"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/patterson/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Since the correspondences of any one writer over a lifetime document hundreds of associative links comprising perhaps thousands of interpersonal transactions, and because each letter in itself may record many other interpersonal transactions performed or desired, the mapping of such associative links requires a reliable method of storing and retrieving data generated from the letter texts for first constructing individual social network profiles and then later for comparing them. Database programs have the capacity to store, order, reconfigure, and retrieve vast amounts of data. Hypertext theory and technology suggest new approaches to reading as well as representing epistolary texts. Together these technologies can assist in representing the social associations and affiliations of epistolary discourse. The hypertextual \"Anna Jameson and her Friends Database\", designed to reflect my approach to epistolary communication as well as to generate data for the mapping of Jameson's social network profile, is both what I hope will be a useful resource in itself and the first stage of my inquiry into the networking of early to mid-nineteenth-century women writers.", "article_title": "The \"Anna Jameson and her Friends Database\": Mapping Anna Jameson's Associative Links with the Victorian Intellectual Community", "authors": [{"given": "Katharine", "family": "Patterson", "affiliation": [{"original_name": "Simon Fraser University", "normalized_name": "Simon Fraser University", "country": "Canada", "identifiers": {"ror": "https://ror.org/0213rcc28", "GRID": "grid.61971.38"}}, {"original_name": "University of British Columbia", "normalized_name": "University of British Columbia", "country": "Canada", "identifiers": {"ror": "https://ror.org/03rmrcq20", "GRID": "grid.17091.3e"}}]}], "publisher": null, "date": "2000-10", "keywords": ["Written correspondence, associative links, social networks, hypertext, epistolary discourse, nineteenth century, women writers"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/Casta02/Mueller_casta02.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This article describes the origin, principles, practices, and potential of The Nameless Shakespeare electronic edition.", "article_title": "The Nameless Shakespeare", "authors": [{"given": "Martin", "family": "Mueller", "affiliation": [{"original_name": "Northwestern University", "normalized_name": "Northwestern University", "country": "United States", "identifiers": {"ror": "https://ror.org/000e0be47", "GRID": "grid.16753.36"}}]}], "publisher": null, "date": "2005-08", "keywords": ["Electronic edition, text-analysis, tagging, data retrieval, interface"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/Casta02/McGillivray_casta02.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Manuscript transcription in the Cotton Nero A.x. Project is at a graphetic level and captures each distinguishable glyph used by the scribe. When the transcription is organized as a series of XML entities within a codicological DTD a search-and-count algorithm can be appied to the database of graphetic information. Initial statistical analysis of the data reveals dramatic changes in the scribe's writing system at two points in the manuscript that are roughly coincident with quire boundaries (and also textual boundaries). Hypotheses that will guide further investigation of this phenomenon include the possibility that substantial gaps of time separated the scribe's work in copying the four Middle English poems that make up the manuscript.", "article_title": "Statistical Analysis of Digital Paleographic Data: What Can It Tell Us?", "authors": [{"given": "Murray", "family": "McGillivray", "affiliation": [{"original_name": "University of Calgary", "normalized_name": "University of Calgary", "country": "Canada", "identifiers": {"ror": "https://ror.org/03yjb2x39", "GRID": "grid.22072.35"}}]}], "publisher": null, "date": "2005-08", "keywords": ["Statistical analysis, paleography, textual analysis, medieval literature, manuscript, codicology, Pearl-poet, Gawain-poet"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2003/McCarty_b2.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Personification in Ovid's Metamorphoses (understood grammatically, as phenomena created by discernible operations in language) provides a typical problem for the application of computational modelling techniques. An earlier systematic attempt to encode these personifications was described in A.24 as “modelling”. In this paper the result, rather more a phenomenological description than a model, properly so-called, is taken as the basis for construction of a manipulable model. Instances of the abstract entity “fortuna” (fortune, luck, chance) are used to build a relational database of examples. For each example the causative factors are specified; wherever possible these factors are weighted globally to signify their degree of influence on the result. This database is linked to spreadsheet software to generate a chart of these instances in bar-graph format from a formula that computes the total effect of the causative factors. A mathematical function is provisionally introduced to provide more realistic results. Its limitations and directions for further research are discussed.", "article_title": "Depth, Markup and Modelling", "authors": [{"given": "Willard", "family": "McCarty", "affiliation": [{"original_name": "King's College London", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}]}], "publisher": null, "date": "2003-09", "keywords": ["modelling, personification, Ovid, Metamorphoses, databases, literary criticism"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2003/McCarty2.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Modelling, a polysemous idea and all but universal practice in the sciences, is essential to computing and therefore helpful in understanding the implications and consequences of humanities computing for the disciplines in its purview. As defined by their principal application in the physical sciences, models are crude, manipulable simplifications whose heuristic power comes both from the insight they give into otherwise inaccessible aspects of the world and from what they fail to capture. They are thus tools for “knowing true things by what their mockeries be”.", "article_title": "‘Knowing true things by what their mockeries be’: Modelling in the Humanities", "authors": [{"given": "Willard", "family": "McCarty", "affiliation": [{"original_name": "King's College London", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}]}], "publisher": null, "date": "2003-09", "keywords": ["modelling, knowledge representation, humanities computing, simulation, philosophy of science, Ovid, , personification"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/madrigal/Madrigal.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "For three hundred years Shakespeare scholarship has almost unanimously agreed on rejecting a number of plays that were published under William Shakespeare's name during his lifetime, but excluded from the First Folio of 1623. Since the eighteenth century the main argument against their inclusion in the canon has been based on critical taste rather than exhaustive textual examination. However, the use of a computer KWIC program coupled with a search engine like Google shows a significant amount of verbal parallels and very rare word strings shared exclusively between the Shakespeare canonical plays and The Yorkshire Tragedy, The London Prodigal, Lord Cromwell, and The Puritan, which is consistent with tests carried out on texts from the canon.", "article_title": "The Shakespeare Apocrypha in the Time of Google", "authors": [{"given": "José Luis", "family": "Madrigal", "affiliation": [{"original_name": "Graduate Center, City University of New York", "normalized_name": "City University of New York", "country": "United States", "identifiers": {"ror": "https://ror.org/00453a208", "GRID": "grid.212340.6"}}]}], "publisher": null, "date": "2008-03", "keywords": ["Shakespeare Apocrypha, idiolect, Linguistic individuation, stylometry"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2007/Liu_Smith/Liu_Smith.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Computer technologies offer us a wider range of nonlinear ways to read, but current markup-based standards of text encoding do not allow us to exploit the full potential of the digital environment.  The relational database, another well-established method of encoding information, suggests another definition of text, not as a hierarchical structure but as a \"labelled network of language objects.\"  This alternative model allows text not only to be stored in a database but also encoded as a database.  Some applications of this model are illustrated from our current work with Glyphicus, a database-building tool that we are using to encode the Middle English long poem Sir Perceval of Galles.", "article_title": "A Relational Database Model for Text Encoding", "authors": [{"given": "Yin", "family": "Liu", "affiliation": [{"original_name": "University of Saskatchewan", "normalized_name": "University of Saskatchewan", "country": "Canada", "identifiers": {"ror": "https://ror.org/010x8gc63", "GRID": "grid.25152.31"}}]}, {"given": "Jeff", "family": "Smith", "affiliation": [{"original_name": "University of Saskatchewan", "normalized_name": "University of Saskatchewan", "country": "Canada", "identifiers": {"ror": "https://ror.org/010x8gc63", "GRID": "grid.25152.31"}}]}], "publisher": null, "date": "2008-07", "keywords": ["relational databases, text encoding, text modelling, markup, XML"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2003/Lancashire2.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Lexicons of Early Modern English (LEME), an in-progress database of early dictionaries in England from about 1475 to 1700, builds on the EMEDD, now freely available on the Web. LEME is larger in scope, but the reasons for undertaking it remain the same. Language commentary written by Early Modern English lexicographers usefully supplements the OED, as an examination of selected word-entries in John Florio's first Italian-English lexicon (1598) shows. Editorial annotation of works of the period also can glean much from LEME sources. By comparing traditional editorial glosses to Shakespeare's Cymbeline, II.i.15-34, to what early lexicons supply, we can see how unmodern his language was, and how it is (in minutiae) still misunderstood.", "article_title": "The Lexicons of Early Modern English", "authors": [{"given": "Ian", "family": "Lancashire", "affiliation": [{"original_name": "Department of English, University of Toronto", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}]}], "publisher": null, "date": "2003-09", "keywords": ["Lexicons of Early Modern English, Renaissance, lexicon, dictionary, Shakespeare, Cymbeline, John Florio, Randle Cotgrave, database, editing, definition"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2004/junker/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Building an Internet resource for the Native American language East Cree for the last four years has been full of challenges and rewards. We focus here on the technical challenges in order to discuss both the problems encountered in this particular context and the solutions we have considered and explored. We illustrate our discussion with examples from an Oral Stories Database we developed in collaboration with Cree education consultants and speakers in 2002-2004. We advocate an approach that includes fast-prototyping, open-source development, and database engine design that balances speed, availability, features and resources.", "article_title": "The eastcree.org Web Databases: Participatory Action Research with Information Technology", "authors": [{"given": "Marie-Odile", "family": "Junker", "affiliation": [{"original_name": "Institute of Cognitive Science, Carleton University", "normalized_name": "Carleton University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02qtvee93", "GRID": "grid.34428.39"}}]}, {"given": "Radu", "family": "Luchian", "affiliation": [{"original_name": "Institute of Cognitive Science, Carleton University", "normalized_name": "Carleton University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02qtvee93", "GRID": "grid.34428.39"}}]}], "publisher": null, "date": "2009-04", "keywords": ["Oral stories database, participatory action research, information technology, aboriginal language preservation"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/kunstmann/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "On the web site of the Laboratoire de Français Ancien at the University of Ottawa we intend to offer free access to a query and research tool, both powerful and new, for use on Chrétien de Troyes' masterpiece the Chevalier au Lion, Chrétien being the most famous writer of medieval French romances. We are preparing a presentation of all the Chevalier au Lion manuscripts, with analysis and interpretation, that will constitute an indispensable collection of documents for future critical work – both for critical editions in general and critical editions of this particular work. Our aim is to show the educated public the text itself, accompanied by a series of indices, a study of the language and a complete lexicon of each manuscript copy. When the work is complete, the reader will be able to see images of the manuscript folios, to decipher the text by means of a first, \"archeological\" transcription (the text as is), and to understand it, through a second, critical transcription of the emended manuscripts. The series of indices will allow easy, automatic look-up of the text, and various types of query (phonetic, morphological, syntactic, lexical, semantic, literary, cultural, etc.). Morphosyntactic study will give a systematic framework for determining the meaning and import of textual forms and expressions encountered in reading. The lexicon will provide precise definitions for all the lexical words of each manuscript.", "article_title": "Chrétien de Troyes sur le Web: présentation, analyse et interprétation des manuscrits d'Yvain ou le Chevalier au Lion", "authors": [{"given": "Pierre", "family": "Kunstmann", "affiliation": [{"original_name": "Laboratoire de Français Ancien, Faculté des Arts, Université d'Ottawa", "normalized_name": "University of Ottawa", "country": "Canada", "identifiers": {"ror": "https://ror.org/03c4mmv16", "GRID": "grid.28046.38"}}]}, {"given": "France", "family": "Martineau", "affiliation": [{"original_name": "Laboratoire de Français Ancien, Faculté des Arts, Université d'Ottawa", "normalized_name": "University of Ottawa", "country": "Canada", "identifiers": {"ror": "https://ror.org/03c4mmv16", "GRID": "grid.28046.38"}}]}], "publisher": null, "date": "2000-10", "keywords": ["manuscript, Old French, Middle Ages"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/heimpel2/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "How can the specificity of scholarly electronic publications (e-publications) be stressed without inviting claims of inferiority vis-à-vis paper publications (p-publications)? The response I am proposing in this article treats resistance to e-publication as an essentially ideological or conceptual problematic. Examples are drawn from both scientific and humanities scholarly publication, since the conceptual problematic analysed and the solution proposed apply to both fields. Section 2 examines how different approaches to the integration of new technologies inevitably make certain assumptions about the nature of change, its \"felicity conditions,\" and limits. In Section 3, \"Metaphor as Strategy,\" the claims of similarity between p-publications and e-publications made by incrementalist integration approaches are analysed as a kind of metaphorical argument. Section 4 describes the extreme strain and pressure exerted on the publication metaphor by the recent barrage of new printing and publishing technologies. In the final section, \"Beyond the Publication Principle,\" I argue for an alternative metaphorisation of scholarly e-publications as virtual communities. In other words, the legitimization of scholarly e-publication must be approached as a discursive or rhetorical issue: we do not need to change what we are doing, but rather how it is framed as a value that can be protected.", "article_title": "Legitimizing Electronic Scholarly Publication: A Discursive Proposal", "authors": [{"given": "Rod", "family": "Heimpel", "affiliation": [{"original_name": "University of Toronto", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}]}], "publisher": null, "date": "2000-10", "keywords": ["Electronic publications, paper publications, virtual communities, metaphorisation"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2004/guertin/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This article explores the places subjectivity and agency occupy in game spaces.  In an interactive environment, subjectivity becomes motion, becomes the way we move and the choices we make through our embodied location in space.  By analyzing the use of embodiment in feminist computer games, specifically Diana Reed Slattery's Glide, we can see how interactive spaces allow us to construct the text as we play within its walls, with our choices forming the topology of the space of our voyaging.", "article_title": "From Complicity to Interactivity: Theories of Feminist Game Play", "authors": [{"given": "Carolyn", "family": "Guertin", "affiliation": [{"original_name": "McLuhan Program in Culture & Technology, University of Toronto", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}]}], "publisher": null, "date": "2009-04", "keywords": ["Glide, digital games, feminism, glyphs"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2004/gibson/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "While faculty members are beginning to use technology in their teaching, much more attention to technology integration is needed. Professional development experiences can play an important part in supporting faculty in these endeavours; however, most faculty professional development at the postsecondary level has been of an ad hoc nature involving interested individuals who have seen a need and sought out someone more skilled with computers to help them. Glenn (2002) calls for more work in the area of identifying viable models for preparing faculty to infuse technology into teacher education programs. In this paper I share some of the elements of a faculty wide professional development model designed for a large faculty of education. The Teaching with Technology in the Faculty of Education (TTFE) website was developed to provide a professional development model that includes practical resources for faculty seeking ways to make effective use of learning technologies. The model, which includes a suite of online tools and resources, integrates ideas both from people in the faculty and from other postsecondary institutions as to different ways to enhance teaching and learning. Faculty members have opportunities to engage in hands-on learning about active student-centred learning approaches as well as learning about effective use of technology for transforming their courses along these lines.", "article_title": "A Web of Possibilities: Faculty Sharing Ideas For Technology Integration In Teaching", "authors": [{"given": "Susan E.", "family": "Gibson", "affiliation": [{"original_name": "University of Alberta", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}]}], "publisher": null, "date": "2009-04", "keywords": ["Computer technology, faculty, professional development, classroom integration, stories"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/Casta02/Forest_casta02.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In this paper, we present the results of a research in which our main objective was to explore text mining techniques in their application to thematical analysis of philosophical corpus. In the first part, we present the software (Numexco) used in our experiment, focusing on the modular approach of the software. The second part presents the results obtained when we applied Numexco to the thematical analysis of Descartes' Discours de la méthode and his Méditations métaphysiques. This paper also demonstrates how this computer assisted technology can allow the user to rapidly identify, explore and navigate through the different themes found in humanities texts.", "article_title": "NUMEXCO: A Text Mining Approach to Thematic Analysis of a Philosophical Corpus", "authors": [{"given": "Dominic", "family": "Forest", "affiliation": [{"original_name": "Laboratoire d’ANalyse Cognitive de l’Information (LANCI)", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Jean-Guy", "family": "Meunier", "affiliation": [{"original_name": "Université du Québec à Montréal (UQAM)", "normalized_name": "University of Quebec at Montreal", "country": "Canada", "identifiers": {"ror": "https://ror.org/002rjbv21", "GRID": "grid.38678.32"}}]}], "publisher": null, "date": "2005-08", "keywords": ["Text classification, thematic analysis, categorization, text mining, philosophy"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2003/Finn2.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper addresses the question: “Do We Need a New Theory in Order to Theorize Computer Games?” To answer this question, I will expand two points. The first involves the “we” in “do we need”, the second, the nature of the word theory. My solution involves an emphasis on the key compositional and formal component of computer game construction: programming. The most straightforward answer to the first question is that we are the members of the academy and critical community. Following this simple definition, this paper argues that both groups need to come up with new theoretical models to address computer games, each for their own reasons. Once we articulate these positions, we find that underlying their primary purposes is a position that involves both groups. For the second point, I will make a distinction between theory that is more broadly formal and theory that is cultural. Our answer to the question of whether or not a new theory is needed will change depending on which of these definitions we apply. As a point of departure, my paper responds to a quote from Espen Arseth, which sounds rather pessimistic about early attempts to theorize games by transferring existing models to new media. I agree with some of the spirit of Arseth's quote, but I believe that a properly instituted form of critique can answer many of his concerns, while providing for new modes of critical participation.", "article_title": "What you C is What You Get: Formalizing Computer Game Criticism", "authors": [{"given": "Patrick", "family": "Finn", "affiliation": [{"original_name": "St. Mary's College, Calgary", "normalized_name": "St. Mary's College", "country": "Japan", "identifiers": {"ror": "https://ror.org/02306qr05", "GRID": "grid.472033.1"}}]}], "publisher": null, "date": "2003-09", "keywords": ["Computer games, literary theory, ergotic text"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/Casta02/Esling_casta02.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This article describes the development of an auditory coding system and an associated web-based XML database to document and analyze speech development in infants from Canada, Morocco, France, and China. The XML database will allow researchers on this international research project, based at the Department of Linguistics, University of Victoria, to collaborate in data collection and analysis, facilitating a better understanding of phonetic development in infants from diverse language backgrounds. We hypothesize that infants from all language backgrounds employ laryngeal constriction as the primary means of phonetic development in the first months of life, using this experience as a base to learn the sounds of their native language in the second half of the first year. Preliminary results from English-speaking infants support this hypothesis.", "article_title": "Phonetic Structure and Acquisition of Laryngeal and Pharyngeal Articulations: Text-Analysis Considerations", "authors": [{"given": "John H.", "family": "Esling", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": "Lisa D.", "family": "Bettany", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": "Allison", "family": "Benner", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}, {"given": "Spencer", "family": "Rose", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}], "publisher": null, "date": "2005-08", "keywords": ["Speech acquisition, phonetics, laryngeal constriction, auditory coding, XML database"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2007/Dyck_Williams/Dyck_Williams.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper describes an intermediate point in the development of an electronic edition of a unique and complex early modern book. At this stage, we the authors have done extensive research on the book itself and have also begun thinking about appropriate ways of rendering information about the book electronically. This essay describes the book, a gospel harmony or 'concordance' made for King Charles I in the mid-1630s by the Ferrars of Little Gidding, England, particularly in light of its construction and intended functions. It goes on to explore the appropriateness of electronic forms for describing the book, ending by postulating possible tools for delivery. In particular, it describes the complexity of the Little Gidding concordance, which rearranges and combines the text of the four canonical gospels into a single narrative of 150 chapters. We have found, somewhat paradoxically, that XML provides a natural-feeling platform for gathering data about this document (contrasted with a word processor), but that the document's complexity makes it a difficult fit with TEI markup. We note that since the biblical text is already marked up, and that the Ferrars have added another layer of markup, the real difficulty as well as the promise of this project is in using digital markup to further enable the complex and powerful reading machine that is the Little Gidding concordance.", "article_title": "Toward an Electronic Edition of an Early Modern Assembled Book", "authors": [{"given": "Paul", "family": "Dyck", "affiliation": [{"original_name": "Canadian Mennonite University", "normalized_name": "Canadian Mennonite University", "country": "Canada", "identifiers": {"ror": "https://ror.org/046qgfw50", "GRID": "grid.440058.d"}}]}, {"given": "Stuart", "family": "Williams", "affiliation": [{"original_name": "Independent scholar, Winnipeg", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2008-07", "keywords": ["Little Gidding concordance, Ferrar family, markup"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2003/Dubrule2.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "It is commonly thought that courses requiring discussion must be taught in classrooms. This paper describes a design for a scholastic course taught entirely on the world wide web that has at its core customized online discussion forums.  The design has been implemented in two Carleton University Philosophy courses, Computer Ethics and Information Ethics, open to qualified students across North America.  Evaluations by students and of students indicate that the courses have not only met, but exceeded the learning goals of a corresponding classroom course.  The success of the model implies that many courses hitherto assumed to require classrooms can be taught online as distance education courses.", "article_title": "Teaching Scholastic Courses Requiring Discussion On Line", "authors": [{"given": "Diane E.", "family": "Dubrule", "affiliation": [{"original_name": "Philosophy Department, Carleton University", "normalized_name": "Carleton University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02qtvee93", "GRID": "grid.34428.39"}}]}], "publisher": null, "date": "2003-09", "keywords": ["Discussion boards, philosophy, pedagogy, technology, information ethics, computer ethics"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2007/Cunningham/Cunningham.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "“dis-Covering the Early Modern Book” is a description of an experiment conducted during a single day spent in Ray Siemens' Electronic Textual Cultures Laboratory at the University of Victoria. The purpose of the experiment was primarily to find out what kind of digital artefact could be generated from an early modern book. Secondarily, we wanted to contemplate potential use for such an artefact, which subsequently was clearly established as teaching bibliography, or book or print culture. The resulting paper started life as a wiki contributed to by three of the members of the group who conducted the experiment. It was then carried further by the present author. It continues to evolve, and two members of the group plan to publish a longer version of this essay in the near future.", "article_title": "Dis-Covering the Early Modern Book: An Experiment in Humanities Computing", "authors": [{"given": "Richard", "family": "Cunningham", "affiliation": [{"original_name": "Acadia University", "normalized_name": "Acadia University", "country": "Canada", "identifiers": {"ror": "https://ror.org/00839we02", "GRID": "grid.411959.1"}}]}], "publisher": null, "date": "2008-07", "keywords": ["Book history, bibliography, print culture, digitization, education, digital artefact, born digital, Gutenberg, electronic text, Electronic Textual Cultures Laboratory, bibliosection, SDH/SEMI, virtual lightbox"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2004/cunningham/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In this paper I will provide some background to the history of books with moving parts before using examples of such books to show that even in the first century of printing with moveable type the need for moving pictures was perceived. Next, I will describe the editorial principles I am using to guide creation of an incunabular electronic edition of one of the examples discussed in this paper, Richard Eden's The Arte of Navigation. The paper concludes with an invitation to follow a link to that electronic edition, with the caveat that it is a work in progress.", "article_title": "Coincidental Technologies: Moving Parts in Early Books and in Early Hypertext", "authors": [{"given": "Richard", "family": "Cunningham", "affiliation": [{"original_name": "Acadia University", "normalized_name": "Acadia University", "country": "Canada", "identifiers": {"ror": "https://ror.org/00839we02", "GRID": "grid.411959.1"}}]}], "publisher": null, "date": "2009-04", "keywords": ["Incunabula, editing, publishing, image, hypertext "], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/Casta02/Carlin_casta02.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper enumerates the technologically naïve humanist's wish list for the type of text analysis tools to be developed by the TAPoR project.", "article_title": "Drawing Knowledge from Information: Early Modern Texts and Images on the TAPoR Platform", "authors": [{"given": "Claire", "family": "Carlin", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}], "publisher": null, "date": "2005-08", "keywords": ["Annotation, anthology, navigability, searchability, usability"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/CHC2003/Bonnett2.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "One of the key challenges currently facing humanities and computing scholars is the generation of new conventions, particularly new forms of narration and representation to support student development of critical thinking skills. Drawing inspiration from the writings of the communication theorist Harold Innis, this study argues that conventions supporting information visualization - the production of visual analogues of ideas or patterns represented by text and number - can help students apprehend and interrogate concepts. The experience of the 3D Virtual Buildings Project suggests that a program devoted to 3D computer modelling is one way that Innis' ideas might be realized. Through tutorials students learn to reconstruct models of historic Canadian settlements and to translate historic data into numeric information for a 3D model. Most importantly, the tutorials show students that historical models are inherently imperfect, at best partial reconstructions of the past. Through a process of information translation and visualization, students learn to distinguish historical models from the objects they purport to represent.", "article_title": "The Oral Tradition in 3D: Harold Innis, Information Visualisation and the 3D Historical Cities Project", "authors": [{"given": "John", "family": "Bonnett", "affiliation": [{"original_name": "National Research Council of Canada, Institute for Information Technology, Fredericton, NB", "normalized_name": "Oldenburger Institut für Informatik", "country": "Germany", "identifiers": {"ror": "https://ror.org/003sav189", "GRID": "grid.5637.7"}}]}], "publisher": null, "date": "2003-09", "keywords": ["Harold Innis, 3D, virtual reality, CAD, information visualisation, learning, constructivism, urban architecture, Canada, history, computing, critical thinking"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/Casta02/Best_casta02.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The principal aim of the Internet Shakespeare Editions is to \"create and publish works for the student, scholar, actor, and general reader in a form native to the medium of the Internet.\" Our focus to date, as texts are being edited, has been to create hypertext editions, capable of being annotated both by text and by multimedia objects. The infrastructure created by TAPoR (Text Analysis Portal for Research), however, provides an opportunity to go further than the hypertext edition, by integrating into it the capabilities offered by textual analysis software. The aim will be to develop an interface that permits a user to go beyond the hard links provided by the editor in the basic hypertext structure to explore in a more fluid way the text of a given play, and to extend the exploration to related texts by Shakespeare and other relevant writers in the period.", "article_title": "'Is this a vision? is this a dream?': Finding New Dimensions in Shakespeare's Texts", "authors": [{"given": "Michael", "family": "Best", "affiliation": [{"original_name": "University of Victoria", "normalized_name": "University of Victoria", "country": "Canada", "identifiers": {"ror": "https://ror.org/04s5mat29", "GRID": "grid.143640.4"}}]}], "publisher": null, "date": "2005-08", "keywords": ["TAPoR, Shakespeare, hypertext edition, text analysis software, interface design"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}, {"url": "http://projects.chass.utoronto.ca/chwp/baider/", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In his seminal work l'Emile Rousseau asked his female reader to educate her daughter so that she would become a 'honnête femme' and not a 'honnête homme'. Rousseau was playing on words as the collocation 'honnête homme' refers to a social and intellectual ideal reserved for the masculine gender, whereas the 'honnêteté' described in 'honnête femme' refers to the loyalty of a spouse vis-à-vis her husband. This different meaning of an adjective when it qualifies the noun femme or the noun homme is found in other collocations in French, for instance a grand homme is a \"great man\" but a grande femme is \"a tall woman\". This lexical and semantic dissymmetry is the topic of this essay. I make the hypothesis that the differential meaning can be explained by the systematic derogation of the noun femme; therefore, in the case of the syntagms with a differential meaning the noun modifies to a certain extent the adjective. Computerized databases and on-line texts provide the much-needed data to examine this assumed phenomenon of derogation of the noun femme. I also remark upon the usage of some women writers. Female writers tend to use more positive adjectives with the word woman. Also female writers such as de Navarre and Sévigné use adjectives with the 'male (and positive) meaning' when referring to women and not the 'female (and negative) meaning'.", "article_title": "Sexism And Language : What Can The Web Teach Us ?", "authors": [{"given": "Fabienne H.", "family": "Baider", "affiliation": [{"original_name": "University of Toronto", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}]}], "publisher": null, "date": "2000-10", "keywords": ["Women, Renaissance, language, French, gender, lexicology, dictionaries"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}]