[
    {
        "url": "http://dx.doi.org/10.1353/dph.2012.0010",
        "identifier": {
            "string_id": "10.1353/dph.2012.0010",
            "id_scheme": "DOI"
        },
        "abstract": "President Nicolas Sarkozy’s recent call for a debate on national identity generated controversy in France. I use this controversy as a point of departure from which to re-examine the nineteenth-century myth of nationalism that casts the Armagnacs, supporters of Charles VII, as protonationalists. If the type of nationalism that the Armagnacs represented possesses any didactic force today, it is as a negative exemplum. Based on contemporary chronicle representations of the faction revealing how it understood itself and how it was viewed by its enemies, I argue that the Armagnacs are better seen as members of a feuding faction than as early nationalists to conclude that recent debate over national identity would be well served by acknowledging from the outset the fictive nature of what the History of France relates about the trajectory towards national unity and the perennial disagreement over who is French and who is not.",
        "article_title": "Feuding, Factionalism and Fictions of National Identity: Reconsidering Charles VII’s Armagnacs",
        "authors": [
            {
                "given": "Tracy",
                "family": "Adams",
                "affiliation": [
                    {
                        "original_name": "University of Auckland",
                        "normalized_name": "University of Auckland",
                        "country": "New Zealand",
                        "identifiers": {
                            "ror": "https://ror.org/03b94tp07",
                            "GRID": "grid.9654.e"
                        }
                    },
                    {
                        "original_name": "The Netherlands Institute for Advanced Studies",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2012-07-11",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "1",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2012.0008",
        "identifier": {
            "string_id": "10.1353/dph.2012.0008",
            "id_scheme": "DOI"
        },
        "abstract": "This article offers a codicological description of the most complete extant manuscript containing the poetry of Ausiàs March (Valencia, 1400–1459). It lays out the material characteristics of the codex, and sets them in contrast with a matrix of relevant features from other witnesses of March’s poetry. As a result, this study uncovers several of the stages in the compilatory process of the manuscript and argues for it having been originally owned by Ferrando de Cardona, Admiral of Naples and Duke of Somma (Naples, 1521-Sant Cugat del Vallès, 1571).",
        "article_title": "Readers and Compilators of Ausiàs March’s Poetry in Barcelona (BNE, MS 2985)",
        "authors": [
            {
                "given": "Albert",
                "family": "Lloret",
                "affiliation": [
                    {
                        "original_name": "University of Massachusetts, Amherst",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2012-07-11",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "1",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2012.0006",
        "identifier": {
            "string_id": "10.1353/dph.2012.0006",
            "id_scheme": "DOI"
        },
        "abstract": "In this paper I study the portrayal of Jean de Meun in Arsenal 3339, an early fifteenth-century manuscript collection in which the Rose precedes Jean’s Testament, Codicille, and Tresor ou Sept articles de la foi. I marshal manuscript evidence to show how the person who masterminded the production of Arsenal 3339 refuted certain of the reproaches leveled against Jean de Meun in the 1401–1403 Debate about the Roman de la Rose. They were, in effect, that he had erred on key theological points and had moreover employed questionable instructional methods. Although the Arsenal mastermind, whom I provisionally identify as its compiler, objects to the way that Jean as Rose author had portrayed himself by means of a negative persona, Jean “Clopinel,” which can be roughly translated as “Jean who limps,” he nevertheless declines to join with Jean Gerson and Christine de Pizan to consign the book to the flames. I make the case that the compiler was an early fifteenth-century reader exceptionally well versed in the Rose, the Debate documents, and Gerson’s sermons, who, by expertly designing the collection, seeks to rehabilitate Jean’s professional reputation in response to criticisms lodged by his detractors in the Debate.",
        "article_title": "“The Foot on Which He Limps”: Jean Gerson and the Rehabilitation of Jean de Meun in Arsenal 3339",
        "authors": [
            {
                "given": "Lori J.",
                "family": "Walters",
                "affiliation": [
                    {
                        "original_name": "Florida State University",
                        "normalized_name": "Florida State University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/05g3dte14",
                            "GRID": "grid.255986.5"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2012-07-11",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "1",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2012.0004",
        "identifier": {
            "string_id": "10.1353/dph.2012.0004",
            "id_scheme": "DOI"
        },
        "abstract": "Globalization is a “hot topic.” While language figures prominently in debates, its complexity defies descriptions of globalization adequate for other subjects. Increasingly diverse ethnicity in nation states alters the status of once dominant vernaculars—what Dante called the parlar materno—as factors of cultural and social cohesion. Language and religion, rather than nation, now serve as elective markers of identity. Inevitably, however, to assert global status for a language conveys overtones of linguistic, and thus cultural, hegemony. From this perspective, Carl Schmitt’s dictum that “all significant concepts of the modern theory of the state are secularized theological concepts,” resonates in the sphere of language. For when Schmitt refers to modern concepts of state as theological in origin, his thought speaks directly to the concept of global language. For “global” is only a slightly attenuated variant of “universal,” whose totalizing connotation we find somewhat embarrassing today. And yet, historically, the myth of a lost universal language has played an important role in traditional cultures that value creation accounts. The latter evoke a mythic moment, in illo tempore, when all humans spoke a common language for the simple reason that the origin of the one implicated the emergence of the other. Perhaps no one thought so profoundly about the question of global or universal language in this sense as Dante Alighieri in his philosophical treatise on the illustrious vernacular, the De vulgari eloquentia (c. 1304 CE, DVE). Unlike proponents of global language today who seek to extrapolate a (pre)dominant language from among hundreds of dialects, Dante recognized multilingualism as an historical contingency, a product of the linguistic fall at Babel. At that point, universal language—the speech co-created by God and the first man in Genesis—disappeared, fractured into linguistic shards representing the diversity of human culture. Dante’s anthropology of language thus imitates the division of the first human into an infinite series, each unit different from others, but all containing an originary “DNA,” identified in Genesis 1:26–27 as divine similitude. Likewise, Dante proposes that all human language possess a common “deep structure,” a set of principles for a universal grammar that act as the formal cause of language. Dante calls this capacity for language the forma locutionis, the innate capacity for speech, which defines humans. For Dante, only the vernacular or mother tongue can embody this essence. Jointly created by God and the first man, it has the potential to incarnate the highest aspiration of human speech, the volgare illustre or illustrious vernacular. Although Dante lays out his anthropology of the vernacular in De vulgare eloquentia—arguing that one must look to the most refined vernacular poetry for examples—he defers demonstrating the concept fully until Purgatorio and Paradiso. There he deploys text networks invoking Hebrew, Greek, Latin, and diverse vernacular poets and philosophers to showcase the volgare illustre as a universal vernacular—a forma locutionis in which the meaning, aura, and affect of speaking take precedence over language of origin.",
        "article_title": "Global Language or Universal Language?: From Babel to the Illustrious Vernacular",
        "authors": [
            {
                "given": "Stephen G.",
                "family": "Nichols",
                "affiliation": [
                    {
                        "original_name": "Johns Hopkins University",
                        "normalized_name": "Johns Hopkins University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00za53h95",
                            "GRID": "grid.21107.35"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2012-07-11",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "1",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2012.0002",
        "identifier": {
            "string_id": "10.1353/dph.2012.0002",
            "id_scheme": "DOI"
        },
        "abstract": "In the digital humanities much research has been done concerning stylometry, the computational study of style. Literary authorship at-tribution, especially, has been a central topic. After a brief introduction, I will discuss the enormous potential of this paradigm for medieval philology, a field that studies so many texts of unknown or disputed origin. At the same time, it will be stressed that stylometry’s application to medieval texts is currently not without problems: many attribution techniques are still controversial and do not account for the specific nature of medieval text production. Throughout this paper, I will tentatively apply two well-established attribution techniques (principal components analysis and Burrows’s Delta) to a number of case studies in Middle Dutch studies. These analyses shall be restricted to rhyme words, since these words are less likely to have been altered by scribes.",
        "article_title": "Stylometry for Medieval Authorship Studies: An Application to Rhyme Words",
        "authors": [
            {
                "given": "Mike",
                "family": "Kestemont",
                "affiliation": [
                    {
                        "original_name": "University of Antwerp",
                        "normalized_name": "University of Antwerp",
                        "country": "Belgium",
                        "identifiers": {
                            "ror": "https://ror.org/008x57b05",
                            "GRID": "grid.5284.b"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2012-07-11",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "1",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2012.0000",
        "identifier": {
            "string_id": "10.1353/dph.2012.0000",
            "id_scheme": "DOI"
        },
        "abstract": "This essay explores the ways in which a single tongue can be said to be, in Brunetto Latini’s phrase, at once “delectable” and “common.” It is argued that such titles are suited to medieval texts that trouble the limits of individual languages and, further, that they pertain in exemplary fashion to a restricted but complex corpus of medieval poems that are written in several languages at once.",
        "article_title": "The Most Delectable of Languages",
        "authors": [
            {
                "given": "Daniel",
                "family": "Heller-Roazen",
                "affiliation": [
                    {
                        "original_name": "Princeton University",
                        "normalized_name": "Princeton University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00hx57361",
                            "GRID": "grid.16750.35"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2012-07-11",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "1",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2013.0002",
        "identifier": {
            "string_id": "10.1353/dph.2013.0002",
            "id_scheme": "DOI"
        },
        "abstract": "In this article, the author explores the idea that during the thirteenth century there were implemented new vernacular legal languages that were communicated to the ignorant clients of the law or lay people by notarial officers. The article theorizes around the effects of this communication, understood as a process of second language acquisition in which the second language is the formulaic system contained in legal documents.",
        "article_title": "Political Idiots and Ignorant Clients: Vernacular Legal Language in Thirteenth-Century Iberian Culture",
        "authors": [
            {
                "given": "Jesús",
                "family": "Rodríguez-Velasco",
                "affiliation": [
                    {
                        "original_name": "Columbia University",
                        "normalized_name": "Columbia University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00hj8s172",
                            "GRID": "grid.21729.3f"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-06-30",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "2",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2013.0001",
        "identifier": {
            "string_id": "10.1353/dph.2013.0001",
            "id_scheme": "DOI"
        },
        "abstract": "Authorship attribution often suffers from charges of vicious circularity, of conflating authorship and style. We argue for a more virtuous circularity for attribution arguments made through the quantitative analyses of stylometry. Our study investigated temporal lexeme usage, which has been suggested as a mark of authorship style, in the corpus traditionally attributed to Chrétien de Troyes. Our analyses revealed different usage patterns for these lexemes after line 6150 of the Lancelot, possibly indicating the signature of another author in the text (traditionally presumed to be that of Godefroy de Lagny). By embracing probabilistic arguments instead of certainties, digital philology can employ stylometry to consider questions of authorship attribution for medieval texts.",
        "article_title": "Virtuous Circles of Authorship Attribution through Quantitative Analysis: Chrétien de Troyes's Lancelot",
        "authors": [
            {
                "given": "Brian J.",
                "family": "Reilly",
                "affiliation": [
                    {
                        "original_name": "The Johns Hopkins University",
                        "normalized_name": "Johns Hopkins University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00za53h95",
                            "GRID": "grid.21107.35"
                        }
                    }
                ]
            },
            {
                "given": "Moira R.",
                "family": "Dillon",
                "affiliation": [
                    {
                        "original_name": "Harvard University",
                        "normalized_name": "Harvard University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/03vek6s52",
                            "GRID": "grid.38142.3c"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-06-30",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "2",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2013.0004",
        "identifier": {
            "string_id": "10.1353/dph.2013.0004",
            "id_scheme": "DOI"
        },
        "abstract": "In this paper, the author considers the origins of the rhyme, -aura, which has played an important role in Western poetry. Numerous studies have addressed questions pertaining to the history of aura in general, but none have focused on the matter of aura specifically as a rhyme. Within this narrower focus, the history of the aura-rhyme is shown to center on one critical moment, in which the aura-pun in Ovid's Metamorphoses is transformed into the aura-rhyme in Arnaut Daniel's song \"En cest sonet.\" Through a comparative reading of these two texts, conclusions are drawn regarding the relation of puns to rhymes, nouns to names, and the problems of isolating the origin of a rhyme historically.",
        "article_title": "The Metamorphoses of Aura in Ovid and Arnaut Daniel",
        "authors": [
            {
                "given": "Andrew",
                "family": "Lemons",
                "affiliation": [
                    {
                        "original_name": "Princeton University",
                        "normalized_name": "Princeton University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00hx57361",
                            "GRID": "grid.16750.35"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-06-30",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "2",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2013.0003",
        "identifier": {
            "string_id": "10.1353/dph.2013.0003",
            "id_scheme": "DOI"
        },
        "abstract": "This essay offers an insight into the way digital editions of medieval texts can be employed to replicate the medieval reading experience. Awareness of the characteristic features of medieval textuality, exemplified through select late medieval texts, can help in developing increasingly flexible editorial models, which are more consistent with medieval reading practices than current editions. Editions, transformed from single textual occurrences into fluid, communal, and unfolding processes, can uncover a complex notion of medieval hypertextuality by linking texts, images, and tunes. They can then even trace the reception of a given text. As readers are empowered to zoom in and out specific textual components, of manuscript witnesses, of families and printed editions, digital editions can present individual witnesses alongside editorial apparatuses and thus bridge the gap between the Old and the New Philology.",
        "article_title": "Old Light on New Media: Medieval Practices in the Digital Age",
        "authors": [
            {
                "given": "Farkas Gábor",
                "family": "Kiss",
                "affiliation": [
                    {
                        "original_name": "Leopold-Franzens-Universität, Innsbruck",
                        "normalized_name": "Universität Innsbruck",
                        "country": "Austria",
                        "identifiers": {
                            "ror": "https://ror.org/054pv6659",
                            "GRID": "grid.5771.4"
                        }
                    }
                ]
            },
            {
                "given": "Eyal",
                "family": "Poleg",
                "affiliation": [
                    {
                        "original_name": "The University of Edinburgh",
                        "normalized_name": "University of Edinburgh",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/01nrxwf90",
                            "GRID": "grid.4305.2"
                        }
                    }
                ]
            },
            {
                "given": "Lucie",
                "family": "Doležalová",
                "affiliation": [
                    {
                        "original_name": "Univerzita Karlova, Praha",
                        "normalized_name": "Charles University",
                        "country": "Czechia",
                        "identifiers": {
                            "ror": "https://ror.org/024d6js02",
                            "GRID": "grid.4491.8"
                        }
                    }
                ]
            },
            {
                "given": "Rafal",
                "family": "Wójcik",
                "affiliation": [
                    {
                        "original_name": "Uniwersytet im. Adama Mickiewicza, Poznan",
                        "normalized_name": "Adam Mickiewicz University in Poznań",
                        "country": "Poland",
                        "identifiers": {
                            "ror": "https://ror.org/04g6bbq64",
                            "GRID": "grid.5633.3"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-06-30",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "2",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2013.0005",
        "identifier": {
            "string_id": "10.1353/dph.2013.0005",
            "id_scheme": "DOI"
        },
        "abstract": "This essay discusses the racialized portrayal of Dangier in Bodleian Library MS Douce 195. In contrast to the notion that the Middle Ages had no recourse to race as phenotypical difference, it argues that the orientalization of depictions in late medieval manuscripts like Douce 195— mostly studied through costume—is also to be found in portrayals of skin pigmentation.",
        "article_title": "Saracens and Race in Roman de la Rose Iconography: The Case of Dangier in MS Douce 195",
        "authors": [
            {
                "given": "Nadia R.",
                "family": "Altschul",
                "affiliation": [
                    {
                        "original_name": "The Johns Hopkins University",
                        "normalized_name": "Johns Hopkins University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00za53h95",
                            "GRID": "grid.21107.35"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-06-30",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "2",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2013.0008",
        "identifier": {
            "string_id": "10.1353/dph.2013.0008",
            "id_scheme": "DOI"
        },
        "abstract": "This article argues that, in the Series, Thomas Hoccleve not only appeals to the system of patronage, but attempts to revise it, creating a new template for literary sponsorship and engagement based on collaboration and mutual responsibility. The process of literary production Hoccleve outlines supports a reading of patronage that is not exclusively financially-based; rather, it is flexible, less hierarchical, and demands more from the patron than Hoccleve’s previous work—and indeed the work of most medieval authors—would suggest. In order to understand Hoccleve’s attempts to redefine his relationship to the system of literary sponsorship, however, we must be willing to take the structure of the Series seriously, following the signposts of creative collaboration Hoccleve weaves throughout the texts rather than their misleading, seemingly random nature. In addition to offering an alternate reading of Hoccleve’s work in the Series, this article suggests new ways of thinking about literary patronage in the Middle Ages more generally.",
        "article_title": "The Rehabilitation of Patronage in Hoccleve’s Series",
        "authors": [
            {
                "given": "Amy N.",
                "family": "Vines",
                "affiliation": [
                    {
                        "original_name": "University of North Carolina, Greensboro",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-12-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "2",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2013.0014",
        "identifier": {
            "string_id": "10.1353/dph.2013.0014",
            "id_scheme": "DOI"
        },
        "abstract": "Patronage regularly figures as the dominant paradigm in discussions of late-medieval literary production and circulation. Common practice dictates that behind every text, a patron-figure looms, typically identified as a member of nobility for whom the text was composed. Many medieval texts promote this view by spotlighting extratextual relations in dedication materials or by folding into the narrative itself the story of its inception. Regardless of the source of these narratives, scholarship places under the patronage umbrella a large spectrum of exchanges said to have fostered the literary enterprise while excluding other partnerships that are seen to destabilize the system. Thus, transactions as distinctive as Guillaume de Machaut’s Confort d’amy, presented as an unsolicited text intended to comfort the imprisoned Charles of Navarre; Jean Froissart’s fictive account of literary collaboration with a prince in the Prison amoureuse; Christine de Pizan’s biography of Charles V, identified in the prologue as a commission ordered by the duke of Burgundy; and Geoffrey Chaucer’s dedication of Troilus and Criseyde to fellow poet John Gower and the lawyer Ralph Strode are presented as forms of patronage with little thought to the implications of the relational variations. At the same time, a number of transactions are sidelined in patronage studies because they seem to transgress the boundaries of expected exchange, even though they reproduce many of the same dynamics; hence, regifting, seizure of books, multi-copy dissemination of a single work, and purchase of a book from a third party regularly fail to figure into analysis. To date, scholars have avoided interrogating these arbitrary boundaries that define patronage studies. Critical avoidance of the heterogeneity of literary support networks is further exacerbated by a generalized failure to interrogate the impact of time, place, or cultural practices on sponsorship, not to mention possible manipulations of this exchange based on political, economic or personal concerns.",
        "article_title": "Introduction: Rethinking the Boundaries of Patronage",
        "authors": [
            {
                "given": "Deborah",
                "family": "McGrady",
                "affiliation": [
                    {
                        "original_name": "University of Virginia",
                        "normalized_name": "University of Virginia",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/0153tk833",
                            "GRID": "grid.27755.32"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-12-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "2",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2013.0013",
        "identifier": {
            "string_id": "10.1353/dph.2013.0013",
            "id_scheme": "DOI"
        },
        "abstract": "This article reviews the terminological framework used to describe manuscripts. The Lachmannian terminology allows scholars to classify manuscripts as versions or variants of a work on a purely textual basis, but lacks a rigid designator to indicate a (part of a) manuscript as a unit of text and material considerations. Conversely, scholars who adopt Dagenais’s solution to renounce the work and concentrate on the material scriptum gain a rigid designator, but threaten to lose the ability to classify manuscripts at all. Proceeding from a case study, the article argues that the twelfth-century view of a work’s ontological status enables medievalists to keep classifying their scripta on both textual and material grounds. It explores the possibility of using Dagenais’s scriptum as the foundation for a Neo-Lachmannian terminological framework that allows scholars to study manuscript variance and materiality without losing the ability to classify them.",
        "article_title": "Work, Version, Text and Scriptum: High Medieval Manuscript Terminology in the Aftermath of the New Philology",
        "authors": [
            {
                "given": "Tjamke",
                "family": "Snijders",
                "affiliation": [
                    {
                        "original_name": "Universiteit Gent",
                        "normalized_name": "Ghent University",
                        "country": "Belgium",
                        "identifiers": {
                            "ror": "https://ror.org/00cv9y106",
                            "GRID": "grid.5342.0"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-12-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "2",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2013.0012",
        "identifier": {
            "string_id": "10.1353/dph.2013.0012",
            "id_scheme": "DOI"
        },
        "abstract": "Erich Auerbach held an expansive notion of what philology is and does. Taking literature as his starting point (often under the rubric of a concrete Ansatzpunkt, be this a phrase, an isolated feature of style, or a self-contained logical sequence), Auerbach restlessly sought to establish nothing less than an intellectual—or better yet, spiritual (he often calls it “inner”)—history of the Western European mind as it lunged into contemporary modernity. Literary forms were for Auerbach a gateway to forms of thought, feeling, and expression. Philology was the method best suited to grasping these. The result was a philology of the world (Weltphilologie)—a politically, ideologically, and ethically engaged counter-philology that is as relevant today as it was in his own lifetime.",
        "article_title": "Erich Auerbach’s Earthly (Counter-)Philology",
        "authors": [
            {
                "given": "James I.",
                "family": "Porter",
                "affiliation": [
                    {
                        "original_name": "University of California, Irvine",
                        "normalized_name": "California Coast University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/05t99sp05",
                            "GRID": "grid.468726.9"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-12-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "2",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2013.0010",
        "identifier": {
            "string_id": "10.1353/dph.2013.0010",
            "id_scheme": "DOI"
        },
        "abstract": "This essay applies a theoretical model drawn from twentieth-century organization studies to late-medieval texts written in defence of women, in order to refresh critical appreciation of the dynamics of poet-patron relations at play in this corpus, the interest of whose patronage situations has been underestimated. By reading three sample poems (in both textual and paratextual dimensions) as “circuits of power,” we will be able to unpick the manoeuvrings of the agents contributing to a given book’s production and reception; to re-assess the framework of power relations in patronage as fulfilling a productive rather than a regulatory role; and to question more fully what constitutes authority and identity, in its various and multi-faceted forms in premodern literary practice.",
        "article_title": "Circuits of Power: A Model for Rereading Poet-Patron Relations in Late-Medieval Defences of Women",
        "authors": [
            {
                "given": "Helen",
                "family": "Swift",
                "affiliation": [
                    {
                        "original_name": "St Hilda’s College",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    },
                    {
                        "original_name": "University of Oxford",
                        "normalized_name": "University of Oxford",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/052gg0110",
                            "GRID": "grid.4991.5"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-12-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "2",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2013.0018",
        "identifier": {
            "string_id": "10.1353/dph.2013.0018",
            "id_scheme": "DOI"
        },
        "abstract": "Written in the wake of the devastating Christian defeat at Nicopolis, the Epistre lamentable consistently draws on individual examples to target universal reform. Mézières establishes an intimate connection to Duke Philip of Burgundy as a fellow sufferer in Christ, attentuating the distance of hierarchical position. Once the duke is consoled by means of proven analogies—Mézières, Burgundy, and indeed all Christians are bound by wounds that replicate those of the Crucifixion—the author can go further. He becomes the duke’s counselor, or physician, and seeks to address how the Christians were routed at Nicopolis despite the justice of their crusade. Mézières dismantles the standard, self-interested bases of authorpatron address by targeting a larger and higher purpose to which to recruit Philip. He points the way to Christian recovery through his long-cherished project of a perfect knighthood, the Order of the Passion of Jesus Christ.",
        "article_title": "To Console and Control: Philippe de Mézières’s Epistre Lamentable",
        "authors": [
            {
                "given": "Andrea",
                "family": "Tarnowski",
                "affiliation": [
                    {
                        "original_name": "Dartmouth College",
                        "normalized_name": "Dartmouth College",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/049s0rh22",
                            "GRID": "grid.254880.3"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-12-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "2",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2013.0016",
        "identifier": {
            "string_id": "10.1353/dph.2013.0016",
            "id_scheme": "DOI"
        },
        "abstract": "This article explores the politics of owning, or taking ownership, of Bible historiale manuscripts during the Hundred Years’ War. As theft and capture disrupted predictable patterns of patronage and exchange, new owners’ additions, erasures, and alterations can shed new light on ways in which the French Bible conditioned readers’ experience of the war on both sides. Such marginal acts of appropriation also force us to revise traditional notions of patronage to account for the sometimes violent refashioning of books to match the image and needs of unintended owners.",
        "article_title": "Stolen Scriptures: The Bible Historiale and the Hundred Years’ War",
        "authors": [
            {
                "given": "Jeanette",
                "family": "Patterson",
                "affiliation": [
                    {
                        "original_name": "Princeton University",
                        "normalized_name": "Princeton University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00hx57361",
                            "GRID": "grid.16750.35"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-12-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "2",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0004",
        "identifier": {
            "string_id": "10.1353/dph.2014.0004",
            "id_scheme": "DOI"
        },
        "abstract": "This article illustrates an important while comparably unattended role played by the making of digital databases in our contemporary philological study of medieval poetry. By presenting a case study devoted to the figure of Mossèn Avinyó, a fifteenth-century Catalan nobleman and poet, the authors of this essay exemplify the need for a rigorous perusal of the material evidence that is being archived in digital projects. With paleographical, codicological, and literary evidence, the authors show with great probability that Avinyó himself compiled two manuscripts currently held by the Hispanic Society of America: the Cancionero de Vindel and the Cançoner llemosí del siglo XV. In doing so, the authors also show that these two manuscripts contain the entirety of Avinyó’s lyric production, along with a sampling of the poetry produced by those who traveled in Avinyó’s cultural circles.",
        "article_title": "Mossèn Avinyó, the Cancionero de Vindel and the Cançoner llemosí del siglo XV",
        "authors": [
            {
                "given": "Rafael",
                "family": "Ramos",
                "affiliation": [
                    {
                        "original_name": "Universitat de Girona",
                        "normalized_name": "University of Girona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/01xdxns91",
                            "GRID": "grid.5319.e"
                        }
                    }
                ]
            },
            {
                "given": "Francisco J. Rodríguez",
                "family": "Risquete",
                "affiliation": [
                    {
                        "original_name": "Universitat de Girona",
                        "normalized_name": "University of Girona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/01xdxns91",
                            "GRID": "grid.5319.e"
                        }
                    }
                ]
            },
            {
                "given": "Jaume",
                "family": "Torró",
                "affiliation": [
                    {
                        "original_name": "Universitat de Girona",
                        "normalized_name": "University of Girona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/01xdxns91",
                            "GRID": "grid.5319.e"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2014-07-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0002",
        "identifier": {
            "string_id": "10.1353/dph.2014.0002",
            "id_scheme": "DOI"
        },
        "abstract": "This essay explores the significance of what are described as the “tears of Moses” in the fourteenth-century Libro de buen amor (“Book of Good Love”). Using digitized corpora, I show how exegesis of this biblical image focused on Pharaoh’s daughter being moved by the weeping of the infant Moses. Her compassion was equated with the bridal and maternal Church lovingly receiving and nourishing the spirit of the Law of Moses as her groom and infant Christ. The Spanish poem parodies these meanings by portraying the relationship between the narrator and his procuress as that of a crying baby being soothed by his mother. In a subversion of the heart-rending cries of Moses being consoled by the Church, the old bawd enables him to seduce the object of his lust by perversely appealing to her maternal compassion.",
        "article_title": "Return to Commentary: On the Tears of Moses in the Libro de buen amor",
        "authors": [
            {
                "given": "Ryan",
                "family": "Giles",
                "affiliation": [
                    {
                        "original_name": "Indiana University",
                        "normalized_name": "Indiana University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/01kg8sb98",
                            "GRID": "grid.257410.5"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2014-07-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0000",
        "identifier": {
            "string_id": "10.1353/dph.2014.0000",
            "id_scheme": "DOI"
        },
        "abstract": "This study imagines a Sephardic archive not as a physical site that houses the artifacts, texts, and history of a nation-state or Empire, but one that allows us to access those objects (or exposes their absence) and to bring artifacts from different official archives into dialogue in a different, virtual space, thus creating an additional, but not exclusionary, epistemic home, namely that of Sephardic studies. In it the author explores the potential advantages and practical limitations, as well as existing models of transnational resources—such as the Friedberg Genizah Project and the Institute of Microfilmed Hebrew Manuscripts, as well as del Barco and Vegas Montaner’s project of cataloguing the Hebrew manuscripts in Spanish libraries—that could be considered when thinking of what form a Sephardic archive could take. This study also explores how issues of language and identity fare when translated into the metadata used to make digitized information available.",
        "article_title": "The Sephardic Past in the Digital Future",
        "authors": [
            {
                "given": "Michelle M.",
                "family": "Hamilton",
                "affiliation": [
                    {
                        "original_name": "University of Minnesota, Twin Cities",
                        "normalized_name": "University of Minnesota",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/017zqws13",
                            "GRID": "grid.17635.36"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2014-07-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0010",
        "identifier": {
            "string_id": "10.1353/dph.2014.0010",
            "id_scheme": "DOI"
        },
        "abstract": "The academic study of medieval manuscripts has always been undertaken as if in dialogue with printed books. This essay takes as its starting point the changes in the nature of printed books that have come about in the last decade with the dramatic increase in data storage and retrieval capabilities, paying particular attention to the impact of book digitization by Google Books and similar programs. After first considering how targeted textual searching has changed the way books are used for research—inverting the traditional hierarchy of text and reader by allowing the latter to use the text with greater speed and control than ever before—I suggest that the change in the function of books can also entail for medievalists a change in the meaning of manuscripts. Because manuscripts provide much more information than that which is encoded in their text, including many elements that defy systematic characterization, their idiosyncratic nature seems to be enhanced in comparison to the increasingly utilitarian nature of searchable books. Taking as an exemplary case the digitization of University of Coimbra MS 720, a late-medieval copy of the Dagger of Faith (Pugio fidei) by the Catalan Dominican Ramon Martí, this essay offers some personal reflections on the ways that the use of texts, information, and manuscripts is changing in the age of digital books.",
        "article_title": "Cracking the Code: Reflections on Manuscripts in the Age of Digital Books",
        "authors": [
            {
                "given": "Ryan",
                "family": "Szpiech",
                "affiliation": [
                    {
                        "original_name": "University of Michigan",
                        "normalized_name": "University of Michigan–Ann Arbor",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00jmfr291",
                            "GRID": "grid.214458.e"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2014-07-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0009",
        "identifier": {
            "string_id": "10.1353/dph.2014.0009",
            "id_scheme": "DOI"
        },
        "abstract": "This article explains how the Llull DB, a database devoted to Ramon Llull’s original works, apocryphal corpus, historical reception, and modern scholarship, was conceived and developed. In addition to addressing specific issues involved in the design of a database with a focus on the medieval author of a multilingual corpus that enjoyed a wide reception, this essay also shows how the Llull DB has provided the original template for a series of interconnected databases related to medieval Catalonia, and tackles the challenges posed by the need for an interoperative environment for all of them.",
        "article_title": "A Brief History of the Llull DB and Its Derivatives",
        "authors": [
            {
                "given": "Anthony",
                "family": "Bonner",
                "affiliation": [
                    {
                        "original_name": "Universitat de Barcelona",
                        "normalized_name": "University of Barcelona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/021018s57",
                            "GRID": "grid.5841.8"
                        }
                    }
                ]
            },
            {
                "given": "Albert",
                "family": "Soler",
                "affiliation": [
                    {
                        "original_name": "Universitat de Barcelona",
                        "normalized_name": "University of Barcelona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/021018s57",
                            "GRID": "grid.5841.8"
                        }
                    }
                ]
            },
            {
                "given": "Lola",
                "family": "Badia",
                "affiliation": [
                    {
                        "original_name": "Universitat de Barcelona",
                        "normalized_name": "University of Barcelona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/021018s57",
                            "GRID": "grid.5841.8"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2014-07-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0007",
        "identifier": {
            "string_id": "10.1353/dph.2014.0007",
            "id_scheme": "DOI"
        },
        "abstract": "This article has a twofold purpose. By providing ample illustration of the difficulties encountered in the making of a catalogue of medieval Catalan translations, we first consider different cataloguing criteria in order to discuss the suitability of the database format vis-à-vis that of a PDF document. Secondly, through the former discussion we bring forth three main questions for the study of medieval translation in general, namely: autor-ship, mediation, and transmission. The third question elicits our philological discussion of what constitutes a translation and how we may distinguish different translations or versions of a same work.",
        "article_title": "Reflections on the Making of a Census of Medieval Catalan Translations",
        "authors": [
            {
                "given": "Montserrat",
                "family": "Ferrer",
                "affiliation": [
                    {
                        "original_name": "Universitat Autònoma de Barcelona",
                        "normalized_name": "Autonomous University of Barcelona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/052g8jq94",
                            "GRID": "grid.7080.f"
                        }
                    }
                ]
            },
            {
                "given": "Lluís",
                "family": "Cabré",
                "affiliation": [
                    {
                        "original_name": "Universitat Autònoma de Barcelona",
                        "normalized_name": "Autonomous University of Barcelona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/052g8jq94",
                            "GRID": "grid.7080.f"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2014-07-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0005",
        "identifier": {
            "string_id": "10.1353/dph.2014.0005",
            "id_scheme": "DOI"
        },
        "abstract": "This article presents the Cançoners DB, a database devoted to medieval Catalan songbooks transmitting Catalan lyric and verse narrative works ca. 1300–1500. In addition to introducing the aims and scope of the project, this essay reflects on the challenges and prospects of studying and indexing the material characteristics of Catalan songbooks in order to research works in verse, book production, and the compared structure of songbooks in Romance language traditions.",
        "article_title": "Cançoners DB: A New Research Tool for the Study of Medieval Catalan Songbooks",
        "authors": [
            {
                "given": "Sadurní",
                "family": "Martí",
                "affiliation": [
                    {
                        "original_name": "Institut de Llengua i Cultura Catalanes",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    },
                    {
                        "original_name": "Universitat de Girona",
                        "normalized_name": "University of Girona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/01xdxns91",
                            "GRID": "grid.5319.e"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2014-07-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0003",
        "identifier": {
            "string_id": "10.1353/dph.2014.0003",
            "id_scheme": "DOI"
        },
        "abstract": "This article describes the project An Electronic Corpus of Fifteenth-Century Castilian Cancionero Manuscripts, paying particular attention to issues and solutions in matters related to textual criticism, such as the collation of witnesses and the generation of phylogenetic stemmata.",
        "article_title": "An Electronic Corpus of Fifteenth-Century Castilian Cancionero Manuscripts",
        "authors": [
            {
                "given": "Barbara",
                "family": "Bordalejo",
                "affiliation": [
                    {
                        "original_name": "University of Birmingham",
                        "normalized_name": "University of Birmingham",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/03angcq70",
                            "GRID": "grid.6572.6"
                        }
                    }
                ]
            },
            {
                "given": "Fiona",
                "family": "Maguire",
                "affiliation": [
                    {
                        "original_name": "University of Liverpool",
                        "normalized_name": "University of Liverpool",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/04xs57h96",
                            "GRID": "grid.10025.36"
                        }
                    }
                ]
            },
            {
                "given": "Manuel",
                "family": "Moreno",
                "affiliation": [
                    {
                        "original_name": "University of Liverpool",
                        "normalized_name": "University of Liverpool",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/04xs57h96",
                            "GRID": "grid.10025.36"
                        }
                    }
                ]
            },
            {
                "given": "Peter",
                "family": "Robinson",
                "affiliation": [
                    {
                        "original_name": "University of Saskatchewan",
                        "normalized_name": "University of Saskatchewan",
                        "country": "Canada",
                        "identifiers": {
                            "ror": "https://ror.org/010x8gc63",
                            "GRID": "grid.25152.31"
                        }
                    }
                ]
            },
            {
                "given": "Dorothy",
                "family": "Severin",
                "affiliation": [
                    {
                        "original_name": "University of Liverpool",
                        "normalized_name": "University of Liverpool",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/04xs57h96",
                            "GRID": "grid.10025.36"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2014-07-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0017",
        "identifier": {
            "string_id": "10.1353/dph.2014.0017",
            "id_scheme": "DOI"
        },
        "abstract": "The texts and manuscripts of the Middle English prose Brut resist easy classification, largely because they have resulted from a long and ongoing history of re-writing. The articles in this volume grapple with these dynamics by bringing comparative perspectives to a single manuscript. In this afterword, I seek to make clear some of the pluralities at the heart of encountering the digital, physical, and always contingent Brut. I highlight the complexities of transmission with an example of how one late medieval reader responded not to the text at hand, but rather to his memories or expectations of other histories and other texts.",
        "article_title": "Encountering the Dartmouth Brut in the Midst of History",
        "authors": [
            {
                "given": "Matthew",
                "family": "Fisher",
                "affiliation": [
                    {
                        "original_name": "University of California, Los Angeles",
                        "normalized_name": "California Coast University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/05t99sp05",
                            "GRID": "grid.468726.9"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-01-04",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0015",
        "identifier": {
            "string_id": "10.1353/dph.2014.0015",
            "id_scheme": "DOI"
        },
        "abstract": "Through analysis of the patterns and layers of annotation in the Middle English Prose Brut manuscript now known as the Dartmouth Brut, I consider what the manuscript’s development over time reveals about annotation itself as a collaborative activity with a tradition of its own, grounded in widely held habits of reading and writing. Recognition of such factors is essential to assessing annotation (or its absence) as potential evidence for the interests of individual readers. I conclude with discussion of the promise and hazards of manuscript digitization for the study of annotation.",
        "article_title": "“It is to harde for my lernyng”: Making Sense of Annotations in Brut Manuscripts",
        "authors": [
            {
                "given": "Julia",
                "family": "Marvin",
                "affiliation": [
                    {
                        "original_name": "University of Notre Dame",
                        "normalized_name": "University of Notre Dame",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00mkhxb43",
                            "GRID": "grid.131063.6"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-01-04",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0013",
        "identifier": {
            "string_id": "10.1353/dph.2014.0013",
            "id_scheme": "DOI"
        },
        "abstract": "This essay examines the annotations of three readers of the Dartmouth Brut. Each engaged the manuscript in different ways: the first had prior knowledge of its contents, the second used the text to teach himself English history, and the third mined the chronicle as a primary source for facts. Together, these readers provide insight into why a medieval chronicle—outdated in content and manuscript form—would continue to attract the attention of early modern readers.",
        "article_title": "Echoes in the Margins: Reading the Dartmouth Brut in Early Modern England",
        "authors": [
            {
                "given": "Emily",
                "family": "Ulrich",
                "affiliation": [
                    {
                        "original_name": "Yale University",
                        "normalized_name": "Yale University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/03v76x132",
                            "GRID": "grid.47100.32"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-01-04",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0012",
        "identifier": {
            "string_id": "10.1353/dph.2014.0012",
            "id_scheme": "DOI"
        },
        "abstract": "Art is some Brut manuscripts helped shape readers’ understanding of history. Whereas the Dartmouth Brut’s single painted border fulfills an “authorizing” function common in Middle English Prose Brut manuscripts, the seventy miniatures painted by the Master of Edward IV in Lambeth Palace Library MS 6 actually interpret history. This article transcribes instructions to the artist that survive on nine folios of Lambeth 6 and addresses how the manuscript planner and the artist negotiated differences of both medium (text, image) and language (English, French). The planner instructed that pictures match text; the artist’s interpretations and iconography yielded sometimes unexpected historical nuances.",
        "article_title": "Deciphering the Brut: Lambeth Palace MS 6 and the Perils of Transmission",
        "authors": [
            {
                "given": "Elizabeth J.",
                "family": "Bryan",
                "affiliation": [
                    {
                        "original_name": "Brown University",
                        "normalized_name": "Brown University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/05gq02987",
                            "GRID": "grid.40263.33"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-01-04",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0011",
        "identifier": {
            "string_id": "10.1353/dph.2014.0011",
            "id_scheme": "DOI"
        },
        "abstract": "A recently discovered fragment of the Middle English Prose Brut, from the Special Collections department of Queen’s University, Belfast, illuminates the diverse production methods used in the Brut corpus. As part of this process, the author investigates the origins of the unique textual interpolation contained in the Belfast Brut fragment. Through comparison with the Dartmouth Brut, the author suggests some of the different approaches Brut producers took when tasked with “making history.”",
        "article_title": "Making Histories: Locating the Belfast Fragment of the Middle English Prose Brut",
        "authors": [
            {
                "given": "Ryan",
                "family": "Perry",
                "affiliation": [
                    {
                        "original_name": "University of Kent",
                        "normalized_name": "University of Kent",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/00xkeyj56",
                            "GRID": "grid.9759.2"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-01-04",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0019",
        "identifier": {
            "string_id": "10.1353/dph.2014.0019",
            "id_scheme": "DOI"
        },
        "abstract": "This essay situates the Dartmouth Brut within the manuscript culture of mid- to late fifteenth-century England. After a brief sketch of the manuscript’s modern ownership, the author turns to the original owners, the Ewre family of County Durham, and then to a recently discovered Brut with some ownership associations with the Dartmouth Brut. Finally, the author compares the competently written Dartmouth manuscript with one of the physically sloppiest of all Brut manuscripts—Glasgow MS Hunter 443. These manuscripts provide useful foils to each other when examined against the large body of Brut manuscripts, illuminating the different methods available to fifteenth-century scribes.",
        "article_title": "Contextualizing the Dartmouth Brut: From Professional Manuscripts to “The Worst Little Scribbler in Surrey”",
        "authors": [
            {
                "given": "Lister M.",
                "family": "Matheson",
                "affiliation": [
                    {
                        "original_name": "Michigan State University",
                        "normalized_name": "Michigan State University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/05hs6h993",
                            "GRID": "grid.17088.36"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-01-04",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0018",
        "identifier": {
            "string_id": "10.1353/dph.2014.0018",
            "id_scheme": "DOI"
        },
        "abstract": "The text represented by the Dartmouth Brut, written before 1430, was probably influenced by the political turmoil following the death of Henry V. Its omission of the stories of Constantine and Havelok—but inclusion of the story of Cadwallader—appears to represent a stage in the government’s revision of history. The stories of Constantine and Havelok would have been offensive to some since the first suggests a continuation of heroic kingship among the Welsh and the second an unflattering parallel to Humphrey, Duke of Gloucester, who was attempting to control the government of the child-king Henry VI.",
        "article_title": "“History Repeats itself”: The Dartmouth Brut and Fifteenth-Century Historiography",
        "authors": [
            {
                "given": "Edward Donald",
                "family": "Kennedy",
                "affiliation": [
                    {
                        "original_name": "University of North Carolina, Chapel Hill",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-01-04",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2014.0016",
        "identifier": {
            "string_id": "10.1353/dph.2014.0016",
            "id_scheme": "DOI"
        },
        "abstract": "In this photo essay, we reflect on our respective encounters with the object now known as Dartmouth College, Rauner Special Collections Library, MS 003183. Deborah Howe describes the process that turned a fragile object into a functional codex. Michelle Warren considers how this process intersects with the practices of medieval studies and digital humanities. Together, we trace the kinds of collaborations that orient material history toward the future.",
        "article_title": "The Dartmouth Brut: Conservation, Authenticity, Dissemination",
        "authors": [
            {
                "given": "Deborah",
                "family": "Howe",
                "affiliation": [
                    {
                        "original_name": "Dartmouth College",
                        "normalized_name": "Dartmouth College",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/049s0rh22",
                            "GRID": "grid.254880.3"
                        }
                    }
                ]
            },
            {
                "given": "Michelle R.",
                "family": "Warren",
                "affiliation": [
                    {
                        "original_name": "Dartmouth College",
                        "normalized_name": "Dartmouth College",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/049s0rh22",
                            "GRID": "grid.254880.3"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-01-04",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2015.0004",
        "identifier": {
            "string_id": "10.1353/dph.2015.0004",
            "id_scheme": "DOI"
        },
        "abstract": "Erich Auerbach’s Mimesis: The Representation of Reality in Western Literature (1946) was profoundly influenced by George Wilhelm Friedrich Hegel’s idealist philosophy. Hegel held that concepts determine the structure of reality: the concept of freedom in his philosophy of history and, for Auerbach, the concept of history in the representation of reality. For both, reality is inextricable from reason, rationality, consciousness, and vice versa; hence, history signifies the rise and progress of human consciousness. Auerbach also shared Hegel’s view that the art of mimesis produces an image of a reality, in contrast to Plato, who thought a work of art is a resemblance opposed to reality. This paper analyzes the influence of Hegel’s philosophy of history on Auerbach’s conceptions of literary history, reality, and truth, as evidenced in Mimesis’s famous first chapter, “Odysseus’ Scar.” Auerbach chose the Hegelian concept of reality (Wirklichkeit) as the subtitle of his book to advance its main thesis, opposing realism to myths and legends, rationality to the flight from reason. He refutes the claim that classical Greek myths, legends, and heroes inaugurated Western culture’s representation of reality and, hence, conception of history. Instead, he finds their origins in the Old Testament, with its formulation of world, universal history, and “concept of the historically becoming,” an important Hegelian concept according to which the temporal becoming and unfolding of the life of human beings is meaningful, intelligible, and should be thought of as evolutionary progress toward a certain goal or end.",
        "article_title": "Constructing and Representing Reality: Hegel and the Making of Erich Auerbach’s Mimesis",
        "authors": [
            {
                "given": "Avihu",
                "family": "Zakai",
                "affiliation": [
                    {
                        "original_name": "The Hebrew University of Jerusalem",
                        "normalized_name": "Hebrew University of Jerusalem",
                        "country": "Israel",
                        "identifiers": {
                            "ror": "https://ror.org/03qxff017",
                            "GRID": "grid.9619.7"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-08-02",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "4",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2015.0003",
        "identifier": {
            "string_id": "10.1353/dph.2015.0003",
            "id_scheme": "DOI"
        },
        "abstract": "This article questions the “narrator theory of narration” with particular reference to medieval narratives, often retellings of existing stories, and generally neglected by current theory. Part I analyzes the concept of the internal, potentially unreliable narrator, widely regarded as a narratological necessity. Part II examines the history of the term narrator. Part III studies the theories of narration implied by scribal annotations in some medieval manuscripts. Parts IV, V, and VI discuss three medieval cases—Malory’s Morte Darthur, Chaucer’s Physician’s Tale and the anonymous Pearl—in which application of the narrator theory proves to be misleading.",
        "article_title": "What is a Narrator?: Narrator Theory and Medieval Narratives",
        "authors": [
            {
                "given": "A. C.",
                "family": "Spearing",
                "affiliation": [
                    {
                        "original_name": "University of Virginia",
                        "normalized_name": "University of Virginia",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/0153tk833",
                            "GRID": "grid.27755.32"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-08-02",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "4",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2015.0002",
        "identifier": {
            "string_id": "10.1353/dph.2015.0002",
            "id_scheme": "DOI"
        },
        "abstract": "Resistance to digital technology in manuscript study stems in large part from what detractors perceive as a loss of contact with the material artifact. For them, the digital image represents an illegitimate substitution for “the real thing.” In two movements, this article first suggests why such a term radically misunderstands both the relationship of digital image to manuscript, and also the nature of the manuscript’s performance of the work it represents. A second movement illustrates the performative propensity of manuscript technology—under the impetus of the sudden accumulation of vernacular adaptations of classical works fostered by Charles V in the 1370s—to influence court culture.",
        "article_title": "Materialities of the Manuscript: Codex and Court Culture in Fourteenth–Century Paris",
        "authors": [
            {
                "given": "Stephen G.",
                "family": "Nichols",
                "affiliation": [
                    {
                        "original_name": "Johns Hopkins University",
                        "normalized_name": "Johns Hopkins University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00za53h95",
                            "GRID": "grid.21107.35"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-08-02",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "4",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2015.0001",
        "identifier": {
            "string_id": "10.1353/dph.2015.0001",
            "id_scheme": "DOI"
        },
        "abstract": "This article studies how modern philologists have reconstructed a now lost ninth-century Arabic chronicle, the so-called Chronicle of al-Razi, through the account found in fifteenth-century Castilian chronicles of the defeat of the last Visigothic king of Iberia, Rodrigo. In addition to exploring the construction of a textual history that is populated by a series of phantasmal Iberian translators, manuscripts, and copyists, the creation of a modern Castilian edition of this lost Arabic chronicle speaks to the ideological basis and desires of modern, national philology.",
        "article_title": "Spanish Philology and the Arab Past: A Case Study",
        "authors": [
            {
                "given": "Michelle M.",
                "family": "Hamilton",
                "affiliation": [
                    {
                        "original_name": "University of Minnesota, Twin Cities",
                        "normalized_name": "University of Minnesota",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/017zqws13",
                            "GRID": "grid.17635.36"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-08-02",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "4",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2015.0013",
        "identifier": {
            "string_id": "10.1353/dph.2015.0013",
            "id_scheme": "DOI"
        },
        "abstract": "This article engages with the scholarly debate surrounding the scribal hands of the Parker Chronicle, the copy of the Anglo-Saxon Chronicle found in Cambridge, Corpus Christi College, MS 173. In light of new tools and practices within the digital humanities, the author suggests that the number of previously differentiated scribes writing between folios 16v–28r ought to be reduced. Fleck examines Corpus Christi’s digital holdings through the tools afforded by Stanford University’s Parker on the Web Project, and addresses questions of scribal identity treated most recently and prominently by Janet Bately and David Dumville, collaborative editors of the Anglo-Saxon Chronicle. In so doing, he demonstrates the utility of these digital tools for democratizing the practice of paleography.",
        "article_title": "A Digital Re-examination of the Scribal Hands in the Parker Chronicle",
        "authors": [
            {
                "given": "Alex",
                "family": "Fleck",
                "affiliation": [
                    {
                        "original_name": "University of Toronto",
                        "normalized_name": "University of Toronto",
                        "country": "Canada",
                        "identifiers": {
                            "ror": "https://ror.org/03dbr7087",
                            "GRID": "grid.17063.33"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-12-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "4",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2015.0012",
        "identifier": {
            "string_id": "10.1353/dph.2015.0012",
            "id_scheme": "DOI"
        },
        "abstract": "Two manuscripts in the Parker Library at Corpus Christi College, Cambridge, are copied in a hand which resembles that of Richard Frampton, a known clerk of the House of Lancaster in the early fourteenth century. Frampton copied literary manuscripts as well as working for the civic bureaucracy at the London Guildhall. His connections with royalty, the nobility and with Guildhall colleagues engaged in similar activities prompted an exploration of his social networks by means of software created at the University of Sheffield. The research was funded by the Andrew W. Mellon Foundation and coordinated by the University of Toronto.",
        "article_title": "Richard Frampton and Two Manuscripts in the Parker Library",
        "authors": [
            {
                "given": "Estelle V.",
                "family": "Stubbs",
                "affiliation": [
                    {
                        "original_name": "University of Sheffield",
                        "normalized_name": "University of Sheffield",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/05krs5044",
                            "GRID": "grid.11835.3e"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-12-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "4",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2015.0011",
        "identifier": {
            "string_id": "10.1353/dph.2015.0011",
            "id_scheme": "DOI"
        },
        "abstract": "In this article I analyze the contents and transmission of a group of related manuscripts containing copies of Ælfrician and anonymous homilies in order to demonstrate the linguistic potential of variant copies of texts. I consider them from a comparative textual and linguistic perspective in a way that privileges the scribe and scribal activity over traditional philology or editorial practice. The manuscripts are Oxford, Bodleian Library MSS Bodley 340 and 342, Cambridge, Corpus Christi College MSS 162, 198, and 303. They date from Ælfric’s lifetime (c. 950–c. 1010) to the mid-twelfth century. I focus on three Ælfrician homilies that appear in sequence uniquely in this cluster alongside four anonymous texts that, similarly, are not found together elsewhere. This research, funded by the Andrew W. Mellon foundation, was conducted as part of a collaborative project that sought to refine digital technologies to aid consequential research in book and language history.",
        "article_title": "Filling the Silence: Shared Content in Four Related Manuscripts of Ælfric’s Catholic Homilies",
        "authors": [
            {
                "given": "Kathryn A.",
                "family": "Lowe",
                "affiliation": [
                    {
                        "original_name": "University of Glasgow",
                        "normalized_name": "University of Glasgow",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/00vtgdb53",
                            "GRID": "grid.8756.c"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-12-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "4",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2015.0010",
        "identifier": {
            "string_id": "10.1353/dph.2015.0010",
            "id_scheme": "DOI"
        },
        "abstract": "In Old English poetry and prose, declarations of unknowing and inexpressibility appear as quasi-formulaic assertions that no human being exists who could know or express the declarations’ subject—even when the text surrounding the declaration of unknowing contains evidence to the contrary. Consistently, in homilies and poetry alike, declarations of unknowing mark out the supernatural, functioning as traditional poetic markers of wonder and awe. With declarations of unknowing as a case study, this paper proposes a network model for visualizing the relationship between motifs, texts, and traditional associations within the larger expressive economy of oral-traditional Old English poetics.",
        "article_title": "Beyond the Sun’s Setting: Webs of Unknowing in Old English",
        "authors": [
            {
                "given": "Alexandra",
                "family": "Bolintineanu",
                "affiliation": [
                    {
                        "original_name": "University of Toronto",
                        "normalized_name": "University of Toronto",
                        "country": "Canada",
                        "identifiers": {
                            "ror": "https://ror.org/03dbr7087",
                            "GRID": "grid.17063.33"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2015-12-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "4",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2016.0008",
        "identifier": {
            "string_id": "10.1353/dph.2016.0008",
            "id_scheme": "DOI"
        },
        "abstract": "This article examines the group of Machaut’s poems (a composite lai and ten ballades) copied into an anthology compiled by the French humanist Simon de Plumetot. More than half of the 155 items were composed by Eustache Deschamps, and most of the remainder are anonymous, but the collection has a markedly didactic character and many pieces make political allusions. The manuscript thus sets Machaut’s love poems in an unusual context. This essay argues that reading these poems as presented in the anthology enables the modern reader to approximate a medieval reading experience.",
        "article_title": "‘Anonymous’ Machaut: Guillaume de Machaut in Paris, BnF, NAF 6221",
        "authors": [
            {
                "given": "Maureen",
                "family": "Boulton",
                "affiliation": [
                    {
                        "original_name": "University of Notre Dame",
                        "normalized_name": "University of Notre Dame",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00mkhxb43",
                            "GRID": "grid.131063.6"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2016-06-05",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "5",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2016.0007",
        "identifier": {
            "string_id": "10.1353/dph.2016.0007",
            "id_scheme": "DOI"
        },
        "abstract": "This essay examines a late fourteenth-century compendium that combines an abridged version of Machaut’s Confort d’amy with a disparate sampling of contemporary devotional, didactic, and political vernacular writing. Many of the texts, including Machaut’s poem, appear in the compendium in anonymous and abridged versions that erase details pertaining to a specific author or patron. The systematic process of adaptation within the manuscript favors author anonymity and a more personalized approach to abstracting meaning from texts. This essay argues that the continuity of this reading experience across the compendium’s patchwork of devotional and political contents shows a reception history for Machaut’s poetry that was driven by readership more than authorship.",
        "article_title": "Devotional and Political Consolation in Paris, BnF, fr. 994",
        "authors": [
            {
                "given": "Rachel",
                "family": "Geer",
                "affiliation": [
                    {
                        "original_name": "University of Virginia",
                        "normalized_name": "University of Virginia",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/0153tk833",
                            "GRID": "grid.27755.32"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2016-06-05",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "5",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2016.0006",
        "identifier": {
            "string_id": "10.1353/dph.2016.0006",
            "id_scheme": "DOI"
        },
        "abstract": "The ordering of polyphonic musical works in the Machaut manuscripts relates directly to issues of layout and readability. Considering the size of the manuscripts, calculated according to surface area, the paper compares musical layout across the six Machaut manuscripts including his musical works (Paris, BnF, fr. 1584, 1585, 1586, 9221, 22545–6, and the Ferrell manuscript). Focusing on BnF fr. 9221, which is the largest and latest of these manuscripts, and is often criticized for its musical readings, the paper examines the idea of authority and considers the value of the manuscript to its original owner, the Duke of Berry.",
        "article_title": "Why Size Matters: Music Layout and Order in the Machaut Manuscripts",
        "authors": [
            {
                "given": "Jennifer",
                "family": "Bain",
                "affiliation": [
                    {
                        "original_name": "Dalhousie University",
                        "normalized_name": "Dalhousie University",
                        "country": "Canada",
                        "identifiers": {
                            "ror": "https://ror.org/01e6qks80",
                            "GRID": "grid.55602.34"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2016-06-05",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "5",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2016.0005",
        "identifier": {
            "string_id": "10.1353/dph.2016.0005",
            "id_scheme": "DOI"
        },
        "abstract": "Medieval scribes used decorated letters to mark the beginnings of songs, highlighting the incipits of texted voices and the vocal designations of others (“Tenor”). But some motets from fourteenth-century France begin with sung, untexted fanfares. This study examines several instances in the Machaut and Ivrea manuscripts where shortages of space, missing opening letters, and unorthodox layout decisions point to scribal confusion in the face of such beginnings. This evidence raises the possibility that untexted introductory sections may have traveled independently of their host compositions, and suggests new answers to the problems these “introitus” sections raise for modern editors and performers.",
        "article_title": "[I]ntroitus: Untexted Beginnings and Scribal Confusion in the Machaut and Ivrea Manuscripts",
        "authors": [
            {
                "given": "Anna",
                "family": "Zayaruznaya",
                "affiliation": [
                    {
                        "original_name": "Yale University",
                        "normalized_name": "Yale University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/03v76x132",
                            "GRID": "grid.47100.32"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2016-06-05",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "5",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2016.0004",
        "identifier": {
            "string_id": "10.1353/dph.2016.0004",
            "id_scheme": "DOI"
        },
        "abstract": "This chapter shakes up critical understanding of narrative voice in text and image of Machaut’s dits. It perceives narratorial activity as a function that, far from being proper to one party (“the narrator”), is inherently mobile, circulating around elements of a poem or miniature, whether human characters, animals or landscape features. Miniatures devised for the jugement poems are a particularly rich resource for analyzing this mobility being exploited by artists to draw attention to issues of narrative framing, communication and point of view – including, crucially, the point of view of the manuscript’s reader/viewer.",
        "article_title": "Picturing Narrative Voice: Communication and Displacement",
        "authors": [
            {
                "given": "Helen",
                "family": "Swift",
                "affiliation": [
                    {
                        "original_name": "St. Hilda’s College, University of Oxford",
                        "normalized_name": "University of Oxford",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/052gg0110",
                            "GRID": "grid.4991.5"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2016-06-05",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "5",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2016.0002",
        "identifier": {
            "string_id": "10.1353/dph.2016.0002",
            "id_scheme": "DOI"
        },
        "abstract": "This article explores the overlapping experiences of Guillaume de Machaut’s medieval manuscript readers and modern viewers of the digitized codex to argue that they share a nostalgic desire for a multi-sensorial and intimate encounter with the textual body. This study first considers Guillaume’s disgruntled reader in the Jugement dou roy de Navarre before turning to later readers who reenacted her desires when dealing with Machaut’s manuscripts. Finally, nuancing complaints that digitization distances us from the manuscript artifact, I consider how the digital surrogate reignites a desire for the textual body that defined the late-medieval reading experience.",
        "article_title": "Textual Bodies, the Digital Surrogate, and Desire: Guillaume de Machaut’s Judgment Cycle and his Protean Corpus",
        "authors": [
            {
                "given": "Deborah",
                "family": "McGrady",
                "affiliation": [
                    {
                        "original_name": "University of Virginia",
                        "normalized_name": "University of Virginia",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/0153tk833",
                            "GRID": "grid.27755.32"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2016-06-05",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "5",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2016.0013",
        "identifier": {
            "string_id": "10.1353/dph.2016.0013",
            "id_scheme": "DOI"
        },
        "abstract": "This paper analyses Christine de Pizan’s inclusion and decoration of the Livre du chemin de lonc estude (Book of the Path of Long Study) in her masterpiece, the Queen’s Manuscript, London, British Library, Harley 4431. It shows how she directed the choice and placement of the miniatures in order to foreground the theme of her book as a gift of wisdom.",
        "article_title": "The Book as a Gift of Wisdom: The Chemin de lonc estude in the Queen’s Manuscript, London, British Library, Harley 4431",
        "authors": [
            {
                "given": "Lori J.",
                "family": "Walters",
                "affiliation": [
                    {
                        "original_name": "Florida State University",
                        "normalized_name": "Florida State University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/05g3dte14",
                            "GRID": "grid.255986.5"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2017-01-22",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "5",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2016.0012",
        "identifier": {
            "string_id": "10.1353/dph.2016.0012",
            "id_scheme": "DOI"
        },
        "abstract": "This study examines two Franco-Italian manuscripts of the Huon d’Auvergne romance epic, Padua, Biblioteca del Seminario Vescovile, MS 32 and the Barbieri fragment, Bologna, Biblioteca dell’Archiginnasio, B. 3489. Using codicological evidence, the discussion connects these two material witnesses to literary trends of the fourteenth and fifteenth centuries, the period in which the manuscripts were prepared. This article approaches each witness as a unique iteration of the Huon d’Auvergne epic and argues that the Barbieri witness, even though fragmentary, should not be overlooked in an attempt to understand the literary culture of this epic.",
        "article_title": "A Contextual Analysis of Two Huon d’Auvergne Manuscripts",
        "authors": [
            {
                "given": "Stephen P.",
                "family": "McCormick",
                "affiliation": [
                    {
                        "original_name": "Washington and Lee University",
                        "normalized_name": "Lee University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00fwhaq79",
                            "GRID": "grid.259012.d"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2017-01-22",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "5",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2016.0011",
        "identifier": {
            "string_id": "10.1353/dph.2016.0011",
            "id_scheme": "DOI"
        },
        "abstract": "This article examines one of the decision-making moments in Petrarch’s editing of his Rerum vulgarium fragmenta (Rvf), when he erases the ballata “Donna mi vene spesso ne la mente” from the partial holograph Vaticano Latino 3195 and inserts the madrigal “Or vedi amor che giovenetta donna” over the erasure, creating a dynamic, palimpsestic relationship between the erased ballad and the Rvf. This shift in the making of the text represents the heart of the artistry of Petrarch’s visual poetics. The study of erasures and palimpsests in the partial holograph and other significant early witnesses helps us understand and trace the history of the work and affects our consideration of modern and contemporary editions of the text. The Petrarchive digital edition of the Rvf (&lt;http://petrarchive.org&gt;) implements new solutions, in the encoding and presentation of the edition, for exposing and highlighting the dynamic, palimpsestic features of Petrarch’s visual poetics.",
        "article_title": "Digital Representations and the Pivotal Instability of “Donna mi venne spesso ne la mente” in the Study of the Fragmenta",
        "authors": [
            {
                "given": "Isabella",
                "family": "Magni",
                "affiliation": [
                    {
                        "original_name": "Indiana University",
                        "normalized_name": "Indiana University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/01kg8sb98",
                            "GRID": "grid.257410.5"
                        }
                    }
                ]
            },
            {
                "given": "John A.",
                "family": "Walsh",
                "affiliation": [
                    {
                        "original_name": "Indiana University",
                        "normalized_name": "Indiana University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/01kg8sb98",
                            "GRID": "grid.257410.5"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2017-01-22",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "5",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2016.0010",
        "identifier": {
            "string_id": "10.1353/dph.2016.0010",
            "id_scheme": "DOI"
        },
        "abstract": "Manuscript 5366 of the Bibliothèque de l’Arsenal in Paris is a fifteenth-century miscellany written on paper that reproduces several religious texts in Middle French and two short fragments in Latin. The first group of texts—the Gospel of Nicodemus and La vengence Vaspasien (“The Revenge of Emperor Vespasian”, ff. 1r-86r)—is signed with the words: “Cest liure est a Nicole de Bretaigne qui le trouuera cy li rende et elle poyra bien le vin” (“This book belongs to Nicole de Bretaigne; she will pour a good quantity of wine for the finder who returns it”; Paris, Bibliothèque de l’Arsenal, MS 5366, f. 86r). This note is written in the same color ink as the preceding texts and in the same handwriting. Starting on the verso side of this leaf a slightly different hand, most likely a reader, has added three short fragments in French based on the Gospels. The thematic unity of these later additions suggests that they were the result of the spiritual needs and preferences of an owner of this manuscript, most likely a laywoman. Although the involvement of professional scribes cannot be ruled out entirely, this article will argue that one or several laypeople, most likely women, were responsible for the production of this manuscript.",
        "article_title": "Nicole de Bretaigne and a Fifteenth-Century Collection of Religious Texts in French: Paris, Bibliothèque de l’Arsenal, MS 5366",
        "authors": [
            {
                "given": "Margriet",
                "family": "Hoogvliet",
                "affiliation": [
                    {
                        "original_name": "University of Groningen",
                        "normalized_name": "University of Groningen",
                        "country": "Netherlands",
                        "identifiers": {
                            "ror": "https://ror.org/012p63287",
                            "GRID": "grid.4830.f"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2017-01-22",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "5",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2016.0009",
        "identifier": {
            "string_id": "10.1353/dph.2016.0009",
            "id_scheme": "DOI"
        },
        "abstract": "This article investigates the history of cataloging medieval manuscripts in order to determine a paradigm for digital catalogs of the present. Inspired by the work of Suzanne Briet (1894–1989), it argues in favor of a culturally informed “documentation” that considers not only the complexity of medieval manuscripts as information objects, but also anticipates the diverse interests of users who depend on digital images and supporting metadata to access manuscripts as primary sources for research. Presented here is a faceted metadata structure that considers the premodern manuscript as physical, textual, historical, as well as digital information. This approach is built upon various traditions for cataloging medieval manuscripts, from Cassiodorus in the sixth century to the electronic databases and digital catalogs of the present.",
        "article_title": "Cataloging Medieval Manuscripts, from Beasts to Bytes",
        "authors": [
            {
                "given": "Debra Taylor",
                "family": "Cashion",
                "affiliation": [
                    {
                        "original_name": "Saint Louis University",
                        "normalized_name": "Saint Louis University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/01p7jjy08",
                            "GRID": "grid.262962.b"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2017-01-22",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "5",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2017.0005",
        "identifier": {
            "string_id": "10.1353/dph.2017.0005",
            "id_scheme": "DOI"
        },
        "abstract": "This article gives the first complete list of all the known manuscripts of Christine de Pizan's Livre des fais d'armes et de chevalerie (1410) according to their most salient feature, first identified by A. T. P. Byles: those that identify Christine as author and those that remove the female author figure from the text. The article also provides a fuller description of the manuscripts than has hitherto been published and elaborates on the differences noted by Byles between the two major groups, with a view to aiding the selection of manuscripts for a critical edition of this text. Finally, the article suggests a new possible motive behind the initial erasure of Christine's authorship, which affected a large number of manuscripts.",
        "article_title": "The Manuscripts of the Livre des fais d'armes et de chevalerie",
        "authors": [
            {
                "given": "Christine",
                "family": "Reno",
                "affiliation": [
                    {
                        "original_name": "Vassar College",
                        "normalized_name": "Vassar College",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/022x6qg61",
                            "GRID": "grid.267778.b"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2017-06-25",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "6",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2017.0004",
        "identifier": {
            "string_id": "10.1353/dph.2017.0004",
            "id_scheme": "DOI"
        },
        "abstract": "Bespoke software developed during a transcription project on London, British Library, MS Harley 4431 makes it possible to analyze this very large corpus. Investigations so far have concentrated on variant spellings and the textual ornamentation; these are discussed in detail here. Further, guidance is given for other scholars wishing to use the software to examine the manuscript.",
        "article_title": "Patterns and Fingerprints in London, British Library, MS Harley 4431",
        "authors": [
            {
                "given": "James",
                "family": "Laidlaw",
                "affiliation": [
                    {
                        "original_name": "University of Edinburgh",
                        "normalized_name": "University of Edinburgh",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/01nrxwf90",
                            "GRID": "grid.4305.2"
                        }
                    }
                ]
            },
            {
                "given": "Charlie",
                "family": "Mansfield",
                "affiliation": [
                    {
                        "original_name": "Plymouth University",
                        "normalized_name": "Plymouth University",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/008n7pv89",
                            "GRID": "grid.11201.33"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2017-06-25",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "6",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2017.0003",
        "identifier": {
            "string_id": "10.1353/dph.2017.0003",
            "id_scheme": "DOI"
        },
        "abstract": "Few manuscripts explore Jean de Meun's philosophical anthropology—particularly its engagement with women and sexuality—as directly as does a mid-fourteenth-century miscellany preserved in the Bibliothèque municipale of Dijon, MS 525. Compiled by a scribe named Mathias du Rivau between 1355 and 1362, the miscellany includes a series of texts that either influenced Jean's Rose, or were influenced by it. Satiric and moral in nature, these texts form a counterpoint to the Rose that riffs on Jean's concept of dialectical opposites—contraires choses—particularly in the closing sections (as suggested by Mathias's marginal annotations). Key to the critical dynamic of the miscellany is a group of four texts—identified as prosa mulierum—immediately following the end of the Rose. Scholars who have studied this manuscript have dismissed these texts as misogynistic or even (anachronistically) \"anti-feminist.\" Such readings ignore the dialectical context of Dijon 525. Above all, they ignore the nuanced way that the prosa mulierum engage the disparate panoply of Jean de Meun's perspectives on the subject.",
        "article_title": "Codex as Critic: One Manuscript's Dialogue with the Romance of the Rose",
        "authors": [
            {
                "given": "Stephen G.",
                "family": "Nichols",
                "affiliation": [
                    {
                        "original_name": "Johns Hopkins University",
                        "normalized_name": "Johns Hopkins University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00za53h95",
                            "GRID": "grid.21107.35"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2017-06-25",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "6",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2017.0002",
        "identifier": {
            "string_id": "10.1353/dph.2017.0002",
            "id_scheme": "DOI"
        },
        "abstract": "Despite the encyclopedic nature of Jean de Meun's Roman de la Rose, there are two topics that have been accorded a central place in the quagmire of debates, discussions, and digressions that make up the second Rose. They are the successful and guaranteed regeneration of the human species and the proper use of one's (sexual) tools. At the center of both these topics is the allegorical figure of Lady Nature. The comparative analysis of iconographic depictions of Lady Nature in two fourteenth-century manuscripts, Chicago, University of Chicago Library, 1380 and Paris, Sainte-Geneviève, 1126, and in the fifteenth-century manuscript, Paris, BnF, fr. 23492 reveal new interpretative textual linkages, such as the rapprochement of Lady Nature's confession with Pygmalion's creation of his female statue.",
        "article_title": "Lady Nature in Word and Image in Jean de Meun's Roman de la Rose",
        "authors": [
            {
                "given": "Christine",
                "family": "McWebb",
                "affiliation": [
                    {
                        "original_name": "University of Waterloo",
                        "normalized_name": "University of Waterloo",
                        "country": "Canada",
                        "identifiers": {
                            "ror": "https://ror.org/01aff2v68",
                            "GRID": "grid.46078.3d"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2017-06-25",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "6",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2017.0001",
        "identifier": {
            "string_id": "10.1353/dph.2017.0001",
            "id_scheme": "DOI"
        },
        "abstract": "A glowing tribute to Anne de France, duchess of Bourbon, appears on one of the final folios of Paris, BnF, MS fr. 24392, a fifteenth-century collection notable for its rehabilitation of Jean de Meun. The encomium, composed between 1488 and 1498, praises Anne for serving as regent for her brother, the future King Charles VIII. Citing her many attributes, the poet likens Anne's eloquence to that of Christine de Pizan. How and why he makes this comparison is the subject of this two-part article. I conclude that it is not by accident that the encomium poet added his compliment to Anne to Français 24392.",
        "article_title": "Remembering Christine de Pizan in Paris, BnF, MS fr. 24392, A Manuscript Owned by Anne de France, Duchess of Bourbon",
        "authors": [
            {
                "given": "Lori J.",
                "family": "Walters",
                "affiliation": [
                    {
                        "original_name": "Florida State University",
                        "normalized_name": "Florida State University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/05g3dte14",
                            "GRID": "grid.255986.5"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2017-06-25",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "6",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2017.0015",
        "identifier": {
            "string_id": "10.1353/dph.2017.0015",
            "id_scheme": "DOI"
        },
        "abstract": "This essay considers the problem of normalized orthography in critical editions of Middle High German texts. The conventions devised by Lachmann, Benecke, and Grimm in the nineteenth century have always been controversial, but the problem is especially urgent now that digital reproductions afford direct access to manuscripts. Drawing on their experience of editing the Kaiserchronik, the authors advocate a print spelling from which a certain amount of scribal variation is filtered out, but in such a way as to respect and reflect the historic writing system of the medieval manuscript. This, they contend, is one of the main tasks for a responsible philology in the digital age.",
        "article_title": "Responsible Philology: Editing the Kaiserchronik in the Digital Age",
        "authors": [
            {
                "given": "Mark",
                "family": "Chinca",
                "affiliation": [
                    {
                        "original_name": "University of Cambridge",
                        "normalized_name": "University of Cambridge",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/013meh722",
                            "GRID": "grid.5335.0"
                        }
                    }
                ]
            },
            {
                "given": "Christopher",
                "family": "Young",
                "affiliation": [
                    {
                        "original_name": "University of Cambridge",
                        "normalized_name": "University of Cambridge",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/013meh722",
                            "GRID": "grid.5335.0"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2018-04-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "6",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2017.0014",
        "identifier": {
            "string_id": "10.1353/dph.2017.0014",
            "id_scheme": "DOI"
        },
        "abstract": "Proceeding from Walter Benjamin's ideas on technical reproduction, this essay examines the phenomenon of medieval manuscript culture being reduced and preserved through the medium of digital editing. This effect is demonstrated with reference to the Bern Parzival Project, which captures Wolfram von Eschenbach's romance (ca. 1200) in its rich manuscript transmission. Various components of the electronic edition, including a synopsis of different textual versions, single manuscript transcriptions, and unrooted phylograms borrowed from microbiology for the purpose of documenting witness relationships are discussed here in the context of theoretical issues situated on the boundaries between the sciences and the humanities.",
        "article_title": "Copying, Emergence, and Digital Reproduction: Transferring Medieval Manuscript Culture into an Electronic Edition",
        "authors": [
            {
                "given": "Michael",
                "family": "Stolz",
                "affiliation": [
                    {
                        "original_name": "Universität Bern",
                        "normalized_name": "University of Bern",
                        "country": "Switzerland",
                        "identifiers": {
                            "ror": "https://ror.org/02k7v4d05",
                            "GRID": "grid.5734.5"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2018-04-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "6",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2017.0013",
        "identifier": {
            "string_id": "10.1353/dph.2017.0013",
            "id_scheme": "DOI"
        },
        "abstract": "For over ten years, e-codices–Virtual Manuscript Library of Switzerland has been publishing medieval and select modern manuscripts from Swiss collections online at www.e-codices.ch. The website links highquality digital reproductions with descriptive metadata, all of which are searchable. The digital library offers free public access in four languages (English, French, German, and Italian). The home institution of e-codices is the Medieval Institute at the University of Fribourg (Switzerland). This article presents e-codices along with information regarding technical specifications, metadata and digitization. It highlights some of the digital manuscript library's special features and interesting projects, and it addresses challenges for the future of digital infrastructures such as e-codices.",
        "article_title": "e-codices–Virtual Manuscript Library of Switzerland: Great Achievements and Even Greater Challenges to Come",
        "authors": [
            {
                "given": "Ramona",
                "family": "Fritschi",
                "affiliation": [
                    {
                        "original_name": "Bibliothèque cantonale et universitaire de Lausanne",
                        "normalized_name": "Cantonal and University Library of Lausanne",
                        "country": "Switzerland",
                        "identifiers": {
                            "ror": "https://ror.org/010dca812",
                            "GRID": "grid.507547.4"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2018-04-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "6",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2017.0012",
        "identifier": {
            "string_id": "10.1353/dph.2017.0012",
            "id_scheme": "DOI"
        },
        "abstract": "Austria has a unique manuscript landscape in the German-speaking world, characterized both by the high number of surviving medieval manuscripts relative to its population, and by the survival of monastic libraries, which were not affected by the secularization that took place in German lands in 1806. This article surveys the range of scholarly projects in Austria that deal with medieval German texts and their online presentation, with a particular focus on the role of the Austrian Academy of Sciences and its Department of Paleography and Codicology, and the research portal manuscripta.at.",
        "article_title": "manuscripta.at: A Portal for Medieval Manuscripts Held in Austrian Libraries",
        "authors": [
            {
                "given": "Astrid",
                "family": "Breith",
                "affiliation": [
                    {
                        "original_name": "Österreichische Akademie der Wissenschaften",
                        "normalized_name": "Austrian Academy of Sciences",
                        "country": "Austria",
                        "identifiers": {
                            "ror": "https://ror.org/03anc3s24",
                            "GRID": "grid.4299.6"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2018-04-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "6",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2017.0011",
        "identifier": {
            "string_id": "10.1353/dph.2017.0011",
            "id_scheme": "DOI"
        },
        "abstract": "The world-famous Bibliotheca Palatina holds more than 3,000 medieval manuscripts, which are today divided between the Vatican Library in Rome and the Heidelberg University Library. This article discusses the academic, technical, and organizational challenges and solutions for a digitization project that is now drawing to its close. Its goal has been to digitally reconstruct the Bibliotheca Palatina and to make it available, as one single online edition, to scholars all over the world, with new opportunities for access and research.",
        "article_title": "Digitization at the Heidelberg University Library: The Digital Bibliotheca Palatina Project",
        "authors": [
            {
                "given": "Veit",
                "family": "Probst",
                "affiliation": [
                    {
                        "original_name": "Universität Heidelberg",
                        "normalized_name": "Heidelberg University",
                        "country": "Germany",
                        "identifiers": {
                            "ror": "https://ror.org/038t36y30",
                            "GRID": "grid.7700.0"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2018-04-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "6",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2017.0010",
        "identifier": {
            "string_id": "10.1353/dph.2017.0010",
            "id_scheme": "DOI"
        },
        "abstract": "With almost twenty years of expertise in the field of computer methods in the humanities, the Center for Digital Humanities at the University of Trier has recently been partner in two projects in the field of medieval manuscript studies: Virtuelles Skriptorium St. Matthias reconstructed the stock of medieval texts in the abbey of St Matthias in Trier by digitizing and publishing more than 450 manuscripts. eCodicology aimed to develop, test, and optimize new algorithms that automatically detect the macro- and microstructural layout elements on manuscript pages. This article discusses the workflows and technologies of both projects with a focus on the potential and limits of machine-reading technologies.",
        "article_title": "Automatic Layout Analysis and Storage of Digitized Medieval Books",
        "authors": [
            {
                "given": "Hannah",
                "family": "Busch",
                "affiliation": [
                    {
                        "original_name": "Universität Trier",
                        "normalized_name": "University of Trier",
                        "country": "Germany",
                        "identifiers": {
                            "ror": "https://ror.org/02778hg05",
                            "GRID": "grid.12391.38"
                        }
                    }
                ]
            },
            {
                "given": "Philipp",
                "family": "Hegel",
                "affiliation": [
                    {
                        "original_name": "Technische Universität Darmstadt",
                        "normalized_name": "TU Darmstadt",
                        "country": "Germany",
                        "identifiers": {
                            "ror": "https://ror.org/05n911h24",
                            "GRID": "grid.6546.1"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2018-04-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "6",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2017.0009",
        "identifier": {
            "string_id": "10.1353/dph.2017.0009",
            "id_scheme": "DOI"
        },
        "abstract": "This essay addresses the reception of the New Philology, and its more recent iteration, material philology, in German medieval studies. Whereas the New Philology elicited a largely skeptical response from practitioners of textual criticism and editorial philology, approaches informed by cultural studies have been more open to a constructive engagement with its tenets. Nevertheless, the question remains open as to whether German medieval studies have really followed the lead given by material philology and placed the manuscript as a physical object at the center of research to the extent that is often claimed.",
        "article_title": "Transmission and Materiality: Philology, Old and New, in German Medieval Studies",
        "authors": [
            {
                "given": "Martin",
                "family": "Baisch",
                "affiliation": [
                    {
                        "original_name": "Universität Hamburg",
                        "normalized_name": "Universität Hamburg",
                        "country": "Germany",
                        "identifiers": {
                            "ror": "https://ror.org/00g30e956",
                            "GRID": "grid.9026.d"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2018-04-08",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "6",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2018.0005",
        "identifier": {
            "string_id": "10.1353/dph.2018.0005",
            "id_scheme": "DOI"
        },
        "abstract": "Could invisible translators be the key to seeing invisible medieval authors? Medieval manuscripts and modern editions give us texts that combine signals of original authorship with interfering signals of scribal authorship, dialectical variation, etc. This article suggests a way to use medieval texts in modern translation to isolate authentic signals of authorship. By using translation as a signal-processing filter and applying previously tested stylometric techniques based on character n-grams, the present study detects a different signal for Guillaume d'Angleterre than those found for other texts attributed to Chrétien de Troyes, suggesting different authorship.",
        "article_title": "Invisible Translator, Visible Author: Medieval Authorship Verification Through Modern Translation",
        "authors": [
            {
                "given": "Brian J.",
                "family": "Reilly",
                "affiliation": [
                    {
                        "original_name": "Fordham University",
                        "normalized_name": "Fordham University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/03qnxaf80",
                            "GRID": "grid.256023.0"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2018-08-12",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "7",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2018.0004",
        "identifier": {
            "string_id": "10.1353/dph.2018.0004",
            "id_scheme": "DOI"
        },
        "abstract": "Collation as an element in the production of digital critical editions is no longer in its infancy. The current article, based on the experience of editing a lengthy medieval prose text for the Estoria de Espanna Digital, addresses the theoretical and practical implications of using digital tools to collate extensive passages of medieval text.",
        "article_title": "The Estoria de Espanna Digital: Collating Medieval Prose-Challenges… and More Challenges",
        "authors": [
            {
                "given": "Aengus",
                "family": "Ward",
                "affiliation": [
                    {
                        "original_name": "University of Birmingham",
                        "normalized_name": "University of Birmingham",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/03angcq70",
                            "GRID": "grid.6572.6"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2018-08-12",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "7",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2018.0003",
        "identifier": {
            "string_id": "10.1353/dph.2018.0003",
            "id_scheme": "DOI"
        },
        "abstract": "Using the Estoria Digital as a case study, I examine some practical issues that may be encountered in collaborative digital editing projects of medieval texts: I describe some of the practical issues we encountered when creating the Estoria Digital, and some of the strategies we employed to overcome them. Focussing on transcription, collation, and regularization, I propose a model for their effective completion by more than one person. Finally, I consider if collaborative digital editing might be a misnomer in this context: what do we mean by collaborative and editing in the collaborative digital editing of medieval texts?",
        "article_title": "The Practicalities of Collaboratively Digitally Editing Medieval Prose: The Estoria de Espanna Digital Project as a Case Study",
        "authors": [
            {
                "given": "Polly",
                "family": "Duxfield",
                "affiliation": [
                    {
                        "original_name": "University of Birmingham",
                        "normalized_name": "University of Birmingham",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/03angcq70",
                            "GRID": "grid.6572.6"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2018-08-12",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "7",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2018.0002",
        "identifier": {
            "string_id": "10.1353/dph.2018.0002",
            "id_scheme": "DOI"
        },
        "abstract": "This essay will examine what we define as digital-medieval manuscript culture, the production, dissemination, and use, scholarly or otherwise, of digital surrogates of medieval manuscripts. As we argue here, digital-medieval manuscript culture is continually in process and changing, as our tools, like those of the Middle Ages, evolve. In order to theorize digital manuscript surrogates—which need not be facsimiles, but rather any digital text or object intended to represent the contents and/or physical presence of a manuscript—as hyper-remediations that foreground medieval technologies in new media, we consider five interrelated aspects of digital-medieval manuscript culture: likeness, tangibility, presence, time, and intention(s).",
        "article_title": "On Digital-Medieval Manuscript Culture: A Tentative Manifesto",
        "authors": [
            {
                "given": "Heather",
                "family": "Bamford",
                "affiliation": [
                    {
                        "original_name": "The George Washington University",
                        "normalized_name": "George Washington University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00y4zzh67",
                            "GRID": "grid.253615.6"
                        }
                    }
                ]
            },
            {
                "given": "Emily C.",
                "family": "Francomano",
                "affiliation": [
                    {
                        "original_name": "Georgetown University",
                        "normalized_name": "Georgetown University",
                        "country": "Qatar",
                        "identifiers": {
                            "ror": "https://ror.org/029e47x73",
                            "GRID": "grid.452129.9"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2018-08-12",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "7",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2018.0001",
        "identifier": {
            "string_id": "10.1353/dph.2018.0001",
            "id_scheme": "DOI"
        },
        "abstract": "Several recent works have addressed the question of the extent to which recent advances in digital scholarship imply a revolution in scholarly editing practice. The current article addresses claims of a qualitative leap in the scholarly editing and suggests that while digital means present many advantages, digital editing practice is less far removed from print scholarly editing than might otherwise be thought.",
        "article_title": "Digital versus Analogue Textual Scholarship or The Revolution is Just in the Title",
        "authors": [
            {
                "given": "Barbara",
                "family": "Bordalejo",
                "affiliation": [
                    {
                        "original_name": "KU Leuven",
                        "normalized_name": "KU Leuven",
                        "country": "Belgium",
                        "identifiers": {
                            "ror": "https://ror.org/05f950310",
                            "GRID": "grid.5596.f"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2018-08-12",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "7",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0003",
        "identifier": {
            "string_id": "10.1353/dph.2019.0003",
            "id_scheme": "DOI"
        },
        "abstract": "This article focuses on the iconography of Guillaume de Deguileville's Le pelerinage de vie humaine, first printed in its prose version in Lyon in 1485. The iconography here functions as a vehicle for the global identity of the text, ensuring the permanence of this identity over the process of translation. Henrich Mayer, a German printer and editor in Toulouse, preserved the iconography at the cost of adaptations and significant adjustments in the Castilian Peregrino de la vida humana, which was published in 1490. The editor treated the illustrations as the locus of textual filiation.",
        "article_title": "Traveling Images: The Illustrations of Guillaume de Deguileville's Livre du Pelerin de vie humaine (Mathis Husz edition, Lyon, 1485) and its Castilian Translation by Vincente de Mazuelo (Heinrich Mayer edition, Toulouse, 1490)",
        "authors": [
            {
                "given": "Philippe",
                "family": "Maupeu",
                "affiliation": [
                    {
                        "original_name": "Université Toulouse 2 – Jean Jaurès",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-05-19",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "7",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0002",
        "identifier": {
            "string_id": "10.1353/dph.2019.0002",
            "id_scheme": "DOI"
        },
        "abstract": "Alain Chartier's Livre de l'Espérance is widely considered the chef d'oeuvre of his opus, melding the personal, the political, and the spiritual into a catechesis of Christianity. Its debt to Boethius, the Bible, and patristic writings has been analyzed. There may be another source less acknowledged: the Commedia of Dante Alighieri. Is it possible that Chartier was influenced by Dante's work? This essay traces the evidence and possibilities for such a textual encounter. Establishing the influence of Dante on Chartier allows further recognition of the paths by which humanist ideas from Italy entered France during the transitional fifteenth century.",
        "article_title": "Alain Chartier's Livre de l'Espérance: A Remodeling of Dante's Commedia?",
        "authors": [
            {
                "given": "Joan E.",
                "family": "McRae",
                "affiliation": [
                    {
                        "original_name": "Middle Tennessee State University",
                        "normalized_name": "Middle Tennessee State University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/02n1hzn07",
                            "GRID": "grid.260001.5"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-05-19",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "7",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0001",
        "identifier": {
            "string_id": "10.1353/dph.2019.0001",
            "id_scheme": "DOI"
        },
        "abstract": "This essay argues two points concerning the systematic use of the protagonists' dreams in the fifteenth-century romance Paris et Vienne, focusing on the single manuscript composed at the Burgundian Court during the 1450s, the base MS for the new edition of de Crécy and Brown-Grant. First, it argues that these dreams form a coherent, important program in the work as a whole, directly linked to the structure of its narrative. Secondly, it argues that this program functions in part by referring to a similar oneiric program in the thirteenth-century Roman de la Rose, in terms of the (ambiguous) meaning of dreams as fictional discourse.",
        "article_title": "The Dream Program in Paris et Vienne and Its Relation with the Roman de la Rose",
        "authors": [
            {
                "given": "Kevin",
                "family": "Brownlee",
                "affiliation": [
                    {
                        "original_name": "University of Pennsylvania",
                        "normalized_name": "University of Pennsylvania",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00b30xv10",
                            "GRID": "grid.25879.31"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-05-19",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "7",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0000",
        "identifier": {
            "string_id": "10.1353/dph.2019.0000",
            "id_scheme": "DOI"
        },
        "abstract": "This essay considers the literary influence of the Ramon Llull's Llibre de l'orde de cavalleria at the end of the Middle Ages, both in its relatively few surviving Catalan manuscripts, and in its much more frequently found middle French translation, as the Livre de l'ordre de chevalerie. After an introductory survey of the known manuscripts, the essay examines in detail the work's diffusion and its translations, as well as its later adaptations. Finally, there is a detailed consideration of tradition, influence, and imitations. In each of these cases, the middle French translation is shown to be particularly important and influential.",
        "article_title": "The French Translation of the Llibre de l'orde de cavalleria: The Diffusion, Translation, and Adaptation of Ramon Llull's Text",
        "authors": [
            {
                "given": "Florence",
                "family": "Bouchet",
                "affiliation": [
                    {
                        "original_name": "Université Toulouse – Jean Jaurès",
                        "normalized_name": "University of Toulouse-Jean Jaurès",
                        "country": "France",
                        "identifiers": {
                            "ror": "https://ror.org/04ezk3x31",
                            "GRID": "grid.410542.6"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-05-19",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "7",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0010",
        "identifier": {
            "string_id": "10.1353/dph.2019.0010",
            "id_scheme": "DOI"
        },
        "abstract": "The medieval Catalan translation of Livy's Decades, which is extant in London, British Library, MS Harley 4893, translates the fourteenth-century French version of Livy by Pierre Bersuire. The textual study of the Catalan translation and the French version suggests that the French manuscript used to produce the Catalan translation came from the court of the Duke of Berry soon after 1383, when John of Aragon (future King John I) had asked the Duke to send him a copy of the French Decades.",
        "article_title": "Reconstructing the Text: The Fourteenth-Century Catalan Translation of Livy",
        "authors": [
            {
                "given": "Montserrat",
                "family": "Ferrer",
                "affiliation": [
                    {
                        "original_name": "Universitat Autònoma de Barcelona",
                        "normalized_name": "Autonomous University of Barcelona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/052g8jq94",
                            "GRID": "grid.7080.f"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-05-19",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "7",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0009",
        "identifier": {
            "string_id": "10.1353/dph.2019.0009",
            "id_scheme": "DOI"
        },
        "abstract": "Knowledge of Guillaume de Machaut's literary and musical works is attested since 1380 in the Francophile court of Aragon, where his art exerted an influence that endured well into the fifteenth century. Catalan poets such as Andreu Febrer and Pere Torroella were greatly influenced by Machaut's poetry. This can be seen in the way they adapted the lay and ballade forms, and in the French section of chansonnier Vega-Aguiló (Barcelona, Biblioteca de Catalunya, MSS 7–8), an important witness to the poetry that originated with the troubadours and was fashionable in the Crown of Aragon until the end of the fifteenth century. This article approaches the role of Machaut's poetry and music in the construction of a literary canon in the Crown of Aragon.",
        "article_title": "Guillaume de Machaut at the Court of Aragon, 1380–1430",
        "authors": [
            {
                "given": "Anna",
                "family": "Alberni",
                "affiliation": [
                    {
                        "original_name": "ICREA – Universitat de Barcelona",
                        "normalized_name": "University of Barcelona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/021018s57",
                            "GRID": "grid.5841.8"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-05-19",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "7",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0008",
        "identifier": {
            "string_id": "10.1353/dph.2019.0008",
            "id_scheme": "DOI"
        },
        "abstract": "The epistles and political speeches of Jean Juvénal des Ursins contain varied ideas on language. This essay attempts to offer significant insights into his linguistic considerations. An analysis of the language and translation principles, in the works of the bishop of Charles VII of France, suggests a subtle but strong political activism at a time when nationalism was emerging across Europe. The systematic use of Latin to reflect on modern language can be considered a militant act in the context of the restoration of King of France's prerogatives. Jean Juvénal's militancy also appears in the allegorical devices he uses, which are based on morphological manipulations.",
        "article_title": "Jean Juvénal des Ursins, Linguist and Translator? Policies and Memory of Language in Late Medieval France",
        "authors": [
            {
                "given": "Sébastien",
                "family": "Cazalas",
                "affiliation": [
                    {
                        "original_name": "Université de Nantes",
                        "normalized_name": "University of Nantes",
                        "country": "France",
                        "identifiers": {
                            "ror": "https://ror.org/03gnr7b55",
                            "GRID": "grid.4817.a"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-05-19",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "7",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0007",
        "identifier": {
            "string_id": "10.1353/dph.2019.0007",
            "id_scheme": "DOI"
        },
        "abstract": "In fourteenth-century France, Charles V's official programs of translations into French have typically been considered the instrument of a royal political agenda and concepts of translatio as a transfer of power from the clerical milieu to the lay court. However, this essay focuses on the works of one of the king's preeminent translators Nicole Oresme, more from the cultural standpoint of the translator than the king's political one. Oresme's scholastic and cultural background helps understanding how translating was an all-encompassing complex intellectual process for him and that any of the political stands that arose from his process reflected personal philosophical beliefs and worldview.",
        "article_title": "Nicole Oresme's Cultural Translatio in Question",
        "authors": [
            {
                "given": "Anne-Hélène",
                "family": "Miller",
                "affiliation": [
                    {
                        "original_name": "The University of Tennessee- Knoxville",
                        "normalized_name": "University of Tennessee at Knoxville",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/020f3ap87",
                            "GRID": "grid.411461.7"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-05-19",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "7",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0018",
        "identifier": {
            "string_id": "10.1353/dph.2019.0018",
            "id_scheme": "DOI"
        },
        "abstract": "This article tracks the global trajectories of a tale of a scholarly slave girl (her name in Arabic is Tawaddud) who wins a knowledge contest over the greatest scholars of her time. This essay investigates what made the tale so gripping to its medieval readers and translators: its uncoupling of knowledge from mastery. I use Deleuze's and DeLanda's discussions of assemblage theory to consider how Arabic versions of the tale link heterogeneous fields and genres of knowledge into a fantasy of feminine, enslaved omnicompetence, and also how the tales' global transmigrations create a network of multifaceted and larger-than-Eurocentric research, informed but not deliminated by colonialism and decolonization.",
        "article_title": "Tawaddud/Teodor and the Stripping of Medieval Mastery",
        "authors": [
            {
                "given": "Christine",
                "family": "Chism",
                "affiliation": [
                    {
                        "original_name": "University of California, Los Angeles",
                        "normalized_name": "California Coast University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/05t99sp05",
                            "GRID": "grid.468726.9"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-07-21",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0017",
        "identifier": {
            "string_id": "10.1353/dph.2019.0017",
            "id_scheme": "DOI"
        },
        "abstract": "The inclusion of the medieval Portuguese chivalric romance \"The Twelve of England\" into Luís Vaz de Camões's Os Lusíadas (1572) links Vasco da Gama's voyage to India and subsequent Portuguese expansionism to specific historical moments of national foundation narrated in the epic. This essay argues that Magriço (Álvaro Gonçalves Coutinho), the protagonist of \"The Twelve of England,\" embodies a larger theme in the epic of national belatedness that is integral to the poem's engagement with the temporalities of empire and cultural inheritance. But the Lusiads's utility as a cultural artifact celebrating the rise of new forms of knowledge and power also provides the conceptual basis for its symbolic appropriation by Portugal's imperial rivals, Spain and England. The essay concludes by examining representations of Camões in twentieth-century Brazilian folhetos (\"leaflets\"), or literatura de cordel, to show how the Lusiads's anxieties about textual survival and generativeness provide a discursive frame for Camões's later textual incarnations.",
        "article_title": "Oceanic Epic: The Translations of the Lusiads in the Global Renaissance",
        "authors": [
            {
                "given": "Sara V.",
                "family": "Torres",
                "affiliation": [
                    {
                        "original_name": "University of Virginia",
                        "normalized_name": "University of Virginia",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/0153tk833",
                            "GRID": "grid.27755.32"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-07-21",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0016",
        "identifier": {
            "string_id": "10.1353/dph.2019.0016",
            "id_scheme": "DOI"
        },
        "abstract": "This essay synthesizes the perspectives of eleven participants in a colloquium that brought together experts in medieval language and culture, second-language acquisition, and video game production to assess the use of three-dimensional (3D) immersive environments for learning about inaccessible or lost cultures. We suggest that technology offers a unique method for experiencing the past; and when harnessed effectively, immersive environments can increase empathy and learning while appealing to a new generation of students.",
        "article_title": "Revisioning the Global Middle Ages: Immersive Environments for Teaching Medieval Languages and Culture",
        "authors": [
            {
                "given": "Lynn",
                "family": "Ramey",
                "affiliation": [
                    {
                        "original_name": "Vanderbilt University",
                        "normalized_name": "Vanderbilt University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/02vm5rt34",
                            "GRID": "grid.152326.1"
                        }
                    }
                ]
            },
            {
                "given": "David",
                "family": "Neville",
                "affiliation": [
                    {
                        "original_name": "Grinnell College",
                        "normalized_name": "Grinnell College",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/04tmmky42",
                            "GRID": "grid.256592.f"
                        }
                    }
                ]
            },
            {
                "given": "Sahar",
                "family": "Amer",
                "affiliation": [
                    {
                        "original_name": "University of Sydney",
                        "normalized_name": "University of Sydney",
                        "country": "Australia",
                        "identifiers": {
                            "ror": "https://ror.org/0384j8v12",
                            "GRID": "grid.1013.3"
                        }
                    },
                    {
                        "original_name": "Ruhr-Universität Bochum",
                        "normalized_name": "University Hospitals of the Ruhr-University of Bochum",
                        "country": "Germany",
                        "identifiers": {
                            "ror": "https://ror.org/03zcpvf19",
                            "GRID": "grid.411091.c"
                        }
                    }
                ]
            },
            {
                "given": "Jonathan",
                "family": "deHaan",
                "affiliation": [
                    {
                        "original_name": "University of Shizuoka",
                        "normalized_name": "University of Shizuoka",
                        "country": "Japan",
                        "identifiers": {
                            "ror": "https://ror.org/04rvw0k47",
                            "GRID": "grid.469280.1"
                        }
                    }
                ]
            },
            {
                "given": "Maxime",
                "family": "Durand",
                "affiliation": [
                    {
                        "original_name": "Ubisoft Montreal",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    }
                ]
            },
            {
                "given": "Brandon",
                "family": "Essary",
                "affiliation": [
                    {
                        "original_name": "Elon University",
                        "normalized_name": "Elon University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/01szgyb91",
                            "GRID": "grid.255496.9"
                        }
                    }
                ]
            },
            {
                "given": "Rob",
                "family": "Howland",
                "affiliation": [
                    {
                        "original_name": "Three Flip Studios",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    }
                ]
            },
            {
                "given": "Mubbasir",
                "family": "Kapadia",
                "affiliation": [
                    {
                        "original_name": "Rutgers University",
                        "normalized_name": "Rutgers, The State University of New Jersey",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/05vt9qd57",
                            "GRID": "grid.430387.b"
                        }
                    }
                ]
            },
            {
                "given": "Felix",
                "family": "Kronenberg",
                "affiliation": [
                    {
                        "original_name": "Michigan State University",
                        "normalized_name": "Michigan State University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/05hs6h993",
                            "GRID": "grid.17088.36"
                        }
                    }
                ]
            },
            {
                "given": "Brett E.",
                "family": "Shelton",
                "affiliation": [
                    {
                        "original_name": "Boise State University",
                        "normalized_name": "Boise State University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/02e3zdp86",
                            "GRID": "grid.184764.8"
                        }
                    }
                ]
            },
            {
                "given": "Barbara",
                "family": "Vance",
                "affiliation": [
                    {
                        "original_name": "Indiana University",
                        "normalized_name": "Indiana University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/01kg8sb98",
                            "GRID": "grid.257410.5"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-07-21",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0015",
        "identifier": {
            "string_id": "10.1353/dph.2019.0015",
            "id_scheme": "DOI"
        },
        "abstract": "Since the death of Thailand's King Bhumibol Adulyadej in 2016, his image has continued to play a defining role in the articulation of Thainess (khwampenthai) in reference to the country's \"authentic\" premodern past and its teleological \"progress.\" This essay addresses several paradoxes in this image and its relationship to Thailand's embattled political history. How might the royal photograph be both sacred and secular? How are premodern understandings of kingship, including the taboo on the monarchy's public representation, reconciled with the contemporary hypervisibility of the monarchy? And what implications do references to the premodern past have for debates over defining democracy in Thailand?",
        "article_title": "The Feudal Photograph of a Democratic Dhammaraja: Secularism and Sacrality in Thai Royal Imagery",
        "authors": [
            {
                "given": "Clare",
                "family": "Veal",
                "affiliation": [
                    {
                        "original_name": "LASALLE College of the Arts",
                        "normalized_name": "LASALLE College of the Arts",
                        "country": "Singapore",
                        "identifiers": {
                            "ror": "https://ror.org/04s8jdf66",
                            "GRID": "grid.443361.7"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-07-21",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0014",
        "identifier": {
            "string_id": "10.1353/dph.2019.0014",
            "id_scheme": "DOI"
        },
        "abstract": "In 2015 Pope Francis released Laudato Si', an encyclical call to arms on environmental issues, declaring climate change a problem of urgent proportions. The letter received extraordinary levels of global coverage and was hailed as a necessary and timely intervention by a range of politicians, policymakers, and public intellectuals, many of them avowed secularists. Laudato Si' was able to achieve acclaim and influence because it was immediately available via the Internet—a divinely inspired press release, so to speak. At the same time, Laudato Si' defined itself in terms of the medieval church, taking its name from a poem by Saint Francis and grounding its claims on the philosophy of Saint Thomas Aquinas. In so doing, Laudato Si played with multiple temporal registers, drawing on an unbroken spiritual tradition to issue a manifesto within a broken modernity.",
        "article_title": "\"Nothing in this world is indifferent to us\": Laudato Si' as Global and Planetary Medievalism",
        "authors": [
            {
                "given": "Louise",
                "family": "D'Arcens",
                "affiliation": [
                    {
                        "original_name": "Macquarie University",
                        "normalized_name": "Macquarie University",
                        "country": "Australia",
                        "identifiers": {
                            "ror": "https://ror.org/01sf06y89",
                            "GRID": "grid.1004.5"
                        }
                    }
                ]
            },
            {
                "given": "Clare",
                "family": "Monagle",
                "affiliation": [
                    {
                        "original_name": "Macquarie University",
                        "normalized_name": "Macquarie University",
                        "country": "Australia",
                        "identifiers": {
                            "ror": "https://ror.org/01sf06y89",
                            "GRID": "grid.1004.5"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-07-21",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0013",
        "identifier": {
            "string_id": "10.1353/dph.2019.0013",
            "id_scheme": "DOI"
        },
        "abstract": "An important trend in scholarship is attending to the metamorphoses of particular folktales across regions, periods, and religions, tracking what such changes reveal about the direction of cultural transmission. Part of this trend is looking beyond circulation in Europe to circulation across south-south boundaries, or even from south to north, the latter of which I have done much to try to forward. In this essay, however, I consider an instance of ostensible Europe-to-Africa textual transfer: the body of folktales that circulated around the medieval world about miracles performed by Saint Mary, the mother of Jesus. The Ethiopian Marian tales, which appear in a compilation text titled Täˀammərä Maryam (Miracles of Mary), are sometimes mistakenly said to have arisen solely in Europe. To explore the issue of influence, I examine a Marian tale innovated in Ethiopia titled \"The Cannibal of Qəmər\" (or \"The Miracle of the Man-Eater\" or \"The Story of Belai\"). Reading the cannibal tale diachronically, relationally, allegorically, and intertextually reveals much. The Marian tale template first devised in the Levant persists across multiple boundaries yet was radically adapted in Ethiopia, underscoring why care is required when discussing African narrative adaptation of outside texts.",
        "article_title": "Mary Saves the Man-Eater: Value in the Medieval Ethiopian Marian Miracle Tale of \"The Cannibal of Qəmər\"",
        "authors": [
            {
                "given": "Wendy Laura",
                "family": "Belcher",
                "affiliation": [
                    {
                        "original_name": "Princeton University",
                        "normalized_name": "Princeton University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00hx57361",
                            "GRID": "grid.16750.35"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-07-21",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0012",
        "identifier": {
            "string_id": "10.1353/dph.2019.0012",
            "id_scheme": "DOI"
        },
        "abstract": "A remarkable set of late medieval European epics and histories tell of Charlemagne's youth in al-Andalus and his marriage to a converted Saracen princess. This essay considers the cultural work of these narratives by analyzing them as instances of genealogical self-fashioning and interimperial translation in the medieval Mediterranean.",
        "article_title": "Charles in al-Andalus",
        "authors": [
            {
                "given": "Shirin",
                "family": "Khanmohamadi",
                "affiliation": [
                    {
                        "original_name": "San Francisco State University",
                        "normalized_name": "San Francisco State University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/05ykr0121",
                            "GRID": "grid.263091.f"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-07-21",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0025",
        "identifier": {
            "string_id": "10.1353/dph.2019.0025",
            "id_scheme": "DOI"
        },
        "abstract": "Stand-off markup is widely considered to be a possible solution for overcoming the limitation of inline XML markup, primarily when dealing with multiple overlapping hierarchies. Considering previous contributions on the subject as well as the implementations of stand-off markup, we propose a new TEI-based model for encoding that still uses the regular TEI elements but in a stand-off manner. Our light notation moves the bulk of markup into a separate &lt;standoff&gt; element, grouping layers of related textual features encoded via existing TEI elements (e.g., &lt;name&gt; or &lt;corr&gt;) into individual &lt;stf&gt; elements; furthermore, our proposed notation provides a schema for referencing the transcription using the xml:id attribute. This approach is illustrated through a variety of examples. Our proof-of-concept transformation package works directly on the stand-off markup without the necessity of reducing it back to inline TEI for parsing, querying, and visualizing.",
        "article_title": "XML-TEI Stand-off Markup: One Step Beyond",
        "authors": [
            {
                "given": "Elena",
                "family": "Spadini",
                "affiliation": [
                    {
                        "original_name": "Université de Lausanne",
                        "normalized_name": "University of Lausanne",
                        "country": "Switzerland",
                        "identifiers": {
                            "ror": "https://ror.org/019whta54",
                            "GRID": "grid.9851.5"
                        }
                    }
                ]
            },
            {
                "given": "Magdalena",
                "family": "Turska",
                "affiliation": [
                    {
                        "original_name": "eXist Solutions",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-10-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "8",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0024",
        "identifier": {
            "string_id": "10.1353/dph.2019.0024",
            "id_scheme": "DOI"
        },
        "abstract": "As with so many of his colleagues working elsewhere in the Crown of Aragon, the Valencia-based printer and bookseller Joan Rix de Cura (ca. 1450–90) is typical of those figures responsible for the introduction of the printing press in the Iberian peninsula. By a stroke of good fortune, the inventory of Rix de Cura's bookshop holdings, totalling 5,261 volumes, has been preserved. An invaluable source for the circulation of classical and humanistic texts in late-fifteenth-century Valencia, the inventory includes an astonishing number of Latin books (with an indication of the number of copies held at the bookshop), mostly imported from Venice.",
        "article_title": "Books and Readers in Late-Fifteenth-Century Valencia: The Inventory of Joan Rix de Cura (1490)",
        "authors": [
            {
                "given": "Alejandro",
                "family": "Coroleu",
                "affiliation": [
                    {
                        "original_name": "ICREA—Universitat Autònoma de Barcelona",
                        "normalized_name": "Autonomous University of Barcelona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/052g8jq94",
                            "GRID": "grid.7080.f"
                        }
                    }
                ]
            },
            {
                "given": "Montserrat",
                "family": "Ferrer",
                "affiliation": [
                    {
                        "original_name": "Universitat Autònoma de Barcelona",
                        "normalized_name": "Autonomous University of Barcelona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/052g8jq94",
                            "GRID": "grid.7080.f"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-10-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "8",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0023",
        "identifier": {
            "string_id": "10.1353/dph.2019.0023",
            "id_scheme": "DOI"
        },
        "abstract": "This methodological article researches all available documentary sources regarding the ownership, making, and circulation of books within the royal House of Aragon (ca. 1300–1460) in order to study the creation of personal libraries linked to the royal house and investigate how individual books were transmitted from one personal library to another. The goal is to better define the intellectual profile of some of the kings, queens, and princes of the House of Aragon, such as James II, Peter III, Martin I, the young Alfonso the Magnanimous, Maria of Castile, and Charles Prince of Viana.",
        "article_title": "The Books of the Kings of Aragon: From James II to Alfonso IV",
        "authors": [
            {
                "given": "Lluís",
                "family": "Cabré",
                "affiliation": [
                    {
                        "original_name": "Universitat Autònoma de Barcelona",
                        "normalized_name": "Autonomous University of Barcelona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/052g8jq94",
                            "GRID": "grid.7080.f"
                        }
                    }
                ]
            },
            {
                "given": "Josep",
                "family": "Pujol",
                "affiliation": [
                    {
                        "original_name": "Universitat Autònoma de Barcelona",
                        "normalized_name": "Autonomous University of Barcelona",
                        "country": "Spain",
                        "identifiers": {
                            "ror": "https://ror.org/052g8jq94",
                            "GRID": "grid.7080.f"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-10-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "8",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2019.0022",
        "identifier": {
            "string_id": "10.1353/dph.2019.0022",
            "id_scheme": "DOI"
        },
        "abstract": "Old English poems are difficult to date, largely anonymous, and written in a formulaic idiom, making it difficult to establish authorship and intertextual relationships among various poems. This essay employs computational stylometry—specifically, n-gram analysis—and network analysis to address this problem. It proposes methods for screening out chance n-grams and for employing n-grams of various lengths within a single analysis to show that, in Old English poetry, formulaic diction exists at the level of idiolect, sociolect, and language. Specifically, the signed poems of Cynewulf evince idiolectal characteristics; and along with Andreas, Christ III, The Phoenix, and Guthlac A and B, they form a poetic subtradition (sociolect).",
        "article_title": "Using N-gram Analysis to Map Intertextual Networks in Old English Verse",
        "authors": [
            {
                "given": "Paul",
                "family": "Battles",
                "affiliation": [
                    {
                        "original_name": "Hanover College",
                        "normalized_name": "Hanover College",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00vc14296",
                            "GRID": "grid.431583.8"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2019-10-20",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "8",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2020.0004",
        "identifier": {
            "string_id": "10.1353/dph.2020.0004",
            "id_scheme": "DOI"
        },
        "abstract": "In the 13th-century text Ami et Amile, Ami is willingly stricken with leprosy after he replaces Amile in the judicial battle to prove his friend's innocence, having been warned beforehand about the affliction by an angel. This paper explores the notion of vulnerability through the lens of leprosy. Medieval society regarded the leper as being touched by God, a physical manifestation of an inward transgression. Ami, as a leper, incites both fear and longing: the disease excludes him from society due to its contagious and incurable nature. Concurrently, it provides the opportunity for charity by tending to the sick and lowly. In this case, it allows Amile and his children to perform charitable Christian sacrifices to save Ami: Amile murders his own children for the blood cure, while the children die for the benefit of another. Their sacrifices are rewarded as the children are restored to life and Amile is forgiven the infanticide, revealing a logic of vulnerability that applies to the characters as well as the political and social institutions in place. In the end, it is vulnerability that permits ultimate redemption and allows secular personages to achieve spiritual elevation.",
        "article_title": "Precarious Bodies in the Old French Ami et Amile",
        "authors": [
            {
                "given": "Stephanie",
                "family": "Grace-Petinos",
                "affiliation": [
                    {
                        "original_name": "Western Carolina University",
                        "normalized_name": "Western Carolina University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/010h78f45",
                            "GRID": "grid.268170.a"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2020-05-10",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2020.0003",
        "identifier": {
            "string_id": "10.1353/dph.2020.0003",
            "id_scheme": "DOI"
        },
        "abstract": "This article explores able-bodied subjects' affective response to people with disabilities, as manifested in the \"tests\" and trials used to ascertain the authenticity of those disabilities. When children drop hot coals on the esh of a deaf-mute to see if he can scream, or when a cleric tricks blind beggars into spending a coin they do not possess, more than simple cruelty is at play (though these actions are undeniably cruel). Through readings of selected texts from twelfth- through fifteenth-century France – including Chrétien de Troyes's Cligès, the Miracles de saint Louis by Guillaume de Saint-Pathus, the fabliau Les trois aveugles de Compiègne, and a ballade by Eustache Deschamps – I examine what vulnerabilities are being exposed, protected, or celebrated through the administration of these tests. I argue that medieval literary tests of disability reveal privilege to be both an embodied and an intellectual or epistemic state: the prospect of a feigned disability exposes an unsettling (because unresolvable) fragility in the mechanisms of knowing.",
        "article_title": "Able-Bodied Fragility",
        "authors": [
            {
                "given": "Julie",
                "family": "Singer",
                "affiliation": [
                    {
                        "original_name": "Washington University in Saint Louis",
                        "normalized_name": "Washington University in St. Louis",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/01yc7t268",
                            "GRID": "grid.4367.6"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2020-05-10",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2020.0002",
        "identifier": {
            "string_id": "10.1353/dph.2020.0002",
            "id_scheme": "DOI"
        },
        "abstract": "Petrus Alfonsi's medieval readers often categorized his Disciplina clericalis as a homiletic exemplum collection or as a mirror for princes. I will argue that beneath these layers of misreading, Petrus organizes a collection that emphasizes the subject position of the socially vulnerable: women, pilgrims, travelers, subordinates, apprentices, slaves, and the disabled. In this reading, the normative values of church and state become accruals. Beneath them, I reveal a Disciplina clericalis that it is strangely resonant in our time. It attends to the problem of premodern precarity, recurrently mapping that condition onto body in the form of vulnerability. Disciplina clericalis is less a handbook for preachers or a mirror for princes than a guide for the marginalized in a dangerous and exploitative world.",
        "article_title": "Sociality at the Margins in Petrus Alfonsi's Disciplina Clericalis",
        "authors": [
            {
                "given": "Gabriel",
                "family": "Ford",
                "affiliation": [
                    {
                        "original_name": "Converse College",
                        "normalized_name": "Converse College",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/01g0q1j14",
                            "GRID": "grid.421523.3"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2020-05-10",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2020.0001",
        "identifier": {
            "string_id": "10.1353/dph.2020.0001",
            "id_scheme": "DOI"
        },
        "abstract": "This essay considers medieval precarity and vulnerability through the example of Thomas Hoccleve, whose Regiment of Princes attests to a broad and varied discourse about the effects of marginalization, contingency, and economic insecurity and exploitation in late medieval English literature. Drawing on Judith Butler and others' work on the \"politics of grief,\" I consider how Thomas Hoccleve uses his experience of personal loss and sorrow as an occasion to reflect on the precarious lives of those around him. In so doing, his work in the Regiment of Princes serves as an early example of how personal sorrow can become an imaginative catalyst for broader ethical reflection and advocacy",
        "article_title": "The Politics of Precarious Grief in Thomas Hoccleve's Regiment of Princes",
        "authors": [
            {
                "given": "Sarah",
                "family": "Wilson",
                "affiliation": [
                    {
                        "original_name": "Northwestern University",
                        "normalized_name": "Northwestern University",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/000e0be47",
                            "GRID": "grid.16753.36"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2020-05-10",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2012.0012",
        "identifier": {
            "string_id": "10.1353/dph.2012.0012",
            "id_scheme": "DOI"
        },
        "abstract": "This article discusses the medieval Icelandic Nítíða saga (“The Saga of Nítíða”) as it is preserved in one of many postmedieval paper manuscripts, and takes into account not only the manuscript’s content and physical aspects, but also its social context, including its scribe, Þórður Jónsson (fl. 1667–93). The article foregrounds the existence of different versions of Nítíða saga by considering the differences between this version of the text and the better-known version from earlier manuscripts. In addition, this article offers an explanation for two scribal errors in one version of the saga through comparison with the other, and shows the importance of further manuscript-based research of this sort in Icelandic literary studies and other fields.",
        "article_title": "Variance Uncovered and Errors Explained: An Analysis of Nítíða saga in the Seventeenth-Century Icelandic Manuscript js 166 FOL.",
        "authors": [
            {
                "given": "Sheryl",
                "family": "McDonald",
                "affiliation": [
                    {
                        "original_name": "University of Leeds",
                        "normalized_name": "University of Leeds",
                        "country": "United Kingdom",
                        "identifiers": {
                            "ror": "https://ror.org/024mrxd33",
                            "GRID": "grid.9909.9"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-01-06",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "1",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2012.0021",
        "identifier": {
            "string_id": "10.1353/dph.2012.0021",
            "id_scheme": "DOI"
        },
        "abstract": "A long-term digitization project (www.stgallplan.org) to bring the Carolingian plan for the monastery of St. Gall in Switzerland to life has earned justified praise for its impact. The project calls attention to and increases understanding of Carolingian monastic life at one of the great houses of the time. Whether the library was ever intended to be constructed or whether it was an imaginative conceptualization of an ideal library is immaterial to the light the project has shed on Carolingian spirituality. This article both introduces the project and demonstrates how digitization of manuscripts can increase the data available for studying devotion and the religious emotions that it entailed.",
        "article_title": "Digital Devotion from Carolingian Reichenau and St. Gall",
        "authors": [
            {
                "given": "Richard Matthew",
                "family": "Pollard",
                "affiliation": [
                    {
                        "original_name": "University of British Columbia",
                        "normalized_name": "University of British Columbia",
                        "country": "Canada",
                        "identifiers": {
                            "ror": "https://ror.org/03rmrcq20",
                            "GRID": "grid.17091.3e"
                        }
                    }
                ]
            },
            {
                "given": "Julian",
                "family": "Hendrix",
                "affiliation": [
                    {
                        "original_name": "Carthage College",
                        "normalized_name": "Carthage College",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/00wkay776",
                            "GRID": "grid.420456.1"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-01-06",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "1",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2012.0020",
        "identifier": {
            "string_id": "10.1353/dph.2012.0020",
            "id_scheme": "DOI"
        },
        "abstract": "This essay explores the early fifteenth-century “Cour amoureuse,” or Love Court, associated with the French royal court, in the context of modern psychological work on aggression and flyting, setting up a dialogue between medieval and modern psychological theories of anger. A professor in Pediatric Clinical Neuroscience specializing in the study of anger and aggression comments on an analysis of the “Cour amoureuse” offered by a scholar of medieval studies. The exchange reveals that a distinction present in medieval theories of anger seems to have a basis in neurological reality.",
        "article_title": "Anger and the “Cour amoureuse” of Charles VI: Medieval and Modern Perspectives",
        "authors": [
            {
                "given": "Tracy",
                "family": "Adams",
                "affiliation": [
                    {
                        "original_name": "University of Auckland",
                        "normalized_name": "University of Auckland",
                        "country": "New Zealand",
                        "identifiers": {
                            "ror": "https://ror.org/03b94tp07",
                            "GRID": "grid.9654.e"
                        }
                    },
                    {
                        "original_name": "Netherlands Institute for Advanced Studies",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    },
                    {
                        "original_name": "Centre for Medieval and Early Modern Studies",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    }
                ]
            },
            {
                "given": "Michael",
                "family": "Potegal",
                "affiliation": [
                    {
                        "original_name": "Department of Pediatrics",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    },
                    {
                        "original_name": "University of Minnesota",
                        "normalized_name": "University of Minnesota",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/017zqws13",
                            "GRID": "grid.17635.36"
                        }
                    },
                    {
                        "original_name": "Netherlands Institute for Advanced Studies",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-01-06",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "1",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2012.0019",
        "identifier": {
            "string_id": "10.1353/dph.2012.0019",
            "id_scheme": "DOI"
        },
        "abstract": "Recent work on the history of emotions, particularly by Barbara Rosenwein, has explored the idea of “emotional communities” as a means of uncovering the complex layers of identity and self-definition among individuals in past societies. Here I wish to explore three brief examples from French texts of the twelfth and thirteenth centuries in the light of this enquiry. Two are from well-known literary figures (Chrétien de Troyes and Marie de France) while the other is by Guillaume le Breton, biographer and panegyrist of the French king Philip II Augustus (r. 1180–1223). Each writer uses the image of the garden to illustrate the emotional standpoint of prominent individuals and communities within his or her text. The range of emotions on display—jealousy, grief, anger, fear, love, and even something we might label “national pride”—attests to the power of the garden image as a conveyor of meaning for medieval authors and audiences alike.",
        "article_title": "Gardens as “Emotional Communities”: Three Medieval French Examples",
        "authors": [
            {
                "given": "Lindsay",
                "family": "Diggelmann",
                "affiliation": [
                    {
                        "original_name": "University of Auckland",
                        "normalized_name": "University of Auckland",
                        "country": "New Zealand",
                        "identifiers": {
                            "ror": "https://ror.org/03b94tp07",
                            "GRID": "grid.9654.e"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-01-06",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "1",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2012.0017",
        "identifier": {
            "string_id": "10.1353/dph.2012.0017",
            "id_scheme": "DOI"
        },
        "abstract": "This essay examines how Dominicans focused their late fourteenth-century struggle to redefine spirituality around the cults of St. Thomas and St. Catherine of Siena. The relics of the Angelic Doctor were translated from the Cistercian abbey of Fossanova to Toulouse in 1369 through the efforts of French Dominican Master, Elias Raymundus. However, the translation was then countered by Raymond of Capua through the active promotion of the much more affective spirituality of Catherine of Siena. The contest came to a head when Raymond overthrew Elias Raymundus as Master of the Order at the General Chapter of Pentecost in 1380, just after the death of Catherine of Siena at thirty-three. Catherine’s intensely emotional style of spiritual writing is much more closely connected to her understanding of the influence of Thomas Aquinas than often realised and its promotion by Raymond of Capua marks a shift away from a purely cerebral approach to theology.",
        "article_title": "Thomas Aquinas and Catherine of Siena: Emotion, Devotion and Mendicant Spiritualities in the Late Fourteenth Century",
        "authors": [
            {
                "given": "Constant J.",
                "family": "Mews",
                "affiliation": [
                    {
                        "original_name": "Monash University",
                        "normalized_name": "Monash University",
                        "country": "Australia",
                        "identifiers": {
                            "ror": "https://ror.org/02bfwt286",
                            "GRID": "grid.1002.3"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-01-06",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "1",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2012.0015",
        "identifier": {
            "string_id": "10.1353/dph.2012.0015",
            "id_scheme": "DOI"
        },
        "abstract": "The words emotion and devotion are used as terms of convenience by modern historians when discussing various aspects of late medieval religion. The phrase emotive devotion has been used to describe an affective form of piety, focused on the sufferings of Christ, that is often regarded as the dominant form in fifteenth-century towns. However, if closer attention is paid to late-medieval usage of the terms devotion and emotion (or rather the “passions”) a different picture emerges. This article uses evidence from Bruges, then one of northern Europe’s most important towns, to argue that the “devotion” most favored, at least among those in authority, was one that was tied to social order. Descriptions of rebellion within the town in 1488 are semantically linked to a familiar scholastic discourse regarding the nature of the body and its “passions.” They are also linked to a vocabulary relating to order—and a “devotion” that in this period was specifically connected with “general” or supplicatory processions. The increasing use of this type of procession in the fifteenth century represents a qualitative change in the way that the citizen body was managed by civic authorities in Bruges and, by implication, in other late medieval towns. ",
        "article_title": "Devotion and Emotion: Creating the Devout Body in Late Medieval Bruges",
        "authors": [
            {
                "given": "Andrew",
                "family": "Brown",
                "affiliation": [
                    {
                        "original_name": "Massey University",
                        "normalized_name": "Massey University",
                        "country": "New Zealand",
                        "identifiers": {
                            "ror": "https://ror.org/052czxv31",
                            "GRID": "grid.148374.d"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-01-06",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "1",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2012.0013",
        "identifier": {
            "string_id": "10.1353/dph.2012.0013",
            "id_scheme": "DOI"
        },
        "abstract": "Satan and demonic beings as represented in Latin theological treatises undergo a surprising transformation during the Middle Ages. Initially depicted as impersonal manifestations of a divinely ordained world with labile frontiers between the natural and the supernatural, they become passionate beings, usually portrayed as envious, angry, and vengeful, with a particular animus towards morally upstanding humans. Concomitant with the portrayal of demonic emotion is the development of the first-person conversion narrative. This essay documents the evolution in the portrayal of demonic emotions across two key genres of the Latinate Middle Ages: the first-person life narratives of monks that began to appear in the twelfth century, and collections of miracle narratives from the twelfth to the thirteenth centuries. This progressive “personalization” of supernatural beings offers insight into Milton’s portrayal of Satan in Paradise Lost.",
        "article_title": "Sensitive Spirits: Changing Depictions of Demonic Emotions in the Twelfth and Thirteenth Centuries",
        "authors": [
            {
                "given": "Juanita Feros",
                "family": "Ruys",
                "affiliation": [
                    {
                        "original_name": "ARC Centre of Excellence for the History of Emotions",
                        "normalized_name": null,
                        "country": null,
                        "identifiers": {
                            "ror": null,
                            "GRID": null
                        }
                    },
                    {
                        "original_name": "Medieval and Early Modern Centre, University of Sydney",
                        "normalized_name": "University of Sydney",
                        "country": "Australia",
                        "identifiers": {
                            "ror": "https://ror.org/0384j8v12",
                            "GRID": "grid.1013.3"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-01-06",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "1",
        "issue": "2",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.1353/dph.2013.0000",
        "identifier": {
            "string_id": "10.1353/dph.2013.0000",
            "id_scheme": "DOI"
        },
        "abstract": "Sometime after its creation, the manuscript under investigation, a fifteenth-century Florentine antiphonary, received a remarkable new program of illumination, which included several heraldic devices and other images copied from or inspired by important Florentine works of art. Thus it lost its original liturgical role and was used simply as a canvas to demonstrate a more political and social purpose. This paper does not attempt to explain how this came about, but rather to explore the intricacies of this manuscript's new context. Besides dating its later illumination to the years around 1480, largely by identifying and analyzing the heraldic evidence, I argue that the manuscript must be placed within the humanist circle of Lorenzo de' Medici. By investigating the nuanced political atmosphere in Florence and the relations between wealthy, intellectual families of Lorenzo's circle, I furthermore conclude that Filippo Strozzi commissioned the illumination of this manuscript in order to solidify his political relationship with the Medici, to glorify his family, and to prove its devotion to Florence.",
        "article_title": "The Fisher Antiphonary: A Gilded Window onto the Strozzi and Late Fifteenth-Century Florentine Politics",
        "authors": [
            {
                "given": "Ilana",
                "family": "Krug",
                "affiliation": [
                    {
                        "original_name": "York College of Pennsylvania",
                        "normalized_name": "York College of Pennsylvania",
                        "country": "United States",
                        "identifiers": {
                            "ror": "https://ror.org/02ssn3c97",
                            "GRID": "grid.433833.c"
                        }
                    }
                ]
            }
        ],
        "publisher": "Johns Hopkins University Press",
        "date": "2013-06-30",
        "keywords": null,
        "journal_title": "Digital Philology: A Journal of Medieval Cultures",
        "volume": "2",
        "issue": "1",
        "ISSN": [
            {
                "value": "2162-9552",
                "type": "electronic"
            }
        ]
    }
]