[{"url": "http://dx.doi.org/10.31400/dh-hun.2018.1.126", "identifier": {"string_id": "10.31400/dh-hun.2018.1.126", "id_scheme": "DOI"}, "abstract": "This experimental study is an attempt to explore and test whether, by using current computational linguistics tools for the Hungarian language, it is possible to confirm hypotheses concerning the classification of Dániel Berzsenyi’s (1776-1836) poems drawing on their close reading. The paper also investigates if we can answer questions related to the phoneme theory and practice in Berzsenyi’s poems, which obviously cannot be examined by traditional close reading methods.", "article_title": "The Reading Machine", "authors": [{"given": "Labádi", "family": "Gergely", "affiliation": [{"original_name": "University of Szeged", "normalized_name": "University of Szeged", "country": "Hungary", "identifiers": {"ror": "https://ror.org/01pnej532", "GRID": "grid.9008.1"}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2018-06-04", "keywords": ["Dániel Berzseny, R, Magyarlanc, topic modelling, distant reading"], "journal_title": "Digitális Bölcsészet", "volume": "1", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2018.1.129", "identifier": {"string_id": "10.31400/dh-hun.2018.1.129", "id_scheme": "DOI"}, "abstract": "Born digital content offers a more detailed and complete record of the present than what traditional sources provided of the past. The first section of this paper surveys current efforts and technologies to capture the present digital universe and reflects on the limitations of current web archives. The first attempts to archive the Hungarian web were made in 2017 in the National Széchényi Library, Budapest. The second part explores how this content could be harnessed for historical research, and how it will become the principal source of our recent past. The authors point out how web archives, and the resulting scale of data, will require new strategies and methodologies to deal with born digital sources effectively. They also show that born digital sources will also make it possible to pursue new types of inquiries that yield new results.", "article_title": "Web Archiving and Historical Research", "authors": [{"given": "Kokas", "family": "Károly", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Drótos", "family": "László", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2018-07-16", "keywords": ["web archives, digital preservation, digital humanities, web historiography"], "journal_title": "Digitális Bölcsészet", "volume": "1", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2018.1.152", "identifier": {"string_id": "10.31400/dh-hun.2018.1.152", "id_scheme": "DOI"}, "abstract": "The inscriptions, personal greetings of the album amicorums in the 16th–17th centuries can be seen as remarkable resources for several research projects: philological, historical or biographical data can be identified; as well as the flow of knowledge can be detected. These, autograph books are the early examples of networking, and the set of these citations and signatures, included in these books, offers the possibility to interpret them as a network-model. In my study I would like to analyse the inscriptions of the autograph books between 1500 and 1700 as such a network that includes the owners and the inscriptors of the albums as nodes and the inscriptions as edges, contacts. This analysis would like to experiment with or test the method of network science and network analysis on an early modern corpus. In this study I will answer the questions how these interdisciplinary methods of network analysis could be adaptable to a culture-historical corpus and whether this method could help to reveal new or hidden philological or biographical nuances.", "article_title": "Network Analysis of Album Amicorums in the 16th–17th Centuries", "authors": [{"given": "Markó", "family": "Anita", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2018-06-06", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "1", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2018.1.242", "identifier": {"string_id": "10.31400/dh-hun.2018.1.242", "id_scheme": "DOI"}, "abstract": "Chapter 5 of Macroanalysis: Digital Methods and Literary History demonstrates how computational approaches can be used to explore bibliographic and demographic metadata in order to reassess and postulate new claims about literary history. This chapter demonstrates how thoughtprovoking perspectives on literary periods and trends can be derived from a macroanalysis of book-level metadata – including book titles, author ethnicities, publication years, fictional settings, etc. Utilizing a database of metadata related to Irish-American literature, the author provides a reassessment of common narratives of Irish-American literary history and offers an alternative perspective on Charles Fanning’s theory of a “lost generation” of Irish-American writing. The metadata provide context for understanding Fanning’s reading of literary history and suggest that scholarly assumptions about Irish-American literary history might be based too much on a small sample of books by a homogenous group of authors. More broadly, the chapter argues that traditional literary scholars make a mistake in thinking that large-scale analyses are proposed as a replacement to close reading. On the contrary, a macroanalysis of metadata provides the necessary context for close readings and prompts new questions and new perspectives on literary history.", "article_title": "Metadata", "authors": [{"given": "Matthew L.", "family": "Jockers", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Labádi", "family": "Gergely", "affiliation": [{"original_name": "University of Szeged", "normalized_name": "University of Szeged", "country": "Hungary", "identifiers": {"ror": "https://ror.org/01pnej532", "GRID": "grid.9008.1"}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2018-06-04", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "1", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2018.1.228", "identifier": {"string_id": "10.31400/dh-hun.2018.1.228", "id_scheme": "DOI"}, "abstract": "This article reviews the latest controversies surrounding digital humanities in the United States and summarizes their main arguments. It discusses a set of questions that these controversies raise, starting with the lack of definition as to what criteria need to be met to qualify a project as a digital humanities project. It discusses whether the digital humanities is a methodology or a new branch of scholarship. It argues for the need to develop an infrastructure to support the pursuit of digital humanities projects. It concludes by identifying future implications of digital humanities research for scholarship in the humanities.", "article_title": "Discussions and visions of the digital humanities", "authors": [{"given": "Sennyey", "family": "Pongrácz", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2018-06-04", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "1", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2018.1.234", "identifier": {"string_id": "10.31400/dh-hun.2018.1.234", "id_scheme": "DOI"}, "abstract": "A virtual national library can be distributed among people in arbitrary number of copies. Duplication is the only way of long-term preservation since the last millenials have shown that the durability of text carriers seems to have decreased as the number of copies have grown. Another condition of long-term preservation is that people also use the national cultural heritage to which they have access. This can be facilitated by providing narratives (such as literary history), not solely texts.“Digital philology” follows the classification principles of traditional philology when registering, editing the works and contextualizing them in a narrative. The first milestones of Hungarian digital philology: the repertory of the early modern Hungarian poetry: 1994, the first online critical edition: 1998, the first online Hungarian literary history: 2006. In recent years digital humanities scholars have highlighted hitherto unknown correlations and patterns in literary history thanks to these novel digital editions as well. These correlations are sometimes relevant, sometimes not. My book A vers (The Verse, 1991) foresaw the possibility of a “non-reading” philologist who uses Franco Moretti’s distant reading method.", "article_title": "Digital Humanities in the Virtual National Library", "authors": [{"given": "Horváth", "family": "Iván", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2018-07-12", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "1", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2018.1.232", "identifier": {"string_id": "10.31400/dh-hun.2018.1.232", "id_scheme": "DOI"}, "abstract": "Digitisation methods have significantly evolved in recent years and made it possible for all types of digital humanities projects, among them biographical projects to gain ground. One of the aims of a biographical research is to transform the texts of already digitized encyclopaedias (e.g. the Österreichisches Biographisches Lexikon 1815–1950, ÖBL, which consists of structured and unstructured data) to a machine readable format, and to perform network-, statistical- and computational linguistic analysis on the transformed data. The biographical research of ÖBL started in 2015 in the Institute for Modern and Contemporary Historical Research [Institut für Neuzeit- und Zeitgeschichtsforschung (INZ)] of the Austrian Academy of Sciences within the project Mapping historical networks: Building the new Austrian Prosopographical, Biographical Information System (APIS). The project is aimed at the digital processing of the ÖBL and the creation of a virtual research environment which is implemented in cooperation with the Austrian Center for Digital Humanities (ACDH) and the Institute for Urban and Regional Research [Institut für Stadt- und Regionalforschung (ISR)]. This paper discusses the technical and natural language processing solutions used in the APIS web application to open up biographical data for the researchers by processing and representing them in a structured format.", "article_title": "Digitisation and Network Research", "authors": [{"given": "Lejtovicz", "family": "Katalin", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Schlögl,", "family": "Matthias", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Bernád", "family": "Ágoston Zénó", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Kaiser,", "family": "Maximilian", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Rumpolt,", "family": "Peter Alexander", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2018-07-16", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "1", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2018.1.227", "identifier": {"string_id": "10.31400/dh-hun.2018.1.227", "id_scheme": "DOI"}, "abstract": "The NKFIH-project that seeks to publish the digital edition of Zsigmond Móricz’s (1892–1913) correspondence was launched in 2016 at the Petőfi Literary Museum in Budapest. The project itself has been a huge challenge for the Móricz-research group because they can only partially rely on the earlier paper-based edition. Drawing on the experiences and resolved problems of the first years of the project, this paper focuses on the harmonization and relationship of a museum's programming/IT possibilities, the philological problems and the applied software capacities. As the paper discusses the challenges of an ongoing project, the study does not offer a holistic and comprehensive overview of the entire project, rather a list of problems as encountered along the way and their solutions.", "article_title": "The Digital Critical Edition of the Correspondence of Zsigmond Móricz (1892–1913)", "authors": [{"given": "Kómár", "family": "Éva", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Cséve", "family": "Anna", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Fellegi", "family": "Zsófia", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2018-07-16", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "1", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2018.1.231", "identifier": {"string_id": "10.31400/dh-hun.2018.1.231", "id_scheme": "DOI"}, "abstract": "The Budapest Time Machine (Budapest Időgép, https://hungaricana.hu/hu/budapest-idogep/) is a recent project that offers innovative ways to use historical maps as a research tool. The web service contains overlapping maps from different periods with attached, geospacial, archival materials and photographs. These data present the recent history of Budapest and its geographic dimensions. This study demonstrates novel ways in which this resource can be used for research purposes.", "article_title": "Budapest Time Machine", "authors": [{"given": "Kokas", "family": "Károly", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Biszak", "family": "Sándor", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2018-07-13", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "1", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2018.1.223", "identifier": {"string_id": "10.31400/dh-hun.2018.1.223", "id_scheme": "DOI"}, "abstract": "The paper discusses the use of digital technologies in museums. It introduces various connotations of the concept of the digital museum. A special focus will be placed on the potentials of enhancing the museum visits in space and time and engaging the visitor as an active participant. Fifteen projects of the MOME TechLab are introduced, which have been created in an educational setting as student projects or as commissioned works by the TechLab Fellows collective. All of them have been designed for and in cooperation with cultural heritage institutions, representing a broad range of topics from literature to music and fine arts. They are clustered according to mechanisms and goals, such as surprise and emotional involvement, playful exploration, interactive data visualization, augmenting objects with additional information, assigning active role to visitors to voice opinion, and offering real and virtual tours beyond the walls of the museum. Most of the projects are demonstrated at http://techlab.mome.hu/en. The paper stresses the necessity of interdisciplinary cooperation and the need to scholarly assess the merits of digital installations in museums.", "article_title": "Digital Museum – in the Light of the Projects of MOME TechLab", "authors": [{"given": "Ruttkay", "family": "Zsófia", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2018-07-16", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "1", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2018.1.238", "identifier": {"string_id": "10.31400/dh-hun.2018.1.238", "id_scheme": "DOI"}, "abstract": "The aim of the #BREW-experiment, started in November 2015, was to test the working logic and mechanism of the social media platform designed for sharing images, Instagram. The researchers opted for an immersive, qualitative approach, focusing on the subculture of third wave coffee enthusiasts (including professionals like roasters, cafés and baristas, along with educated connoisseurs and aesthetically oriented fans). Employing tools developed by digital ethnographers but aiming to explore marketing and visual aesthetics as well, the experiment finetunes and relativizes (at the same time adding a new layer to) Lev Manovich's recently published results that were based on cultural analytic methodology involving big data as a source. The result of our research brings novel approaches both in terms of marketing and digital ethnography, creating an interdisciplinary dialogue with the history of photographic aesthetics and anthropology as well.", "article_title": "#BREW: Influencer Experiment in the Third Wave Coffee Community of Instagram", "authors": [{"given": "Dragon", "family": "Zoltán", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Sebestény", "family": "Csilla", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2018-06-04", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "1", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2019.2.282", "identifier": {"string_id": "10.31400/dh-hun.2019.2.282", "id_scheme": "DOI"}, "abstract": "Libraries and librarians can support digital humanists not only by having expertise in identifying objectives and working out ways of realization, informed by library and information science (LIS) but because both the digital humanities and LIS have several themes and issues in common. LIS aims to explore and understand the world of information and its human factors, and the latter is in the focus of digital humanists’ research as well. Besides showcasing these common features, examples of services offered to digital humanists (mainly) in Anglo-American academic libraries are presented in the paper.", "article_title": "Thoughts on the Relationship between Digital Humanities, Library and Information Science and Libraries", "authors": [{"ORCID": "http://orcid.org/0000-0003-0548-7527", "authenticated-orcid": false, "given": "Tibor", "family": "Koltay", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2019-01-01", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "2", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2019.2.336", "identifier": {"string_id": "10.31400/dh-hun.2019.2.336", "id_scheme": "DOI"}, "abstract": "This paper discusses the potentials of the computer assisted analysis of Hungarian historical texts, which relies on the methods of linguistic, literary studies, information technology and statistics. It reviews the characteristics and applicability of different stylometric methods and demonstrates their use by case studies based on Kelemen Mikes’ (1690-1761) works. It examines the relationships between Mikes’ own works and his translations as well as the thematic separation of his works. The case studies highlight that the effectiveness of the stylometric analyses of Mikes’ writings can be improved by applying the digital Mikes’ dictionary.", "article_title": "The Potentials of Stylometry Analysis of Hungarian Historical Text Corpora", "authors": [{"given": "Margit", "family": "Kiss", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2019-01-01", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "2", "issue": null, "ISSN": [{"value": "2630-9696", "type": "print"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2019.2.387", "identifier": {"string_id": "10.31400/dh-hun.2019.2.387", "id_scheme": "DOI"}, "abstract": "While at the end of the 20th century information technology research offered an optimistic vision about the future of the cyber world, where the technology first of all, would help our access to the information and knowledge of humanity, in the early 21st century our cyber world has become Searle’s Chinese room: we have started to lose control over the inputs and outputs, the information, the content, or sometimes even our own private sphere. The first part of the study examines the emergence of various forms of cyberbullying through the „Jung Joon-yung scandal” in the K-pop world. This section analyses different forms of online shaming from cyber-stalking, to sharing of non-consensual pornography, and even the cyber-pillory. The second part of the paper interprets some manifestations of virtual or cyber-love with the help of Baudrillard’s concept of simulacrum. It is more than interesting how similarly the false (or elusive) love of the obsessive fans of Korean pop/TV/movie stars is constructed to that of simulacra, ie. robots and other imaginary heroes. The virtual communication not just simply makes it easier to express our different kinds of human emotions by overcoming some of the factors such as self-reflection that make real communication difficult for us. At the same time, virtual communication simplifies what we say (“dislike”, “love” etc.), but it also influences our way of thinking. We become different human beings by doing things in cyberspace that we would not do in real life. The simulacrum problem is interpreted through different Korean TV-drama-series, as the “I’m not a Robot,” the “Are you human too” and the “W”. The paper concludes with the discussion of some ethical problems concerning the digitized human consciousness.", "article_title": "A Design for Living in the Chinese Room I.", "authors": [{"given": "Tünde", "family": "Tóth", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2019-12-29", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "2", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2019.2.388", "identifier": {"string_id": "10.31400/dh-hun.2019.2.388", "id_scheme": "DOI"}, "abstract": "Europeana, the European digital platform for cultural heritage, has a heterogeneous collection of metadata records ingested from more than 3200 data providers. The original nature and context of these records were different. In order to create effective services upon them we should know the strength and weakness or in other words the quality of these data. This paper proposes a method and an open source implementation to measure some structural features of these data, such as completeness, multilinguality, uniqueness, record patterns, to reveal quality issues.", "article_title": "Measuring completeness as metadata quality metric in Europeana", "authors": [{"given": "Péter", "family": "Király", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Marco", "family": "Büchler", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2019-12-30", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "2", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2019.2.390", "identifier": {"string_id": "10.31400/dh-hun.2019.2.390", "id_scheme": "DOI"}, "abstract": "Literary scholars have deployed the concept of “spoken language” to describe Kálmán Mikszáth’s fiction since the success of his short story collections entitled A tót atyafiak (Slovak Kinsmen, 1881) and A jó palócok (The Good Palots, 1882). Although this stylistic concept has become a key characteristic feature of Mikszáth’s oeuvre, no attempt has been made to elaborate on its definition. As scholarship assumes a clear-cut and measurable distinction between the written “literary” and “spoken” language, this paper claims that this spoken language has quantifiable linguistic markers. This is demonstrated by the morphological analysis of Kálmán Mikszáth and Mór Jókai’s fictional writings.", "article_title": "Machine-readable Literature: ”Spoken Language” in Mikszáth’s Short Stories", "authors": [{"given": "Gergely", "family": "Labádi", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2019-01-01", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "2", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2020.3.443", "identifier": {"string_id": "10.31400/dh-hun.2020.3.443", "id_scheme": "DOI"}, "abstract": "In recent decades, the controversy over distant versus close reading has revolved around the question of scaling. Participants in the debate have either advocated distance (or speed), or have insisted on proximity (or slowness). On a meta-critical level, some have even argued for the need for any reading to be able to shift between, and thus combine, different scales. Very little has been said, however, about the limitations of scaling as such, and the irreducibility of reading to the logic of scales. Starting out from a few intricate formulations by some proponents of close and distant reading, this paper attempts to investigate the potentials and limitations of scaling, first by references to “Stanford” (the university as well as its founder), then by looking into Walter Benjamin’s treatment of film, and finally, though most importantly, by re-reading some passages in Poe’s detective story “The Purloined Letter.” These three points of reference (Stanford, Benjamin, Poe) seem analogous in the way they lay mutual emphasis on both serialization and segmentation, fast and slow motion, or distance and proximity. On a closer (or more distant?) look, however, Poe’s text goes even beyond such a scheme of scaling. It testifies to a logic of detection which surpasses mere zooming-in or zooming-out strategies, and points to a notion of reading that is “escalated” not simply because of its extraordinary range in terms of velocity or distance, but more radically because, although it still binds reading to specific scales, it also has an aspect that is utterly heterogeneous to any logic of scaling. The paper attempts to highlight this radically “escalated” (out-of-scale) aspect of reading.", "article_title": "Escalated Reading", "authors": [{"given": "György", "family": "Fogarasi", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2020-08-24", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "3", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.31400/dh-hun.2020.3.422", "identifier": {"string_id": "10.31400/dh-hun.2020.3.422", "id_scheme": "DOI"}, "abstract": "The paper presents a method of automatic analysis of sound devices by using Attila József’s poems as a case study. The first half of the paper discusses the functions of the program hunpoem_analyzer-TEI, which was developed for the automatic annotation of sound devices and addresses the main steps of the annotation process. The second half of the paper presents different frequency lists of lexical features and sound devices extracted from the annotated corpus.", "article_title": "Automatic Analysis of Sound Devices in Attila József’s Poems", "authors": [{"given": "Péter", "family": "Horváth", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Eotvos Lorand University (ELTE)", "date": "2020-07-15", "keywords": null, "journal_title": "Digitális Bölcsészet", "volume": "3", "issue": null, "ISSN": [{"value": "2630-9696", "type": "electronic"}]}]