[{"url": "http://dx.doi.org/10.1007/s42803-019-00025-5", "identifier": {"string_id": "10.1007/s42803-019-00025-5", "id_scheme": "DOI"}, "abstract": "The paper describes the special interest among historians in scholarly editing and the resulting editorial practice in contrast to the methods applied by pure philological textual criticism. The interest in historical ‘facts’ suggests methods the goal of which is to create formal representations of the information conveyed by the text in structured databases. This can be achieved with RDF representations of statements extracted from the text, by automatic information extraction methods, or by hand. The paper suggests the use of embedded RDF representations in TEI markup, following the practice in several recent projects, and it concludes with a proposal for a definition of the ‘assertive edition’.", "article_title": "The ‘assertive edition’", "authors": [{"given": "Georg", "family": "Vogeler", "affiliation": [{"original_name": "Zentrum für Informationsmodellierung, Universität Graz, Graz, Austria", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-5-11", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00023-7", "identifier": {"string_id": "10.1007/s42803-019-00023-7", "id_scheme": "DOI"}, "abstract": "The article presents a model for annotating textual variants. The annotations made can be queried in order to analyse and find patterns in textual variation. The model is flexible, allowing scholars to set the boundaries of the readings, to nest or concatenate variation sites, and to annotate each pair of readings; furthermore, it organizes the characteristics of the variants in features of the readings and features of the variation. After presenting the conceptual model and its applications in a number of case studies, this article introduces two implementations in logical models: namely, a relational database schema and an OWL 2 ontology. While the scope of this article is a specific issue in textual criticism, its broader focus is on how data is structured and visualized in digital scholarly editing.", "article_title": "Exercises in modelling: textual variants", "authors": [{"given": "Elena", "family": "Spadini", "affiliation": [{"original_name": "Centre des littératures en Suisse romande, University of Lausanne, Lausanne, Switzerland", "normalized_name": "University of Lausanne", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/019whta54", "GRID": "grid.9851.5"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-5-30", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00021-9", "identifier": {"string_id": "10.1007/s42803-019-00021-9", "id_scheme": "DOI"}, "abstract": "This is a history of and a technical report on the Charles Harpur Critical Archive (CHCA), which has been in preparation since 2009. Harpur was a predominantly newspaper poet in colonial New South Wales from the 1830s to the 1860s. Approximately 2700 versions of his 700 poems in newspaper and manuscript form have been recovered. In order to manage the complexity of his often heavily revised manuscripts, traditional encoding in XML-TEI, with its known difficulties in handling overlapping structures and complex revisions, was rejected. Instead, the transcriptions were split into simplified versions and layers of revision. Markup describing textual formats was stored externally using properties that may freely overlap. Both markup and the versions and layers were merged into multi-version documents (MVDs) to facilitate later comparison, editing and searching. This reorganisation is generic in design and should be reusable in other editorial projects.", "article_title": "The Charles Harpur Critical Archive", "authors": [{"given": "Desmond", "family": "Schmidt", "affiliation": [{"original_name": "Queensland University of Technology, Brisbane, Australia", "normalized_name": "Queensland University of Technology", "country": "Australia", "identifiers": {"ror": "https://ror.org/03pnv4752", "GRID": "grid.1024.7"}}]}, {"given": "Paul", "family": "Eggert", "affiliation": [{"original_name": "Loyola University Chicago, Chicago, USA", "normalized_name": "Loyola University Chicago", "country": "United States", "identifiers": {"ror": "https://ror.org/04b6x2g63", "GRID": "grid.164971.c"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-5-16", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00018-4", "identifier": {"string_id": "10.1007/s42803-019-00018-4", "id_scheme": "DOI"}, "abstract": "Building on a longstanding terminological discussion in the field of textual scholarship, this essay explores the archival and editorial potential of the digital scholarly edition. Following Van Hulle and Eggert, the author argues that in the digital medium these traditionally distinct activities now find the space they need to complement and reinforce one another. By critically examining some of the early and more recent theorists and adaptors of this relatively new medium, the essay aims to shed a clearer light on some of its strengths and pitfalls. To conclude, the essay takes the discussion further by offering a broader reflection on the difficulties of providing a ‘definitive’ archival base transcription of especially handwritten materials, questioning if this should be something to aspire to for the edition in the first place.", "article_title": "On edited archives and archived editions", "authors": [{"given": "Wout", "family": "Dillen", "affiliation": [{"original_name": "Centre for Manuscript Genetics, University of Antwerp, Antwerp, Belgium", "normalized_name": "University of Antwerp", "country": "Belgium", "identifiers": {"ror": "https://ror.org/008x57b05", "GRID": "grid.5284.b"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-4-29", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00014-8", "identifier": {"string_id": "10.1007/s42803-019-00014-8", "id_scheme": "DOI"}, "abstract": "Online book discussion is a popular activity on weblogs, specialized book discussion sites, booksellers’ sites and elsewhere. These discussions are important for research into literary reception and should be made and kept accessible for researchers. This article asks what an archive of online book discussion should and could look like, and how we could describe such an archive in terms of some of the central concepts of textual scholarship: work, document, text, transcription and variant. What could an approach along the lines of textual scholarship mean for such a collection? If such a collection holds many pieces of information that would not usually be considered text (such as demographic information about contributors), could we still call such a collection an edition, and could we call editing the activity of preparing such a collection?The article introduces some of the relevant (Dutch-language) sites, and summarizes their properties (among others: they are dynamic and vulnerable, they contain structured data and are very large) from the perspective of creating a research collection. It discusses the interpretation of some essential terms of textual studies in this context, and briefly lists a number of components that a digital edition of these sites might or should contain. It argues that such a collection is the result of scholarly work and should not be considered as 'just' a web archive.", "article_title": "Editing social media: the case of online book discussion", "authors": [{"given": "Peter", "family": "Boot", "affiliation": [{"original_name": "Huygens Institute for the History of the Netherlands, Amsterdam, The Netherlands", "normalized_name": "Huygens Institute for the History of the Netherlands", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/04x6kq749", "GRID": "grid.450092.a"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-5-22", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00013-9", "identifier": {"string_id": "10.1007/s42803-019-00013-9", "id_scheme": "DOI"}, "abstract": "Dealing with documents that have changed through time requires keeping track of additional metadata, for example the order of the revisions. This small issue explodes in complexity when these documents are translated. Even more complicate is keeping track of the parallel evolution of a document and its translations. The fact that this extra metadata has to be encoded in formal terms in order to be processed by computers has forced us to reflect on issues that are usually overlooked or, at least, not actively discussed and documented: How do I record which document is a translation of which? How do I record that this document is a translation of that specific revision of another document? And what if a certain translation has been created using one or more intermediate translations with no access to the original document? In this paper we addresses all these issues, starting from first principles and incrementally building towards a comprehensive solution. This solution is then distilled in terms of formal concepts (e.g., translation, abstraction levels, comparability, division in parts, addressability) and abstract data structures (e.g., derivation graphs, revisions-alignment tables, source-document tables, source-part tables). The proposed data structures can be seen as a generalization of the classical evolutionary trees (e.g., stemma codicum), extended to take into account the concepts of translation and contamination (i.e., multiple sources). The presented abstract data structures can easily be implemented in any programming language and customized to fit the specific needs of a research project.", "article_title": "Tracking the evolution of translated documents: revisions, languages and contaminations", "authors": [{"given": "Gioele", "family": "Barabucci", "affiliation": [{"original_name": "Cologne Center for eHumanities, Universität zu Köln, Köln, Germany", "normalized_name": "University of Cologne", "country": "Germany", "identifiers": {"ror": "https://ror.org/00rcxh774", "GRID": "grid.6190.e"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-6-28", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00024-6", "identifier": {"string_id": "10.1007/s42803-019-00024-6", "id_scheme": "DOI"}, "abstract": "3D (re)constructions of heritage sites and Digital Scholarly Editions face similar needs and challenges and have many concepts in common, although they are expressed differently. 3D (re)constructions, however, lack a framework for addressing them. The goal of this article is not to create a single or the lowest common denominator to which both DSEs and 3D models subscribe, nor is it to reduce 3D to one scholarly editing tradition. It is rather to problematise the development of a model by borrowing concepts and values from editorial scholarship in order to enable public-facing 3D scholarship to be read in the same way that scholarly editions are by providing context, transmission history, and transparency of the editorial method/decision-making process.", "article_title": "Textuality in 3D: three-dimensional (re)constructions as digital scholarly editions", "authors": [{"given": "Susan", "family": "Schreibman", "affiliation": [{"original_name": "Department of Literature & Art, Faculty of Arts and Social Sciences, Maastricht Uiversity, Maastricht, The Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Costas", "family": "Papadopoulos", "affiliation": [{"original_name": "Department of Literature & Art, Faculty of Arts and Social Sciences, Maastricht Uiversity, Maastricht, The Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-5-14", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00019-3", "identifier": {"string_id": "10.1007/s42803-019-00019-3", "id_scheme": "DOI"}, "abstract": "Digital scholarly editions are expensive to make and to maintain. As such, they prove unattainable for less established scholars like early careers and PhD students, or indeed anyone without access to significant funding. One solution could be to create tools and platforms able to provide a publishing framework for digital scholarly editions that requires neither a high-tech skillset nor big investment. I call this type of edition “Prêt-à-Porter”, to be distinguished from “haute couture” editions which are tailored to the specific needs of specific scholars. I argued that both types of editions are necessary for a healthy scholarly environment.", "article_title": "What future for digital scholarly editions? From Haute Couture to Prêt-à-Porter", "authors": [{"given": "Elena", "family": "Pierazzo", "affiliation": [{"original_name": "Université Grenoble Alpes – LUHCIE, Grenoble, France", "normalized_name": "Grenoble Alpes University", "country": "France", "identifiers": {"ror": "https://ror.org/02rx3b187", "GRID": "grid.450307.5"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-5-1", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00017-5", "identifier": {"string_id": "10.1007/s42803-019-00017-5", "id_scheme": "DOI"}, "abstract": "The concepts of original and copy, of source and facsimile, always convey particular understandings of the process of reproducing documents. This essay is an analysis of these concepts, in particular copies and facsimiles, framed within the context of digital reproduction. The activities and cases discussed are picked from two areas: digital scholarly editing and cultural heritage digitization performed by research libraries. The conceptual analysis draws on three fields of scholarly inquiry: scholarly editing, library and information science, and philosophical aesthetics.", "article_title": "Copies and facsimiles", "authors": [{"given": "Mats", "family": "Dahlström", "affiliation": [{"original_name": "Swedish School of Library and Information Science, University of Borås, Borås, Sweden", "normalized_name": "University of Borås", "country": "Sweden", "identifiers": {"ror": "https://ror.org/01fdxwh83", "GRID": "grid.412442.5"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-5-8", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00016-6", "identifier": {"string_id": "10.1007/s42803-019-00016-6", "id_scheme": "DOI"}, "abstract": "This article argues that editors of scholarly digital editions should not be distracted by underlying technological concerns except when these concerns affect the editorial tasks at hand. It surveys issues in the creation of scholarly digital editions and the open licensing of resources and addresses concerns about underlying data models and vocabularies, such as the Guidelines of the Text Encoding Initiative. It calls for solutions which promote the collaborative creation, annotation, and publication of scholarly digital editions. The article draws a line between issues with which editors of scholarly digital editions should concern themselves and issues which may only prove to be distractions.", "article_title": "Opening the book: data models and distractions in digital scholarly editing", "authors": [{"given": "James", "family": "Cummings", "affiliation": [{"original_name": "Newcastle University, Newcastle upon Tyne, UK", "normalized_name": "University of Newcastle Australia", "country": "Australia", "identifiers": {"ror": "https://ror.org/00eae9z71", "GRID": "grid.266842.c"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-5-16", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00015-7", "identifier": {"string_id": "10.1007/s42803-019-00015-7", "id_scheme": "DOI"}, "abstract": "In the context of a specific hybrid project—a digital archive and a print edition of the complete works of American writer Charles W. Chesnutt (1858–1932)--we consider three issues: (1) the value of print editions, notwithstanding the flexibility, capaciousness, and accessibility of digital editions; (2) the distinct affordances of digital editing in general and in this case; and (3) the challenges of a hybrid approach, and the possiblility of supplementing the now standard digital approach to rendering paper manuscripts (high quality scans and TEI-compliant transcriptions) with approaches borrowed from print and print aesthetics.", "article_title": "Charles Chesnutt and the case for hybrid editing", "authors": [{"given": "Stephanie P.", "family": "Browner", "affiliation": [{"original_name": "Literary Studies, The New School, New York, USA", "normalized_name": "New School", "country": "United States", "identifiers": {"ror": "https://ror.org/02tvcev59", "GRID": "grid.264933.9"}}]}, {"given": "Kenneth M.", "family": "Price", "affiliation": [{"original_name": "Department of English, University of Nebraska-Lincoln, Lincoln, USA", "normalized_name": "University of Nebraska–Lincoln", "country": "United States", "identifiers": {"ror": "https://ror.org/043mer456", "GRID": "grid.24434.35"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-5-3", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00012-w", "identifier": {"string_id": "10.1007/s42803-019-00012-w", "id_scheme": "DOI"}, "abstract": "The technological developments in the field of textual scholarship lead to a renewed focus on textual variation. Variants are liberated from their peripheral place in appendices or footnotes and are given a more prominent position in the (digital) edition of a work. But what constitutes an informative and meaningful visualisation of textual variation? The present article takes visualisation of the result of collation software as point of departure, examining several visualisations of collation output that contains a wealth of information about textual variance. The newly developed collation software HyperCollate is used as a touchstone to study the issue of representing textual information to advance literary research. The article concludes with a set of recommendations in order to evaluate different visualisations of collation output.", "article_title": "From graveyard to graph", "authors": [{"given": "Elli", "family": "Bleeker", "affiliation": [{"original_name": "Research and Development – KNAW Humanities Cluster, Amsterdam, Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Bram", "family": "Buitendijk", "affiliation": [{"original_name": "Research and Development – KNAW Humanities Cluster, Amsterdam, Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Ronald", "family": "Haentjens Dekker", "affiliation": [{"original_name": "Research and Development – KNAW Humanities Cluster, Amsterdam, Netherlands", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-6-19", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00020-w", "identifier": {"string_id": "10.1007/s42803-019-00020-w", "id_scheme": "DOI"}, "abstract": "This special issue on Digital Scholarly Editing introduces several new developments, both in terms of the theory and practice of textual scholarship that are taking shape in the digital medium. But instead of enumerating or summarizing them, this introduction is meant as a reflection on some of the possible ways in which our work in digital scholarly editing could be useful to the broader field of digital humanities. After all, we tend to work on a microscale compared to the forms of macroanalysis and ‘distant’ reading that are currently dominant in digital literary studies. This raises the question: how can our research be relevant to these other sub-disciplines in digital humanities?", "article_title": "Artificial imagination, imagine: new developments in digital scholarly editing", "authors": [{"given": "Dirk", "family": "Van Hulle", "affiliation": [{"original_name": "Department of Literature, University of Antwerp, Antwerp, Belgium", "normalized_name": "University of Antwerp", "country": "Belgium", "identifiers": {"ror": "https://ror.org/008x57b05", "GRID": "grid.5284.b"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-4-25", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "2", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00010-y", "identifier": {"string_id": "10.1007/s42803-019-00010-y", "id_scheme": "DOI"}, "abstract": "Web 25. Histories from the first 25 years of the world wide web, edited by Niels Brügger, is part of the Digital Formations series. Brügger’s collection takes the challenge of placing the (hi)story of the World Wide Web in a critical perspective seriously. The volume seeks to foster those working in web archiving, internet studies or web historiography to undertake innovative, cross-disciplinary research. The editor has brought together authors who collectively have contributed to a book that is a valuable addition to the emerging scholarship surrounding the study of the web and the web’s history. The book, divided in four sections, comprises ‘a number of probes into the vast and multifaceted past of the web’ (xi). However, the volume is neither designed to be exhaustive, nor comprehensive. It is broad in scope in relation to a number of aspects: (i) its variety of topics, (ii) its combination of case studies and methodological reflections and (iii) the compilation of chapters focusing on national as well as international WWW phenomena.", "article_title": "Web 25. Histories from the first 25 years of the world wide web", "authors": [{"given": "Peter", "family": "Mechant", "affiliation": [{"original_name": "imec-mict-Ghent University, Ghent, Belgium", "normalized_name": "Ghent University", "country": "Belgium", "identifiers": {"ror": "https://ror.org/00cv9y106", "GRID": "grid.5342.0"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-2-25", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "1", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00008-6", "identifier": {"string_id": "10.1007/s42803-019-00008-6", "id_scheme": "DOI"}, "abstract": "The way researchers in the arts and humanities disciplines work has changed significantly. Research can no longer be done in isolation as an increasing number of digital tools and certain types of knowledge are required to deal with research material. Research questions are scaled up and we see the emergence of new infrastructures to address this change. The DigitAl Research Infrastructure for the Arts and Humanities (DARIAH) is an open international network of researchers within the arts and humanities community, which revolves around the exchange of experiences and the sharing of expertise and resources. These resources comprise not only of digitised material, but also a wide variety of born-digital data, services and software, tools, learning and teaching materials. The sustaining, sharing and reuse of resources involves many different parties and stakeholders and is influenced by a multitude of factors in which research infrastructures play a pivotal role. This article describes how DARIAH tries to meet the requirements of researchers from a broad range of disciplines within the arts and humanities that work with (born-)digital research data. It details approaches situated in specific national contexts in an otherwise large heterogeneous international scenario and gives an overview of ongoing efforts towards a convergence of social and technical aspects.", "article_title": "A landscape of data – working with digital resources within and beyond DARIAH", "authors": [{"given": "Tibor", "family": "Kálmán", "affiliation": [{"original_name": "Gesellschaft für wissenschaftliche Datenverarbeitung mbh Göttingen (GWDG), Göttingen, Germany", "normalized_name": "Gesellschaft für wissenschaftliche Datenverarbeitung mbH Göttingen", "country": "Germany", "identifiers": {"ror": "https://ror.org/00cd95c65", "GRID": "grid.434972.f"}}]}, {"given": "Matej", "family": "Ďurčo", "affiliation": [{"original_name": "Austrian Academy of Sciences, Vienna, Austria", "normalized_name": "Austrian Academy of Sciences", "country": "Austria", "identifiers": {"ror": "https://ror.org/03anc3s24", "GRID": "grid.4299.6"}}]}, {"given": "Frank", "family": "Fischer", "affiliation": [{"original_name": "National Research University Higher School of Economics, Moscow, Russian Federation", "normalized_name": "National Research University Higher School of Economics", "country": "Russia", "identifiers": {"ror": "https://ror.org/055f7t516", "GRID": "grid.410682.9"}}]}, {"given": "Nicolas", "family": "Larrousse", "affiliation": [{"original_name": "CNRS, Paris, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Claudio", "family": "Leone", "affiliation": [{"original_name": "Göttingen State and University Library, Göttingen, Germany", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Karlheinz", "family": "Mörth", "affiliation": [{"original_name": "Austrian Academy of Sciences, Vienna, Austria", "normalized_name": "Austrian Academy of Sciences", "country": "Austria", "identifiers": {"ror": "https://ror.org/03anc3s24", "GRID": "grid.4299.6"}}]}, {"given": "Carsten", "family": "Thiel", "affiliation": [{"original_name": "Göttingen State and University Library, Göttingen, Germany", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-4-3", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "1", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00007-7", "identifier": {"string_id": "10.1007/s42803-019-00007-7", "id_scheme": "DOI"}, "abstract": "The aim of this article is to provide an exploratory analysis of the landscape of web archiving activities in Europe. Our contribution, based on desk research, and complemented with data from interviews with representatives of European heritage institutions, provides a descriptive overview of the state-of-the-art of national web archiving in Europe. It is written for a broad interdisciplinary audience, including cultural heritage professionals, IT specialists and managers, and humanities and social science researchers. The legal, technical and operational aspects of web archiving and the value of web archives as born-digital primary research resources are both explored. In addition to investigating the organisations involved and the scope of their web archiving programmes, the curatorial aspects of the web archiving process, such as selection of web content, the tools used and the provision of access and discovery services are also considered. Furthermore, general policies related to web archiving programmes are analysed. The article concludes by offering four important issues that digital scholars should consider when using web archives as a historical data source. Whilst recognising that this study was limited to a sample of only nine web archives, this article can nevertheless offer some useful insights into the technical, legal, curatorial and policy-related aspects of web archiving. Finally, this paper could function as a stepping stone for more extensive and qualitative research.", "article_title": "Web archives as a data resource for digital scholars", "authors": [{"given": "Eveline", "family": "Vlassenroot", "affiliation": [{"original_name": "imec-mict-UGent, Ghent, Belgium", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Sally", "family": "Chambers", "affiliation": [{"original_name": "Ghent Centre for Digital Humanities, UGent, Ghent, Belgium", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Emmanuel", "family": "Di Pretoro", "affiliation": [{"original_name": "URF-SID, Haute École Bruxelles-Brabant, Bruxelles, Belgium", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Friedel", "family": "Geeraert", "affiliation": [{"original_name": "Royal Library and State Archives of Belgium, Brussel, Belgium", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Gerald", "family": "Haesendonck", "affiliation": [{"original_name": "Department of Electronics and Information Systems, Ghent University - imec – IDLab, Ghent, Belgium", "normalized_name": "Ghent University", "country": "Belgium", "identifiers": {"ror": "https://ror.org/00cv9y106", "GRID": "grid.5342.0"}}]}, {"given": "Alejandra", "family": "Michel", "affiliation": [{"original_name": "NADI/CRIDS, UNamur, Namur, Belgium", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Peter", "family": "Mechant", "affiliation": [{"original_name": "imec-mict-UGent, Ghent, Belgium", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-3-8", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "1", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00006-8", "identifier": {"string_id": "10.1007/s42803-019-00006-8", "id_scheme": "DOI"}, "abstract": "Over the last two decades publishing and distributing content on the Web has become a core part of society. This ephemeral content has rapidly become an essential component of the human record. Writing histories of the late 20th and early 21st century will require engaging with web archives. The scale of web content and of web archives presents significant challenges for how research can access and engage with this material. Digital humanities scholars are advancing computational methods to work with corpora of millions of digitized resources, but to fully engage with the growing content of two decades of web archives, we now require methods to approach and examine billions, ultimately trillions, of incongruous resources. This article approaches one seemingly insignificant, but fundamental, aspect in web design history: the use of tiny transparent images as a tool for layout design, and surfaces how traces of these files can illustrate future paths for engaging with web archives. This case study offers implications for future methods allowing scholars to engage with web archives. It also prompts considerations for librarians and archivists in thinking about web archives as data and the development of systems, qualitative and quantitative, through which to make this material available.", "article_title": "The invention and dissemination of the spacer gif: implications for the future of access and use of web archives", "authors": [{"given": "Trevor", "family": "Owens", "affiliation": [{"original_name": "U.S. Library of Congress, Washington, DC, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Grace Helen", "family": "Thomas", "affiliation": [{"original_name": "U.S. Library of Congress, Washington, DC, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-4-5", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "1", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00005-9", "identifier": {"string_id": "10.1007/s42803-019-00005-9", "id_scheme": "DOI"}, "abstract": "The Media Archaeology Lab (MAL) at the University of Colorado at Boulder (U.S.A.) acts as both an archive and a site for what the authors describe as ‘anarchival’ practice-based research and research creation. ‘Anarchival’ indicates research and creative activity enacted as a complement to an existing, stable archive. In researching the One Laptop Per Child Initiative, by way of a donation of XO laptops, the MAL has devised a modular process which could be used by other research groups to investigate the gap between the intended use and the affordances of any given piece of technology.", "article_title": "Anarchive as technique in the Media Archaeology Lab | building a one Laptop Per Child mesh network", "authors": [{"given": "libi", "family": "striegl", "affiliation": [{"original_name": "Intermedia Arts, Writing, and Performance Program, University of Colorado at Boulder, Boulder, USA", "normalized_name": "University of Colorado Boulder", "country": "United States", "identifiers": {"ror": "https://ror.org/02ttsq026", "GRID": "grid.266190.a"}}]}, {"given": "Lori", "family": "Emerson", "affiliation": [{"original_name": "Department of English and Intermedia Arts, Writing, and Performance Program, University of Colorado at Boulder, Boulder, USA", "normalized_name": "University of Colorado Boulder", "country": "United States", "identifiers": {"ror": "https://ror.org/02ttsq026", "GRID": "grid.266190.a"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-4-1", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "1", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00003-x", "identifier": {"string_id": "10.1007/s42803-019-00003-x", "id_scheme": "DOI"}, "abstract": "The impact of New Technologies on writing proccess is not new at all. This digital revolution first resulted in the appearance of new text formats and the development of an ad hoc literary theory. In Angloamerican area, this revolution made philologists and patrimonial institutions reflect on the necessity of developing formats of study, edition and perennial conservation of these new formats of digital texts. What is the reason for such a delay in these disciplines that can be observed in Europe? Why can we say that digital forensics and media archaeology (Kirschenbaum) are not trasnational disciplines? In this paper, I assess the impact in Europe and in Angloamerican area of .Txtual condition. Moreover, I make a contrast between these conclusions and the answers given by three emblematic writers of the ‘new Spanish narrative’ to a survey about ways of managing and preserving digital files.", "article_title": "The .txtual condition, .txtual criticism and .txtual scholarly editing in Spanish philology", "authors": [{"ORCID": "http://orcid.org/0000-0002-9022-2699", "authenticated-orcid": false, "given": "Bénédicte", "family": "Vauthier", "affiliation": [{"original_name": "Institut für spanische Sprache und Literaturen, Universität Bern (Schweiz), Bern, Switzerland", "normalized_name": "University of Bern", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02k7v4d05", "GRID": "grid.5734.5"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-3-5", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "1", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00002-y", "identifier": {"string_id": "10.1007/s42803-019-00002-y", "id_scheme": "DOI"}, "abstract": "The field of digital forensics seems at first glance quite separate from archival work and digital preservation. However, professionals in both fields are trusted to attest to the identity and integrity of digital documents and traces – they are regarded as experts in the acquisition, interpretation, description and presentation of that material. Archival science and digital forensics evolved out of practice and grew into established professional disciplines by developing theoretical foundations, which then returned to inform and standardize that practice. They have their roots in legal requirements and law enforcement. A significant challenge to both fields, therefore, is the identification of records (archival focus) and evidence (digital forensics focus) in digital systems, establishing their contexts, provenance, relationships, and meaning. This paper traces the development of digital forensics from practice to theory and presents the parallels with archival science.", "article_title": "From time theft to time stamps: mapping the development of digital forensics from law enforcement to archival authority", "authors": [{"given": "Corinne", "family": "Rogers", "affiliation": [{"original_name": "School of Library, Archival and Information Studies, University of British Columbia, Vancouver, Canada", "normalized_name": "University of British Columbia", "country": "Canada", "identifiers": {"ror": "https://ror.org/03rmrcq20", "GRID": "grid.17091.3e"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-3-4", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "1", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.1007/s42803-019-00011-x", "identifier": {"string_id": "10.1007/s42803-019-00011-x", "id_scheme": "DOI"}, "abstract": "The first special issue of International Journal of Digital Humanities (IJDH) is about born-digital archives, their preservation and research perspectives involving born-digital primary records in the humanities. This is not only a result of the collaboration between the journal’s editor-in-chief, Gábor Palkó, Co-Director of the Centre for Digital Humanities at the Eötvös University, who is interested in the practice and theory of digital archives, and the editor of this volume, Thorsten Ries, who conducts research on born-digital dossiers génétiques with digital forensic methods at Ghent University. It is also meant to be a programmatic call to intensify cross-sectoral collaboration between galleries, libraries, archives, and museums (GLAM institutions), digital preservation projects, and humanities research working with digital primary sources.", "article_title": "Born-digital archives", "authors": [{"given": "Thorsten", "family": "Ries", "affiliation": [{"original_name": "Ghent University, Ghent, Belgium", "normalized_name": "Ghent University", "country": "Belgium", "identifiers": {"ror": "https://ror.org/00cv9y106", "GRID": "grid.5342.0"}}]}, {"given": "Gábor", "family": "Palkó", "affiliation": [{"original_name": "University of Sussex, Brighton, UK", "normalized_name": "University of Sussex", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00ayhx656", "GRID": "grid.12082.39"}}]}], "publisher": "Springer Science and Business Media LLC", "date": "2019-3-25", "keywords": null, "journal_title": "International Journal of Digital Humanities", "volume": "1", "issue": "1", "ISSN": [{"value": "2524-7832", "type": "print"}, {"value": "2524-7840", "type": "electronic"}]}]