[
  {
    "url": "http://dx.doi.org/10.17928/jjadh.1.1_107",
    "identifier": {
      "string_id": "10.17928/jjadh.1.1_107",
      "id_scheme": "DOI"
    },
    "abstract": "The Collaborative EuropeaN Digital Archival Research Infrastructure (CENDARI) project has developed a new virtual environment for humanities research, reimagining the analogue landscape of research sources for medieval and modern history and humanities research infrastructure models for the digital age. To achieve this, the project has needed to be sensitive to the ways in which historical research practices in the 21st Century are distinct from those of earlier eras, harnessing the affordances of technology to reveal connections and support or refute hypotheses, enabling transnational approaches, and federating sources beyond the well-known and across the largely national organization paradigms that dominate within traditional knowledge infrastructures (libraries, archives and museums). This paper describes both the user-centered development methodology deployed by the project and the resulting technical architecture adopted to meet these challenging requirements. The resulting system is a robust ‘enquiry environment’ able to integrate a variety of data types and standards with bespoke tools for the curation, annotation, communication and validation of historical insight.",
    "article_title": "The Taste of “Data Soup” and the Creation of a Pipeline for Transnational Historical Research",
    "authors": [
      {
        "given": "Jennifer",
        "family": "Edmond",
        "affiliation": [
          {
            "original_name": "Faculty of Arts Humanities and Social Sciences and Trinity Long Room Hub, Trinity College Dublin",
            "normalized_name": "Trinity College Dublin",
            "country": "Ireland",
            "identifiers": {
              "ror": "https://ror.org/02tyrky19",
              "GRID": "grid.8217.c"
            }
          }
        ]
      },
      {
        "given": "Natasa",
        "family": "Bulatovic",
        "affiliation": [
          {
            "original_name": "Max Planck Digital Library",
            "normalized_name": "Max Planck Digital Library",
            "country": "Germany",
            "identifiers": {
              "ror": "https://ror.org/0061msm67",
              "GRID": "grid.431460.4"
            }
          }
        ]
      },
      {
        "given": "Alexander",
        "family": "O'Connor",
        "affiliation": [
          {
            "original_name": "ADAPT Centre, KDEG, School of Computer Science & Statistics, Trinity College Dublin",
            "normalized_name": "Trinity College Dublin",
            "country": "Ireland",
            "identifiers": {
              "ror": "https://ror.org/02tyrky19",
              "GRID": "grid.8217.c"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2015",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "1",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.1.1_86",
    "identifier": {
      "string_id": "10.17928/jjadh.1.1_86",
      "id_scheme": "DOI"
    },
    "abstract": "This paper describes a knowledge based character processing model to resolve some problems of coded character model. Currently, in the field of information processing of digital texts, each character is represented and processed by the “Coded Character Model.” In this model, each character is defined and shared using a coded character set (code) and represented by a code-point (integer) of the code. In other words, when knowledge about characters is defined (standardized) in a specification of a coded character set, then there is no need to store large and detailed knowledge about characters into computers for basic text processing. In terms of flexibility, however, the coded character model has some problems, because it assumes a finite set of characters, with each character of the set having a stable concept shared in the community. However, real character usage is not so static and stable. Especially in Chinese characters, it is not so easy to select a finite set of characters which covers all usages. To resolve these problems, we have proposed the “Chaon” model. This is a new model of character processing based on character ontology. This report briefly describes the Chaon model and the CHISE (Character Information Service Environment) project, and focuses on how to represent Chinese characters and their glyphs in the context of multiple unification rules.",
    "article_title": "Multiple-policy Character Annotation based on CHISE",
    "authors": [
      {
        "given": "Tomohiko",
        "family": "Morioka",
        "affiliation": [
          {
            "original_name": "Kyoto University",
            "normalized_name": "Kyoto University",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/02kpeqv85",
              "GRID": "grid.258799.8"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2015",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "1",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.1.1_68",
    "identifier": {
      "string_id": "10.17928/jjadh.1.1_68",
      "id_scheme": "DOI"
    },
    "abstract": "This paper introduces the idea of data sharing strategy based on a conversion service, not on a sharing application, scheme, or ontology, that are dominant in proposals for language documentation. Although these three methods have been basic tactics for sharing corpora, they have a conceptual flaw in terms of descriptive linguistics. In this paper we report the results of a previous project - the LingDy project, and propose a basic concept for corpus sharing strategy to support personal diachronic data sharing. This paper is a revised version of a handout at JADH2012, so readers should be careful that this content is based on results at the time of 2012.",
    "article_title": "Corpus Sharing Strategy for Descriptive Linguistics",
    "authors": [
      {
        "given": "Kazushi",
        "family": "Ohya",
        "affiliation": [
          {
            "original_name": "Tsurumi University",
            "normalized_name": "Tsurumi University",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/04j8wth34",
              "GRID": "grid.412816.8"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2015",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "1",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.1.1_58",
    "identifier": {
      "string_id": "10.17928/jjadh.1.1_58",
      "id_scheme": "DOI"
    },
    "abstract": "Printed books are finished products once published. Digital editions, on the other hand, may have an eternal life as updateable items, at least as archives. Since the work on digital editions started in the different Nordic countries more than 20 years ago, a consensus or convergence of practice seems to have grown in the planning and development of digital scholarly editions in the Nordic countries (here defined as Denmark, Finland, Norway, and Sweden; for Finnish editions, especially those based on material written in Swedish) (Dahlström and Ore 2013). Whereas it is possible to find some examples of similar developments in other countries or continents, it seems that there are remarkable similarities between the Nordic countries. In this paper I want to discuss what factors have contributed to this situation, and to illustrate them by presenting some fairly recent digital editions from Nordic countries.",
    "article_title": "A Nordic Tradition for Digital Scholarly Editions?",
    "authors": [
      {
        "given": "Espen S.",
        "family": "Ore",
        "affiliation": [
          {
            "original_name": "Dept. of Linguistics and Scandinavian Studies, Unit for Digital Documentation, University of Oslo",
            "normalized_name": "University of Oslo",
            "country": "Norway",
            "identifiers": {
              "ror": "https://ror.org/01xtthb56",
              "GRID": "grid.5510.1"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2015",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "1",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.1.1_44",
    "identifier": {
      "string_id": "10.17928/jjadh.1.1_44",
      "id_scheme": "DOI"
    },
    "abstract": "To support the automatic semantic analysis of texts in the humanities, it is not sufficient to analyze words and evaluate word pairs, because it is necessary to process larger units, such as phrases, sentences, and paragraphs. This study proposes the introduction of intratextuality into a digital archive system. In the future, this method will be developed as the basis for semantic analysis of larger units. Classical literary structures that are used frequently in the Old and New Testaments were digitized as a case study. A literary structure data format for a relational database was also implemented. The literary structures of 39 books in the Old Testament and 27 books in the New Testament were digitized. The total number of digitized literary structures was 1,507 and the elements of these structures comprised 7,715 pairs. These data were stored in a Java-based relational database system and a web-based viewer program for rhetorical structures was implemented as a JSP servlet. This web-based program will be combined with an existing digital archive system that can manage intertextuality data. The Java-based relational database system and the JSP servlet will facilitate numerical analyses of the intertextuality and intratextuality of digital archive systems of classical texts, thus making it much easier to conduct scientific analyses of the meanings of texts.",
    "article_title": "Database System for Archiving the Literary Structure of the Bible",
    "authors": [
      {
        "given": "Hajime",
        "family": "Murai",
        "affiliation": [
          {
            "original_name": "Graduate School of Decision Science and Technology Tokyo Institute of Technology",
            "normalized_name": null,
            "country": null,
            "identifiers": {
              "ror": null,
              "GRID": null
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2015",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "1",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.1.1_37",
    "identifier": {
      "string_id": "10.17928/jjadh.1.1_37",
      "id_scheme": "DOI"
    },
    "abstract": "This study proposes a framework to access to the modern history of Japanese philosophy using natural language processing (NLP) and visualization. In order to discover new knowledge from massive amounts of information, support of information technologies is required. For supporting knowledge discovery from vast amount of books, we developed an OCR-based automatic book-digitizing framework and the system visualizing documents with relationships among them calculated by using NLP techniques. We applied the framework to Japanese journal Shisō (“Thought”) by the Japanese publisher Iwanami Shoten. We show an example of knowledge structure extracted from Shisō by using our visualizing system.",
    "article_title": "Revealing the Modern History of Japanese Philosophy Using Digitization, Natural Language Processing, and Visualization",
    "authors": [
      {
        "given": "Katsuya",
        "family": "Masuda",
        "affiliation": [
          {
            "original_name": "Center for Research and Development of Higher Education, University of Tokyo",
            "normalized_name": "University of Tokyo",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/057zh3y96",
              "GRID": "grid.26999.3d"
            }
          }
        ]
      },
      {
        "given": "Makoto",
        "family": "Tanji",
        "affiliation": [
          {
            "original_name": "Center for Knowledge Structuring, University of Tokyo",
            "normalized_name": "University of Tokyo",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/057zh3y96",
              "GRID": "grid.26999.3d"
            }
          }
        ]
      },
      {
        "given": "Hideki",
        "family": "Mima",
        "affiliation": [
          {
            "original_name": "Graduate School of Engineering, University of Tokyo",
            "normalized_name": "University of Tokyo",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/057zh3y96",
              "GRID": "grid.26999.3d"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2015",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "1",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.1.1_10",
    "identifier": {
      "string_id": "10.17928/jjadh.1.1_10",
      "id_scheme": "DOI"
    },
    "abstract": "The UC CEISMIC Canterbury Earthquakes Digital Archive was established in response to the devastating earthquakes that struck Canterbury region in New Zealand from September 2010 onwards, including 4 quakes of magnitude 6 or greater and over 11,000 aftershocks. 185 people died and significant parts of Christchurch city were either destroyed or have needed to be demolished, resulting in financial losses of an estimated NZ$30 billion. The rebuild is expected to take 10 – 15 years, and the UC CEISMIC archive is designed to accommodate this, acting as a distributed national (and eventually international) repository for digital content produced as a result of the earthquakes. This paper outlines the design principles and architecture of the archive, describing the commitment to open access and open source that allowed the project team to bring together a broad-ranging national consortium comprised of leading cultural organizations, who work alongside content providers ranging from individual citizens, government agencies and community groups, to large media companies. Principles common to the digital humanities community were used to bond the broader project team, in an interesting example of scholar-led community engagement. The goal is to provide a model that can be used, either in whole or in part, by future teams in need of similar capability.",
    "article_title": "Open Principles, Open Data: The Design Principles and Architecture of the UC CEISMIC Canterbury Earthquakes Digital Archive",
    "authors": [
      {
        "given": "James",
        "family": "Smithies",
        "affiliation": [
          {
            "original_name": "University of Canterbury",
            "normalized_name": "University of Canterbury",
            "country": "New Zealand",
            "identifiers": {
              "ror": "https://ror.org/03y7q9t39",
              "GRID": "grid.21006.35"
            }
          }
        ]
      },
      {
        "given": "Paul",
        "family": "Millar",
        "affiliation": [
          {
            "original_name": "University of Canterbury",
            "normalized_name": "University of Canterbury",
            "country": "New Zealand",
            "identifiers": {
              "ror": "https://ror.org/03y7q9t39",
              "GRID": "grid.21006.35"
            }
          }
        ]
      },
      {
        "given": "Chris",
        "family": "Thomson",
        "affiliation": [
          {
            "original_name": "University of Canterbury",
            "normalized_name": "University of Canterbury",
            "country": "New Zealand",
            "identifiers": {
              "ror": "https://ror.org/03y7q9t39",
              "GRID": "grid.21006.35"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2015",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "1",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.1.1_1",
    "identifier": {
      "string_id": "10.17928/jjadh.1.1_1",
      "id_scheme": "DOI"
    },
    "abstract": "Gathering information from social media content is becoming increasingly popular. Twitter, a microblog where posts are limited to 140 characters, is an excellent platform for gathering instant and interactive information. Considerable research has focused on Twitter’s effectiveness for disseminating emergency alerts and confirming the safety of acquaintances. However, there has been less emphasis on the analysis of Twitter posts to obtain information specialized to specific domains. Such analysis could enable simple and rapid identification of information related to state-of-the-art technology. Against this background, this study reports on a preliminary analysis of tweets by Japanese academic researchers. Our content analysis and text analysis reveal that many academic researchers tweet about their individual activities, education, or research. Their tweets contain domain-specific knowledge and have identifiable textual characteristics. This study provides basic findings that can be applied to obtain domain-specific knowledge from Twitter.",
    "article_title": "Analyzing the Content and Text of Tweets by Japanese Academic Researchers",
    "authors": [
      {
        "given": "Yui",
        "family": "Arakawa",
        "affiliation": [
          {
            "original_name": "University of Tsukuba",
            "normalized_name": "University of Tsukuba",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/02956yf07",
              "GRID": "grid.20515.33"
            }
          }
        ]
      },
      {
        "given": "Ryosuke",
        "family": "Yoshimoto",
        "affiliation": [
          {
            "original_name": "University of Tsukuba",
            "normalized_name": "University of Tsukuba",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/02956yf07",
              "GRID": "grid.20515.33"
            }
          }
        ]
      },
      {
        "given": "Fuyuki",
        "family": "Yoshikane",
        "affiliation": [
          {
            "original_name": "University of Tsukuba",
            "normalized_name": "University of Tsukuba",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/02956yf07",
              "GRID": "grid.20515.33"
            }
          }
        ]
      },
      {
        "given": "Takafumi",
        "family": "Suzuki",
        "affiliation": [
          {
            "original_name": "Toyo University",
            "normalized_name": "Toyo University",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/059d6yn51",
              "GRID": "grid.265125.7"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2015",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "1",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.2.1_90",
    "identifier": {
      "string_id": "10.17928/jjadh.2.1_90",
      "id_scheme": "DOI"
    },
    "abstract": "Popular songs can be regarded as a fine representation of modern society andculture. In particular, the lyrics of popular songs are the most importantaspect for understanding the sense of values and linguistic sensitivity in agiven generation and community. The purpose of the present study is toinvestigate the chronological variation of popular Japanese songs usingstylometric techniques. This study draws on the lyrics of 858 songs, whichappeared on the Oricon annual top 20 single hit chart between 1976 and 2015. Thelinguistic features investigated in this study include five different types oflexical indices, namely (a) number of words, (b) parts-of-speech, (c) wordtypes, (d) character types, and (e) vocabulary level. Multiple regressionanalysis was conducted to explore the chronological change in the frequencies oflexical indices. The results showed that the frequencies of word types andcharacter types dramatically changed before and after 1990. Moreover, the usagesof auxiliary verbs as well as lower level vocabulary became more prominent,whereas the frequencies of adjectival nouns and conjunctions decreased. Thefindings suggest that a turning point in cultural trends corresponds with thehistorically significant political and economic events, such as the end of theShowa era and the burst of the bubble economy.",
    "article_title": "Investigating the Chronological Variation of Popular Song Lyrics ThroughLexical Indices",
    "authors": [
      {
        "given": "Yuichiro",
        "family": "Kobayashi",
        "affiliation": [
          {
            "original_name": "Nihon University",
            "normalized_name": "Nihon University",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/05jk51a88",
              "GRID": "grid.260969.2"
            }
          }
        ]
      },
      {
        "given": "Misaki",
        "family": "Amagasa",
        "affiliation": [
          {
            "original_name": "Toyo University",
            "normalized_name": "Toyo University",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/059d6yn51",
              "GRID": "grid.265125.7"
            }
          }
        ]
      },
      {
        "given": "Takafumi",
        "family": "Suzuki",
        "affiliation": [
          {
            "original_name": "Toyo University",
            "normalized_name": "Toyo University",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/059d6yn51",
              "GRID": "grid.265125.7"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2017",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "2",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.2.1_73",
    "identifier": {
      "string_id": "10.17928/jjadh.2.1_73",
      "id_scheme": "DOI"
    },
    "abstract": "Wikipedia: The Free Encyclopedia was launched in January 2001, and its articles now represent a major resource for understanding the world. Many of these articles have been negotiated and edited for a decade or more, and the history of that editing can provide insight into the recent history of ideas. This paper describes the development of a tool called WIScker that works with the Wikipedia Application Programming Interface (API) to scrape, or \"wisck,\" the revision history of any Wikipedia article, in order to build a corpus for subsequent text analysis and visualization. As an example, we examine a fourteen-year revision history of the article \"Terrorism,\" first introduced into Wikipedia in October 2001, the month after 9/11, and subsequently expanded to provide a more historically informed, though still politically motivated, entry.",
    "article_title": "WIScking Ideas",
    "authors": [
      {
        "given": "Andrea",
        "family": "Budac",
        "affiliation": [
          {
            "original_name": "University of Alberta",
            "normalized_name": "University of Alberta",
            "country": "Canada",
            "identifiers": {
              "ror": "https://ror.org/0160cpw27",
              "GRID": "grid.17089.37"
            }
          }
        ]
      },
      {
        "given": "Geoffrey",
        "family": "Rockwell",
        "affiliation": [
          {
            "original_name": "University of Alberta",
            "normalized_name": "University of Alberta",
            "country": "Canada",
            "identifiers": {
              "ror": "https://ror.org/0160cpw27",
              "GRID": "grid.17089.37"
            }
          }
        ]
      },
      {
        "given": "Zachary",
        "family": "Palmer",
        "affiliation": [
          {
            "original_name": "University of Alberta",
            "normalized_name": "University of Alberta",
            "country": "Canada",
            "identifiers": {
              "ror": "https://ror.org/0160cpw27",
              "GRID": "grid.17089.37"
            }
          }
        ]
      },
      {
        "given": "Robert",
        "family": "Budac",
        "affiliation": [
          {
            "original_name": "University of Alberta",
            "normalized_name": "University of Alberta",
            "country": "Canada",
            "identifiers": {
              "ror": "https://ror.org/0160cpw27",
              "GRID": "grid.17089.37"
            }
          }
        ]
      },
      {
        "given": "Todd",
        "family": "Suomela",
        "affiliation": [
          {
            "original_name": "Bucknell University",
            "normalized_name": "Bucknell University",
            "country": "United States",
            "identifiers": {
              "ror": "https://ror.org/00fc1qt65",
              "GRID": "grid.253363.2"
            }
          }
        ]
      },
      {
        "given": "Stéfan",
        "family": "Sinclair",
        "affiliation": [
          {
            "original_name": "McGill University",
            "normalized_name": "McGill University",
            "country": "Canada",
            "identifiers": {
              "ror": "https://ror.org/01pxwe438",
              "GRID": "grid.14709.3b"
            }
          }
        ]
      },
      {
        "given": "Stan",
        "family": "Ruecker",
        "affiliation": [
          {
            "original_name": "The University of Illinois at Urbana-Champaign",
            "normalized_name": "University of Illinois at Urbana-Champaign",
            "country": "United States",
            "identifiers": {
              "ror": "https://ror.org/047426m28",
              "GRID": "grid.35403.31"
            }
          }
        ]
      },
      {
        "given": "",
        "family": "the INKE Team",
        "affiliation": [
          {
            "original_name": null,
            "normalized_name": null,
            "country": null,
            "identifiers": {
              "ror": null,
              "GRID": null
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2017",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "2",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.2.1_60",
    "identifier": {
      "string_id": "10.17928/jjadh.2.1_60",
      "id_scheme": "DOI"
    },
    "abstract": "The present paper aims at designing a monitoring framework for a yet new interdisciplinary research and education program in Japan, “Cultural Resources Studies.”, \"Bunkashigengaku\" in Japanese. We analyze the linkage between a university, an academic association, and the practitioners’ institutions closely related with cultural resources through the mining of the principal texts produced by them. Our findings reveal the complicated relations among these stakeholder institutions, and attest to the importance of the revision cycle for the advance of interdisciplinary studies.",
    "article_title": "Designing Research for Monitoring Humanities-based Interdisciplinary Studies: A Case of Cultural Resources Studies (Bunkashigengaku 文化資源学) in Japan",
    "authors": [
      {
        "given": "Yusuke",
        "family": "Nakamura",
        "affiliation": [
          {
            "original_name": "Graduate School of Humanities and Sociology, University of Tokyo",
            "normalized_name": "University of Tokyo",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/057zh3y96",
              "GRID": "grid.26999.3d"
            }
          }
        ]
      },
      {
        "given": "Chikahiko",
        "family": "Suzuki",
        "affiliation": [
          {
            "original_name": "Graduate School of Humanities and Sociology, University of Tokyo",
            "normalized_name": "University of Tokyo",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/057zh3y96",
              "GRID": "grid.26999.3d"
            }
          }
        ]
      },
      {
        "given": "Katsuya",
        "family": "Masuda",
        "affiliation": [
          {
            "original_name": "Center for Research and Development of Higher Education, University of Tokyo",
            "normalized_name": "University of Tokyo",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/057zh3y96",
              "GRID": "grid.26999.3d"
            }
          }
        ]
      },
      {
        "given": "Hideki",
        "family": "Mima",
        "affiliation": [
          {
            "original_name": "Center for Research and Development of Higher Education, University of Tokyo",
            "normalized_name": "University of Tokyo",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/057zh3y96",
              "GRID": "grid.26999.3d"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2017",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "2",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.2.1_48",
    "identifier": {
      "string_id": "10.17928/jjadh.2.1_48",
      "id_scheme": "DOI"
    },
    "abstract": "This paper aims to demonstrate that variables relating to the independency of the string parts are useful for discriminating between symphonies and string quartets in terms of their orchestrations. More specifically, this paper targets the fast initial movements of thirty-nine symphonies and twenty string quartets by Mozart. Conducted analysis extracted three factors within the twelve observed variables and suggests that one of those factors, namely, the Lower part Pitch-Name and Duration factor (LPND), can account for the differences between Mozart’s symphonies and string quartets composed after 1782.",
    "article_title": "This paper aims to demonstrate that variables relating to the independency of the string parts are useful for discriminating between symphonies and string quartets in terms of their orchestrations. More specifically, this paper targets the fast initial movements of thirty-nine symphonies and twenty string quartets by Mozart. Conducted analysis extracted three factors within the twelve observed variables and suggests that one of those factors, namely, the Lower part Pitch-Name and Duration factor (LPND), can account for the differences between Mozart’s symphonies and string quartets composed after 1782.",
    "authors": [
      {
        "given": "Michiru",
        "family": "Hirano",
        "affiliation": [
          {
            "original_name": "Department of Value and Decision Science, Tokyo Institute of Technology",
            "normalized_name": "Tokyo Institute of Technology",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/0112mx960",
              "GRID": "grid.32197.3e"
            }
          }
        ]
      },
      {
        "given": "Hilofumi",
        "family": "Yamamoto",
        "affiliation": [
          {
            "original_name": "Department of Value and Decision Science, Tokyo Institute of Technology",
            "normalized_name": "Tokyo Institute of Technology",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/0112mx960",
              "GRID": "grid.32197.3e"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2017",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "2",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.2.1_31",
    "identifier": {
      "string_id": "10.17928/jjadh.2.1_31",
      "id_scheme": "DOI"
    },
    "abstract": "This paper proposes a method for describing narrative structure that focuses on the behavior of characters in a story. In this approach, focus, polarity, dynamic, motivation, and result are assigned as attributes of behavior. As a case study, the plots of flash fictions by Shin'ichi Hoshi were analyzed and represented formally using such behavioral attributes. Specifically, this approach to plot description enabled the representation of “punch lines,” which comprise a reversal of story elements (such as agent and recipient). Using software to analyze plot descriptions, certain types of reversal-type punch lines were automatically extracted. These extracted reversal patterns were sorted based on the rules of “similarity” and “distant foreshadowing,” and valid reversal-type punch lines were extracted in 60% of the analyzed stories.",
    "article_title": "Automatic Extraction of Reversal-Type Punch Lines in Shin'ichi Hoshi's Flash Fictions",
    "authors": [
      {
        "given": "Hajime",
        "family": "Murai",
        "affiliation": [
          {
            "original_name": "Faculty of Systems Information Science, Future University Hakodate",
            "normalized_name": "Future University Hakodate",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/05szw2z23",
              "GRID": "grid.440872.d"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2017",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "2",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.2.1_1",
    "identifier": {
      "string_id": "10.17928/jjadh.2.1_1",
      "id_scheme": "DOI"
    },
    "abstract": "Below we develop a method to determine whether the use of grammatical particles in Chinese Buddhist scriptures is characteristic for the period of their translation. The corpus consists of three different Chinese translations of an early Indian Mahāyāna text from two different periods. We use the results of Principal Component Analysis (PCA) to discern if the samples of texts from different periods cluster together. We found that PCA used on common grammatical particles that exhibit great variance between texts, but occur evenly distributed within the texts, does in this case indeed yield distinctive patterns that distinguish the translations from different time periods. This is relevant for historical Chinese linguistics and Buddhist studies. It allows us to identify grammatical particles the use of which differs between translations from different periods. This in turn is an important basis for further research into Buddhist Hybrid Chinese translation idioms and the better attribution and dating of Chinese Buddhist texts.",
    "article_title": "Stylometric Analysis of Chinese Buddhist texts - Do different Chinese translations of the Gaṇḍavyūha reflect stylistic features that are typical for their age?",
    "authors": [
      {
        "given": "Marcus",
        "family": "BINGENHEIMER",
        "affiliation": [
          {
            "original_name": "Temple University",
            "normalized_name": "Temple University",
            "country": "United States",
            "identifiers": {
              "ror": "https://ror.org/00kx1jb78",
              "GRID": "grid.264727.2"
            }
          }
        ]
      },
      {
        "given": "Jen-Jou",
        "family": "HUNG",
        "affiliation": [
          {
            "original_name": "Dharma Drum Institute of Liberal Arts",
            "normalized_name": "Dharma Drum Institute of Liberal Arts",
            "country": "Taiwan",
            "identifiers": {
              "ror": "https://ror.org/05hkpfm52",
              "GRID": "grid.501594.c"
            }
          }
        ]
      },
      {
        "given": "Cheng-en",
        "family": "HSIEH",
        "affiliation": [
          {
            "original_name": "Dharma Drum Institute of Liberal Arts",
            "normalized_name": "Dharma Drum Institute of Liberal Arts",
            "country": "Taiwan",
            "identifiers": {
              "ror": "https://ror.org/05hkpfm52",
              "GRID": "grid.501594.c"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2017",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "2",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.3.1_114",
    "identifier": {
      "string_id": "10.17928/jjadh.3.1_114",
      "id_scheme": "DOI"
    },
    "abstract": "This article uses character n-grams methods to assess the authorship of three religious texts written in medieval Japan, comparing them to the works of Monkan (1278-1357), a Shingon monk active during the first half of the 14th century. Such texts belong to a literary genre called shōgyō that presents many challenges that render the use of traditional authorship attribution methods inappropriate. They were composed in Japanese kanbun (classical Chinese read in Japanese word order), and their contents are closer to cumulative work than to original creations by a single author. This article thus draws on previous research on the translators of the Chinese Buddhist canon, which have proven to be far more effective than traditional methods developed for modern languages for the analysis of this type of literature. Concretely, it proposes a workflow proceeding from the preparation of the corpus (with manuscript edition, encoding,…) to a concrete data analysis using the variable length n-gram method. The last part of the article deals with future perspectives that would further refine the results, such as taking into account the various speaking voices found inside the shōgyō and their relationship to the author, as well as stylistic analysis based on grammatical patterns. As a whole, the experiment succeeded in showing global trends in the texts of the Japanese Shingon schools, finding stylistic differences between the works of Kūkai, of monks from the 12th century, and of Monkan. Combined with a rigorous historical enquiry into the redaction context of the texts and their manuscripts, the data analysis also demonstrates that one of them was almost certainly written by Monkan, and another either by him or by one of his close disciples.",
    "article_title": "Data Mining in the Works of the Shingon Monk Monkan (1278–1357): Using Digital Methods to Assess the Contested Authorship of Three Religious Texts from Medieval Japan",
    "authors": [
      {
        "given": "Gaetan",
        "family": "Rappo",
        "affiliation": [
          {
            "original_name": "Graduate school of Letters, Nagoya University",
            "normalized_name": "Nagoya University",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/04chrp450",
              "GRID": "grid.27476.30"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2018-10-21",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "3",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.3.1_98",
    "identifier": {
      "string_id": "10.17928/jjadh.3.1_98",
      "id_scheme": "DOI"
    },
    "abstract": "Migrants all over the world have left multiple traces in different countries, and this cultural heritage is of growing interest to researchers and to the migrant communities themselves. Cultural heritage institutions, however, have dwindling funds and resources to meet the demand for the heritage of immigrant communities to be protected. In this article we propose that the key to bridging this gap is to be found in new possibilities that are opened up if resources are linked to enable digital exploration of archival records and collections. In particular, we focus on the value of building a composite and distributed resource around migrants’ life courses. If this approach is used and dispersed collections held by heritage institutions can be linked, migrant communities can have access to detailed information about their families and researchers to a wealth of data—serial and qualitative—for sophisticated and innovative research. Not only does the scattered data become more usable and manageable, it becomes more visible and coherent; patterns can be discovered that were not apparent before. We use the Dutch-Australian collaborative project “Migrant: Mobilities and Connection” as an example and case study of this life course–centered methodology and propose that this may develop into a migration heritage template for migrants worldwide.",
    "article_title": "Migrating People, Migrating Data: Digital Approaches to Migrant Heritage",
    "authors": [
      {
        "given": "Paul",
        "family": "Longley Arthur",
        "affiliation": [
          {
            "original_name": "Edith Cowan University",
            "normalized_name": "Edith Cowan University",
            "country": "Australia",
            "identifiers": {
              "ror": "https://ror.org/05jhnwe22",
              "GRID": "grid.1038.a"
            }
          }
        ]
      },
      {
        "given": "Jason",
        "family": "Ensor",
        "affiliation": [
          {
            "original_name": "Western Sydney University",
            "normalized_name": "Western Sydney University",
            "country": "Australia",
            "identifiers": {
              "ror": "https://ror.org/03t52dk35",
              "GRID": "grid.1029.a"
            }
          }
        ]
      },
      {
        "given": "Marijke",
        "family": "van Faassen",
        "affiliation": [
          {
            "original_name": "Huygens Institute for the History of the Netherlands",
            "normalized_name": "Huygens Institute for the History of the Netherlands",
            "country": "Netherlands",
            "identifiers": {
              "ror": "https://ror.org/04x6kq749",
              "GRID": "grid.450092.a"
            }
          }
        ]
      },
      {
        "given": "Rik",
        "family": "Hoekstra",
        "affiliation": [
          {
            "original_name": "Huygens Institute for the History of the Netherlands",
            "normalized_name": "Huygens Institute for the History of the Netherlands",
            "country": "Netherlands",
            "identifiers": {
              "ror": "https://ror.org/04x6kq749",
              "GRID": "grid.450092.a"
            }
          }
        ]
      },
      {
        "given": "Nonja",
        "family": "Peters",
        "affiliation": [
          {
            "original_name": "Curtin University",
            "normalized_name": "Curtin University",
            "country": "Australia",
            "identifiers": {
              "ror": "https://ror.org/02n415q13",
              "GRID": "grid.1032.0"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2018-10-21",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "3",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.3.1_73",
    "identifier": {
      "string_id": "10.17928/jjadh.3.1_73",
      "id_scheme": "DOI"
    },
    "abstract": "The Landscapes of Injustice project is a multi-institutional seven-year research project funded by a Partnership Grant from the Social Sciences and Humanities Research Council of Canada. The project mission is to investigate, document, and analyze the process by which, beginning in 1942, tens of thousands of people of Japanese ethnicity were interned, and their property was seized and disposed of by the Canadian government and its agents. Part of this process involves identifying where Japanese Canadians were living and working prior to their internment, what property they owned, and how the dispossession affected them. This requires that we identify Japanese Canadian individuals across a range of different types of official and unofficial records, often based only on name, on a scale that makes an entirely manual process impractical. The project has therefore developed a semi-automated algorithmic approach to determining whether any name in the records is Japanese or not. This article describes the algorithm in detail, along with its application and limitations.",
    "article_title": "Algorithmic Determination of Japanese Ethnic Identity Based on Name",
    "authors": [
      {
        "given": "Martin",
        "family": "Holmes",
        "affiliation": [
          {
            "original_name": "University of Victoria",
            "normalized_name": "University of Victoria",
            "country": "Canada",
            "identifiers": {
              "ror": "https://ror.org/04s5mat29",
              "GRID": "grid.143640.4"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2018-10-21",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "3",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.3.1_49",
    "identifier": {
      "string_id": "10.17928/jjadh.3.1_49",
      "id_scheme": "DOI"
    },
    "abstract": "Although the literary structures employed in the Bible (chiasmus, concentric structures, and parallelism) are important for its interpretation, the ambiguity of these structures renders them problematic. In this paper, in order to establish an objective framework of evaluation for these structures, a quantitative analysis method is proposed. The target hypothesis of literary structures is the Parallel Literary Structure hypothesis about the hierarchical literary structure of the Bible. This hypothesis proposes that the literary structures in all books of the Bible have a parallel common system. Specifically, the validity of text divisions was evaluated based on divisions rendered in a number of extant Bible translations. Then, corresponding pericope pairs (a pericope is a small story unit in the Bible) that include various “common rare” words and phrases were counted, and the number of valid pairs was compared with the number of randomly constructed structures. From this analysis, statistical significances were extracted and the result strongly supports the hypothesis quantitatively.",
    "article_title": "Quantitative Evaluation Method for a Literary Structure Hypothesis within the Bible",
    "authors": [
      {
        "given": "Hajime",
        "family": "Murai",
        "affiliation": [
          {
            "original_name": "Faculty of Systems Information Science, Future University Hakodate",
            "normalized_name": "Future University Hakodate",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/05szw2z23",
              "GRID": "grid.440872.d"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2018-10-21",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "3",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.3.1_33",
    "identifier": {
      "string_id": "10.17928/jjadh.3.1_33",
      "id_scheme": "DOI"
    },
    "abstract": "The Song Dynasty was a decisive period of transformation in ancient China, during which relationships between scholars and politicians are thought to have become closer and closer, and this change is considered part of the “Tang–Song transition.” In the Song Dynasty, the Yuanyou 元祐 era (1086–94) was a critical and complex period with regard to its political environment. The major purpose of this paper is to investigate the relationships between scholars and politicians during this period. The connections between figures collected from the CBDB (China Biographical Database) include both literary relations and political relations. Two scholars have a literary relation when both of them write to a common third figure, and a political relation between two politicians is demonstrated through such connections as political support associations, recommendation sponsorship, and oppositional political affiliations. In the present study, two matrices are respectively constructed according to literary and political relations among figures and a Poisson-Gamma factorization model is adopted to obtain the key factors of the matrices. According to calculated results and literary history, the scholars can be clearly classified into three groups. We identified two groups of the politicians with this method, while we found other politicians to have steered a course between them. Furthermore, the figures engaged in common literary pursuits are more likely to share common political goals. As a result, the observation that scholars and politicians are related closely in the Yuanyou era confirms that this period must have featured literati politics.",
    "article_title": "Investigating the Relationships between Scholars and Politicians in Ancient China: Taking the Yuanyou Era as an Example",
    "authors": [
      {
        "given": "Wenyi",
        "family": "Shang",
        "affiliation": [
          {
            "original_name": "Department of Information Management, Peking University, Beijing, China",
            "normalized_name": "Peking University",
            "country": "China",
            "identifiers": {
              "ror": "https://ror.org/02v51f717",
              "GRID": "grid.11135.37"
            }
          }
        ]
      },
      {
        "given": "Winbin",
        "family": "Huang",
        "affiliation": [
          {
            "original_name": "Department of Information Management, Peking University, Beijing, China",
            "normalized_name": "Peking University",
            "country": "China",
            "identifiers": {
              "ror": "https://ror.org/02v51f717",
              "GRID": "grid.11135.37"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2018-10-21",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "3",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.3.1_1",
    "identifier": {
      "string_id": "10.17928/jjadh.3.1_1",
      "id_scheme": "DOI"
    },
    "abstract": "Historians have traditionally relied on close readings of select primary sources to evaluate linguistic and discursive changes over time, but this approach can be limiting in its scope. Numeric representations of language allow us to statistically quantify and compare the significance of discursive changes and capture linguistic relationships over time. Here, we compare two deep learning methods of quantitatively identifying the chronology of linguistic shifts: RNN classification and RNN language modeling. In particular, we examine deep learning methods of isolating stylistic from topical changes, generating “decade embeddings,” and charting the changing average perplexity in a language model trained on chronologically sorted data. We apply these models to a historical diplomatic corpus, finding that the two world wars proved to be notable moments of linguistic change in American foreign relations. With this example we show applications of text-based deep learning methods for digital humanities usages.",
    "article_title": "The Long Arc of History: Neural Network Approaches to Diachronic Linguistic Change",
    "authors": [
      {
        "given": "Eun Seo",
        "family": "Jo",
        "affiliation": [
          {
            "original_name": "Department of History, Stanford University",
            "normalized_name": "Stanford University",
            "country": "United States",
            "identifiers": {
              "ror": "https://ror.org/00f54p054",
              "GRID": "grid.168010.e"
            }
          }
        ]
      },
      {
        "given": "Mark",
        "family": "Algee-Hewitt",
        "affiliation": [
          {
            "original_name": "Department of English, Stanford University",
            "normalized_name": "Stanford University",
            "country": "United States",
            "identifiers": {
              "ror": "https://ror.org/00f54p054",
              "GRID": "grid.168010.e"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2018-10-21",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "3",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.4.1_72",
    "identifier": {
      "string_id": "10.17928/jjadh.4.1_72",
      "id_scheme": "DOI"
    },
    "abstract": "No discussion of play and leisure in Japan would be complete without acknowledging the place of pachinko, a game so popular that it dominates the leisure economy in a way no other medium does, not even videogames. Even in decline, pachinko generates more revenue in Japan than any other leisure pursuit and yet it is rarely discussed in game studies in the West or even in the Japanese literature around game culture. This is largely because of the gambling associated with pachinko and because it is unique to Japan – a national industry with no export potential. Pachinko is at the disreputable edge of gaming—economically, culturally, and mechanically. Above all, pachinko machines stand out as monstrous hybrids that combine the electro-mechanical apparatus of a pinball machine with the digital screen of a slot machine in a curious mixed interface that seems to be an anachronism of a pre-computing era. And that is what this paper is about – the hybrid interface of pachinko.",
    "article_title": "Pachinko",
    "authors": [
      {
        "given": "Geoffrey",
        "family": "Rockwell",
        "affiliation": [
          {
            "original_name": "University of Alberta",
            "normalized_name": "University of Alberta",
            "country": "Canada",
            "identifiers": {
              "ror": "https://ror.org/0160cpw27",
              "GRID": "grid.17089.37"
            }
          }
        ]
      },
      {
        "given": "Keiji",
        "family": "Amano",
        "affiliation": [
          {
            "original_name": "Seijoh University",
            "normalized_name": "Seijoh University",
            "country": "Japan",
            "identifiers": {
              "ror": "https://ror.org/0085wxm22",
              "GRID": "grid.443236.4"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2019-8-30",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "4",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.4.1_54",
    "identifier": {
      "string_id": "10.17928/jjadh.4.1_54",
      "id_scheme": "DOI"
    },
    "abstract": "Attempts to preserve retro game elements or ‘the classic feeling’ through remixing retro elements with modern ones are not a new method. However, it is an effective preservation method. According to Newman, videogame preservation goes beyond simply preserving hardware. In order to deliver “authentic play (and aesthetic) experiences”, it also necessary to determine what are the most significant, qualitative aspects or properties that make a particular videogame what it is (Newman 2012, 122–23). Part of the success of classic characters like Mario is how often they are reused and reimagined (Suominen 2012, 8). Even if you have never played the original Mario games, you have still likely been exposed to the franchise’s most ‘basic’ elements through their various iterations. However, while the game industry typically aims for continual innovation and reinvention (Newman 2012, 9), the changing market and gaming landscape is allowing for alternative opportunities for remixing retro elements. One notable example includes Mega Man 9, which garnered praise for their gorgeous, realistic graphics. While all three games were made for modern consoles, Mega Man 9 was made in classic retro style, not only to return the series to its roots but also to give players a new story and “the classical feel” (Takeshita 2008). By studying the approaches developers have used, it is possible to study what ‘feeling’ they were attempting to preserve, what elements were considered most essential, how these elements were translated, and what new meanings occur.",
    "article_title": "Remixing Retro",
    "authors": [
      {
        "given": "Domini",
        "family": "Gee",
        "affiliation": [
          {
            "original_name": null,
            "normalized_name": null,
            "country": null,
            "identifiers": {
              "ror": null,
              "GRID": null
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2019-8-30",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "4",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.4.1_37",
    "identifier": {
      "string_id": "10.17928/jjadh.4.1_37",
      "id_scheme": "DOI"
    },
    "abstract": "The genre of boys’ love (BL), which generally refers to a body of works that depict fictional relationships between beautiful “boys,” is produced for and consumed mainly by women in Japan. Ludic expressions of sexuality and gender unique to BL have gained popularity on a global scale but have also drawn negative attention. In this article, we employ the concept of asobigokoro (playful spirit/heart) to highlight the importance of regional ideas of play and playfulness in game analysis. We argue that asobigokoro functions as a kind of counter-discourse as it privileges non-Eurocentric ways of knowing, understanding, and “playing” with representations of sexuality. Game analysis through an asobigokoro lens enriches the field of regional gaming by drawing on Japanese sociopolitical contexts to situate a reading of Japanese ludic representations. Asobigokoro stresses the importance of understanding cultural variations of “play” and “playfulness” in order to make sense of “taboo” subjects in culturally nuanced ways. In our textual analysis of Enzai: Falsely Accused, we discover that the simultaneous appropriation and subversion of violent and sexually explicit content, which characterizes the game’s asobigokoro, can be traced to Japanese feminist forms of asobi (play), which are rooted within the Yaoi tradition.",
    "article_title": "Playing with Pain",
    "authors": [
      {
        "given": "Tsugumi",
        "family": "Okabe",
        "affiliation": [
          {
            "original_name": "University of Alberta",
            "normalized_name": "University of Alberta",
            "country": "Canada",
            "identifiers": {
              "ror": "https://ror.org/0160cpw27",
              "GRID": "grid.17089.37"
            }
          }
        ]
      },
      {
        "given": "Jérémie",
        "family": "Pelletier-Gagnon",
        "affiliation": [
          {
            "original_name": "University of Alberta",
            "normalized_name": "University of Alberta",
            "country": "Canada",
            "identifiers": {
              "ror": "https://ror.org/0160cpw27",
              "GRID": "grid.17089.37"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2019-8-30",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "4",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  },
  {
    "url": "http://dx.doi.org/10.17928/jjadh.4.1_7",
    "identifier": {
      "string_id": "10.17928/jjadh.4.1_7",
      "id_scheme": "DOI"
    },
    "abstract": "This article focuses on Nintendo’s influential and much-celebrated 1998 videogame The Legend of Zelda: Ocarina of Time (hereafter OoT). In particular, it explores the often unexpectedly creative and wholly transformative ways in the game is played by ‘speedrunners.’ Seeking to race through the game as quickly as possible, speedrunners play in a distinctive way that combines mastery of performance execution with a deep knowledge of the game’s operation and how its systems may be exploited. Speedrunning performances are creative because they involve astonishingly detailed investigations of the minutiae of game behaviors. They are transformative because they disrupt and even invert much-vaunted aspects of the game as sequences that slow down progress are circumvented. As such, what would otherwise class as crucial moments in the storyline, key character development and even locales, are not only raced through but are actively skipped. Compared with the game’s narrative, the connectivity of its spaces, and the complex but clearly mapped passage of time as set out in Nintendo’s officially-endorsed ‘Strategy Guides’ (see Buchanan et al 1998; Hollinger et al 1998; Loe and Guess 1998), the OoT speedrun constructs an altogether different game with vastly altered priorities. And so, the offer to, ‘Join legendary hero Link as he journeys across Hyrule, and even through time, to thwart the plans of Ganondorf.’ (Nintendo 2017), is recast as a breakneck dash to the closing credits sequence evading and avoiding all but the essential moments of gameplay.",
    "article_title": "Wrong Warping, Sequence Breaking, and Running through Code",
    "authors": [
      {
        "given": "James",
        "family": "Newman",
        "affiliation": [
          {
            "original_name": "Bath Spa University",
            "normalized_name": "Bath Spa University",
            "country": "United Kingdom",
            "identifiers": {
              "ror": "https://ror.org/0038jbq24",
              "GRID": "grid.252874.e"
            }
          }
        ]
      }
    ],
    "publisher": "Japanese Association for Digital Humanities",
    "date": "2019-8-30",
    "keywords": null,
    "journal_title": "Journal of the Japanese Association for Digital Humanities",
    "volume": "4",
    "issue": "1",
    "ISSN": [
      {
        "value": "2188-7276",
        "type": "electronic"
      }
    ]
  }
]