[{"url": "http://computerphilologie.digital-humanities.de/jg00/christma/christma.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Much praised and much criticized but certainly unique: The forming of the Deutsches Wörterbuch (DWB) by Jacob and Wilhelm Grimm took far more than one hundred years and engaged generations of lexicographers who have contributed a total of approximately 350.000 entries to be collected in 67.744 dictionary columns that were published in sixteen volumes (32 sections). The DWB comprises the most thorough account of the German language and reflects a period of more than one hundred years of lexicographical, cultural, institutional, and also political history; thus it proves indispensable for research and teaching. It marks a further step in the history of this dictionary, to make it available in the electronic medium, and to recognize and encode its heterogeneous structures systematically. Since November 1998 a project team at the University of Trier prepares a computerized version of the DWB to be published on CD-ROM and also be made available via Internet. Accessibility of this outstanding dictionary will be improved thereby enlargening its user community independent of libraries' opening hours. The adaptation of the dictionary's contents will be according to international standards: The use of SGML determined by the TEI-guidelines will support the aim to obtain new possibilities in its usage: A markup of the dictionary's contents taking into account the specific demands of dictionary structures enables to provide selective access to various positions of each dictionary entry, offering far wider possibilities of dictionary usage than conventional full-text search requests can supply. Systematic analysis of quotations and its references will be ensured by interlinking those with the DWB's index volume. After a brief outline of the DWB's structure, history, and value, this paper stresses upon following the steps to a computerized version of the DWB. The stages from data input, correction procedures, and automatic markup according to SGML standards to the provision of a graphical user interface will be discussed, emphasizing on the difficulties arising from the dictionary's hetergeneous structure and contents.", "article_title": "EIN »HAUSBUCH«[1] FÜR ALLE? - DAS DEUTSCHE WÖRTERBUCH DER BRÜDER GRIMM AUF CD-ROM UND IM INTERNET", "authors": [{"given": "Thomas", "family": "Burch", "affiliation": [{"original_name": "Germanistik/Ältere deutsche Philologie, Universität Trier", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}, {"given": "Ruth", "family": "Christmann", "affiliation": [{"original_name": "Germanistik/Ältere deutsche Philologie, Universität Trier", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}, {"given": "Vera", "family": "Hildenbrandt", "affiliation": [{"original_name": "Germanistik/Ältere deutsche Philologie, Universität Trier", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}, {"given": "Thomas", "family": "Schares", "affiliation": [{"original_name": "Germanistik/Ältere deutsche Philologie, Universität Trier", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}], "publisher": null, "date": "2000-08-11", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg00/maxeibl/maxeibl2.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This article describes ergonomical aspects of hypermedia systems. First, the basic concepts of hypertext, multimedia and hypermedia are defined and discussed. Then the main problems of hypertext systems, such as navigation, orientation, and search, and their possible solutions are discussed. Different methods are presented and evaluated according to their usability. The article closes with a short introduction to usability problems of different modalities.", "article_title": "HYPERTEXT, MULTIMEDIA, HYPERMEDIA: ERGONOMISCHE ASPEKTE", "authors": [{"given": "Maximilian", "family": "Eibl", "affiliation": [{"original_name": "Berlin", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2000-10-01", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg00/landfest/landfest.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This essay suggests a website edition of Bettine von Arnims complete works, including all her correspondances, concepts and other manuscript material. Crucial arguments in favor of such an edition are first von Arnim's constant interweaving of published books and private correspondances which lent her writings their specific network structure; second the problem of handling the sources, von Arnim's papers partly having disappeared after an auction in 1929 and the rest being scattered wide. To give plausibility to these argu-ments the essay sketches the works' net structure as well as the state of the manuscript sources.", "article_title": "FASELEI ONLINE. VORÜBERLEGUNGEN ZU EINER INTERNET-PUBLIKATION VON BETTINE VON ARNIMS WERK", "authors": [{"given": "Ulrike", "family": "Landfester", "affiliation": [{"original_name": "München/Frankfurt am Main", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2000-07-02", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg00/richter/richter.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The project of a new, historical-critical edition of the entire corpus of letters written by Goethe has been a desideratum of German Studies research for decades. A total of more than 14.700 letters by Goethe to more than 1400 different correspondents, excluding official correspondence, have survived. Various particulars in part four of the Weimar Edition (which appeared between 1887 and 1912 and contains the only thorough academic edition of Goethe letters to date) have to be revised. More than 2.000 letters were published incompletely, while about 300 letters are not yet available in print. Besides a full presentation of the letters, there are two other strong arguments in favour of a revised and enlarged edition: improving both the chronology and the annotation of the letters in the Weimar Edition. As an essential preparatory work transmissions of manuscripts and prints of all Goethe letters were brought together in a database. In this complete index are noted all manuscripts, drafts, and contemporary copies of Goethe letters which have survived. It comprises over 15.200 records. In addition to the Goethe and Schiller Archives, where about 20.000 manuscripts of Goethe letters, including drafts and copies, are held, about 200 other libraries, archives, and private owners all over the world were contacted for materials. The database for the electronic index of transmissions of all Goethe letters is published on the internet now and is accessible to all users.", "article_title": "ZUR INTERNETVERÖFFENTLICHUNG. DER DATENBANK: JOHANN WOLFGANG GOETHE. REPERTORIUM SÄMTLICHER BRIEFE 1764-1832. HG. V. DER STIFTUNG WEIMARER KLASSIK/GOETHE- UND SCHILLER-ARCHIV", "authors": [{"given": "Elke", "family": "Richter", "affiliation": [{"original_name": "Stiftung Weimarer Klassik/Goethe- und Schiller-Archiv, Weimar", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2000-10-01", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg01/bein2.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This feature is a summary of two round table talks conducted for several hours on 2 and 22 August 2001 at the Institute of German Literature of RWTH Aachen. The goal of these talks was to identify what practical consequences new computer and Internet based technologies have on research and teaching in the field of Medieval German studies and what requirements different university groups have for the future use of the new media and technologies. The talks deliberately set aside the field of specialist programming or special hardware configurations. The focus was to be on application. (Translation by Alison Dobson-Ottmers.)", "article_title": "PC UND INTERNET IN ALTGERMANISTISCHER. FORSCHUNG UND LEHRE. ERFAHRUNGEN UND DESIDERATE", "authors": [{"given": "Thomas", "family": "Bein", "affiliation": [{"original_name": "Germanistisches Intitut der RWTH Aachen, Abteilung für Ältere Deutsche Literatur", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2001-11-26", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg01/oberhofer.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Distributed learning environments and content often lack common basis for the exchange of learning materials. This delays or even hinders both innovation and delivery of learning technology. Standards for platforms and authoring may provide a way to improve interoperability and cooperative development. This article provides an XML-based approach to this problem promoted by the IMS Global Learning Consortium.", "article_title": "XML-STANDARDS ALS MOTOR. FÜR DEN AUSBAU VIRTUELLER LEHRANGEBOTE", "authors": [{"given": "Thomas", "family": "Oberhofer", "affiliation": [{"original_name": "Erlangen", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2001-11-26", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg01/reinhardt-becker.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The following paper deals with the development of a hypertext-study program for personal use, connected with Jochen Vogts 1999 textbook Einladung zur Literaturwissenschaft (Invitation to Literary Studies), which is used for first year-classes of German literature in several universities home and abroad. Our hypertext-program is available in the World Wide Web and basically provides substantial information on authors (both literary and critical) and literary terms (in example genres, literary history, styles, theory) mentioned in the textbook. In addition, short original texts represent the most important critical schools. A system of links gives every user the opportunity to find her or his own path through the jungle of literary facts, concepts and terms. My paper tries to trace mainly the discussions and decisions in our working team, mostly of graduate students, to discuss the didactic possibilities of the hypertext, and to summarize the responses of users both in Essen and worldwide to our work-in-progress.", "article_title": "EINLADUNG ZUR LITERATURWISSENSCHAFT[1]. DAS ESSENER INTERNET-VERTIEFUNGSPROGRAMM ZUM SELBSTSTUDIUM. EIN ERFAHRUNGSBERICHT", "authors": [{"given": "Elke", "family": "Reinhardt-Becker", "affiliation": [{"original_name": "Universität GHS Essen", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2001-11-26", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg01/rohmer.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The World Wide Web offers a lot of information on poets and literary texts, which may motivate people in continuing and intensifying their reading. The web-catalogue Erlanger Liste – Germanistik im Internet <http://www.erlangerliste.uni-erlangen.de> (4.11.2001), where internet resources on german literature are listed and commented, could help to find such places in the web. In doing so, the list also takes part in the renewal of a cultural memory under the sign of the new media. Literary science should observe both: the way, how readers present their reading in the net, but also the consequences for the literary tradition.", "article_title": "LINKLISTE UND LESELUST. MÖGLICHKEITEN DER LITERATURVERMITTLUNG IM INTERNET", "authors": [{"given": "Ernst", "family": "Rohmer", "affiliation": [{"original_name": "Institut für Germanistik, Universität Erlangen-Nürnberg", "normalized_name": "University of Erlangen-Nuremberg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00f7hpc57", "GRID": "grid.5330.5"}}]}], "publisher": null, "date": "2001-11-26", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg01/doerr.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The article gives an overview about digitization activities from a German prospective. The setup of a specialized funding program for retrospective digitization of library holdings by the Deutsche Forschungsgemeinschaft in 1997 played an important role for inciting and promoting digitization projects. Giving direct access to broadly used research and teaching materials or facilitating the use of rare and precious documents are some of the most frequent selection criterias. The main lines of digitization activities of the Bavarian State Library are given as an example for building a digitization profile which is reflecting the missions of the library. Further American and French initiatives are cited in order to illustrate digitization programs of much greater dimensions. The second part of the article refers to the basic technical questions (scanners, resolution, text encoding) and also mentions some copyright issues.", "article_title": "RETRODIGITALISIERUNG IN BIBLIOTHEKEN UND WISSENSCHAFTLICHEN EINRICHTUNGEN", "authors": [{"given": "Marianne", "family": "Dörr", "affiliation": [{"original_name": "Bayerische Staatsbibliothek, Leitung VD 12 und Münchner Digitalisierungszentrum", "normalized_name": "Bavarian State Library", "country": "Germany", "identifiers": {"ror": "https://ror.org/031h71w90", "GRID": "grid.432478.e"}}]}], "publisher": null, "date": "2001-09-15", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg01/kocher-boehler.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Departing from an aphorism by G. Ch. Lichtenberg - that words stand still while the world designated by them moves on and that therefore words ought to be reexamined periodically for their adequacy vis-à-vis the new realities - the essay explores the term ›Spiel‹ (›play‹/›game‹) for its possible potential as a key-concept linking post-kantian Aesthetics, Gadamer’s Hermeneutics and Iser’s Reader-Response Criticism as analytical tools for the new artistic genres of electronic hyperfiction and computer games. Tracing the history of the term ›Spiel‹ as it oscillates between an abstract figurative meaning as a purely mental interplay between the different cognitive faculties and its reference to concrete performative acts in a leisurely purposeless mood the authors show their branching out into an outright dichotomy in the post-kantian Aesthetics and they postulate the re-convergence of the two meanings in the new artistic forms of literary hyperfictions and computer games.", "article_title": "ÜBER DEN ÄSTHETISCHEN BEGRIFF DES SPIELS ALS LINK ZWISCHEN TRADITIONELLER TEXTHERMENEUTIK, HYPERFICTION UND COMPUTERSPIELEN", "authors": [{"given": "Manuela", "family": "Kocher", "affiliation": [{"original_name": "Zürich", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Michael", "family": "Böhler", "affiliation": [{"original_name": "Zürich", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2001-11-26", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg01/tiutenko.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "A look from the viewpoint of the linguistic theory of text, as in this article, may result in reconsideration of some key-ideas common to many non-linguistic publications about hypertext. Since hypertext is frequently thought of as a primarily textual phenomenon (single text or system of texts), the authors of this article search for its linguistic definition based upon the knowledge about text production and reception that was gathered by many researchers in text linguistics during past four decades. A genuine concept of hypertext developed by computer science in 1960s-1980s serves in this case as a framework for the discussion. The article shows that verbal components of hypertext have to satisfy the general textuality criteria to become texts. Those criteria, however, clash with the notion of hypertext as a kind of non-constrained text and make the philosophical vision of an unlimited, universal hypertext unrealistic.", "article_title": "TEXT IM HYPERTEXT. EIN TEXTLINGUISTISCHER BLICK AUF DIE INFORMATIONSGESTALTUNG IM INTERNET", "authors": [{"given": "Klaudia", "family": "Prokopczuk", "affiliation": [{"original_name": "Sprachenzentrum, Friedrich-Alexander-Universität, Erlangen", "normalized_name": "University of Erlangen-Nuremberg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00f7hpc57", "GRID": "grid.5330.5"}}]}, {"given": "Arthur", "family": "Tiutenko", "affiliation": [{"original_name": "Sprachenzentrum, Friedrich-Alexander-Universität, Erlangen", "normalized_name": "University of Erlangen-Nuremberg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00f7hpc57", "GRID": "grid.5330.5"}}]}], "publisher": null, "date": "2001-09-15", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg01/rommel.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Advanced Computing in the Humanities (ACO*HUM) was a SOCRATES/ ERASMUS thematic network designed to analyse the state of humanities computing in Europe. Experts from different countries and with different fields of expertise compiled a survey on the influence of humanities computing at European universities. The methodological implications of formal methods in the humanities and the different approaches to teaching advanced computational skills provide valuable insights into the different attitudes towards education and in particular humanities education at universities in Europe. The revision of curricula and the implementation of humanities computing centres seems a necessary development in the information society of the twenty-first century; here ACO*HUM provides a knowledge base for students, teachers, and administrators.", "article_title": "EUROPA UND DIE NEUEN MEDIEN. ACO*HUM EVALUIERT DIE GEISTESWISSENSCHAFTEN", "authors": [{"given": "Thomas", "family": "Rommel", "affiliation": [{"original_name": "School of Humanities an Social Sciences, International University Bremen", "normalized_name": "Jacobs University", "country": "Germany", "identifiers": {"ror": "https://ror.org/02yrs2n53", "GRID": "grid.15078.3b"}}]}], "publisher": null, "date": "2001-06-07", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg01/steding.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Many paper based scholarly editions struggle with the limitations of paper and the typographic means of expression. They are difficult to use, potentially incomplete, and in many cases they do not meet the informational needs and expectations of the users. Digital editions offer serious solutions to many of these problems. They should not be seen simply as ›improved‹ editions, but as a new form of philological data storage. The computer allows new types of scholarly editions and new methods for accessing the data. It therefore is no longer necessary to offer all scholarly editions in print.", "article_title": "WARUM NOCH DRUCKEN? ÜBER DIE NACHTEILE GEDRUCKTER EDITIONEN", "authors": [{"given": "Sören", "family": "Steding", "affiliation": [{"original_name": "Institut für Germanistik, Regensburg", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2001-11-26", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg02/mccarty.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The question of academic legitimacy for humanities computing is argued from an heuristic, experimental perspective. The basic approach is to privilege what happens in actual practice, to observe the commonalities and generalize from them to a picture of the interrelations between the field and the non-technical disciplines of the humanities. These generalizations also lead to discovery of intellectual kinships with several traditional fields of study: philosophy and history (including the history and philosophy of science), ethnography, sociology, literary criticism and so on. The essay argues that in these kinships are to be found the basic questions with which we may build a computing that is of as well as in the humanities.", "article_title": "NEW SPLASHINGS IN THE OLD POND: THE COHESIBILITY OF HUMANITIES COMPUTING", "authors": [{"given": "Willard", "family": "McCarty", "affiliation": [{"original_name": "Centre for Computing in the Humanities, King's College London", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}]}], "publisher": null, "date": "2002-10-16", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg02/meister2.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The article's point of departure is a clarification of the principle conditions that would have to be fulfilled by Computer Philology in order to qualify as a discipline. This is followed by reviewing steps taken with a view to the possible institutionalization of Computer Philology at Hamburg University. The above theoretical considerations, as well as the reference to the practical example will form the backdrop for reviewing three articles presented in recent years which have aimed to answer the question »What is Computer Philology?«. The contributions under discussion are seen to differ mainly with regard to the implications which they hold for Computer Philology's development into a discipline proper. The article's conclusion is that we ought to »Think Big» in Computer Philology and aspire to meet the criteria for disciplinarity which are considered an important scholarly benchmark.", "article_title": "»THINK BIG»: DISZIPLINARITÄT ALS WISSENSCHAFTSTHEORETISCHE BENCHMARK DER COMPUTERPHILOLOGIE", "authors": [{"given": "Jan Christoph", "family": "Meister", "affiliation": [{"original_name": "Forschergrupper Narratologie, Institut für Germanistik II, Hamburg", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2002-08-07", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg02/orlandi.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "At the beginning, the article mentions the results of an enquiry on how humanities computing is being introduced into the curricula of the European universities; and the most important topics recently discussed around the theme of a theory of humanities computing. It appears that most experts agree on the opinion that humanities computing is an independent discipline, and as such it should be introduced into the faculties of humanities. The article then explains how the foundation of the discipline should be understood, on the basis of computing theory and the methodology of the different humanities disciplines.", "article_title": "IS HUMANITIES COMPUTING A DISCIPLINE?", "authors": [{"given": "Tito", "family": "Orlandi", "affiliation": [{"original_name": "Centro Interdipartimentale di Servizio per l'Automazione nelle Discipline Umanistiche, Università degli Studi di Roma - LA SAPIENZA", "normalized_name": "Sapienza University of Rome", "country": "Italy", "identifiers": {"ror": "https://ror.org/02be6w209", "GRID": "grid.7841.a"}}]}], "publisher": null, "date": "2002-05-17", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg02/rockwell.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "While we are tired of discussing whether humanities computing is a discipline or an interdisciplinary field, it is still worth looking at what it is to become a discipline. Starting with a discussion of disciplinarity I argue that when a field begins to control the means of its academic reproduction through programmes it becomes a discipline. This founding moment of rupture with the surrounding disciplines should not be overlooked, nor should the dangers inherent in the defining of a field that happens through formalization in educational structures. In multimedia, in particular, there is a rupture around the place of the crafts of digital creation that places us in conflict with ideas about the liberal and servile (applied) arts. This will be the contribution of the digital humanities – a reorientation to craft and creative art in the humanities. There is no more stunning fact about the academic profession anywhere in the world than the simple one that academics are possessed by disciplines, fields of study, even as they are located in institutions. With the growth of specialization in the last century, the discipline has become everywhere an imposing, if not dominating, force in the working lives of the vast majority of academics. A discipline is born when a field takes control of its means of reproduction, specifically the ability to produce ›disciples‹ or students. The founding of a discipline is a rupture in the existing structure of institutions, one which is outside the founded discipline, being the condition of its becoming. The founding of a discipline is a liminal moment that defines the relationship between the discipline and those surrounding institutions. Humanities computing (HC) is becoming a discipline as it struggles to understand itself, struggles with existing disciplines and finds a new place within institutions. This paper will look at the emergence of humanities computing programmes as the founding of a discipline and the possibilities for rupture.", "article_title": "MULTIMEDIA, IS IT A DISCIPLINE? THE LIBERAL AND SERVILE ARTS IN HUMANITIES COMPUTING", "authors": [{"given": "Geoffrey", "family": "Rockwell", "affiliation": [{"original_name": "School of the Arts, Humanities Computing Centre, McMaster University, Hamilton", "normalized_name": "McMaster University", "country": "Canada", "identifiers": {"ror": "https://ror.org/02fa3aq29", "GRID": "grid.25073.33"}}]}], "publisher": null, "date": "2002-11-08", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg02/unsworth.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "I'll give the short answer to the question »what is humanities computing?« up front: it is foreshadowed by my two epigraphs. Humanities computing is a practice of representation, a form of modeling or, as Wallace Stevens has it, mimicry. It is also (as Davis and his co-authors put it) a way of reasoning and a set of ontological commitments, and its representational practice is shaped by the need for efficient computation on the one hand, and for human communication on the other. We'll come back to these ideas, but before we do, let's stop for a moment to consider why one would ask a question such as »what is humanities computing?«", "article_title": "WHAT IS HUMANITIES COMPUTING AND WHAT IS NOT?", "authors": [{"given": "John", "family": "Unsworth", "affiliation": [{"original_name": "Department of English, Institute for Advanced Technology in the Humanities, University of Virginia", "normalized_name": "University of Virginia", "country": "United States", "identifiers": {"ror": "https://ror.org/0153tk833", "GRID": "grid.27755.32"}}]}], "publisher": null, "date": "2002-11-08", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg02/boesken.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The past decade has seen the rise of quite a few new technologies. The computer and the internet have undoubtedly reached the status of mass media by now and discussions have been led about whether this phenomenon will finally force the exodus of ›the book‹ and of ›reading‹ – discussions that are well known from earlier times as in regard to the assumed competition between other electronic technologies, e.g. television, and the print media. This essay aims to take a closer look at these theories and tries to distinguish two different levels of the discussion that tend to be mixed up easily, as on one hand arguments are presented that relate to the medium itself and on the other hand arguments that relate to its products, such as the hypertext. Further to this, the essay aims to oppose the mentioned theories and assumptions with factual reality and examine their validity. It builds up on the results of a representative study investigating the attitude towards media in Germany in 2000 and it concludes that – at the time being – no extrusion of ›the book‹ or ›reading‹ in favour of the use of new technologies can be observed. Moreover, this essay aims to show that the assumed ›added value‹ of the hypertext (compared to linear presentation of printed text) should be studied more carefully. Hypertext does indeed offer some added value, but also bears the risk of disorientation and stress which might transform ›extra value‹ to ›less value‹.", "article_title": "LESEN AM COMPUTER – MEHRWERT ODER MEHR VERWIRRUNG? UNTERSUCHUNGEN ZUR ›KONKURRENZ‹ ZWISCHEN BUCH UND HYPERTEXT", "authors": [{"given": "Gesine", "family": "Boesken", "affiliation": [{"original_name": "Köln", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2002-04-22", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg02/gallet-martinet.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The technology of hypermedia presentation can be developed so as to highlight the new approaches of cultural geography, which emphasise the complexities of townscape perception. Hypermedia programs on urban history offer the options of relating maps and projects to views of built areas, or documents on social history to their cultural background, through interface elements such as windows, animations, interchangeable pictures, which structure the documents as embedded spaces, appearing as sets of options. This interactive presentation, which makes the unfolding of the program dependent on the user's choices, stresses the importance of the virtual as an essential constituent of the perception of cityscape. Historical studies of urban culture in recent years have stressed the complexities of townscape perception, favouring an interdisciplinary approach in which semiotics, including rhetoric and image analysis, are applied to cultural geography, an approach indebted to the ›linguistic turn‹ now followed by the ›visual turn‹. The technology of hypermedia presentation can be developed so as to highlight this new conceptualisation. The epistemology of hypermedia has itself undergone an evolution in the past ten years, since the first theories defined programs by their governing ›metaphors‹ whereas the more recent ones were indebted to ›constructivism‹, stressing the user's role. The argument will primarily be based on the CD-ROM Georgian Cities (authored by the research centre Cultures Anglophones et Technologies de l'Information – CATI, Université Paris-Sorbonne – Paris IV), which was designed so as to demonstrate the potential of hypermedia for urban studies.", "article_title": "HYPERMEDIA AND URBAN CULTURE: A PRESENTATION ON THE CD-ROM GEORGIAN CITIES", "authors": [{"given": "Liliane", "family": "Gallet-Blanchard", "affiliation": [{"original_name": "Centre Cultures Anglophones et Technologies de l'Information CATI, Université Paris-Sorbonne - Paris IV", "normalized_name": "University of Paris-Sud", "country": "France", "identifiers": {"ror": "https://ror.org/028rypz17", "GRID": "grid.5842.b"}}]}, {"given": "Marie-Madeleine", "family": "Martinet", "affiliation": [{"original_name": "Centre Cultures Anglophones et Technologies de l'Information CATI, Université Paris-Sorbonne - Paris IV", "normalized_name": "University of Paris-Sud", "country": "France", "identifiers": {"ror": "https://ror.org/028rypz17", "GRID": "grid.5842.b"}}]}], "publisher": null, "date": "2002-10-17", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg02/rudman.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Non-traditional authorship attribution studies are those attribution studies that make use of the computer, statistics, and stylistics. The hypothesis behind these studies is that an author has a unique and identifiable style. The computer has now become ubiquitous in eighteenth century literary studies and is the main reason why non-traditional authorship studies have advanced to where they are. David Holmes gives a good overview of the field in, The Analysis of Literary Style – A Review.[1] This article surveys a representative sample of authorship studies of eighteenth century literature and gives an exemplum of an ongoing study.", "article_title": "NON-TRADITIONAL AUTHORSHIP ATTRIBUTION STUDIES IN EIGHTEENTH CENTURY LITERATURE. STYLISTICS STATISTICS AND THE COMPUTER", "authors": [{"given": "Joseph", "family": "Rudman", "affiliation": [{"original_name": "Department of English, Carnegie Mellon University, USA", "normalized_name": "Carnegie Mellon University", "country": "United States", "identifiers": {"ror": "https://ror.org/05x2bcf33", "GRID": "grid.147455.6"}}]}], "publisher": null, "date": "2002-10-16", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg02/will.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The transcription and electronic edition of Jean Paul's Exzerpthefte (excerpts), initiated and directed by Helmut Pfotenhauer at the University of Würzburg, is a project which was first sponsored by the Fritz Thyssen Foundation and is now supported by the Deutsche Forschungsgemeinschaft. The following article first gives a description of the manuscripts in question and outlines their special character and importance: in 45 years, Jean Paul has written down more than 12000 pages of excerpts, a very curious private encyclopaedia, which he intensively used during the writing of his novels and other texts. In a second part, the article delimits the philological and digital intentions of the edition: it is mainly conceived as a support for future editors of the revised historico-critical edition of Jean Paul's works, who will use it to comment the text and describe the author's writing method. In a third step, the article concentrates upon the digital realisation of the project, especially on the text markup, but also the used markup model designed by the Text Encoding Initiative (TEI) and the software used in different stages of the work (transcription, encoding, retrieval).", "article_title": "DIE ELEKTRONISCHE EDITION VON JEAN PAULS EXZERPTHEFTEN", "authors": [{"given": "Michael", "family": "Will", "affiliation": [{"original_name": "Institut für Deutsche Philologie der Universität Würzbug", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2002-08-16", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg03/froemming-etal.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Internet-database Literary Life reflects the growing interest in interdependencies between literary production, reception and communication in relation to other fields and discourses. It aims to encourage occupation with and research on all aspects of literary life in the German-speaking countries from 1945 up to the present time. Provided is information on a variety of subjects such as literary prizes and exhibitions, literary debates and scandals, forms and aspects of political engagement of writers or the activities of institutions of the literary field. The form of presentation refrains from giving information bound in narrative structures, thus enabling the user to organize, combine and select materials according to the requirements of the particular question asked. The article gives further insight into problems and advantages of the database's design as well as its technical realization.", "article_title": "LITERARISCHES LEBEN. DATENBANK ZU DEN DEUTSCHSPRACHIGEN LäNDERN 1945-2000. Projektbericht http://www.literarischesleben.uni-goettingen.de", "authors": [{"given": "Gesa", "family": "Frömming", "affiliation": [{"original_name": "Projekt Literarisches Leben, Seminar für Deutsche Philologie, Göttingen", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Claudius", "family": "Sittig", "affiliation": [{"original_name": "Projekt Literarisches Leben, Seminar für Deutsche Philologie, Göttingen", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Roland", "family": "Baier", "affiliation": [{"original_name": "Gesellschaft für wissenschaftliche Datenverarbeitung mbH Göttingen (GWDG)", "normalized_name": "Gesellschaft für wissenschaftliche Datenverarbeitung mbH Göttingen", "country": "Germany", "identifiers": {"ror": "https://ror.org/00cd95c65", "GRID": "grid.434972.f"}}]}, {"given": "Burkhard", "family": "Heise", "affiliation": [{"original_name": "Gesellschaft für wissenschaftliche Datenverarbeitung mbH Göttingen (GWDG)", "normalized_name": "Gesellschaft für wissenschaftliche Datenverarbeitung mbH Göttingen", "country": "Germany", "identifiers": {"ror": "https://ror.org/00cd95c65", "GRID": "grid.434972.f"}}]}], "publisher": null, "date": "2004-03-24", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg03/mmeier.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Journals are still the principal means by which new scientific knowledge is disseminated. The recent high and fast-rising cost of journals has had a devastating effect on the flow of scientific communication, the research community, and library collections. The following article provides an overview of the forces in the scientific communication market focusing on the particularly difficult situation for journals in the scientific, technical and medical (STM) fields. The impact of rising journal prices is aggravated by the availability of new media – such as Web editions of existing journals. Researchers – whose work is paid for by the university or the federal government – increasingly give away their research to commercial journals, which then charge universities high subscription fees in order to buy it back. The papers that appear in STM journals are typically provided free by academic researchers and are subject to peer review by academic referees and editors, who also receive little if any remuneration. To alleviate this difficult situation, numerous projects that represent a direct and strong competitive alternative to existing high-priced titles in important established STM fields have been launched. This article describes the far reaching transformation of the STM publishing market under way which will also change other scientific professions such as the humanities.", "article_title": "AUTOREN ALS VERLEGER. DIE ZUKUNFT DER WISSENSCHAFTLICHEN KOMMUNIKATION?", "authors": [{"given": "Michael", "family": "Meier", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2004-03-24", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg03/morgenthaler2.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Handwritten documents like Gottfried Keller's ›Studien- und Notizbücher‹ (›study and note books‹) demand an edition, which accounts for the special character of text witnesses. It is not the task to transfer the records into ›edited texts‹ only, but to make them visible inside their topographic embedding. The Historisch-Kritische Gottfried Keller-Ausgabe (Historical-Critical Gottfried Keller Edition) complies with these requirements owing to the complete reproduction of the text witnesses and the complement of each hand written page with a diplomatic transcription. The computer edition on CD-ROM, issued with the book, intends to implement appropriately the interaction of hand writing and transcription as well within the electronic media. This specification includes, aside from a word by word parallelisation, also a search option for character strings, which spans the entire corpus of the text witnesses. Thus, the limitation to sole textual and graphic display, which still rules today's electronic media, is overcome.", "article_title": "GOTTFRIED KELLERS STUDIENBÜCHER - ELEKTRONISCH EDIERT", "authors": [{"given": "Walter", "family": "Morgenthaler", "affiliation": [{"original_name": "Basel, Schweiz", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2004-03-24", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg03/opitz.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "With the help of specialists in the relevant fields the Herzog August Bibliothek is engaged in a pilot project concentrating on five genres characteristic of the 17th century – pamphlets, emblem books, almanacs, prayer books and books on the plague and other contagions – in order to develop document type definitions accessible via the internet. These DTDs can be employed in the future as worldwide standardisation tools for the publication and retrieval of the genres concerned. They will be developed on an empirical basis and demonstrated by using a large and representative sample of titles from each genre. We use the Text Encoding Initiative (TEI) and XML to encode text and metadata. The source XML-data is transformed into static HTML by an XSLT-script and thus offered to the public via the internet. The project is supported by the Deutsche Forschungsgemeinschaft (DFG)", "article_title": "DOCUMENT TYPE DEFINITIONS ZUR ERSCHLIEßUNG VON GATTUNGEN DES BAROCK IM INTERNET. EIN PROJEKT AN DER HERZOG AUGUST BIBLIOTHEK WOLFENBÜTTEL", "authors": [{"given": "Andrea", "family": "Opitz", "affiliation": [{"original_name": "Herzog-August-Bibliothek, Abteilung Alte Drucke", "normalized_name": "Herzog August Library", "country": "Germany", "identifiers": {"ror": "https://ror.org/02y5mkh60", "GRID": "grid.461604.1"}}]}], "publisher": null, "date": "2004-03-24", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg03/schicketanz-heiligenhaus.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Historical newspapers and journals are invaluable sources for the study of the past. Especially, Jewish periodicals provide a detailed impression of the cultural development of Jewry and shed a quite different light on German history. Yet, it is tremendously difficult to obtain and to investigate these sources: Besides ›normal‹ losses (paper destruction et cetera), a great stock of Jewish newspapers was destroyed under the Nazi regime or are scattered all over the world – a fact, that forces a researcher to expensive stays in different libraries or archives and compels librarians to an extra burden of work. Within the funding program Scientific Library Services and Information Systems of the Deutsche Forschungsgemeinschaft the Aachen Chair of German-Jewish Literary History, the Cologne library Germania Judaica and the Town and University Library Frankfurt/Main carry out a digitization project, which already provides more than twenty representative periodicals, containing about 300.000 images in the WWW. The essay emphasizes the implications and the broad range of problems as well as their solutions in the process of digitizing periodicals. A discussion of the project's technological goals demonstrates the single strategies und procedures to publish large amounts of images, text and bibliographical data in an economic and structured way.", "article_title": "»INSELN IM MEER DES BELIEBIGEN«. ARCHITEKTUR UND IMPLEMENTIERUNG EINES INTERNETPORTALS DEUTSCH-JÜDISCHE PERIODIKA", "authors": [{"given": "Till", "family": "Schicketanz", "affiliation": [{"original_name": "Germanistisches Institut der RWTH Aachen", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Kay", "family": "Heiligenhaus", "affiliation": [{"original_name": "Semantics Kommunikationsmanagement GmbH, Aachen", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2004-03-24", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg03/schreier.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This contribution focuses on pseudo-documentaries on the internet which are regarded as the most recent example of the present-day media trend towards an increasing blurring of the line between fact and fiction. After outlining the tradition of especially audiovisual hybrid media products in which pseudo-documentaries can be seen to stand, various approaches for [distinguishing between fact and fiction are discussed and a three-pronged model for evaluating the reality status of media products is presented. On the basis of this model, pseudo-documentaries are reconstructed as a type of fiction that lacks any clear paratextual signals as to its fictional status; instead, the impression is created (as part of the plot) that product actually constitutes fact. This impression is further supported by a highly realistic production mode that is achieved by presenting a large amount of seemingly authentic material. With respect to content, however, most pseudo-documentaries contain highly implausible as well as topical elements which in turn can function as signals pointing recipients to the fictional status of these products. Content analysis of a random sample of e-mails from internet newsgroups about the pseudo-documentary horror film The Blair Witch Project shows, however, that approximately one third of these recipients are somewhat confused concerning the reality status of the film, basing their evaluation for the most part on information obtained from other media products. Even those recipients who correctly consider the film to be fiction or a hybrid hardly ever make use of the strongest signals to that effect contained in the product, but rely on mediated information instead. These results are supported by a comparison with two companion studies.", "article_title": "PSEUDO-DOKUMENTATIONEN: ZUM VERSCHWIMMEN DER GRENZE ZWISCHEN REALITÄT UND FIKTION IN DEN MEDIEN", "authors": [{"given": "Margrit", "family": "Schreier", "affiliation": [{"original_name": "International University Bremen, School of Humanities and Social Sciences", "normalized_name": "Jacobs University", "country": "Germany", "identifiers": {"ror": "https://ror.org/02yrs2n53", "GRID": "grid.15078.3b"}}]}], "publisher": null, "date": "2004-03-11", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg04/buettner/buettner.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The integration of the medium Internet into the traditional system of scientific communication is still in a transitional process. New ways of knowledge transfer, different forms of communication as well as information retrieval are yet to be tested. Depending on the different communication cultures among academic disciplines, the focus of interest might vary and should be adjusted to a variety of needs and individual preferences. For the field of historical science, the example of the internet-project historicum.net and its predecessor Server Frühe Neuzeit may illustrate the search for appropriate concepts as well as the problems that arise.", "article_title": "ERFAHRUNGEN MIT DER VIRTUELLEN WISSENSCHAFT. VOM SERVER FRÜHE NEUZEIT ZUM HISTORICUM.NET", "authors": [{"given": "Sabine", "family": "Büttner", "affiliation": [{"original_name": "Universität zu Köln", "normalized_name": "University of Cologne", "country": "Germany", "identifiers": {"ror": "https://ror.org/00rcxh774", "GRID": "grid.6190.e"}}]}], "publisher": null, "date": "2004-12-07", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg04/duerhub/duerhub.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper focuses on the development of the e-journal IASLonline with special emphasis on the technical development of the publication of reviews. The technical editing process up to the publication of the reviews is presented in detail. As electronic publications can greatly increase the efficiency and pace of academic communication, the article argues for an equal treatment of non-profit electronic publications and print publications with regard to printing cost subsidies for publishing houses.", "article_title": "IASLONLINE – ZUM MEDIENWECHSEL. IN DER FACHKOMMUNIKATION", "authors": [{"given": "Oliver", "family": "Dürselen", "affiliation": [{"original_name": "FernUniversität in Hagen, Institut für Neuere deutsche und europäische Literatur", "normalized_name": "University of Hagen", "country": "Germany", "identifiers": {"ror": "https://ror.org/04tkkr536", "GRID": "grid.31730.36"}}]}, {"given": "Martin", "family": "Huber", "affiliation": [{"original_name": "FernUniversität in Hagen, Institut für Neuere deutsche und europäische Literatur", "normalized_name": "University of Hagen", "country": "Germany", "identifiers": {"ror": "https://ror.org/04tkkr536", "GRID": "grid.31730.36"}}]}], "publisher": null, "date": "2005-05-10", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg04/gross/gross.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Heinrich-Heine-Portal (<http://www.hhp.uni-trier.de>) is a digital edition of Heinrich Heine's (1797-1856) works and letters. It was established in autumn 2002 as a cooperation between the Heinrich-Heine-Institut (HHI), Düsseldorf, and the Competence Centre for Information Retrieval and Electronic Publishing in the Humanities at the University of Trier and is being supported by the Deutsche Forschungsgemeinschaft (DFG) and the Kunststiftung Nordrhein-Westfalen. In addition to a complete, annotated scientific edition of the poet's works and letters, the Heinrich-Heine-Portal presents digital images of his manuscripts held by the Heinrich-Heine-Institut and other literary archives. Access for users is free of charge. The electronic version is based on the two reference editions of Heine: the Düsseldorfer Heine-Ausgabe (DHA) for the works and the Weimar Heine-Säkular-Ausgabe (HSA) for the letters. The edition of the letters is being revised and updated, newly-discovered letters and corrigenda are added. Not only does the portal interlink edited texts, indices, commentaries et cetera and vice-versa, it also provides the electronic facsimiles of the textual transmission in Heine's manuscripts and printed materials (i.e. First Editions, newspaper publications); it thus allows for a close study of all the primary sources still available. In addition, the portal offers digital images of contemporary pictures and paintings, including the portraits of the poet. An extensive bibliography will be added at a later date and kept up-to-date continually by the Heinrich-Heine-Institut. The HHP thus represents a comprehensive platform for research on Heinrich Heine. This paper describes the essential steps of the project from the close analysis of the printed editions and their structural and typographical characteristics, the digitizing process, the encoding principles and the encoding practices by means of TUSTEP (Tübinger System von Textverarbeitungsprogrammen), the markup according to the TEI Guidelines and, finally, the electronic publication by consistently using Open Source software such as the database management system MySQL and the content management system ZOPE.", "article_title": "DER DIGITALE HEINE – EIN INTERNETPORTAL. ALS INTEGRIERTES INFORMATIONSSYSTEM", "authors": [{"given": "Nathalie", "family": "Groß", "affiliation": [{"original_name": "Kompetenzzentrum für elektronische, Erschließungs- und Publikationsverfahren in den Geisteswissenschaften an der Universität Trier", "normalized_name": "University of Trier", "country": "Germany", "identifiers": {"ror": "https://ror.org/02778hg05", "GRID": "grid.12391.38"}}]}], "publisher": null, "date": "2005-04-27", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg04/jaeger.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Goethezeitportal has been developed on the initiative of a team based at the Institute of German Literature at the university of Munich. It is a tool that can be used for the innovative processing and dissemination of knowledge by applying the possibilities offered by the new media to the cultural and scientific discourse on the most significant phase in the history of German intellectual history between 1770 and 1830. Further information on the concept, mission and current activities of the portal is available below.", "article_title": "DAS GOETHEZEITPORTAL – EIN WERKSTATTBERICHT", "authors": [{"given": "Georg", "family": "Jäger", "affiliation": [{"original_name": "Ludwig-Maximilians-Universität München, Institut für Deutsche Philologie", "normalized_name": "Ludwig-Maximilians-Universität München", "country": "Germany", "identifiers": {"ror": "https://ror.org/05591te55", "GRID": "grid.5252.0"}}]}], "publisher": null, "date": "2004-10-25", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg04/michel.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Virtual Library for German Studies (ViFa Germanistik) is being developed at the University Library of Frankfurt/Main in cooperation with Deutscher Germanistenverband, Deutsches Literaturarchiv Marbach and with a group of German specialists. Intended as a central portal for German Studies, it will offer access not only to the fully integrated OPAC, containing both conventional and electronic media, but also to links with selective qualified information/internet resources. In addition, ViFa Germanistik will integrate a communication site allowing comprehensive orientation on scholarly and organizational matters.", "article_title": "DIE VIRTUELLE FACHBIBLIOTHEK GERMANISTIK – EINE PROJEKTSKIZZE", "authors": [{"given": "Volker", "family": "Michel", "affiliation": [{"original_name": "Universitätsbibliothek Johann Christian Senckenberg, Frankfurt am Main", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2005-03-17", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg04/dimpel.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The following paper offers an introduction to a set of programs called ErMaStat, which is an instrument for textual analysis of Middle High German rhymed epics. With the help of ErMaStat, texts can be analysed with respect to statistical differences, for example in the case of uncertain authorship or if the relative chronology of works of one author is unclear. ErMaStat is the first set of programs in the area of German Medieval Studies which makes it possible to record a large number of different textual features automatically and without any manual input, and subsequently carries out a statistical analysis. The scope of the textual features that can be examined is wide: It ranges from simple quantitative features such as words per line, function words and grammatical phenomena to an automatic analysis of meter. The power of ErMaStat is demonstrated on a number of scholarly issues in German Medieval Literature. It can be shown that the results of the so-called ›schallanalytische Untersuchungen‹ practised by Elisabeth Karg-Gasterstädt are more plausible than hitherto assumed. Another result is that statistical evidence can be presented for the theory that the first thousand lines of Hartmann von Aue's Iwein were written immediately after Hartmann had finished Erec.", "article_title": "TEXTSTATISTISCHE UNTERSUCHUNGEN AN MITTELHOCHDEUTSCHEN TEXTEN", "authors": [{"given": "Friedrich Michael", "family": "Dimpel", "affiliation": [{"original_name": "Universität Erlangen-Nürnberg", "normalized_name": "University of Erlangen-Nuremberg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00f7hpc57", "GRID": "grid.5330.5"}}]}], "publisher": null, "date": "2004-11-23", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg04/luedeling/ddd.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper describes plans for a diachronic corpus of German, which contains texts from Old High German to Modern German. In order to serve as a resource for research questions from many different fields (linguistics, literature, lexicography et cetera) the corpus must have a flexible architecture as well as a high degree of standardization of content. This flexibility is possible through a multi-layer standoff corpus model where the texts are stored in a central database. Standardization is ensured through common tagsets on each annotation level.", "article_title": "DEUTSCHDIACHRONDIGITAL – EIN DIACHRONES KORPUS DES DEUTSCHEN", "authors": [{"given": "Anke", "family": "Lüdeling", "affiliation": [{"original_name": "Institut für deutsche Sprache und Linguistik Humboldt-Universität zu Berlin", "normalized_name": "Institute for the German Language", "country": "Germany", "identifiers": {"ror": "https://ror.org/00hvwkt50", "GRID": "grid.443960.c"}}]}, {"given": "Thorwald", "family": "Poschenrieder", "affiliation": [{"original_name": "Institut für deutsche Sprache und Linguistik Humboldt-Universität zu Berlin", "normalized_name": "Institute for the German Language", "country": "Germany", "identifiers": {"ror": "https://ror.org/00hvwkt50", "GRID": "grid.443960.c"}}]}, {"given": "Lukas", "family": "Faulstich", "affiliation": [{"original_name": "Institut für deutsche Sprache und Linguistik Humboldt-Universität zu Berlin", "normalized_name": "Institute for the German Language", "country": "Germany", "identifiers": {"ror": "https://ror.org/00hvwkt50", "GRID": "grid.443960.c"}}]}], "publisher": null, "date": "2005-02-07", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg04/simon.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In the German copyright law so far the legislator has basically considered the interests of the industry rightholders for a commercial use of digital media during the implementation of the EC Copyright Directive 2001/29/EC. But the public in science and education is not allowed to use the new potentials of the information society as they need them. Six main German science organisations, more than 230 scientific societies and institutions and more than 3100 distinguished scientists and educa-tors have established the Alliance for Copyright in Education and Science to change this unbalanced situation. The aims of this movement for a better copyright law will be explained in this paper: In a digital and networked information society everyone should have access to world-wide information at any time and from everywhere for educational and scientific purposes.", "article_title": "Das Aktionsbündnis Urheberrecht für Bildung und Wissenschaft und seine Ziele", "authors": [{"given": "Hartmut", "family": "Simon", "affiliation": [{"original_name": "Universität Siegen", "normalized_name": "University of Siegen", "country": "Germany", "identifiers": {"ror": "https://ror.org/02azyry73", "GRID": "grid.5836.8"}}]}], "publisher": null, "date": "2005-03-18", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg04/wirth.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This essay aims to sketching out the task of a future hypernarratology by exploring the narrative function of hyperlinks and other hypertext specific ways of building a hyperstructure within the frame of digital literature. The most important assumption for any hypernarratological analysis is that the interference between the propositional content of the textual elements and the meaning, ascribed to the hypertext specific ways of connecting textual elements, is relevant for the mise en scènce, and hence, for the understanding of any hypernarrative. The performative aspect of these hypertext specific ways of connecting textual elements are examined by a close reading of Susanne Berkenheger's Hypertext Hilfe!. In the focus of interest is herebey the narrative function of performative dynamical connections.", "article_title": "»WEM DER GROSSE WURF GELUNGEN«... ANSÄTZE EINER HYPERNARRATOLOGIE. DARGESTELLT ANHAND VON SUSANNE BERKENHEGERS HYPERTEXT HILFE!", "authors": [{"given": "Uwe", "family": "Wirth", "affiliation": [{"original_name": "Johann Wolfgang Goethe-Universität Frankfurt, Institut für Deutsche Sprache und Literatur II", "normalized_name": "Goethe University Frankfurt", "country": "Germany", "identifiers": {"ror": "https://ror.org/04cvxnb49", "GRID": "grid.7839.5"}}]}], "publisher": null, "date": "2004-11-18", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg04/wolber.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Freiburger Anthologie has been founded in 1999 by Klemens Wolber and Jochen Knaus. Originally it was a database of lyric poetry assembling the »most important« German poems of the period between 1720 and 1933. These data had been based on an evaluation of numerous anthologies and have been published on a web site.As part of an interdisciplinary project funded by the Deutsche Forschungsgemeinschaft (DFG) the Freiburger Anthologie is now being enlarged to cover not only poems but also traditional German folksongs and church hymns. A lot of poems and songs exist in various versions that have to be taken into account, and during the course of the work annotations and commentaries are to be added. Digital data processing of the texts and annotations ensure the special features of the website that offers the use of extensive search functions browsing the fields of the database. – This essay describes the development of the project and explains the principles used in editing and annotating lyrical texts. Finally the user numbers and target groups of the Freiburger Anthologie are presented.", "article_title": "DIE ALTE UND DIE NEUE FREIBURGER ANTHOLOGIE – EINE ANTHOLOGISCHE LYRIKDATENBANK", "authors": [{"given": "Klemens", "family": "Wolber", "affiliation": [{"original_name": "Albert-Ludwigs-Universität Freiburg", "normalized_name": "University of Fribourg", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/022fs9h90", "GRID": "grid.8534.a"}}]}, {"given": "Jochen", "family": "Knaus", "affiliation": [{"original_name": "Albert-Ludwigs-Universität Freiburg", "normalized_name": "University of Fribourg", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/022fs9h90", "GRID": "grid.8534.a"}}]}], "publisher": null, "date": "2005-04-20", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg05/kornstaedt/kornstaedt.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "While computer-based searching techniques are well-established for texts, searching techniques for musicological documents are far from being standardized yet. This stems from the significant differences between what is searched, to what these searches pertain and how musical data is represented. The following provides an overview what these differences are and outlines the perspectives for future developments in the filed of computer-based search techniques in musicology.", "article_title": "Computergestützte Suchverfahren in der Musikwissenschaft", "authors": [{"given": "Andreas", "family": "Kornstädt", "affiliation": [{"original_name": "Quickborn", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2005-08-05", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg05/muxeneder/muxeneder.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "With digitalization and publication of the heterogenous extant sources of the Arnold Schönberg legacy, a multitude of methodically formulated questions are being raised that serve as examples of interest for similar collections. The virtual presentation of the music and text manuscripts, letters, works of visual art, calendars, diaries, historical documents, programms, reviews, first editions, photographs, as well as audiovisual sources brings together both archival and editorial concerns. The attempt has been made since 1998 on the website of the Arnold Schönberg Center in Vienna to bundle the media formatting possibilities of these sources with a variety of technological strategies, so that the user can both reflect on unique things of the legacy, as well as see their contextual relevance. How these intermediate Internet databases, static websites, digital facsimiles, as well as music and spoken word audio files present a synopsis of one of the most unique œuvres of the cultural history of the 20th century is the topic of this contribution. A main focus lies on the presentation of the source and facsimile database of letters as well as on the online Critical Complete Edition of Arnold Schönberg’s Writings.", "article_title": "Archivierung und virtuelle Edition – Arnold Schönbergs Nachlass als offenes Archiv", "authors": [{"given": "Therese", "family": "Muxeneder", "affiliation": [{"original_name": "Arnold Schönberg Center, Wien", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2006-01-25", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg05/veit.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "From the perspective of an editor who intends to make use of the new digital technologies some of the digital libraries and numerous musical databases founded within the last years (or, in a few cases, even in the last third of the last century) prove to be very helpful for daily work. But nevertheless, digital editions in a narrow sense are very rare in the field of music. Looking for the real reason for the delay of musicology in this field of research one has to admit that music proves to be very resistant to all endeavours of encoding. The mixture of graphical and letter symbols or ›normal‹ words in musical notation and the ambiguity of many musical signs lead to a lot of problems when trying to find a good, comprehensive and lasting representing system – which is the precondition for all sorts of analytical operations and for long-term editions too. Today all editions are done with proprietary software often totally out-dated a few years after publication. So one of the most urgent tasks is to find a standard representing system for music (notation). MusicXML and the XML-Code of the Music Encoding Initiative (MEI) are important steps on the way to a form of encoding which will allow the integration of versions and variants and their future re-visualization on the screen. A further problem is the electronic ›mapping‹ of music facsimiles. (Such facsimiles are of the utmost importance for editorial arguing.) But musicologists share these problems with all scholars dealing with ›written‹ documents, and this should be a cause to take joint action. A pool of digitally accessible sources and editions following the same electronic standards may be a starting point for basic research in musicology in a form which was unthinkable until now.", "article_title": "Musikwissenschaft und Computerphilologie – eine schwierige Liaison?", "authors": [{"given": "Joachim", "family": "Veit", "affiliation": [{"original_name": "Carl-Maria-von-Weber-Gesamtausgabe, Musikwissenschaftliches Seminar Detmold/Paderborn", "normalized_name": "Musikwissenschaftliches Seminar Detmold/Paderborn", "country": "Germany", "identifiers": {"ror": "https://ror.org/023392c84", "GRID": "grid.506479.9"}}]}], "publisher": null, "date": "2005-10-20", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg05/eskelinen.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "If we were to apply probably the most typical intertextual slogan to games and try to model our approach to them highlighting the idea that a game is a mosaic of other games, we are on the verge of seeing what's missing both from video game theories and the actual scholarly practice not to mention methodology. In short, how should we handle the complex co-presences, imitations, implementations, adaptations and transformations between and among different rule systems, goals, quest structures, tasks, challenges and obstacles, player representations, resources, non-playing characters, game worlds, game engines and platforms etc.? This is the conceptual territory this paper tries to begin to chart by crafting and exploring a general game ecology and its multiple relations to other transmedial modes and entertainment ecologies that also shape and affect individual games.", "article_title": "Explorations in game ecology, part 1", "authors": [{"given": "Markku", "family": "Eskelinen", "affiliation": [{"original_name": "Helsinki", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2005-08-27", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg05/furtwae.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This article suggests an analysis of computer and video games based on very general concepts and categories, e.g. causality between events, spatial and temporal structures, to get away from the application of traditional theories on computer games. This is only possible with a strong focus on players’ experiences. In which way does the medium of the game use players’ past experiences and knowledge to complement its own deficient structures?", "article_title": "Mensch-Maschine Computerspiel. Über eine notwendige Paartherapie in der Medienrealität", "authors": [{"given": "Frank", "family": "Furtwängler", "affiliation": [{"original_name": "Fachbereich Literaturwissenschaft Medienwissenschaft, Universität Konstanz", "normalized_name": "University of Konstanz", "country": "Germany", "identifiers": {"ror": "https://ror.org/0546hnb39", "GRID": "grid.9811.1"}}]}], "publisher": null, "date": "2006-02-21", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg04/hamburg.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The present paper introduces central paradigms, selection criteria and special topics for a introductory lecture on Computing in Text-oriented Humanities (CP). The term ›Computing in Text-oriented Humanities‹ (German ›Computerphilologie‹) should be understood as follows: ›Computer-‹ means some basic knowledge of non-technical user-applications while ›text oriented humanities‹ (germ. ›Philologie‹) is addressing those students and scientists dealing with language research themes or texts in any form. The paper is referring to a severalfold held course at the Language Department of the University of Hamburg.", "article_title": "COMUTERPHILOLOGIE IN HAMBURG. THEMATISCHE MODULE EINER COMPUTERPHILOLOGISCHEN GRUNDVORLESUNG", "authors": [{"given": "Walther v.", "family": "Hahn", "affiliation": [{"original_name": "Arbeitsbereich »Natürlichsprachliche Systeme« im Fachbereich Informatik, Universität Hamburg", "normalized_name": "Universität Hamburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00g30e956", "GRID": "grid.9026.d"}}]}, {"given": "Cristina", "family": "Vertan", "affiliation": [{"original_name": "Arbeitsbereich »Natürlichsprachliche Systeme« im Fachbereich Informatik, Universität Hamburg", "normalized_name": "Universität Hamburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/00g30e956", "GRID": "grid.9026.d"}}]}], "publisher": null, "date": "2005-03-14", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg05/hulle.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "To study a work’s creative process and reconstruct the dynamics of the composition history, ›genetic criticism‹ is particularly interested in so-called paralipomena (short jottings, notes, etc.). Because these paralipomena – by definition – do not belong to any specific version, they are often left out of critical editions. In scholarly editing, the notion of ›version‹ is usually defined as a text that already possesses a minimum of syntactic and structural characteristics of the published text. But in a work like James Joyce’s Finnegans Wake, characterized by numerous linguistic distortions, a single word can undergo several stages of transformation even before it is incorporated into a draft or ›version‹ of the text. This necessitates a smaller concept of the ›version‹ (›word version‹ or ›Wortfassung‹ as opposed to ›Textfassung‹). By using a separate XML tag to indicate paralipomena and external reference tags to indicate their relation to previous and subsequent word versions, it is possible to chart the development of verbal transformations and include paralipomena as an integral part of a work’s genesis.", "article_title": "The Inclusion of Paralipomena in Genetic Editions", "authors": [{"given": "Dirk", "family": "Van Hulle", "affiliation": [{"original_name": "University of Antwerp", "normalized_name": "University of Antwerp", "country": "Belgium", "identifiers": {"ror": "https://ror.org/008x57b05", "GRID": "grid.5284.b"}}]}], "publisher": null, "date": "2005-12-23", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg05/kehrein/kehrein.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The Digital Wenker Atlas (DiWA <http://www.diwa.info>) is primarily dedicated to the internet publication of 19th century language maps. Using satellite imaging technology, graphic files of about 1.6 GB each are linked to databases and placed at users' disposal via decompression on the fly. DiWA has grown to become a powerful information system that opens up hitherto unknown linguistic research possibilities. After an introduction to the technical aspects of the system and the range of contents, some of DiWA's capabilities are demonstrated in a case study.", "article_title": "Möglichkeiten der computergestützten Regionalsprachen- forschung am Beispiel des Digitalen Wenker-Atlas (DiWA)", "authors": [{"given": "Roland", "family": "Kehrein", "affiliation": [{"original_name": "Forschungsinstitut für deutsche Sprache, Deutscher Sprachatlas, Marburg", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Alfred", "family": "Lameli", "affiliation": [{"original_name": "Forschungsinstitut für deutsche Sprache, Deutscher Sprachatlas, Marburg", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Jost", "family": "Nickel", "affiliation": [{"original_name": "Forschungsinstitut für deutsche Sprache, Deutscher Sprachatlas, Marburg", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2006-01-09", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg05/wittdiewald.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In the mid-1990s, the Faculty of Linguistics and Literary-Studies at Bielefeld University began to establish the field Text technology, both in research and education. Text technology is a new field of research on the border of Computational Linguistics and Computational Philology. This paper focuses on Text technology in academic education. In 2002, Text Technology was introduced as a minor subject for B.A. Programs. It is organized in modules: Module 1 introduces the characteristics of electronic texts and documents, typography, typesetting systems and hypertext. Module 2 introduces one or two programming languages relevant to the field of humanities computing. Markup languages and the principles of information structuring are the main topics of Module 3. The formal fundamentals of computer-based text processing, as formal languages and their grammars, Logics et cetera are subjects of another module. The paper ends with a short description of other Bachelor- and Master-Programs at Bielefeld University which contain text technological themes.", "article_title": "Texttechnologie an der Universität Bielefeld", "authors": [{"given": "Andreas", "family": "Witt", "affiliation": [{"original_name": "Universität Tübingen", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Nils", "family": "Diewald", "affiliation": [{"original_name": "Fakultät für Linguistik und Literaturwissenschaft - Computerlinguistik und Texttechnologi, Universität Bielefeld", "normalized_name": "Bielefeld University", "country": "Germany", "identifiers": {"ror": "https://ror.org/02hpadn98", "GRID": "grid.7491.b"}}]}], "publisher": null, "date": "2006-02-16", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg05/zoellner-weber.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper presents a combination of literary studies and text technology. The goal of this work is to develop a formal representation and description system for literary characters. It should enable users either to search and compare literary characters and to integrate newly analysed characters. Technically, the system for description and representation is based on an ontology. The class system within the ontology is derived using literary character theories and own developed concepts. By using this description system new perspectives of literature and literary studies should be possible.", "article_title": "Formale Repräsentation und Beschreibung von literarischen Figuren", "authors": [{"given": "Amélie", "family": "Zöllner-Weber", "affiliation": [{"original_name": "Universität Bielefeld, Fakultät für Linguistik und Literaturwissenschaft, Arbeitsbereich Computerlinguistik", "normalized_name": "Bielefeld University", "country": "Germany", "identifiers": {"ror": "https://ror.org/02hpadn98", "GRID": "grid.7491.b"}}]}], "publisher": null, "date": "2006-01-24", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg06/boot.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Robinson and others have recently called for dynamic and collaborative digital scholarly editions. Annotation is a key component for editions that are not merely passive, read-only repositories of knowledge. Annotation facilities (both annotation creation and display), however, require complex software, and if only for that reason it makes sense to share these facilities among edition sites. The paper argues we therefore need a protocol for requesting (and serving) annotations, and a markup vocabulary for storing annotations. The paper proposes a SANE (Scholarly ANnotation Exchange) Request Protocol (SANE-RP) and a SANE Markup Language (SANE-ML) and shows an experimental implementation of these in annotations to a digitised emblem book. The edition (the process that generates the edition HTML from the edition XML source) requests annotation information from an annotation server using SANE-RP. The annotation server serves out the annotations (created using the annotation tool EDITOR) stored in SANE-ML.", "article_title": "A SANE approach to annotation in the digital edition", "authors": [{"given": "Peter", "family": "Boot", "affiliation": [{"original_name": "Huygens Instituut", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2007-04-21", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg06/fanta.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Walter Fanta is the co-editor of the ‚Klagenfurt Robert Musil Edition’ due to appear on November 6th, 2008 in DVD format, of which a twenty-volume edition of the reading text is also planned in book form. In the article the annotated digital Musil edition is offered as a model for historic-critical complete editions and presented for discussion. The particularity of the Austrian author Robert Musil is shown in his most important work, the novel ‚The Man without Qualities’, published by Musil in two volumes (1930 and 1932). For this work Musil left behind more than 12.000 unpublished pages of manuscript which partly contain preliminary sketches (1903-1925) and partly various options for the continuation of the book (1933-1942). In the protracted editing history of this book hitherto this has led to incomplete, one-sided editorial solutions satisfying only a restricted portion of the reading public. The new Klagenfurt Edition wishes to unite all the various approaches and offer a satisfactory solution for all those interested in the literary text, as well as for translators and scholars active in this field, by offering a reading text and in addition more than 15.000 pages of original manuscript and printed matter all connected with hypertext commentaries. Detailed reasons are given why this goal can only be attained by a digital edition: the complex relations in the texts and between the texts can only be depicted identically in this way - through the use of hyperlinks. Three fields of discussion with open and partially controversial questions concern not just Musil alone but rather general questions of digital editing and are still of concern to the editors of the Klagenfurt Edition. These are as follows: 1) The possibilities of text-genetic depiction, reconstruction of the reading text and the presentation of all levels through original documents, in the Klagenfurt Edition both of which are put into effect at the same time. Here the generating of ‚open’ reading texts with a multitude of undecided variants for the continuation of the novel turns out to be a creative game with many options in which the users of the Edition can also be involved. 2) Secondly there is the question of ‚open’ commentary which in the depiction of intertextuality through weblinks always appears to be in need of supplementation and extrapolation. 3) Thirdly the ‚open source’ discussion, the question of independence from commercial systems and the difficulties involved in the long-term-filing of highly complex hypertext systems, still unsolved in the case of the Musil Edition as conceded by the editors.", "article_title": "Die Klagenfurter Ausgabe Robert Musil Historisch-kritisches Edieren am Computer", "authors": [{"given": "Walter", "family": "Fanta", "affiliation": [{"original_name": "Robert Musil-Institut für Literaturforschung", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2007-09-07", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg06/kegelel.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "A large edition project is nowadays bound to investigate means to bridge the gap between computer science and traditional scholarly research. In this paper we give an overview of ways in which the use of structural markup and computer based collation, analysis and presentation has informed the edition of the complete works of the Dutch writer W.F. Hermans.", "article_title": "»A collection, an enormous accumulation of movements and ideas«. Research documentation for the digital edition of the Volledige Werken (Complete Works) of Willem Frederik Hermans", "authors": [{"given": "Peter", "family": "Kegel", "affiliation": [{"original_name": "Huygens Institute", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Bert", "family": "Van Elsacker", "affiliation": [{"original_name": "Huygens Institute", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2007-02-25", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg06/schmitzstark.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The academy-edition of Immanuel Kant’s writings is the general reference edition for philological and philosophical investigation concerning Immanuel Kant. The first three sections (works, correspondence and handwritten remains) have been digitized and serve as the basis for an electronic edition which is freely available at <http://www.ikp.uni-bonn.de/kant>. The fourth section (lectures) is still work in progress. In this paper, we describe the academy-edition, the electronic edition and the computer-assisted edition of the lectures. We explicate problems regarding the arrangement and documentation of Kant’s texts, and – in this context – we explain the importance of hyperlinking texts and other documents for the proper editing and interpretation.", "article_title": "Herstellen von Verknüpfungen – Zur elektronischen Edition und zum elektronischen Edieren von Immanuel Kants Schriften und Vorlesungen", "authors": [{"given": "Hans-Christian", "family": "Schmitz", "affiliation": [{"original_name": "Johann Wolfgang Goethe-Universität, GK »Satzarten«, Institut für Kognitive Linguistik", "normalized_name": "Goethe University Frankfurt", "country": "Germany", "identifiers": {"ror": "https://ror.org/04cvxnb49", "GRID": "grid.7839.5"}}]}, {"given": "Werner", "family": "Stark", "affiliation": [{"original_name": "Philipps-Universität, Institut für Philosophie", "normalized_name": "Philipp University of Marburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/01rdrb571", "GRID": "grid.10253.35"}}]}], "publisher": null, "date": "2007-03-13", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg06/czfrineu.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "According to the Berlin Declaration on Open Access in the Sciences and Humanities, which was signed by the President of the Academy, an initiative was founded to provide a sustainable, interactive and transparent way to inspire activities in supporting research, communication and presentation with electronic media. This initiative is called Telota – the electronic life of the academy. One part of Telota is the so called Telota – Project of the month (TPM) working group which started work in February 2005. The main aims of this working group are to provide solutions for the mentioned issues which are cost efficient, future proven (especially to be independent from commercial vendors) and freely extensible. Every month the data of a selected academy project is processed, (re)structured and presented on the web to give humanities researchers, scholars and the interested public a new view in the extensive knowledge inventory of the academy. Identification and processing information of the long term projects is one of the central features of TPM. All the applied technologies and third party tools are reused, like all the gained experience is transferred from one project to the next. In addition new technologies are adopted to the working group’s portfolio. Thus the Project of the month is able to react properly to the monthly changing requirements. This paper exemplarily presents two systems for humanities projects from the viewpoint of an »in-house« working group. It tries to show the possibilities of developing electronic resources of long term projects in a very short time period.", "article_title": "Mehr XML – Die digitalen Projekte an der Berlin-Brandenburgischen Akademie der Wissenschaften.", "authors": [{"given": "Alexander", "family": "Czmiel", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}, {"given": "Christiane", "family": "Fritze", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}, {"given": "Gerald", "family": "Neumann", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}], "publisher": null, "date": "2007-04-20", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg06/kueck.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The aim of this paper is to show up ways in which the practice, or rather practices, of cheating can be integrated into the work of game researchers. Apart from the obvious ways, in which cheats can be employed, exempli grati as time-savers, it is my intention to demonstrate how cheating can actually add to our understanding of games. To this end, I study the areas of game analysis, genre, and games culture. In all these examples, I attempt to point to ways in which the practice of cheating can not only make us understand the things we already see, but also enable us to see things that have escaped our attention so far.", "article_title": "Homo Deludens – Cheating als methodisches Werkzeug in der Computerspielforschung", "authors": [{"given": "Julian", "family": "Kücklich", "affiliation": [{"original_name": "Centre for Media Research, University of Ulster", "normalized_name": "University of Ulster", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01yp9g959", "GRID": "grid.12641.30"}}]}], "publisher": null, "date": "2007-05-20", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg07/BassKarcz.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In view of the methodological premises informed by the cultural turn, researchers in literary and cultural studies are engaging in a promising critical endeavor that demands computer-assisted research techniques in order to fulfill its enormous potential. To analyze the delicate relationships between literary works and their cultural context(s) in a comprehensive and traceable manner scholars of literature and culture need convenient computational environments and standards that meet the specific needs of these fields of research. This article introduces a wish list to propose a number of basic requirements for computer-aided research practices and applications in literary and cultural studies and closes with an open invitation to critical discussion and continuation of that list.", "article_title": "Computergestützte Literaturwissenschaft als Kulturwissenschaft. Eine Wunschliste", "authors": [{"given": "Moritz", "family": "Baßler", "affiliation": [{"original_name": "Westfälische Wilhelms-Universität, Germanistisches Institut - Neuere deutsche Literatur", "normalized_name": "University of Münster", "country": "Germany", "identifiers": {"ror": "https://ror.org/00pd74e08", "GRID": "grid.5949.1"}}]}, {"given": "Rainer", "family": "Karczewski", "affiliation": [{"original_name": "Westfälische Wilhelms-Universität, Germanistisches Institut - Neuere deutsche Literatur", "normalized_name": "University of Münster", "country": "Germany", "identifiers": {"ror": "https://ror.org/00pd74e08", "GRID": "grid.5949.1"}}]}], "publisher": null, "date": "2009-02-11", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg07/annobiblio.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The database Annotierte Bibliographie zur Literaturtheorie has been online since July 2007. It contains entries of recent contributions to the field of literary theory and it aims to facilitate a survey of fundamental theories, theories of interpretation and methodological approaches that are relevant to literary theory. Each entry comprises of bibliographical data as well as annotations of several types. In the next few years the database will continue to expand and improve. Our aim is to compile a comprehensive bibliography of literary theory applying the »Creative Commons License« and being globally accessible for users to search for titles within a particular theoretical field and to contribute to the database. This article introduces the idea, implementation, and the utilization of the database and outlines its further development.", "article_title": "Das Projekt Annotierte Bibliographie zur Literaturtheorie – Vorstellung der Datenbank", "authors": [{"given": "Matthias", "family": "Beilein", "affiliation": [{"original_name": "Georg-August-Universität Göttingen", "normalized_name": "University of Göttingen", "country": "Germany", "identifiers": {"ror": "https://ror.org/01y9bpm73", "GRID": "grid.7450.6"}}]}, {"given": "Katharina", "family": "Prinz", "affiliation": [{"original_name": "Georg-August-Universität Göttingen", "normalized_name": "University of Göttingen", "country": "Germany", "identifiers": {"ror": "https://ror.org/01y9bpm73", "GRID": "grid.7450.6"}}]}, {"given": "Simone", "family": "Winko", "affiliation": [{"original_name": "Georg-August-Universität Göttingen", "normalized_name": "University of Göttingen", "country": "Germany", "identifiers": {"ror": "https://ror.org/01y9bpm73", "GRID": "grid.7450.6"}}]}], "publisher": null, "date": "2008-12-12", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg07/bobgehl.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Metrical markup done manually demands an enormous effort of time. Wouldn’t it be smart to let computers do the work automatically – and would that be possible? The answer is »Yes«. The following text describes how automatic metrical markup for stressed and unstressed syllables in German verse text can be achieved on the bases of theoretical postulations and their methodical realization.", "article_title": "Automatisches metrisches Markup deutschsprachiger Gedichte", "authors": [{"given": "Klemens", "family": "Bobenhausen", "affiliation": [{"original_name": "Albert-Ludwigs-Universität Freiburg", "normalized_name": "University of Fribourg", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/022fs9h90", "GRID": "grid.8534.a"}}]}, {"given": "Günter", "family": "Gehl", "affiliation": [{"original_name": "Hainichen", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2009-02-09", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg07/bubenh.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Whereas editors of printed collections of historical sources have to decide whether to create a critical edition for a scientific audience or one for a wider audience, which is easier to read, digital editions have the potential to combine high standards of textual criticism with a high degree of readability. By means of an edition of primary sources on the 1968 movement in Zurich, Switzerland, the article introduces the utilization of XML as tool for the creation of dynamic documents. The application allows the user to switch between different modes of the representation of the sources ranging from a plain to a critically edited text with facsimile. Moreover, XML can be very useful for structuring and arranging large amounts of texts and present them in different modes. XML is thus an ideal markup language for critical editions, although minor problems concerning the processing of large data sets must be dealt with. The article illustrates, how XML and XSLT are put into practice. On the one hand XSLT is used to dynamically produce different views on the sources of the edition. On the other hand XSLT extracts meta information from the data to get the various indices and tables of content. By these means the edition organizes its source documents in different ways to ease the access for the users.", "article_title": "XML-Technologien als Grundlage dynamischer Textpräsentation. Die digitale Quellenedition Der Zürcher Sommer 1968", "authors": [{"given": "Noah", "family": "Bubenhofer", "affiliation": [{"original_name": "Deutsches Seminar der Universität Zürich", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Susanne", "family": "Haaf", "affiliation": [{"original_name": "Deutsches Seminar der Universität Zürich", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Céline", "family": "Jourdain", "affiliation": [{"original_name": "Deutsches Seminar der Universität Zürich", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Joachim ", "family": "Scharloth", "affiliation": [{"original_name": "Deutsches Seminar der Universität Zürich", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Monika ", "family": "Schnoz", "affiliation": [{"original_name": "Deutsches Seminar der Universität Zürich", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Ursula ", "family": "Stutz", "affiliation": [{"original_name": "Deutsches Seminar der Universität Zürich", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2008-06-01", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg07/kuwalu.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Over the last years, the digital archiving, administration, and processing of texts has become more and more important in various fields of academic research. Particularly for literary and cultural studies, the digital storage and handling of great amounts of texts – an endeavor which has already been labelled with the keyword eHumanities (enhanced Humanities) – bears an enormous potential. There is, however, still a lack of applications appropriately supporting specific approaches in these fields of research. In this article, we thus propose basic design principles of a computational environment for literary and cultural investigation, id est a platform providing advanced search facilities which are tailored to the needs of scholars of literature and culture (KUWALU = Kulturwissenschaftliche Arbeits- und Lern-Umgebung). We both sketch the theoretical fundamentals of such a platform and outline specific requirements it has to fulfil. Furthermore, we discuss possible ways of implementing these requirements, in particular focussing on computational linguistic methods from Computational Linguistics supporting »intelligent« search facilities and the need for comprehensibility and traceability of complex search queries and results.", "article_title": "KUWALU – Motivation und Grundzüge einer computergestützten Umgebung für die literatur- und kulturwissenschaftliche Recherche- und Analysearbeit", "authors": [{"given": "Martin", "family": "Butler", "affiliation": [{"original_name": "Universität Duisburg-Essen, Institut für Anglophone Studien, Fachbereich Geisteswissenschaften", "normalized_name": "University of Duisburg-Essen", "country": "Germany", "identifiers": {"ror": "https://ror.org/04mz5ra38", "GRID": "grid.5718.b"}}]}, {"given": "Wolfgang", "family": "Hoeppner", "affiliation": [{"original_name": "Universität Duisburg-Essen, Abteilung für Informatik und angewandte Kognitionswissenschaft, Fakultät für Ingenieurwissenschaften", "normalized_name": "University of Duisburg-Essen", "country": "Germany", "identifiers": {"ror": "https://ror.org/04mz5ra38", "GRID": "grid.5718.b"}}]}, {"given": "Andreas", "family": "Wagner", "affiliation": [{"original_name": "Universität Duisburg-Essen, Abteilung für Informatik und angewandte Kognitionswissenschaft, Fakultät für Ingenieurwissenschaften", "normalized_name": "University of Duisburg-Essen", "country": "Germany", "identifiers": {"ror": "https://ror.org/04mz5ra38", "GRID": "grid.5718.b"}}]}], "publisher": null, "date": "2007-11-25", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg07/koenigrusch.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This article explores the potential of computer games to expand their emotional range and to provide their players with thought provoking and deeply moving experiences. While traditional narrative is well equipped to offer an inside view on characters and events, the fictional components in computer games tend to recede into the background during game-play. We will argue that a systematic approach on coupling rules and fiction may offer a solution to this problem. By drawing on Roland Barthes’ research on the functional units of literary texts, adapting it for the interactive medium, we will identify particular aspects of fiction that are most apt to heighten emotional game-play, if strategically integrated into the rule-system.", "article_title": "Barthes Revisited: Perspectives on Emotion Strategies in Computer Games", "authors": [{"given": "Doris C.", "family": "Rusch", "affiliation": [{"original_name": "Singapore - MIT GAMBIT Game Lab, Program in Comparative Media Studies, Massachusetts Institute of Technology", "normalized_name": "Massachusetts Institute of Technology", "country": "United States", "identifiers": {"ror": "https://ror.org/042nb2s44", "GRID": "grid.116068.8"}}]}, {"given": "Nikolaus", "family": "König", "affiliation": [{"original_name": "IK Senses - Technology - Mise-en-Scene: Media and Perception, c/o Institut für Theater-, Film- und Medienwissenschaft, Universität Wien", "normalized_name": "University of Vienna", "country": "Austria", "identifiers": {"ror": "https://ror.org/03prydq77", "GRID": "grid.10420.37"}}]}], "publisher": null, "date": "2008-01-31", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg07/luedzeldes.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Digital corpora are used as a data source in corpus linguistics, literary computing and computational linguistics. Although differences in these disciplines dictate different kinds of work with corpora, many of their respective methods either are applied or could be applicable in the other disciplines. With the recent emergence of richly annotated multi-level and multi-purpose corpora in mind, we review differences and similarities in research questions, corpus resources and their qualitative and quantitative exploitation in the three disciplines, along with suggestions for further development and mutual enrichment.", "article_title": "Three Views on Corpora: Corpus Linguistics, Literary Computing, and Computational Linguistics", "authors": [{"given": "Anke", "family": "Lüdeling", "affiliation": [{"original_name": "Humboldt-Universität zu Berlin, Institut für deutsche Sprache und Linguistik", "normalized_name": "Humboldt University of Berlin", "country": "Germany", "identifiers": {"ror": "https://ror.org/01hcx6992", "GRID": "grid.7468.d"}}]}, {"given": "Amir", "family": "Zeldes", "affiliation": [{"original_name": "Humboldt-Universität zu Berlin, Institut für deutsche Sprache und Linguistik", "normalized_name": "Humboldt University of Berlin", "country": "Germany", "identifiers": {"ror": "https://ror.org/01hcx6992", "GRID": "grid.7468.d"}}]}], "publisher": null, "date": "2008-02-10", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg07/rischuetei.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Digital methods are essential for production, revision and publication of philological editions. The TEI-guidelines for XML coding are considered an approved standard for the representation of literary texts. The research group responsible for publishing Karl Ferdinand Gutzkow’s (1811–1878) dramatic works and the Institute of Computer Science – both located at the Martin-Luther-University Halle-Wittenberg, Germany – are working together on a configurable platform that simplifies and automates the work of editors. The product of this cooperation is KRONOS, a TEI-conform platform supporting drama edition[1]. The tool offers a GUI adapted to the structure of drama, XML-encoding that is as easy as formatting text even without knowledge of XML/TEI, and the extraction of publication formats (HTML, PDF) at the push of a button.", "article_title": "Entwicklung und Einsatz einer TEI-konformen Arbeitsumgebung für die Edition der Dramen von Karl Ferdinand Gutzkow", "authors": [{"given": "Susanne", "family": "Schütz", "affiliation": [{"original_name": "Martin-Luther-Universität Halle-Wittenberg, Institut für Romanistik", "normalized_name": "Martin Luther University Halle-Wittenberg", "country": "Germany", "identifiers": {"ror": "https://ror.org/05gqaka33", "GRID": "grid.9018.0"}}]}, {"given": "Jörg", "family": "Ritter", "affiliation": [{"original_name": "Martin-Luther-Universität Halle-Wittenberg, Institut für Romanistik", "normalized_name": "Martin Luther University Halle-Wittenberg", "country": "Germany", "identifiers": {"ror": "https://ror.org/05gqaka33", "GRID": "grid.9018.0"}}]}, {"given": "Stefan", "family": "Teitge", "affiliation": [{"original_name": "Martin-Luther-Universität Halle-Wittenberg, Institut für Romanistik", "normalized_name": "Martin Luther University Halle-Wittenberg", "country": "Germany", "identifiers": {"ror": "https://ror.org/05gqaka33", "GRID": "grid.9018.0"}}]}], "publisher": null, "date": "2008-07-28", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg07/schmieder.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The article discusses the meaning of the new digital media for the History of Concepts. Although it is evident that new technics and methods of data processing will become more and more relevant it seems surprising to find that the trial and methodical reflexion of digitally supported methods have not found too much interest among researchers in History of Concepts in the past. This neglect seems even more striking as the digital media offer a broad set of methodically and practically highly interesting possibilities for projects on the History of Concepts. The article discusses the meaning of the new digital media for the History of Concepts in relation to three dimensions: to new possibilities of data aquisition and systematisation, concerning new forms of archive systems and, not least, new forms of presentation of the results. The article demonstrates special demands and desiderats; its aim is to stimulate discussions between the History of Concepts, Computerphilologists and Programmers.", "article_title": "Zur Bedeutung der Computertechnik für die Begriffsgeschichte", "authors": [{"given": "Falko", "family": "Schmieder", "affiliation": [{"original_name": "Zentrum für Literatur- und Kulturforschung", "normalized_name": "Leibniz-Zentrum für Literatur- und Kulturforschung", "country": "Germany", "identifiers": {"ror": "https://ror.org/00bpta863", "GRID": "grid.461667.4"}}]}], "publisher": null, "date": "2007-11-09", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg08/tonra.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper focuses on the theoretical and practical decisions taken in the creation of a genetic hypermedia edition of Thomas Moore’s 1817 poetic work, Lalla Rookh for the IRCHSS-funded project, the Thomas Moore Hypermedia Archive. It evaluates the appropriateness of hypermedia for hosting such a work from the perspective of presenting its many associated materials (translations, illustrations, adaptations), and demonstrating the genetic development of the work from its first manuscript draft through to publication. The author compares the different editorial decisions that are associated with presenting literary texts in print and electronic formats, concluding that the latter eliminates the need to choose a copy-text and establish a hierarchy among the textual witnesses. The article illustrates how this fact permits a more effective visualisation of the genetic development of the work, and reports on how the Lalla Rookh edition has achieved this, referring to the encoding practice adopted by the editor on the basis of the standards that are outlined in the TEI P5 Guidelines.", "article_title": "Textual Studies and the TEI: Encoding Thomas Moore’s Lalla Rookh", "authors": [{"given": "Justin", "family": "Tonra", "affiliation": [{"original_name": "Moore Institute, National University of Ireland", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}], "publisher": null, "date": "2009-06-02", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg08/mclough.pdf", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The paper looks at the challenges facing an editor who moves from print editions to working on an electronic edition. Among the first are the different kinds of language usage among editors of print and electronic editions; these – particularly that of ›reader‹ and ›user‹ – point up different expectations and different goals in the two mediums. Questions thus arise as to the purpose in editing an electronic edition and their impact on the way the electronic editor thinks about the text. The implications of the word ›user‹, are explored especially in relation to annotation. Annotation in turn calls for attention to how the text is marked-up in TEI. Throughout the change from the one medium to the other, the editor has to reassess his relation to what he thought were the critical priorities of the text, as well as to his user. The final part of the paper looks at issues of navigation and the demands to think critically about the dynamics of the edition. That takes the editor back to the fundamental question about the purpose of an electronic edition", "article_title": "Bridging the Gap ", "authors": [{"given": "Tim", "family": "McLoughlin", "affiliation": [{"original_name": "Moore Institute, National University of Ireland", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}], "publisher": null, "date": "2009-04-23", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": "10", "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg08/rehbein.pdf", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The purpose of this article is two-fold: firstly, to illustrate the collaborative work of the TEXTE programme at NUI, Galway, in order to facilitate the move that an »old-style editor« had to undertake to electronically edit the correspondence of Irish painter James Barry, and secondly to discuss certain aspects that arose from this work in reflection to editor Tim McLoughlin’s observations which he describes by himself elsewhere in this volume. This article focuses mainly on what ›using‹ a scholarly edition means and problematizes what impact this has on the shift from hard-copy to electronic editing. It is argued that there is not so much a gap between print and electronic medium but much more a transition in a thinking process: from the output orientation of the classical style of editing towards a data- and user-driven new approach. ", "article_title": "The transition from classical to digital thinking Reflections on Tim McLoughlin, James Barry and collaborative work", "authors": [{"given": "Malte", "family": "Rehbein", "affiliation": [{"original_name": "National University of Ireland, Galway", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}], "publisher": null, "date": "2009-04-23", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": "10", "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg08/romary.pdf", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper provides an introduction to the Text Encoding Initiative (TEI), focused at bringing in newcomers who have to deal with a digital document project and are investigating the capacity that the TEI environment may have to fulfil their needs. To this end, we avoid a strictly technical presentation of the TEI and concentrate on the actual issues that such projects face, with a parallel investigation of the situation within two institutions. While a quick walkthrough the TEI technical framework is provided, the paper concludes by showing the essential role played by the TEI community in providing technical and practical advice.", "article_title": "Questions & Answers for TEI Newcomers ", "authors": [{"given": "Laurent", "family": "Romary", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2009-05-02", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": "10", "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg08/pierazzo.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The digital and print edition of the correspondence of Giacomo Puccini, a research project hosted in Lucca (Italy), gives the opportunity to discuss more general issues of project management, workflow and teamwork. The project is intended to run for the next ten years, a time-scale that also raises issues of long-term sustainability and controllable editorial practices. The project team consists of members who are mostly voluntary and who are based in five countries on two continents. These two factors further compound existing difficulties in dealing with unfamiliar frameworks, while the limited budget leads to unsystematic technical development. The need for user-friendly editorial tools and the budget-driven technical limitations combine to demand creative solutions in project management. The choice of a hybrid publication (print and digital) aroused much controversy with the publishing house, probably due on the one hand to the novelty of the form, and on the other hand to the unclear theoretical and practical understanding of the relative strengths and weaknesses of the two formats and of the advantages of having the two side by side.", "article_title": "Editorial Teamwork in a Digital Environment: The Edition of the Correspondence of Giacomo Puccini", "authors": [{"given": "Elena", "family": "Pierrazo", "affiliation": [{"original_name": "Centre for Computing in the Humanities, King's College London", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}]}], "publisher": null, "date": "2009-03-08", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg08/cummings.pdf", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This article reports on a project in progress at the University of Oxford that is editing the forty-eight years of detailed diaries written by William Godwin from 1788 to 1836. Support has been provided in the form of TEI training, schema customisation, website development, and general technical support. This work so far has included tutorials on TEI (and related technologies), the creation of a Godwin-specific TEI ODD in order to customise the TEI to their needs, and numerous XSLT stylesheets for producing various lists and statistics to help them proofread and understand the markup that they’ve already applied and prepare for the next phases of encoding they are undertaking. This article is concerned with some of the the new features of TEI P5 they have used, how these have been transformed (with XSLT2), and the benefits this has accrued to their project methodology. The project, while it is an inter-departmental one, is not located in the History or English faculties as one might expect, but the Department of Politics and International Relations. Hence, the central concerns of those working on the project are the networked relationships between people, the meetings they attended, and prosopographical networks. For example, in addition to just marking up the very regular diary entries, they are also pointing from each of the over 64,000 instances of a person’s name to a TEI <person> element in a separate file where metadata is stored about that person. This form of URI-based pointing combined with prosopographical data is one of the new areas in TEI P5. The article uses this as an example to look at how the particular needs of a scholarly editing project were reflected in the TEI P5 markup chosen and how that has been chosen to be processed for a variety of different purposes, before discussing the directions the project will be going in the future. ", "article_title": "The William Godwin’s Diaries Project: Customising and transforming TEI P5 XML for project work", "authors": [{"given": "James", "family": "Cummings", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2009-04-29", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": "10", "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg08/moran.pdf", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Students of early Irish history, archaeology, language and literature are in many ways well served with digital resources. This paper outlines some of the key resources already available, and discusses a contribution currently under preparation by the Early Irish Glossaries Project at the University of Cambridge. It also makes some general remarks on potential future directions for electronic resources in the field. ", "article_title": "Irish glossaries and other digital resources for early Irish studies ", "authors": [{"given": "Pádraic", "family": "Moran", "affiliation": [{"original_name": "Dept. of Anglo-Saxon, Norse and Celtic, Cambridge", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2009-04-30", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": "10", "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg08/fischer.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "What should a scholarly edition look like? A methodology of scholarly editing has, on the one hand, to be developed under conditions of ongoing change in text theory – as has taken place in a Material Philology – and concomitant changes of perspective on the extant documents. On the other hand, the shift to digital media is augmenting the options for representing and publishing texts and documents, and thus is a decisive factor in methodological enhancement. Stimulated by the fertile interaction of both theoretical and technical options, the digital edition of William of Auxerre’s treatise on liturgy is intended to be a contribution, drawn from practical experience, to the discussion of objectives and methodological standards in scholarly editing. The present article (1) gives some basic information on the life and work of William of Auxerre and (2) presents the features of the digital edition of his treatise on liturgy. This edition then (3) is placed in a theoretical framework; finally (4) some technical issues and problems that appeared during encoding are pointed out.", "article_title": "The pluralistic approach – The first scholarly edition of William of Auxerre’s treatise on liturgy", "authors": [{"given": "Franz", "family": "Fischer", "affiliation": [{"original_name": "Royal Irish Academy, Ireland", "normalized_name": "Royal Irish Academy", "country": "Ireland", "identifiers": {"ror": "https://ror.org/019tbdj08", "GRID": "grid.454046.7"}}]}], "publisher": null, "date": "2009-05-11", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg08/keating1.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In this, part one of a two part paper, we will discuss the approach taken during the creation of a digital edition of the Alcalá Account Book manuscript. The Alcalá Project was originally proposed as a digital humanities project to mark a humanities collaboration between the University of Alcalá de Henares (UAH), Spain, and the National University of Ireland, Maynooth (NUIM). The source was to be a Spanish eighteenth century account book recording the monthly expenses of the Royal Irish College of Saint George the Martyr. In the given time-frame, the source manuscript was chosen, encoded and made available in a web based, dual language, searchable and interactive environment. More importantly, a virtual framework was developed to aid the historian in answering historically pertinent research questions that are specifically prompted by the historical object – an account book. We contend that by creating a digital edition that represents the original Alcalá Account Book manuscript and its functionality, we have provided the end-user (for example the historian) with a richer environment for performing research, and a research tool that is specifically designed to be fit for purpose. The approach is informed by the discipline of the participants, and also takes account of current best practice in humanities and digital humanities. We aim here to provide a description of that digitisation process and the methodologies we used to make design decisions. Part two, Formalisation and Encoding, will address the theoretical framework and practicalities of formalising and encoding the source.", "article_title": "A Digital Edition of a Spanish 18th Century Account Book: User Driven Digitisation", "authors": [{"given": "John G", "family": "Keating", "affiliation": [{"original_name": "An Foras Feasa, National University of Ireland, Maynooth", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}, {"given": "Thomas", "family": "O’Connor", "affiliation": [{"original_name": "An Foras Feasa, National University of Ireland, Maynooth", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}, {"given": "Aja", "family": "Teehan", "affiliation": [{"original_name": "An Foras Feasa, National University of Ireland, Maynooth", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}, {"given": "Damien", "family": "Gallagher", "affiliation": [{"original_name": "An Foras Feasa, National University of Ireland, Maynooth", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}], "publisher": null, "date": "2009-06-17", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg08/keating2.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In this, part two of a two part paper, we will discuss our approach to the formalisation of our document encoding approach, derived from software engineering, which treats of the three classes of a digital edition; the Logical, the Physical and the Interaction Classes. We specifically address our decision to use XML (Extensible Mark-up Language), not TEI (Text Encoding Initiative), as our encoding language. An argument is provided as to why TEI is unsuitable for function-based documents, this addresses both source integrity and the restrictive nature of TEI. TEI does not support our forward engineering approach, which allows us to simultaneously produce the model, the encoding and the software environment.", "article_title": "A Digital Edition of a Spanish 18th Century Account Book: Formalisation and Encoding", "authors": [{"given": "John G", "family": "Keating", "affiliation": [{"original_name": "An Foras Feasa, National University of Ireland, Maynooth", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}, {"given": "Thomas", "family": "O’Connor", "affiliation": [{"original_name": "An Foras Feasa, National University of Ireland, Maynooth", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}, {"given": "Aja", "family": "Teehan", "affiliation": [{"original_name": "An Foras Feasa, National University of Ireland, Maynooth", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}, {"given": "Damien", "family": "Gallagher", "affiliation": [{"original_name": "An Foras Feasa, National University of Ireland, Maynooth", "normalized_name": "National University of Ireland", "country": "Ireland", "identifiers": {"ror": "https://ror.org/00shsf120", "GRID": "grid.9344.a"}}]}], "publisher": null, "date": "2009-06-17", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg09/walkowski.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The article discusses possibilities of data-orientated research with digital data environments in the humanities. Starting with problems of representing meaning in data form in the context of person data, the perspectives of the Person Data Repositoryby the Berlin-Brandenburgische Akademie der Wissenschaften are presented. These problems are related to well known issues concerning the standardization and formalization of content when storing it in the database. This is seen as a loss of value in many humanities projects. The PDR developed an approach in which this loss is compensated by bringing together data and context of the data into the database. The main idea of the PDR is then worked out to the concept of a polysemic database.", "article_title": "Das Konzept einer polysemischer Datenbank und seine Konkretisierung im Personendaten-Repositorium der BBAW", "authors": [{"given": "Niels-Oliver", "family": "Walkowski", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften – TELOTA", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}], "publisher": null, "date": "2011-08-04", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg09/boot.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "In 2009, the Van Gogh Museum and the Huygens Institute published a new edition of the correspondence of Vincent van Gogh, both online and in print. This article discusses how the online edition dealt with the richness of material (using the strategies of flexibility and user control, powerful search and filter facilities and indexing and cross-referencing). It describes the technical infrastructure and the conversion that was needed from word processor documents into XML. It also examines the relation between the book and web versions of the edition. In conclusion, the article mentions some of the user reactions to the edition and briefly mentions some of the prospects for future scholarly editions.", "article_title": "Vincent Van Gogh - The Letters", "authors": [{"given": "Peter", "family": "Boot", "affiliation": [{"original_name": "Huygens Institute, Dept. ICT and Texts", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2011-08-08", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg09/fanta.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Considering the immortality of electronic corpora in the literary edition of the Musil estate The digital Klagenfurt edition of the works of Robert Musil contains the complete transcript of the writers Nachlass, his literary estate.[1] The estate compiles about 12,000 pages from Musils manuscripts; it includes all data collected since 1985, when work on the project began, until the year of publication of the first full edition of his work on DVD in 2009. The transcribed data underwent several interesting metamorphoses throughout the process; the transformation reflects the history of digital philology itself. Out review of the project is geared both towards philological aspects, like the changed status of transcripts within edition projects, and the different transcription systems; as well as technical aspects, like changes in hardware, software and publication formats.", "article_title": "Zur Immortalität elektronischer Korpora am Beispiel der Musil-Edition", "authors": [{"given": "Walter", "family": "Fanta", "affiliation": [{"original_name": "Robert-Musil-Institut für Literaturforschung, Universität Klagenfurt", "normalized_name": "University of Klagenfurt", "country": "Austria", "identifiers": {"ror": "https://ror.org/05q9m0937", "GRID": "grid.7520.0"}}]}], "publisher": null, "date": "2011-09-28", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg09/geykenetal.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "This paper deals with the issue of quality assurance in very large, XML/TEI-encoded full-text collections. The text corpus edited by the DFG-funded project Deutsches Textarchiv (henceforth: DTA), a large and still growing reference corpus of historical German, is a fine example of such a collection. The following remarks focus on text prepared in a Double-Keying-process, since the major part of the DTA-corpus is compiled by applying this highly accurate method. An extensive and multi-tiered approach, which is currently applied by the DTA for the analysis and correction of errors in double-keyed text, is introduced. The process of quality assurance is pursued in a formative way in order to prevent as many errors as possible, as well as in a summative way in order to track errors which nevertheless may have occurred in the course of full-text digitization. To facilitate the latter, DTAQ, a web-based, collaborative tool for finding and commenting errors in the corpus, was developed. On the profound basis of practical experience in the past four years, the preliminaries and possible methods of conducting a widespread quality assurance are being discussed.", "article_title": "TEI und Textkorpora: Fehlerklassifikation und Qualitätskontrolle vor, während und nach der Texterfassung im Deutschen Textarchiv", "authors": [{"given": "Alexander", "family": "Geyken", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}, {"given": "Susanne", "family": "Haaf", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}, {"given": "Bryan", "family": "Jurish", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}, {"given": "Matthias", "family": "Schulz", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}, {"given": "Christian", "family": "Thomas", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}, {"given": "Frank", "family": "Wiegand", "affiliation": [{"original_name": "Berlin-Brandenburgische Akademie der Wissenschaften", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}]}], "publisher": null, "date": "2012-08-05", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg09/Ilsemann.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The main task of this paper deals with the exploration of frequency distributions of speech lengths. Initial investigations aimed at authorship questions and tried to contribute seriously to the recently flared up Marlowe-Shakespeare debate. Distribution curves were compared and checked by chi-square tests relying on text corpora by Marlowe, Shakespeare, and other contemporaries. The all-all text curves showed congruence between Marlowe and Shakespeare, but also conformity between Marlowe/Shakespeare and their contemporaries. Single text vs. all text curve relations resulted in cross-overs when Marlowe texts fitted better into the Shakespeare canon up to 1599 and Titus Andronicus was closer to the Marlowe range. The overall result was more than clear. Frequency distributions of speech lengths could not contribute to authorship questions. However, as an indication of style changes, the maxima values in their reduction from nine to four words opened up a totally different artistic and aesthetic concept which started around 1599 and marked the beginning of British drama in its own right after the process of incorporation of Roman plays and antique mythology. The stylistic shift certainly occurs in the wider context of rhetorical speeches and dramatic actions, as rhetoric and declamations receded and were replaced by refined acting using the spatial dimensions of the stage and speeding up events by shorter speeches. Whereas before monologues had to be seen within the framework of rhetorical devices that kept actors rambling and lamenting they now appeared as functional components of plays, adding to the aesthetic values of varietas and copia – or variety and abundance thus bearing witness to the process of commercialization and of cultural establishment of the literary genre drama at the turn of the century. All quantitative dates were derived from IDAP [1].", "article_title": "Quantitativ-statistische Dramenanalyse: Welche Aussagekraft haben Häufigkeitsverteilungen der Replikenlängen?", "authors": [{"given": "Hartmut", "family": "Ilsemann", "affiliation": [{"original_name": "Leibniz Universität Hannover", "normalized_name": "University of Hannover", "country": "Germany", "identifiers": {"ror": "https://ror.org/0304hq317", "GRID": "grid.9122.8"}}]}], "publisher": null, "date": "2013-05-23", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg09/viehhauser.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Up to now, Wolfram von Eschenbach’s Parzival, one of the most important texts of Middle High German literature, hasn’t been accessible but in one edition, which is over 170 years old and thus follows editorial principles that are by now outdated. Hence, in 2001, the Parzival-Project, currently settled at the University of Berne, was grounded to present a new edition that would visualize the plurality of manuscript transmission by applying modern computer technology. The edition is based on digital transcriptions that are annotated according to a specifically developed markup-system. Due to the fact that the guidelines of the Text Encoding Initiative (TEI) have become a standard for the annotation of digital editions it would be desirable to transform the Bernese project material into the TEI-code. The paper demonstrates what methods can be used to convert the data, and what problems might occur in the transformation process.", "article_title": "Standardisierung und proprietäre Annotation im Berner Parzival-Projekt.", "authors": [{"given": "Gabriel", "family": "Viehhauser", "affiliation": [{"original_name": "Universität Bern, Institut für Germanistik", "normalized_name": "University of Bern", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02k7v4d05", "GRID": "grid.5734.5"}}]}], "publisher": null, "date": "2013-09-25", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}, {"url": "http://computerphilologie.digital-humanities.de/jg09/lukasosthof.pdf", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "Spatiality – the topographical distribution of text on the manuscript page – represents one of the central aspects of the epistolographical ›material text‹. In contrast to a diplomatic-mimetic text reproduction, the C.F.Meyer edition distinguishes between significant (structural) vs. meaningless (contingent) spatiality. The contribution reflects the theoretical foundations and implications of this concept in the context of the current materiality debate in textual scholarship and presents a solution for the implementation of the philological model in TEI.", "article_title": "Physische vs. gedeutete Räumlichkeit. Zur Auszeichnung spatialer Informationen in der historisch-kritischen Ausgabe C.F. Meyers Briefwechsel", "authors": [{"given": "Wolfgang", "family": "Lukas", "affiliation": [{"original_name": "Bergische Universität Wuppertal", "normalized_name": "University of Wuppertal", "country": "Germany", "identifiers": {"ror": "https://ror.org/00613ak93", "GRID": "grid.7787.f"}}]}, {"given": "Matthias", "family": "Osthof", "affiliation": [{"original_name": "Universität Zürich", "normalized_name": "University of Zurich", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02crff812", "GRID": "grid.7400.3"}}]}], "publisher": null, "date": "2016-11-30", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": "30", "issue": null, "ISSN": [{"value": null, "type": null}]}]