{"url": "http://dx.doi.org/10.1093/llc/fqy076", "identifier": {"string_id": "10.1093/llc/fqy076", "id_scheme": "DOI"}, "abstract": "Semantic Textual Similarity (STS), which measures the equivalence of meanings between two textual segments, is an important and useful task in Natural Language Processing. In this article, we have analyzed the datasets provided by the Semantic Evaluation (SemEval) 2012–2014 campaigns for this task in order to find out appropriate linguistic features for each dataset, taking into account the influence that linguistic features at different levels (e.g. syntactic constituents and lexical semantics) might have on the sentence similarity. Results indicate that a linguistic feature may have a different effect on different corpus due to the great difference in sentence structure and vocabulary between datasets. Thus, we conclude that the selection of linguistic features according to the genre of the text might be a good strategy for obtaining better results in the STS task. This analysis could be a useful reference for measuring system building and linguistic feature tuning.", "article_title": "Linguistic analysis of datasets for semantic textual similarity", "authors": [{"given": " Chunlin", "family": "Wang", "affiliation": [{"original_name": "Artificial Solutions Iberia S.L., Barcelona", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Irene", "family": "Castellón", "affiliation": [{"original_name": "Departamento de Filología Catalana y Lingüística General, Universidad de Barcelona, Gran Via de les Corts Catalanes, Barcelona", "normalized_name": "University of Barcelona", "country": "Spain", "identifiers": {"ror": "https://ror.org/021018s57", "GRID": "grid.5841.8"}}]}, {"given": " Elisabet", "family": "Comelles", "affiliation": [{"original_name": "Departamento de Lenguas y Literaturas Modernas y de Estudios Ingleses, Universidad de Barcelona, Gran Via de les Corts Catalanes, Barcelona", "normalized_name": "University of Barcelona", "country": "Spain", "identifiers": {"ror": "https://ror.org/021018s57", "GRID": "grid.5841.8"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019-01-17", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "35", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}