{"url": "http://dx.doi.org/10.1093/llc/fqz017", "identifier": {"string_id": "10.1093/llc/fqz017", "id_scheme": "DOI"}, "abstract": "‘And Quiet Flows the Don’ is an epic novel, considered one of the most significant works of Russian and world literature. The debate on the authorship of ‘And Quiet Flows the Don’ had been surrounding the novel since its first release in 1928 by Mikhail Sholokhov, who was repeatedly accused of plagiarism. The supporters of the plagiarism theory often indicate that the real author of the novel is the Cossack writer, Fyodor Kryukov, who died before ‘And Quiet Flows the Don’ was published. In the present study we applied the information-based similarity analysis (Yang et al., 2003a, Linguistic analysis of human heartbeats using frequency and rank order statistics. Physical Review Letters, 90: 108103; Yang et al., 2003b, Information categorization approach to literary authorship disputes. Physica A, 329, 473) and Burrows's Delta (Burrows, 2002, ‘Delta’: a measure of stylistic difference and a guide to likely authorship. Literary and Linguistic Computing, 17(3):267–87) to a corpus of Russian literature of XIX and XX centuries. We next used these two methods to compare ‘And Quiet Flows the Don’ to Sholokhov’s and Kryukov’s writings. It was found that Fyodor Kryukov writings are distinct from ‘And Quiet Flows the Don’, whilst Sholokhov’s writings being close to the Don novel. The results also highlight how both information similarity analysis and Delta analysis can be used Russian language.", "article_title": "And Quiet Flows the Don: the Sholokhov-Kryukov authorship debate", "authors": [{"given": " Marina", "family": "Iosifyan", "affiliation": [{"original_name": "Moscow State University, Moscow, Russia", "normalized_name": "Lomonosov Moscow State University", "country": "Russia", "identifiers": {"ror": "https://ror.org/010pmpe69", "GRID": "grid.14476.30"}}, {"original_name": "National Research University Higher School of Economics, Moscow, Russia", "normalized_name": "National Research University Higher School of Economics", "country": "Russia", "identifiers": {"ror": "https://ror.org/055f7t516", "GRID": "grid.410682.9"}}]}, {"given": " Igor", "family": "Vlasov", "affiliation": [{"original_name": "MIS and Strategic Planning, VTB Capital, Moscow, Russia", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019-02-22", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "35", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}