{"url": "http://dx.doi.org/10.1093/llc/fqz051", "identifier": {"string_id": "10.1093/llc/fqz051", "id_scheme": "DOI"}, "abstract": "The fact about the way God has described himself or how Muslims regard God’s traits is a significant point because that is the path to know the truth about God in his own words, and the verification of Muslims understanding of God through their thoughts and behaviors in accordance with Quran can be studied. In Islamic mysticism, the names and traits of God are categorized into two groups: beauty and divine glory. Although there have been widespread studies in regard to God’s traits, casting a statistical view on these traits can help with the understanding of God, because it would ease the recognition of the way God has introduced himself or envisages traits he most used for himself which in its turn will enlighten the path a Muslim should take. Therefore, with regard to statistics in this work, we would like to study the idea that which group of God’s traits (beauty or divine grace) is more repeated or what the proportion of the two is, and also what difference there is between the Meccan and Medinan suras in the description of God.", "article_title": "Statistical analysis about the God’s traits in Quran", "authors": [{"given": " Junqi", "family": "Liu", "affiliation": [{"original_name": "School of Communication and Design, Sun Yat-Sen University, Guangzhou, China", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Mohammad Reza", "family": "Mahmoudi", "affiliation": [{"original_name": "Department of Statistics, Faculty of Science, Fasa University, Iran", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Ali", "family": "Abasalizadeh", "affiliation": [{"original_name": "Department of Persian Literature, Fasa University, Iran", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019-06-26", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}