{"url": "http://dx.doi.org/10.1093/llc/fqz063", "identifier": {"string_id": "10.1093/llc/fqz063", "id_scheme": "DOI"}, "abstract": "Our article uses text mining techniques to examine confidential letters sent from the Bank of England’s Prudential Regulation Authority (PRA) to financial institutions it supervises. These letters are a ‘report card’ written to firms annually, and are the most important, regularly recurring written communication sent from the PRA to firms it supervises. Using two complementary machine learning techniques—random forests and logistic ridge regression—we explore whether the letters vary in substance and style depending on the size and importance of the firm to whom the PRA is writing. We find that letters to high impact firms use more evaluative, judgment-based language, and adopt a more forward-looking perspective. We also examine how PRA letters differ from similarly purposed letters written by its predecessor, the Financial Services Authority. We find evidence that PRA letters are different, with a greater degree of forward-looking language and directiveness, reflecting the shift in supervisory approach that has occurred in the UK following the financial crisis of 2007–09.", "article_title": "Text mining letters from financial regulators to firms they supervise", "authors": [{"given": " David", "family": "Bholat", "affiliation": [{"original_name": "Advanced Analytics, Bank of England, UK", "normalized_name": "Bank of England", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04p3y0q03", "GRID": "grid.465255.5"}}]}, {"given": " James", "family": "Brookes", "affiliation": [{"original_name": "Advanced Analytics, Bank of England, UK", "normalized_name": "Bank of England", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04p3y0q03", "GRID": "grid.465255.5"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019-10-18", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}