{"url": "http://dx.doi.org/10.1093/llc/fqz076", "identifier": {"string_id": "10.1093/llc/fqz076", "id_scheme": "DOI"}, "abstract": "An empirical study on about 1.7 million dictionary words from seven languages viz. English, French, Dutch, Spanish, Italian, Hindi, and German has been conducted. Three intriguing characteristic features have been analyzed. First, the alphabet usage pattern in a language was determined which can be used to give an idea on how alphabets have been employed. For instance, the alphabet ‘e’ is highly used in English, while ‘q’ is least used. Second, the average and range of word lengths in the languages were computed and seen to vary from 1 to 37. Average word lengths were computed in the range (6.665–11.14). For comparison, word lengths have been fitted using Gaussian distribution. Third, a new measure was derived; which we termed ‘Language Sparsity’; computed as one minus ratio of number of words of a particular length already existing to the total number of possible words that can be formed. Sparsity hence gives a measure of the scope of fruition in languages. Two such measures have been defined: a weighted and a nonweighted sparsity. Nonweighted sparsity was found to be minimum (0.877) for English and maximum (0.982) for Dutch. The results obtained can play a significant role in propagating the synergy of language evolution.", "article_title": "Alphabet usage pattern, word lengths, and sparsity in seven Indo-European languages", "authors": [{"given": " Nikhil Kumar", "family": "Rajput", "affiliation": [{"original_name": "Department of Computer Science, Ramanujan College, New Delhi, India", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Bhavya", "family": "Ahuja", "affiliation": [{"original_name": "Department of Computer Science, Ramanujan College, New Delhi, India", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Manoj Kumar", "family": "Riyal", "affiliation": [{"original_name": "VCSG Uttarakhand University of Horticulture and Forestry, Tehri Garhwal, India", "normalized_name": "Veer Chandra Singh Garhwali Uttarakhand University of Horticulture & Forestry", "country": "India", "identifiers": {"ror": "https://ror.org/00sfe1713", "GRID": "grid.506070.4"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019-10-03", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}