{"url": "http://dx.doi.org/10.1093/llc/fqz079", "identifier": {"string_id": "10.1093/llc/fqz079", "id_scheme": "DOI"}, "abstract": "Is there a way to ensure older adults can bridge the digital divide and engage with online cultural heritage? How can cinema-going memories encourage cross-generational engagement? This article proposes to address these issues by using the Italian Cinema Audiences research project as a case study, and specifically cinema-going memories as intangible cultural heritage (Ercole et al., 2016, Cinema heritage in Europe: preserving and sharing culture by engaging with film exhibition and audiences. Editorial. Alphaville: Journal of Film and Screen Media, 11(Summer): 1–12. Web. ISSN: 2009-4078). It aims to tackle the difficulty of engaging the older generation with the digital world, by proposing and testing new ways to resolve it. Through a mixed-methods ethnographic approach, this article investigates different strategies: the use of social media platforms; a cross-generational activity involving Historypin, a digital, user-generated archive of crowdsourced historical material; an online dedicated archive built in collaboration with the older adults involved in the project. These different solutions aim not only at increasing digital engagement among older adults, but also at furthering younger generations’ involvement in shared cultural heritage in an online context. By focusing on the memories of cinema-going in 1950s Italy, the article explores the implications of the advantages and disadvantages of these different approaches. It also tests Anja K. Leist’s research findings (2013, Social media use of older adults: a mini-review. Gerontology, 59(4): 378–84) on the key role of moderators (the younger generation) to help novice users (the older generation) in the ‘continuous engagement’ in digital environments. We conclude that in order to bridge the digital divide two components are necessary simultaneously: the creation of digital platforms in which the older generations are both curators and users, and the support of and interaction with younger generations.", "article_title": "Bridging the digital divide: Older adults’ engagement with online cinema heritage", "authors": [{"given": " Silvia", "family": "Dibeltulo", "affiliation": [{"original_name": "School of History, Philosophy and Culture, Oxford Brookes University, Oxford, UK", "normalized_name": "Oxford Brookes University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04v2twj65", "GRID": "grid.7628.b"}}]}, {"given": " Sarah", "family": "Culhane", "affiliation": [{"original_name": "Media Studies Department, Maynooth University, Maynooth, County Kildare, Ireland", "normalized_name": "National University of Ireland, Maynooth", "country": "Ireland", "identifiers": {"ror": "https://ror.org/048nfjm95", "GRID": "grid.95004.38"}}]}, {"given": " Daniela", "family": "Treveri Gennari", "affiliation": [{"original_name": "School of Arts, Oxford Brookes University, Oxford, UK", "normalized_name": "Oxford Brookes University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04v2twj65", "GRID": "grid.7628.b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019-10-22", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}