{"url": "http://dx.doi.org/10.1093/llc/fqz052", "identifier": {"string_id": "10.1093/llc/fqz052", "id_scheme": "DOI"}, "abstract": "Over the last few decades, there has been tremendous growth in online communication through different types of media. Communication via the Internet is anonymous, which causes a critical issue regarding identity tracing. Authorship identification can apply to tasks such as identifying an anonymous author, detecting plagiarism, or finding a ghostwriter. Previous research has outlined the various methods and their improvements for the identification of anonymous authors based on stylometry. However, changes in the writing style of an author over a long period has not been addressed. In this article, we propose a methodology for author identification where the writing style of an author changes. The proposed methodology consists of two phases: the first will show the change in writing style of the author and in another phase the change is mitigated by a new feature normalization technique. A novel Transform Feature to Current Time function is proposed for normalization, where features are shifted to current time and made available for further classification. A machine-learning algorithm is used to identify an author candidate. The experiments of the proposed methodology conducted on a set of text samples by several authors were collected over a different time period and the results show an improvement in performance.", "article_title": "Author identification with feature transformation method", "authors": [{"given": " Mubin Shoukat", "family": "Tamboli", "affiliation": [{"original_name": "Department of Computer Engineering, Matoshri College of Engineering, Nashik, Maharashtra, India", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Rajesh", "family": "Prasad", "affiliation": [{"original_name": "Sinhgad Institute of Technology and Science, Narhe, Pune, India", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019-07-03", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}