{"url": "http://dx.doi.org/10.1093/llc/fqz019", "identifier": {"string_id": "10.1093/llc/fqz019", "id_scheme": "DOI"}, "abstract": "Humour relies on dominant cultural values and outlooks in its environment in enacting its comic content. However, since humour sometimes encompasses global experiences, it often transcends artificial human barriers. Its transcendence has been facilitated through online digitized content, in the present case—Internet memes. In exploring transnationalization, fifty purposively selected memes are culled from the Facebook group Robert Mugabe Quotes and subjected to critical linguistic analysis. In the evaluation of the data which is achieved through the linguistic examination of cross-cultural themes in the formulation of identity, didactics, and ideology, sixteen memes, representative of the overarching tripartite concerns, are used as exemplifications. Reliant on the bipartite postulations of Critical Linguistic Stylistics—a linguistic theory that examines the style and peculiarities of linguistic data—and Relief Theory of Humour—which considers humour as a platform for the assuagement of tension and emotions, the memes are testamental of prevailing concerns— politics, technology, social/international relations, sex, male–female relations, etc.—in the human society at large. Linguistic markers such as oppositional expressions, capitalization, and other graphological features are annexed in meaning-formation. I conclude that although humour is generally regarded as a light-hearted routine geared towards the provision of momentary relief, a close scrutiny reveals that deep messages targeted at stimulating consciousness and social transformation find provenance in these artefacts.", "article_title": "Transnationalizing humour on social media: A linguistic analysis of ideology, identity and didactics in Robert Mugabe Quotes memes1", "authors": [{"given": " Paul", "family": "Onanuga", "affiliation": [{"original_name": "Federal University Oye-Ekiti, Oye-Ekiti, Nigeria", "normalized_name": "Federal University Oye Ekiti", "country": "Nigeria", "identifiers": {"ror": "https://ror.org/02q5h6807", "GRID": "grid.448729.4"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019-03-08", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "35", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}