{"url": "http://dx.doi.org/10.1093/llc/fqz023", "identifier": {"string_id": "10.1093/llc/fqz023", "id_scheme": "DOI"}, "abstract": "Digital Humanities (DH) within Coptic Studies, an emerging field of development, will be much aided by the digitization of large quantities of typeset Coptic texts. Until recently, the only Optical Character Recognition (OCR) analysis of printed Coptic texts had been executed by Moheb S. Mekhaiel, who used the Tesseract program to create a text model for liturgical books in the Bohairic dialect of Coptic. However, this model is not suitable for the many scholarly editions of texts in the Sahidic dialect of Coptic which use noticeably different fonts. In the current study, DH and Coptological projects based in Göttingen, Germany, collaborated to develop a new Coptic OCR pipeline suitable for use with all Coptic dialects. The objective of the study was to generate a model which can facilitate digital Coptic Studies and produce Coptic corpora from existing printed texts. First, we compared the two available OCR programs that can recognize Coptic: Tesseract and Ocropy. The results indicated that the neural network model, i.e. Ocropy, performed better at recognizing the letters with supralinear strokes that characterize the published Sahidic texts. After training Ocropy for Coptic using artificial neural networks, the team achieved an accuracy rate of >91% for the OCR analysis of Coptic typeset. We subsequently compared the efficiency of Ocropy to that of manual transcribing and concluded that the use of Ocropy to extract Coptic from digital images of printed texts is highly beneficial to Coptic DH.", "article_title": "Optical character recognition of typeset Coptic text with neural networks", "authors": [{"given": " So", "family": "Miyagawa", "affiliation": [{"original_name": "Collaborative Research Centre 1136 “Education and Religion in Cultures of the Mediterranean and Its Environment from Ancient to Medieval Times and to the Classical Islam,” Seminar for Egyptology and Coptic Studies", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}, {"original_name": "eTRAP Research Group, University of Göttingen, Germany", "normalized_name": "University of Göttingen", "country": "Germany", "identifiers": {"ror": "https://ror.org/01y9bpm73", "GRID": "grid.7450.6"}}]}, {"given": " Kirill", "family": "Bulert", "affiliation": [{"original_name": "eTRAP Research Group, Institute of Computer Science, University of Göttingen, Germany", "normalized_name": "University of Göttingen", "country": "Germany", "identifiers": {"ror": "https://ror.org/01y9bpm73", "GRID": "grid.7450.6"}}]}, {"given": " Marco", "family": "Büchler", "affiliation": [{"original_name": "eTRAP Research Group, Institute of Computer Science, University of Göttingen, Germany", "normalized_name": "University of Göttingen", "country": "Germany", "identifiers": {"ror": "https://ror.org/01y9bpm73", "GRID": "grid.7450.6"}}]}, {"given": " Heike", "family": "Behlmer", "affiliation": [{"original_name": "Seminar for Egyptology and Coptic Studies, and Collaborative Research Centre 1136 “Education and Religion in Cultures of the Mediterranean and Its Environment from Ancient to Medieval Times and to the Classical Islam,” University of Göttingen, Germany", "normalized_name": "University of Göttingen", "country": "Germany", "identifiers": {"ror": "https://ror.org/01y9bpm73", "GRID": "grid.7450.6"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2019-03-11", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "Supplement_1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}