{"url": "http://dx.doi.org/10.6853/DADH.201910_(4).0003", "identifier": {"string_id": "10.6853/DADH.201910_(4).0003", "id_scheme": "DOI"}, "abstract": "This present work seeks to shed a new light on the language style of the Book of Odes (Shījīng 詩經) from a quantitative perspective. For reading poems written with the so-called incentive process (xīng 興), this work is based on the Mao version (Máoshī 毛詩) as a reference corpus and adopted his sentence segmentation. Almost all the poems written with the incentive process are composed of two couplets: the first, called initiative lines (qǐjù 起句), evokes an affective image; and the second, called envoi lines (yìngjù 應句), expresses one's feeling. Nevertheless, the semantic correlation between two couplets is often ambiguous. In the Mao version, the use of the incentive process is marked with two Chinese characters xīng yě 興也 where one couplet ends and the following begins. Without this mark, it is difficult to recognize this literary form. To interpret the semantic correlation between these lines in macrostructure, traditional commentaries proceed by analogical comparison, causal reasoning, or arrangement of events in sequence. Some recent studies suggest focusing on the microstructure of the incentive process, for example, rhyme schemes, syntactical relations, reiterated formulas, or alternation between function words and content words. The criteria for identifying the incentive process is problematic since his first appearance in the history of Chinese literary theory. However, this process has been considered as the archetypal form in Chinese lyric tradition for a long period. Based on the internal textual data retrieved from the corpus, this work discovers by combinatorial analysis all underlying patterns in all verses and determines representatives patterns as rhythmic patterns according to the frequency of occurrence. Finally, by linking defined rhythmic patterns between lines, this work re-describes stylistic devices of poems written with the incentive process.", "article_title": "A Quantitative Research of the Book of Odes (Shījīng 詩經): The Discovery of the Underlying Rhythm in the Incentive Process", "authors": [{"given": "Shueh-Ying", "family": "Liao", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2019-10-01", "keywords": ["digital humanities ", " quantitative analysis ", " rhythmic analysis ", " Book of Odes(Shījīng 詩經) ", " incentive process(xīng 興)"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "4", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}