{"url": "https://umanisticadigitale.unibo.it/article/view/9055", "identifier": {"string_id": "10.6092/issn.2532-8816/9055", "id_scheme": "DOI"}, "abstract": "La rivoluzione digitale porta con sé la sfida più complessa della contemporaneità. Il digitale ha trasformato completamente le modalità di produzione, trasmissione e condivisione del sapere e il nostro modo stesso d’interagire con esso. Diventa ineludibile ripensare il digitale e la digitalizzazione quali espressioni sociali e culturali dell’epoca contemporanea. Il che comporta la necessità di ripensare i dati digitali in quanto entità culturali prodotte dalle società, e non più quali meri strumenti di semplificazione della gestione amministrativa o surroghe virtuali del patrimonio culturale analogico. Diviene urgente intraprendere serie politiche finalizzate a garantirne la conservazione non solo degli aspetti formali, ma soprattutto degli aspetti strutturali e descrittivi che ne qualificano e identificano i processi creativi ed evolutivi, e ne giustificano il ruolo di testimoni e memoria storica da trasferire nell’integrità dei processi nel tempo e nello spazio. Il presente contributo intende proporre una ridefinizione strutturale dei dati digitali, finalizzata a conferirgli caratteristiche utili a configurarli quali risorse culturali tramite cui conoscere i processi che caratterizzano l’era digitale contemporanea, affidando ai metadati la funzione di fonti primarie cui le generazioni future potranno accedere per leggerne, studiarne, condividerne e riusarne le informazioni.", "article_title": "Ripensare i formati, ripensare i metadati: prove “tecniche” di conservazione digitale", "authors": [{"given": "Nicola", "family": "Barbuti", "affiliation": [{"original_name": "Università di Bari Aldo Moro", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Bologna: AlmaDL", "date": "2019-05-28", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}