{"url": "https://umanisticadigitale.unibo.it/article/view/9063", "identifier": {"string_id": "10.6092/issn.2532-8816/9063", "id_scheme": "DOI"}, "abstract": "This paper pursues the analysis, modelling and representation of the relationships between the different entities concerned by genetic criticism (documents and publications), in the context of a scholarly digital edition. Our cases study are taken from the project \"Gustave Roud, Œuvres complètes\", whose principal aim is to edit the complete works of the Swiss author Gustave Roud (1897-1976). Roud's writing process is rooted in his diary: a first note, for instance taken during a walk in the countryside, can be typed or copied together with other notes in a dedicated notebook, and then inserted in a journal article, which will be itself modified and assembled with others to form a poetic collection. This mechanism of rhapsodic montage is used at various stages of the writing processes, allowing for multiple assemblages of the same materials, for new texts to be produced from existing ones and for the same diary note to appear in multiple texts. In this article, we present an ontology for modelling the genetic relationships between the documents. The available data-model for genetic criticism are firstly discussed: they concentrate on a single document or on the textual variation between them, but no formal model for their relationships is available. Existing visualizations of those relationships are then taken into account. The ontology that we propose to fill this void is detailed and its compatibility with widespread conceptual models, such as FRBRoo and CIDOC CRM, is discussed. Two case studies are presented to test the ontology. In the article we consider the application of our model to other corpora and we conclude with suggestions for the improvement of this work.", "article_title": "Modeling genetic networks. Gustave Roud's œuvre, from diary to poetry collections", "authors": [{"given": "Alessio", "family": "Christen", "affiliation": [{"original_name": "Université de Lausanne", "normalized_name": "University of Lausanne", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/019whta54", "GRID": "grid.9851.5"}}]}, {"given": "Elena", "family": "Spadini", "affiliation": [{"original_name": "Université de Lausanne", "normalized_name": "University of Lausanne", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/019whta54", "GRID": "grid.9851.5"}}]}], "publisher": "Bologna: AlmaDL", "date": "2019-12-18", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}