{"url": "https://umanisticadigitale.unibo.it/article/view/9322", "identifier": {"string_id": "10.6092/issn.2532-8816/9322", "id_scheme": "DOI"}, "abstract": "EVT (Edition Visualization Technology) è un software per la pubblicazione di Edizioni Scientifiche Digitali sul Web. Il suo sviluppo risale agli inizi di questa decade, e può vantare una storia alquanto interessante: nato come una iniziativa di tipo didattico nell’ambito di uno specifico progetto di edizione digitale, nel corso del tempo si è evoluto in uno strumento flessibile apprezzato e utilizzato da molti ricercatori. La versione di sviluppo attuale si basa sulla beta che è stata pubblicata nell’ottobre del 2017: pur essendo molto più ricca di funzionalità rispetto alla prima versione alpha (rilasciata nel luglio 2016) è ancora incentrata sul supporto per edizioni critiche. Una versione completa, con il supporto per edizioni di tipo diplomatico e diplomatico-interpretativo sarà pubblicata nella prima metà del 2019. Questo contributo intende fornire un aggiornamento sui progressi più recenti e anche proporre alcune considerazioni riguardo lo sviluppo di tale strumento, in particolare riguardo i problemi che si incontrano nel progettare un’Interfaccia Utente che deve organizzare in uno spazio bi-dimensionale un gran numero di elementi posti su livelli diversi; le nuove funzionalità che saranno introdotte nella prima versione stabile e l’impatto che avranno sugli utenti; la validità del metodo di sviluppo open source e i rapporti con altri progetti.", "article_title": "Progettazione e implementazione di nuove funzionalità per EVT 2: lo stato attuale dello sviluppo", "authors": [{"given": "Roberto", "family": "Rosselli Del Turco", "affiliation": [{"original_name": "Università di Torino", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Chiara", "family": "Di Pietro", "affiliation": [{"original_name": "Dipartimento di Lettere e Filosofia, Università di Firenze", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Chiara", "family": "Martignano", "affiliation": [{"original_name": "Dipartimento di Lettere e Filosofia, Università di Firenze", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Bologna: AlmaDL", "date": "2019-12-18", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}