[
{"abstract": "<section class=\"abstract\"><p class=\"chapter-para\">This article brings current core concerns of multimodality into dialogue with approaches identified with media archaeology. I begin by considering the development of multimodality in relation to the emphasis that media archaeologists place on non-linear and parallel histories, the relativity of ‘newness’, and cyclical thinking. I then move on to consider some of the respective conceptual undergirding of multimodality and media archaeology, focussing on key issues of materiality and media specificity, signs and signals, media convergence and commensurability. I argue that this juxtaposition brings fresh perspectives to the question of ‘mode’. Significantly, these are attuned both to social and formal considerations, but in ways that differ from both social semiotic orientations and other approaches to multimodality. Having considered these fundamentals, I turn to questions of interactivity, product, and process, and the blurring of boundaries between categories such as reading and writing. As a final intersection, I bring the growing interest in integrating quantitative, corpus-based methods in multimodal analysis into dialogue with the prioritization of the digital archive as a site of specific media archaeological interest with inherent potential for algorithmic manipulation. I conclude with some observations about the status of multimodality and media archaeology as communities and, more specifically, the potential for complementarity between them.</p></section>", "authors": [{"given": " Martin", "family": "Thomas", "affiliation": ["University of Leeds, School of Languages, Cultures and Societies, Leeds, UK"]}]},
{"abstract": "<section class=\"abstract\"><p class=\"chapter-para\">Situated within the debate that has taken place in the recent years on how Digital Humanities can break down barriers between countries of the Global North and South (Intersectionality in Digital Humanities Conference, 2016), and how materials in minority langauges can have presence in the network for the generation of new knowledge (<span class=\"xrefLink\" id=\"jumplink-fqz086-B51\"></span><a href=\"javascript:;\" reveal-id=\"fqz086-B51\" data-open=\"fqz086-B51\" class=\"link link-ref link-reveal xref-bibr\">Thieberger, 2017</a>; <span class=\"xrefLink\" id=\"jumplink-fqz086-B41\"></span><a href=\"javascript:;\" reveal-id=\"fqz086-B41\" data-open=\"fqz086-B41\" class=\"link link-ref link-reveal xref-bibr\">Rodríguez-Ortega and Cruces Rodríguez, 2018</a>), the objective of this article is to explain how (and if) digitalization and Digital Humanities can facilitate research in the Philippines, as well as make it visible, and how this can be facilitated by cooperation projects, citing the example of the project Philperiodicals, carried out by the University of Antwerp and the University of the Philippies. What opportunities and difficulties were encountered upon proposing a project with such characteristics? What problems (ethical, at times) do we encounter when subsidizing projects in the South from the North? We shall address these questions based on the current status of digitalization and Digital Humanities in the country. Lastly, we offer a series of good practices concluded from debates and experiences from the project Philperiodicals, in the hopes that our previous difficulties and discussions may be of use for the development of similar projects in what has been called the Global South. </p></section>", "authors": [{"given": " Rocío", "family": "Ortuño Casanova", "affiliation": ["Department of Literature, Universiteit Antwerpen, Belgium"]}, {"given": " Anna", "family": "Sarmiento", "affiliation": ["Department of European Languages, University of the Philippines Diliman, Philippines"]}]},
{"abstract": "<section class=\"abstract\"><p class=\"chapter-para\">This article presents a relational database capable of integrating data from a variety of types of written sources as well as material remains. In response to historical research questions, information from such diverse sources as documentary, bioanthropological, isotopic, and DNA analyses has been assessed, homogenized, and situated in time and space. Multidisciplinary ontologies offer complementary and integrated perspectives regarding persons and goods. While responding to specific research questions about the impact of globalization on the isthmus of Panama during the sixteenth and seventeenth centuries, the data model and user interface promote the ongoing interrogation of diverse information about complex, changing societies. To this end, the application designed makes it possible to search, consult, and download data that researchers have contributed from anywhere in the world.</p></section>", "authors": [{"given": " Bethany", "family": "Aram", "affiliation": ["Department of Geography, History and Philosophy, Universidad Pablo de Olavide de Sevilla, Spain"]}, {"given": " Aurelio", "family": "López Fernández", "affiliation": ["Department of Sports and Computer Science, Universidad Pablo de Olavide de Sevilla, Spain"]}, {"given": " Daniel", "family": "Muñiz Amian", "affiliation": ["Department of Sports and Computer Science, Universidad Pablo de Olavide de Sevilla, Spain"]}]},
{"abstract": null, "authors": []},
{"abstract": null, "authors": []}
]