[
{"abstract": "<section class=\"abstract\"><p class=\"chapter-para\">Higher education operates in a quickly changing, progressively more globalized, cosmopolitan, and interconnected world (<span class=\"xrefLink\" id=\"jumplink-fqaa023-B6\"></span><a href=\"javascript:;\" reveal-id=\"fqaa023-B6\" data-open=\"fqaa023-B6\" class=\"link link-ref link-reveal xref-bibr\">Bauman, 2000</a>, <em>Globalization: The Human Consequences</em>. New York/Chichester: Columbia University Press; <span class=\"xrefLink\" id=\"jumplink-fqaa023-B3\"></span><a href=\"javascript:;\" reveal-id=\"fqaa023-B3\" data-open=\"fqaa023-B3\" class=\"link link-ref link-reveal xref-bibr\">Appiah, 2006</a>, Cosmopolitanism: Ethics in a World of Strangers. New York: W.W. Norton &amp; Co; <span class=\"xrefLink\" id=\"jumplink-fqaa023-B28\"></span><a href=\"javascript:;\" reveal-id=\"fqaa023-B28\" data-open=\"fqaa023-B28\" class=\"link link-ref link-reveal xref-bibr\">Zuckerman, 2013</a>, Rewire: Digital Cosmopolitans in the Age of Connection. New York: W. W. Norton &amp; Company). At the same time, substantive inequalities between people and places mean that this connectivity and knowledge is unevenly spread (<span class=\"xrefLink\" id=\"jumplink-fqaa023-B16\"></span><a href=\"javascript:;\" reveal-id=\"fqaa023-B16\" data-open=\"fqaa023-B16\" class=\"link link-ref link-reveal xref-bibr\">Hallberg Adu, 2014</a>, What is the opposite of a knowledge society? A critical reflection from Ghana. In Amoah, L. (ed.), Impacts of the Knowledge Society on Economic and Social Growth in Africa. IGI Global). For our students, the future leaders of this unequal world, critical reasoning becomes a key skill, and perhaps especially so for students in the Global South. This paper argues that digital humanities (DH) can provide both a theoretical framework for decolonizing the academy and technological solutions to hurdles in this process. The paper argues that assignments, their theoretical underpinnings, and implementation are key to decolonizing higher education. It describes three accessible technology-driven assignments with DH pedagogy created for diverse classrooms at Ashesi University in Ghana and discusses their outcomes.</p></section>", "authors": [{"given": " Kajsa", "family": "Hallberg Adu", "affiliation": ["The Nordic Africa Institute, Uppsala, Sweden"]}]},
{"abstract": "<section class=\"abstract\"><p class=\"chapter-para\">The objective of this study is to answer the question: Do the central nodes of a social network of characters correspond with the protagonists of a theater play? To answer this question we evaluate different measures of centrality along with other textual quantitative values in relation to other manually annotated metadata on a corpus of twenty five dramatic plays of the Spanish theatre of the Silver Age (1868-1936). The found results show that centrality correlates moderately with importance, but the correlation with the textual quantitative values is stronger.</p></section>", "authors": [{"given": " María Teresa", "family": "Santa María", "affiliation": ["Universidad Internacional de La Rioja, Spain"]}, {"given": " José", "family": "Calvo Tello", "affiliation": ["Göttingen State and University Library, Germany"]}, {"given": " Concepción María", "family": "Jiménez", "affiliation": ["Universidad Internacional de La Rioja, Spain"]}]},
{"abstract": "<section class=\"abstract\"><p class=\"chapter-para\">Local historical documents originated from daily life of people belong to special collection resources that were not published publicly. They are valuable assets of universities and libraries. At present, most documents had only finished digitalization or partial datalization work. However, the requirements of deep knowledge mining in documents data, providing visual analysis, and effectively supporting the research of historic humanities scholars had not been fully met. Taking the local historical documents project of Shanghai Jiao Tong University as an example, using relevant techniques of digital humanities (DH), the in-depth analysis and utilization research of documents data were carried out. On the one hand, the core database of the documents was established based on standardizing metadata cataloguing and establishing metadata association. On the other hand, based on the core database, an intelligent DH system platform was constructed. The platform is to realize full-field retrieval and display of the documents, text analysis, association analysis, statistics, and visual presentation of knowledge. In addition, in the process of using the platform for research, humanities scholars can continuously expand the data dimensions and the relationships between data, achieve intelligent supplementation of documents data and platform self-learning. The concept of DH has led to a new direction of database construction and platform development. In the exploration and practice of DH, libraries should continue to widen thinking, improve service and innovation capabilities, and provide better research perspectives, research environments, research support, and research experience for humanities scholars.</p></section>", "authors": [{"given": " Yin", "family": "Qian", "affiliation": ["Shanghai Jiao Tong University, China"]}, {"given": " Zhuoyuan", "family": "Xing", "affiliation": ["Shanghai Jiao Tong University, China"]}, {"given": " Xiaohua", "family": "Shi", "affiliation": ["Shanghai Jiao Tong University, China"]}]},
{"abstract": "<section class=\"abstract\"><p class=\"chapter-para\">The moods, feelings, and attitudes represented in a novel will resonate in the reader by activating similar sentiments. It is generally accepted that sentiment analysis can capture aspects of such moods, feelings, and attitudes and can be used to summarize a novel’s plot in a story arc. With the availability of a number of algorithms to automatically extract sentiment-based story arcs, new approaches for their utilization becomes pertinent. We propose to use nonlinear adaptive filtering and fractal analysis in order to analyze the narrative coherence and dynamic evolution of a novel. Using <em>Never Let Me Go</em> by Kazuo Ishiguro, the winner of the 2017 Nobel Prize for Literature as an illustrative example, we show that: (1) nonlinear adaptive filtering can extract a story arc that reflects the tragic trend of the novel; (2) the story arc displays persistent dynamics as measured by the Hurst exponent at short and medium timescales; (3) the plot’s dynamic evolution is reflected in the time-varying Hurst exponent. We argue that these findings are indicative of the potential that multifractal theory has for computational narratology and large-scale literary analysis. Specifically that the global Hurst exponent of a story arc is an index of narrative coherence that can identify bland, incoherent, and coherent narratives on a continuous scale. And, further, that the local time-varying Hurst exponent captures variation of a novel’s plot such that the extrema have specific narratological interpretations.</p></section>", "authors": [{"given": " Qiyue", "family": "Hu", "affiliation": ["Center for Geodata and Analysis, Faculty of Geographical Science, Beijing Normal University, China"]}, {"given": " Bin", "family": "Liu", "affiliation": ["Business School, Guangxi University, China"]}, {"given": " Mads Rosendahl", "family": "Thomsen", "affiliation": ["School of Communication and Culture, Aarhus University, Denmark"]}, {"given": " Jianbo", "family": "Gao", "affiliation": ["Center for Geodata and Analysis, Faculty of Geographical Science, Beijing Normal University, China; Institute of Automation, Chinese Academy of Sciences, China and International College, Guangxi University, China"]}, {"given": " Kristoffer L", "family": "Nielbo", "affiliation": ["Center for Humanities Computing, Aarhus University, Denmark"]}]},
{"abstract": "<section class=\"abstract\"><p class=\"chapter-para\">The experiences of murdered victims of Nazi persecutions perished with them. This article discusses how text and data mining technology has helped to recover fragments of these lost experiences out of 2,500 oral history interviews with survivors. This gave rise to Let them Speak, a data edition of Holocaust testimonies. The first part situates the challenge of revealing lost experiences in historiography, and argues that the experience of murdered victims can be reconstructed through the collective experience. The second part shows how text and data mining techniques assisted the author to identify some pieces of the collective experience. The third part presents how web technology and visualization are used to render pieces of the collective experience as testimonial fragments of the Holocaust. </p></section>", "authors": [{"given": " Gábor", "family": "Mihály Tóth", "affiliation": ["USC Shoah Foundation and the Signal Analysis and Interpretation Laboratory (SAIL), Viterbi School of Engineering, University of Southern California, USA and Yale University, Digital Humanities Laboratory and Fortunoff Video Archive for Holocaust Testimonies"]}]}
]