{"url": "http://dx.doi.org/10.1093/llc/fql039", "identifier": {"string_id": "10.1093/llc/fql039", "id_scheme": "DOI"}, "abstract": "Previous studies of American English have identified a number of robust patterns involving the vowel system, such as the Northern Cities Chain Shift and the Southern Vowel Shift. These studies primarily employ methods which treat separately the phonetic properties of specific vowels as produced by individual speakers which are later assembled into complete vowel systems. While this provides a useful picture of production, it is not adequate for comparison with dialect perception studies, where interpretation of the results often requires some understanding of the correlations among linguistic features and between those features and individual talkers. We conducted a factor analysis of the duration and first and second formant frequencies of each of the fourteen vowels produced by forty-eight speakers representing six regional varieties of American English and both genders. The data were submitted to factor analysis using maximum likelihood estimation and Varimax rotation. Results confirmed significant correlations between regional dialect and acoustic–phonetic properties of the vowel systems, although these patterns are complicated by interactions with gender. These results illustrate the utility of factor analytic methods in examining systematic variation across an entire linguistic system such as the vowels.", "article_title": "North American English Vowels: A Factor-analytic Perspective", "authors": [{"given": " Cynthia G.", "family": "Clopper", "affiliation": [{"original_name": "Indiana University, Bloomington, IN 47405, USA", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}, {"given": " John C.", "family": "Paolillo", "affiliation": [{"original_name": "Indiana University, Bloomington, IN 47405, USA", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2006-09-06", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "21", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}