{"url": "http://www.jstor.org/stable/30204912", "identifier": {"string_id": "10.2307/30204912", "id_scheme": "DOI"}, "abstract": "As language data and associated technologies proliferate and as the language resources community expands, it is becoming increasingly difficult to locate and reuse existing resources. Are there any lexical resources for such-and-such a language? What tool works with transcripts in this particular format? What is a good format to use for linguistic data of this type? Questions like these dominate many mailing lists, since web search engines are an unreliable way to find language resources. This paper reports on a new digital infrastructure for discovering language resources being developed by the Open Language Archives Community (OLAC). At the core of OLAC is its metadata format, which is designed to facilitate description and discovery of all kinds of language resources, including data, tools, or advice. The paper describes OLAC metadata, its relationship to Dublin Core metadata, and its dissemination using the metadata harvesting protocol of the Open Archives Initiative.", "article_title": "Extending Dublin Core Metadata to Support the Description and Discovery of Language Resources", "authors": [{"given": "Steven", "family": "Bird", "affiliation": [{"original_name": "University of Melbourne", "normalized_name": "University of Melbourne", "country": "Australia", "identifiers": {"ror": "https://ror.org/01ej9dk98", "GRID": "grid.1008.9"}}, {"original_name": "University of Pennsylvania", "normalized_name": "University of Pennsylvania", "country": "United States", "identifiers": {"ror": "https://ror.org/00b30xv10", "GRID": "grid.25879.31"}}]}, {"given": "Gary", "family": "Simons", "affiliation": [{"original_name": "SIL International", "normalized_name": "SIL International", "country": "United States", "identifiers": {"ror": "https://ror.org/00d57b563", "GRID": "grid.481394.3"}}]}], "date": "2003-01-01", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "37", "issue": "4", "ISSN": [{"value": "00104817", "type": "print"}]}