{"url": "http://www.jstor.org/stable/30204914", "identifier": {"string_id": "10.2307/30204914", "id_scheme": "DOI"}, "abstract": "This paper considers the question of authorship attribution techniques when faced with a pastiche. We ask whether the techniques can distinguish the real thing from the fake, or can the author fool the computer? If the latter, is this because the pastiche is good, or because the technique is faulty? Using a number of mainly vocabulary-based techniques, Gilbert Adair's pastiche of Lewis Carroll, Alice Through the Needle's Eye, is compared with the original 'Alice' books. Standard measures of lexical richness, Yule's K and Orlov's Z both distinguish Adair from Carroll, though Z also distinguishes the two originals. A principal component analysis based on word frequencies finds that the main differences are not due to authorship. A discriminant analysis based on word usage and lexical richness successfully distinguishes the pastiche from the originals. Weighted cusum tests were also unable to distinguish the two authors in a majority of cases. As a cross-validation, we made similar comparisons with control texts: another children's story from the same era, and other work by Carroll and Adair. The implications of these findings are discussed.", "article_title": "Authorship Attribution and Pastiche", "authors": [{"given": "Harold", "family": "Somers", "affiliation": [{"original_name": "Centre for Computational Linguistics, UMIST, Manchester UK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Fiona", "family": "Tweedie", "affiliation": [{"original_name": "Department of Statistics, University of Glasgow, Scotland, UK", "normalized_name": "University of Glasgow", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vtgdb53", "GRID": "grid.8756.c"}}]}], "publisher": "Springer", "date": "2003-01-01", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "37", "issue": "4", "ISSN": [{"value": "00104817", "type": "print"}]}