{"url": "http://projects.chass.utoronto.ca/chwp/CHC2003/Bonnett2.htm", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "One of the key challenges currently facing humanities and computing scholars is the generation of new conventions, particularly new forms of narration and representation to support student development of critical thinking skills. Drawing inspiration from the writings of the communication theorist Harold Innis, this study argues that conventions supporting information visualization - the production of visual analogues of ideas or patterns represented by text and number - can help students apprehend and interrogate concepts. The experience of the 3D Virtual Buildings Project suggests that a program devoted to 3D computer modelling is one way that Innis' ideas might be realized. Through tutorials students learn to reconstruct models of historic Canadian settlements and to translate historic data into numeric information for a 3D model. Most importantly, the tutorials show students that historical models are inherently imperfect, at best partial reconstructions of the past. Through a process of information translation and visualization, students learn to distinguish historical models from the objects they purport to represent.", "article_title": "The Oral Tradition in 3D: Harold Innis, Information Visualisation and the 3D Historical Cities Project", "authors": [{"given": "John", "family": "Bonnett", "affiliation": [{"original_name": "National Research Council of Canada, Institute for Information Technology, Fredericton, NB", "normalized_name": "Oldenburger Institut für Informatik", "country": "Germany", "identifiers": {"ror": "https://ror.org/003sav189", "GRID": "grid.5637.7"}}]}], "publisher": null, "date": "2003-09-01", "keywords": ["Harold Innis, 3D, virtual reality, CAD, information visualisation, learning, constructivism, urban architecture, Canada, history, computing, critical thinking"], "volume": null, "issue": null, "ISSN": [{"value": "1205-5743", "type": "print"}], "journal_title": "CH Working Papers"}