{"url": "http://dx.doi.org/10.1353/dph.2012.0006", "identifier": {"string_id": "10.1353/dph.2012.0006", "id_scheme": "DOI"}, "abstract": "In this paper I study the portrayal of Jean de Meun in Arsenal 3339, an early fifteenth-century manuscript collection in which the Rose precedes Jean’s Testament, Codicille, and Tresor ou Sept articles de la foi. I marshal manuscript evidence to show how the person who masterminded the production of Arsenal 3339 refuted certain of the reproaches leveled against Jean de Meun in the 1401–1403 Debate about the Roman de la Rose. They were, in effect, that he had erred on key theological points and had moreover employed questionable instructional methods. Although the Arsenal mastermind, whom I provisionally identify as its compiler, objects to the way that Jean as Rose author had portrayed himself by means of a negative persona, Jean “Clopinel,” which can be roughly translated as “Jean who limps,” he nevertheless declines to join with Jean Gerson and Christine de Pizan to consign the book to the flames. I make the case that the compiler was an early fifteenth-century reader exceptionally well versed in the Rose, the Debate documents, and Gerson’s sermons, who, by expertly designing the collection, seeks to rehabilitate Jean’s professional reputation in response to criticisms lodged by his detractors in the Debate.", "article_title": "“The Foot on Which He Limps”: Jean Gerson and the Rehabilitation of Jean de Meun in Arsenal 3339", "authors": [{"given": "Lori J.", "family": "Walters", "affiliation": [{"original_name": "Florida State University", "normalized_name": "Florida State University", "country": "United States", "identifiers": {"ror": "https://ror.org/05g3dte14", "GRID": "grid.255986.5"}}]}], "publisher": "Johns Hopkins University Press", "date": "2012-07-11", "keywords": null, "journal_title": "Digital Philology: A Journal of Medieval Cultures", "volume": "1", "issue": "1", "ISSN": [{"value": "2162-9552", "type": "electronic"}]}