{"url": "http://dx.doi.org/10.1093/llc/fqs004", "identifier": {"string_id": "10.1093/llc/fqs004", "id_scheme": "DOI"}, "abstract": "This article discusses the crowdsourced manuscript transcription project Transcribe Bentham, and how it will impact upon long-established editorial practices at the Bentham Project, University College London, which is producing the new and authoritative edition of The Collected Works of Jeremy Bentham. We site Transcribe Bentham in the burgeoning field of scholarly crowdsourcing projects, and, by detailing our experiences of running and administering the project, attempt to assess the potential benefits of engaging the public in humanities research. The article examines the conceptualization and development of Transcribe Bentham, and how editorial practices at the Bentham Project may change as a result. We account for the design of the bespoke transcription tool which is at the project's heart, and which allows volunteers to transcribe the material and encode it in TEI-compliant XML. We attempt to answer five key questions: is crowdsourcing the transcription of complex manuscripts cost-effective? Is crowdsourcing exploitative? Are volunteer-produced transcripts of sufficient quality for editorial use and uploading to a digital repository, and what quality controls are required? Does crowdsourcing ensure sustainability and widen access to this priceless material? And finally, should the success of a project like Transcribe Bentham be measured solely according to cost-effectiveness or the volume of work produced, or do considerations of public engagement and access outweigh such concerns?", "article_title": "Transcription maximized; expense minimized? Crowdsourcing and editing The Collected Works of Jeremy Bentham*", "authors": [{"given": " Tim", "family": "Causer", "affiliation": [{"original_name": "Bentham Project, University College London", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Justin", "family": "Tonra", "affiliation": [{"original_name": "Department of English, University of Virginia", "normalized_name": "University of Virginia", "country": "United States", "identifiers": {"ror": "https://ror.org/0153tk833", "GRID": "grid.27755.32"}}]}, {"given": " Valerie", "family": "Wallace", "affiliation": [{"original_name": "Bentham Project, University College London", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}, {"original_name": "Center for History and Economics, Harvard University", "normalized_name": "Harvard University", "country": "United States", "identifiers": {"ror": "https://ror.org/03vek6s52", "GRID": "grid.38142.3c"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012-03-29", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "27", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}