{"url": "http://dx.doi.org/10.1093/llc/fqs027", "identifier": {"string_id": "10.1093/llc/fqs027", "id_scheme": "DOI"}, "abstract": "Like most authors of digital works of the narrative genre, Gregory Chatonsky is opposed to the idea that plots should be written according to the novelistic traditions. His hyperfiction entitled The Subnetwork is no exception. For the clash of heterogeneous media in this work to produce a ‘community of metaphors’, as opposed to a dialectical reasoning or a conventional narrative, every single media must be indifferently compatible with each other. Occasional relationships are thus established between different worlds, different parts of individual and collective history, which highlights a more fundamental relation of co-membership, where heterogeneous elements are always likely to assemble according to the ‘brotherhood of a new metaphor’ (Rancière, 2003, Le destin des images. Paris: La Fabrique, p. 67). The range of metaphorical brotherhood yet widens in The Subnetwork, through the introduction of animated texts and the possibility that readers are given to ‘manipulate’ (interact with) the work. Using a semio-pragmatic methodology developed at University Paris 8, I will first examine in detail the construction of meaning in these combinations between texts and movement or manipulation and their relationship with the contexts in a reading process. Digital literature often experiments with unexpected combinations based on a (de-)coherence between text, movement, and manipulation gestures, called animation figures and manipulation figures: I would situate a part of the poetic potential of digital literature in these ‘spaces of indeterminacy’.", "article_title": "Animation and manipulation figures in digital literature and the poetics of (de-)coherence: As exemplified by Gregory Chatonsky's The Subnetwork", "authors": [{"given": " Alexandra", "family": "Saemmer", "affiliation": [{"original_name": "University Paris 8, France", "normalized_name": "Paris 8 University", "country": "France", "identifiers": {"ror": "https://ror.org/04wez5e68", "GRID": "grid.15878.33"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2012-07-24", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "27", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}