{"url": "http://dx.doi.org/10.2218/ijdc.v7i2.227", "identifier": {"string_id": "10.2218/ijdc.v7i2.227", "id_scheme": "DOI"}, "abstract": "In this paper we discuss archival storage container formats from the point of view of digital curation and preservation, an aspect of preservation overlooked by most other studies. Considering established approaches to data management as our jumping off point, we selected seven container format attributes that are core to the long term accessibility of digital materials. We have labeled these core preservation attributes. These attributes are then used as evaluation criteria to compare storage container formats belonging to five common categories: formats for archiving selected content (e.g. tar, WARC), disk image formats that capture data for recovery or installation (partimage, dd raw image), these two types combined with a selected compression algorithm (e.g. tar+gzip),  formats that combine packing and compression (e.g. 7-zip), and forensic file formats for data analysis in criminal investigations (e.g. aff – Advanced Forensic File format). We present a general discussion of the storage container format landscape in terms of the attributes we discuss, and make a direct comparison between the three most promising archival formats: tar, WARC, and aff. We conclude by suggesting the next steps to take the research forward and to validate the observations we have made.", "article_title": "Digital Forensics Formats: Seeking a Digital Preservation Storage Container Format for Web Archiving", "authors": [{"given": "Yunhyong", "family": "Kim", "affiliation": [{"original_name": "University of Glasgow", "normalized_name": "University of Glasgow", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vtgdb53", "GRID": "grid.8756.c"}}]}, {"given": "Seamus", "family": "Ross", "affiliation": [{"original_name": "University of Toronto, Canada", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}, {"original_name": "Humanities Advanced Technology and Information Institute,University of Glasgow", "normalized_name": "University of Glasgow", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/00vtgdb53", "GRID": "grid.8756.c"}}]}], "publisher": "Edinburgh University", "date": "2012-10-23", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "7", "issue": "2", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}