{"url": "http://dx.doi.org/10.1093/llc/fqt032", "identifier": {"string_id": "10.1093/llc/fqt032", "id_scheme": "DOI"}, "abstract": "Stemmatology, or the reconstruction of the transmission history of texts, is a field that stands particularly to gain from digital methods. Many scholars already take stemmatic approaches that rely heavily on computational analysis of the collated text (e.g. Robinson and O’Hara 1996; Salemans 2000; Heikkilä 2005; Windram et al. 2008 among many others). Although there is great value in computationally assisted stemmatology, providing as it does a reproducible result and allowing access to the relevant methodological process in related fields such as evolutionary biology, computational stemmatics is not without its critics. The current state-of-the-art effectively forces scholars to choose between a preconceived judgment of the significance of textual differences (the Lachmannian or neo-Lachmannian approach, and the weighted phylogenetic approach) or to make no judgment at all (the unweighted phylogenetic approach). Some basis for judgment of the significance of variation is sorely needed for medieval text criticism in particular. By this, we mean that there is a need for a statistical empirical profile of the text-genealogical significance of the different sorts of variation in different sorts of medieval texts. The rules that apply to copies of Greek and Latin classics may not apply to copies of medieval Dutch story collections; the practices of copying authoritative texts such as the Bible will most likely have been different from the practices of copying the Lives of local saints and other commonly adapted texts. It is nevertheless imperative that we have a consistent, flexible, and analytically tractable model for capturing these phenomena of transmission. In this article, we present a computational model that captures most of the phenomena of text variation, and a method for analysis of one or more stemma hypotheses against the variation model. We apply this method to three ‘artificial traditions’ (i.e. texts copied under laboratory conditions by scholars to study the properties of text variation) and four genuine medieval traditions whose transmission history is known or deduced in varying degrees. Although our findings are necessarily limited by the small number of texts at our disposal, we demonstrate here some of the wide variety of calculations that can be made using our model. Certain of our results call sharply into question the utility of excluding ‘trivial’ variation such as orthographic and spelling changes from stemmatic analysis.", "article_title": "Beyond the tree of texts: Building an empirical model of scribal variation through graph analysis of texts and stemmata", "authors": [{"given": " Tara L.", "family": "Andrews", "affiliation": [{"original_name": "KU Leuven, Belgium", "normalized_name": "KU Leuven", "country": "Belgium", "identifiers": {"ror": "https://ror.org/05f950310", "GRID": "grid.5596.f"}}]}, {"given": " Caroline", "family": "Macé", "affiliation": [{"original_name": "KU Leuven, Belgium", "normalized_name": "KU Leuven", "country": "Belgium", "identifiers": {"ror": "https://ror.org/05f950310", "GRID": "grid.5596.f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013-06-27", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}