{"url": "http://dx.doi.org/10.1093/llc/fqt008", "identifier": {"string_id": "10.1093/llc/fqt008", "id_scheme": "DOI"}, "abstract": "In recent years, great availability of various language resources in different forms as well as rapid development of computer technology and programming skills have made researchers in the fields of linguistics and computer science cooperate in solving different problems of computational linguistics and natural language processing. Building large monolingual as well as bilingual corpora in digital forms and storing them in computer memories has enabled linguists and language engineers to automatically explore techniques for processing information with the help of various computer programs without any need to manually collect and analyze data.One of the main applications of monolingual corpora can be seen in developing automatic spell-checking systems. In such systems, a large monolingual corpus can function as a database instead of a monolingual dictionary. In the present study, it has been tried to demonstrate the effectiveness of a large monolingual corpus of Persian in improving the output quality of a spell-checker developed for this language.In the present spelling correction system, the three phases of error detection, making suggestions, and ranking suggestions are performed in three separate stages. An experiment was carried out to evaluate the performance of the spell-checking system.", "article_title": "FarsiSpell: A spell-checking system for Persian using a large monolingual corpus", "authors": [{"given": " Tayebeh", "family": "Mosavi Miangah", "affiliation": [{"original_name": "Payame Noor University, Islamic Republic of Iran", "normalized_name": "Payame Noor University", "country": "Iran", "identifiers": {"ror": "https://ror.org/031699d98", "GRID": "grid.412462.7"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013-02-23", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}