{"url": "http://dx.doi.org/10.1093/llc/fqt025", "identifier": {"string_id": "10.1093/llc/fqt025", "id_scheme": "DOI"}, "abstract": "The political negotiation, erection, and fall of national and cultural borders represent an issue that frequently occupies the media. Given the historical importance of boundaries as a marker of cultural identity, as well as their function to separate and unite people, the Body Type Dictionary (BTD; Wilson, 2006) represents a suitable computerized content analysis measure to analyse vocabulary qualified to measure body boundaries and their penetrability. Out of this context, this study aimed to assess the inter-method reliability of the BTD (Wilson, 2006) in relation to Fisher and Cleveland’s (1956, 1958) manual scoring system for high and low barrier personalities. The results indicated that Fisher and Cleveland’s manually coded barrier and penetration imagery scores showed an acceptable positive correlation with the computerized frequency counts of the BTD’s coded barrier and penetration imagery scores, thereby indicating an inter-method reliability. In addition, barrier and penetration imagery correlated positively with primordial thought language in the picture response test, and narratives of everyday and dream memories, thereby indicating correlational validity.", "article_title": "Assessing the inter-method reliability and correlational validity of the Body Type Dictionary", "authors": [{"given": " Laura A.", "family": "Cariola", "affiliation": [{"original_name": "Lancaster University, Department of Linguistics and English Language", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013-05-22", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}