{"url": "http://dx.doi.org/10.1093/llc/fqt059", "identifier": {"string_id": "10.1093/llc/fqt059", "id_scheme": "DOI"}, "abstract": "There is a need in the humanities for a 3D WebGIS with analytical tools that allow researchers to analyze 3D models linked to spatially referenced data. Geographic Information Systems (GIS) allow for complex spatial analysis of 2.5D data. For example, they offer bird’s eye views of landscapes with extruded building footprints, but one cannot ‘get on the ground’ and interact with true 3D models from a pedestrian perspective. Meanwhile, 3D models and virtual environments visualize data in 3D space, but analytical tools are simple rotation or lighting effects. The MayaArch3D Project is developing a 3D WebGIS—called QueryArch3D—to allow these two distinct approaches to ‘talk to each other’ for studies of architecture and landscapes—in this case, the eighth-century Maya kingdom of Copan, Honduras. With this tool, researchers can search and query, in real time via a virtual reality (VR) environment, segmented 3D models of multiple resolutions (as well as computer-assisted design and reality-based) that are linked to attribute data stored in a spatial database. Beta tests indicate that this tool can assist researchers in expanding questions and developing new analytical methods in humanities research. This article summarizes the results of a pilot project that started in 2009, with an art historian and an archaeologist’s collaborative research on the ancient Maya kingdom and UNESCO World Heritage site of Copan in Honduras—called MayaArch3D. The project researches innovative approaches to integrate GIS, 3D digital models, and VR environments online for teaching and research on ancient architecture and landscapes. It has grown into an international, interdisciplinary project that brings together art historians, archaeologists, and cultural resource managers with experts in remote sensing, photogrammetry, 3D modeling, and VR. The Start Up Phase was funded by two National Endowment for the Humanities, Digital Humanities Start-Up grants to the University of New Mexico (PI: Jennifer von Schwerin) and developed and beta tested a pipeline and prototype 3D WebGIS—called QueryArch3D. The prototype version is available at http://mayaarch3d.org/project-history/). Project results indicate that it is possible to bridge the gap between 3D and GIS to create a resource for researchers of Maya architecture to compare and analyze 3D models and archaeological data in the context of a geographically referenced, VR landscape.", "article_title": "The MayaArch3D project: A 3D WebGIS for analyzing ancient architecture and landscapes", "authors": [{"given": "Jennifer", "family": "von Schwerin", "affiliation": [{"original_name": "Commission for the Archaeology of Non-European Cultures, German Archaeological Institute, 53173 Bonn, Germany", "normalized_name": "Deutsches Archäologisches Institut", "country": "Germany", "identifiers": {"ror": "https://ror.org/041qv0h25", "GRID": "grid.424195.f"}}]}, {"given": "Heather", "family": "Richards-Rissetto", "affiliation": [{"original_name": "3D Optical Metrology Unit, Bruno Kessler Foundation, Trento, Italy", "normalized_name": "Fondazione Bruno Kessler", "country": "Italy", "identifiers": {"ror": "https://ror.org/01j33xk10", "GRID": "grid.11469.3b"}}, {"original_name": "Department of Anthropology, University of New Mexico, Albuquerque, New Mexico, USA", "normalized_name": "University of New Mexico", "country": "United States", "identifiers": {"ror": "https://ror.org/05fs6jp91", "GRID": "grid.266832.b"}}]}, {"given": "Fabio", "family": "Remondino", "affiliation": [{"original_name": "3D Optical Metrology Unit, Bruno Kessler Foundation, Trento, Italy", "normalized_name": "Fondazione Bruno Kessler", "country": "Italy", "identifiers": {"ror": "https://ror.org/01j33xk10", "GRID": "grid.11469.3b"}}]}, {"given": "Giorgio", "family": "Agugiaro", "affiliation": [{"original_name": "3D Optical Metrology Unit, Bruno Kessler Foundation, Trento, Italy", "normalized_name": "Fondazione Bruno Kessler", "country": "Italy", "identifiers": {"ror": "https://ror.org/01j33xk10", "GRID": "grid.11469.3b"}}]}, {"given": "Gabrio", "family": "Girardi", "affiliation": [{"original_name": "Graphitech Center for Advanced Computer Graphics Technologies, Trento, Italy", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013-09-27", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}