{"url": "http://dx.doi.org/10.1093/llc/fqt018", "identifier": {"string_id": "10.1093/llc/fqt018", "id_scheme": "DOI"}, "abstract": "Most authorship attribution studies have focused on works that are available in the language used by the original author (Holmes, 1994; Juola, 2006) because this provides a direct way of examining an author's linguistic habits. Sometimes, however, questions of authorship arise regarding a work only surviving in translation. One example is ‘Constance’, the putative ‘last play’ of Oscar Wilde, only existing in a supposed French translation of a lost English original.The present study aims to take a step towards dealing with cases of this kind by addressing two related questions: (1) to what extent are authorial differences preserved in translation; (2) to what extent does this carry-over depend on the particular translator?With these aims, we analysed 262 letters written by Vincent van Gogh and by his brother Theo, dated between 1888 and 1890, each available in the original French and in an English translation. We also performed a more intensive investigation of a subset of this corpus, comprising forty-eight letters, for which two different English translations were obtainable. Using three different indices of discriminability (classification accuracy, Hedge's g, and area under the receiver operating characteristic curve), we found that much of the stylistic discriminability between the two brothers was preserved in the English translations. Subsidiary analyses were used to identify which lexical features were contributing most to inter-author discriminability.Discrimination between translation sources was possible, although less effective than between authors. We conclude that ‘handprints’ of both author and translator can be found in translated texts, using appropriate techniques.", "article_title": "Found in translation: To what extent is authorial discriminability preserved by translators?", "authors": [{"given": " Richard S.", "family": "Forsyth", "affiliation": [{"original_name": "16 Halliday Avenue, Leeds LS12 3PQ, UK", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Phoenix W. Y.", "family": "Lam", "affiliation": [{"original_name": "Hong Kong Baptist University, Hong Kong", "normalized_name": "Hong Kong Baptist University", "country": "China", "identifiers": {"ror": "https://ror.org/0145fw131", "GRID": "grid.221309.b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013-05-07", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}