{"url": "http://dx.doi.org/10.1093/llc/fqt046", "identifier": {"string_id": "10.1093/llc/fqt046", "id_scheme": "DOI"}, "abstract": "The Department of Classics at Tufts University and the Perseus Project have jointly designed and tested an integrated platform (the Perseids Platform) on which students and scholars can collaboratively transcribe, edit, and translate Latin and Greek texts, creating vetted open source digital editions. This project, while giving students the opportunity to work with original untranslated documents, also contributes to the efforts of the scholarly community worldwide to meet the challenge of publishing large numbers of primary source documents online while preserving high editorial standards. The platform integrates the Son of SUDA Online software, originally developed to edit papyrological texts, and the Collections, Indexes, and Texts, with Extensions architecture, originally developed by the Center for Hellenic Studies of Harvard University to support the Homer Multitext Project. The present article discusses our scholarly and pedagogical objectives in developing the platform, the technical challenges we faced in the course of our work, and the results we obtained.", "article_title": "Developing a New Integrated Editing Platform for Source Documents in Classics", "authors": [{"given": " Bridget", "family": "Almas", "affiliation": [{"original_name": "The Perseus Project, Tufts University, Medford, MA, USA", "normalized_name": "Tufts University", "country": "United States", "identifiers": {"ror": "https://ror.org/05wvpxv85", "GRID": "grid.429997.8"}}]}, {"given": " Marie-Claire", "family": "Beaulieu", "affiliation": [{"original_name": "Department of Classics, Tufts University, Medford, MA, USA", "normalized_name": "Tufts University", "country": "United States", "identifiers": {"ror": "https://ror.org/05wvpxv85", "GRID": "grid.429997.8"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2013-07-26", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "28", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}