{"url": "http://dx.doi.org/10.2218/ijdc.v8i1.250", "identifier": {"string_id": "10.2218/ijdc.v8i1.250", "id_scheme": "DOI"}, "abstract": "The changing world of IT services opens the chance to more tightly integrate digital long-term preservation into systems, both for commercial and end users. The emergence of cloud offerings re-centralizes services, and end users interact with them remotely through standardized (web-)client applications on their various devices. This offers the chance to use partially the same concepts and methods to access obsolete computer environments and allows for more sustainable business processes. In order to provide a large variety of user-friendly remote emulation services, especially in combination with authentic performance and user experience, a distributed system model and architecture is required, suitable to run as a cloud service, allowing for the specialization both of memory institutions and third party service providers. The shift of the usually non-trivial task of the emulation of obsolete software environments from the end user to specialized providers can help to simplify digital preservation and access strategies. Besides offering their users better access to their holdings, libraries and archives may gain new business opportunities to offer services to a third party, such as businesses requiring authentic reproduction of digital objects and processes for legal reasons. This paper discusses cloud concepts as the next logical step for accessing original digital material. Emulation-as-a-Service (EaaS) fills the gap between the successful demonstration of emulation strategies as a long term access strategy and it’s perceived availability and usability. EaaS can build upon the ground of research and prototypical implementations of previous projects, and reuse well established remote access technology. In this article we develop requirements and a system model, suitable for a distributed environment. We will discuss the building blocks of the core services as well as requirements regarding access management. Finally, we will try to present a business model and estimate costs to implement and run such a service. The implementations of EaaS will influence future preservation planning in memory institutions, as it shifts the focus on object access workflows. ", "article_title": "Towards Emulation-as-a-Service: Cloud Services for Versatile Digital Object Access", "authors": [{"given": "Dirk", "family": "Von Suchodoletz", "affiliation": [{"original_name": "University of Freiburg", "normalized_name": "University of Freiburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/0245cg223", "GRID": "grid.5963.9"}}]}, {"given": "Klaus", "family": "Rechert", "affiliation": [{"original_name": "University of Freiburg", "normalized_name": "University of Freiburg", "country": "Germany", "identifiers": {"ror": "https://ror.org/0245cg223", "GRID": "grid.5963.9"}}]}, {"given": "Isgandar", "family": "Valizada", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Edinburgh University", "date": "2013-06-14", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "8", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}