{"url": "http://dx.doi.org/10.2218/ijdc.v8i1.240", "identifier": {"string_id": "10.2218/ijdc.v8i1.240", "id_scheme": "DOI"}, "abstract": "User-generated content (UGC) has become a part of personal digital collections on the Web, as such collections often contain personal memories, activities, thoughts and even profiles. With the increase in the creation of personal materials on the Web, the needs for archiving and preserving these materials are increasing, not only for the purpose of developing personal archives but also for the purpose of capturing social memory and tracking human traces in this era. Using both survey and interview methods, this study investigated blogs, one popular type of UGC, and analyzed travel bloggers’ perceptions of the value of blogs and the elements of blogs that are important for preservation. The study respondents found personal and sentimental value (e.g., a way to express themselves, a way to keep personal memories and thoughts, and a way to maintain a record for their family) to be the most important reason for preserving blogs, followed by informational value and cultural/historical value. Sharing also appeared as one of the values that respondents found in their blogs. The respondents reported that self-created blog posts (content) and information related to the blog posts (context) are more important to preserve than some other elements (behavior and appearance). Integrating what bloggers consider as most valuable and what archivists think are worth preserving may be an important step when collecting personal blogs.", "article_title": "Defining What Matters When Preserving Web-Based Personal Digital Collections: Listening to Bloggers", "authors": [{"given": "Ayoung", "family": "Yoon", "affiliation": [{"original_name": "University of North Carolina at Chapel Hill", "normalized_name": "University of North Carolina at Chapel Hill", "country": "United States", "identifiers": {"ror": "https://ror.org/0130frc33", "GRID": "grid.10698.36"}}]}], "publisher": "Edinburgh University", "date": "2013-06-14", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "8", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}