{"url": "http://dx.doi.org/10.2218/ijdc.v8i2.263", "identifier": {"string_id": "10.2218/ijdc.v8i2.263", "id_scheme": "DOI"}, "abstract": "Academic librarians are increasingly engaging in data curation by providing infrastructure (e.g., institutional repositories) and offering services (e.g., data management plan consultations) to support the management of research data on their campuses. Efforts to develop these resources may benefit from a greater understanding of disciplinary differences in research data management needs. After conducting a survey of data management practices and perspectives at our research university, we categorized faculty members into four research domains—arts and humanities, social sciences, medical sciences, and basic sciences—and analyzed variations in their patterns of survey responses. We found statistically significant differences among the four research domains for nearly every survey item, revealing important disciplinary distinctions in data management actions, attitudes, and interest in support services. Serious consideration of both the similarities and dissimilarities among disciplines will help guide academic librarians and other data curation professionals in developing a range of data-management services that can be tailored to the unique needs of different scholarly researchers.", "article_title": "Disciplinary differences in faculty research data management practices and perspectives", "authors": [{"given": "Katherine G.", "family": "Akers", "affiliation": [{"original_name": "Emory University Libraries", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Jennifer", "family": "Doty", "affiliation": [{"original_name": "Emory University Libraries", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Edinburgh University", "date": "2013-11-19", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "8", "issue": "2", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}