{"url": "https://doi.org/10.3366/ijhac.2013.0084", "identifier": {"string_id": "10.3366/ijhac.2013.0084", "id_scheme": "DOI"}, "abstract": " The need for a firm understanding of the working practices of researchers in the humanities emerges as a prerequisite for the development of effective digital research infrastructures. This paper will focus on the rationale behind the design and implementation of two related studies conducted in the context of two European e-Infrastructures projects, DARIAH and EHRI. Within DARIAH the challenge involved conducting, analysing and understanding research practices of arts and humanities researchers, a largely ill-defined community encompassing a wide spectrum of disciplines. Each of them deals with a variety of objects employing an extensive number of methods. In the context of EHRI, the challenge is slightly different, due to the involvement of a better-defined research community. Holocaust researchers share well-identified objects, common ground on methods, and handle similar setbacks. In this paper we discuss the approach adopted for designing and implementing qualitative user-centric studies aimed at capturing activities, methods, and types of information objects employed by researchers grounded in identified research goals and questions. It addresses both generic and specific entities and processes, and supports the understanding of researchers’ working practices in settings as diverse and wide as DARIAH, or as specialized as EHRI. The outcomes of the analysis of working practices are used in determining user requirements for digital infrastructures to serve the respective research communities. ", "article_title": "An Approach to Analyzing Working Practices of Research Communities in the Humanities", "authors": [{"given": "Agiatis", "family": "Benardou", "affiliation": [{"original_name": "Digital Curation Unit Athena Research and Innovation Centre, Greece", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Panos", "family": "Constantopoulos", "affiliation": [{"original_name": "Athens University of Economics and Business", "normalized_name": "Athens University of Economics and Business", "country": "Greece", "identifiers": {"ror": "https://ror.org/03s262162", "GRID": "grid.16299.35"}}]}, {"given": "Costis", "family": "Dallas", "affiliation": [{"original_name": "University of Toronto", "normalized_name": "University of Toronto", "country": "Canada", "identifiers": {"ror": "https://ror.org/03dbr7087", "GRID": "grid.17063.33"}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2013-11-01", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "7", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}