{"url": "https://doi.org/10.3366/ijhac.2013.0083", "identifier": {"string_id": "10.3366/ijhac.2013.0083", "id_scheme": "DOI"}, "abstract": " CLARIN is a recently-established research infrastructure which aims to build and sustain services based on language resources and tools. CLARIN aims to support and foster the next generation of research in the humanities, which will make use of advanced digital technologies. A distributed infrastructure is necessary in order to overcome the problems of the current fragmented environment, to create an ecosystem in which data and tools can be connected, and in which innovation will be encouraged. Case studies of early CLARIN demonstrators give a flavour of the possibilities of digital transformations in a number of humanities disciplines, and there is huge potential for important future new directions in literary and linguistic computing. For more widespread, thoroughgoing and effective transformations to take place, builders of infrastructure and researchers will need to negotiate and avoid potential pitfalls, and agree to achieve a certain measure of consensus in terms of priorities, categories and concepts. In the context of current debates about the nature of the humanities and their role in society, it will be necessary for digital humanists to be careful to preserve the unique character and importance of research in the humanities, while moving towards research infrastructures which will facilitate digital scholarship. ", "article_title": "The Role of CLARIN in Digital Transformations in the Humanities", "authors": [{"given": "Martin", "family": "Wynne", "affiliation": [{"original_name": "University of Oxford", "normalized_name": "University of Oxford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/052gg0110", "GRID": "grid.4991.5"}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2013-11-01", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "7", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}