{"url": "https://doi.org/10.3366/ijhac.2013.0080", "identifier": {"string_id": "10.3366/ijhac.2013.0080", "id_scheme": "DOI"}, "abstract": " In this article we present our ideas for an integrating activity for archival research on the Holocaust. We analyse how we can improve Holocaust-related collection descriptions for research, which we will make available online, and how EHRI provides travel grants for transnational access to existing infrastructures in Holocaust research. Both approaches help us overcome that Holocaust-related material is geographically dispersed and address the challenges for historical research stemming from the way documentation on the Holocaust has been attempted up to now. We have chosen to implement the EHRI integrated information resource using graph databases. With their emphasis on relationships, graph databases are particularly well suited for historical research in particular and humanities research in general. We analyse the architecture and implementation details of this novel approach and show how graph databases integrate with traditional ways of searching and browsing historical collections. This way, we support more advanced means of access to facts in the documents and enable deep semantically meaningful access to the documents. The innovation of EHRI lies in the combination of digital and non-digital means to integrate existing infrastructures. We believe this might be a model for many related research activities in the humanities. ", "article_title": "Integrating Holocaust Research", "authors": [{"given": "Tobias", "family": "Blanke", "affiliation": [{"original_name": "King's College London", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}]}, {"given": "Conny", "family": "Kristel", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2013-11-01", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "7", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}