{"url": "https://doi.org/10.3366/ijhac.2013.0082", "identifier": {"string_id": "10.3366/ijhac.2013.0082", "id_scheme": "DOI"}, "abstract": " Archaeologists regularly deal with large and diverse data sets, which are frequently the only record of excavated and destroyed archaeological sites. They need digital research infrastructures to preserve and provide access to this fragile digital data and to develop tools to manipulate and analyse it. Digital data is also increasing in quantity and size, and is often born digital, but there is a high degree of fragmentation and difficulty of accessing data in an integrated way. There is a small but growing number of national discipline-specific research infrastructures, and there have been a few project based attempts to provide European exemplars. This paper describes ARIADNE, a new research infrastructure for archaeologists, funded by the European Commission. It discusses some of the major issues and challenges and introduces some of the activities that ARIADNE partners will undertake. Given the transnational nature of many archaeological research questions, there is a clear value-added for organising research infrastructures in archaeology at a European level. ", "article_title": "ARIADNE: Advanced Research Infrastructures for Archaeological Dataset Networking in Europe", "authors": [{"given": "Franco", "family": "Niccolucci", "affiliation": [{"original_name": "VAST-LAB", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Julian D.", "family": "Richards", "affiliation": [{"original_name": "The University of York", "normalized_name": "University of York", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04m01e293", "GRID": "grid.5685.e"}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2013-11-01", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "7", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}