{"url": "http://dx.doi.org/10.2218/ijdc.v4i2.90", "identifier": {"string_id": "10.2218/ijdc.v4i2.90", "id_scheme": "DOI"}, "abstract": "Scientific researchers today frequently package measurements and associated metadata as digital datasets in anticipation of storage in data repositories. Through the lens of environmental data stewardship, we consider the data repository as an organizational element central to data curation. One aspect of non-commercial repositories, their distance-from-origin of the data, is explored in terms of near and remote categories. Three idealized repository types are distinguished – local, center, and archive - paralleling research, resource, and reference collection categories respectively. Repository type characteristics such as scope, structure, and goals are discussed. Repository similarities in terms of roles, activities and responsibilities are also examined.  Data stewardship is related to care of research data and responsible scientific communication supported by an infrastructure that coordinates curation activities; data curation is defined as a set of repeated and repeatable activities focusing on tending data and creating data products within a particular arena. The concept of “sphere-of-context” is introduced as an aid to distinguishing repository types. Conceptualizing a “web-of-repositories” accommodates a variety of repository types and represents an ecologically inclusive approach to data curation.", "article_title": "Data Stewardship: Environmental Data Curation  and a Web-of-Repositories", "authors": [{"given": "Karen S.", "family": "Baker", "affiliation": [{"original_name": "University of California,San Diego, USA", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}, {"given": "Lynn", "family": "Yarmey", "affiliation": [{"original_name": "University of California,San Diego, USA", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}], "publisher": "Edinburgh University", "date": "2009-10-15", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "4", "issue": "2", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}