[
    {
        "url": "https://journals.psu.edu/dls/article/view/59753",
        "identifier": {
            "string_id": "10.18113/P8dls1159753",
            "id_scheme": "DOI"
        },
        "abstract": "Digital humanities research has frequently been characterized by a high degree of recursivity, that is to say, by attempts to use digital humanities tools and techniques to reflect back on the structures and history of the field. Digital Humanities Masterplots is intended as a contribution to this ongoing project of self-analysis, but one that shifts attention away from actors, institutions, and research agendas and toward what Matthew Kirschenbaum refers to as the digital humanities as a \"discursive construction.\" My aim is not to offer a survey of or an opinion piece on work in an emerging field, not least because a critical mass of such essays already exists. Rather, my primary material will comprise a series of second-order reflections on the field, and, more specifically, how they tend to emplot the rise of the digital humanities in order to render it intelligible within a range of intellectual, institutional, and societal contexts. Inspired by the narratologist Mieke Bal's assertion that \"the shape of the story you tell determines what knowledge you produce,\" my claim is that the shapes of these digital humanities stories derive from certain basic assumptions about the aims of humanistic inquiry, and that by attending to them we can better understand an emerging set of positions regarding the role of the humanities as such.",
        "article_title": "Digital Humanities Masterplots",
        "authors": [
            {
                "given": "Matt",
                "family": "Erlin",
                "affiliation": [
                    "Washington University in St. Louis"
                ]
            }
        ],
        "publisher": null,
        "date": "2016-05-05",
        "keywords": null,
        "journal_title": "Digital Literary Studies",
        "volume": "1",
        "issue": "1",
        "ISSN": [
            {
                "value": "2376-4228",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://journals.psu.edu/dls/article/view/59715",
        "identifier": {
            "string_id": "10.18113/P8dls1159715",
            "id_scheme": "DOI"
        },
        "abstract": "<additions>, <label>, <head>, <note>: with over five hundred elements, why can't I find the one I need? By tracing the different TEI (Text Encoding Initiative) elements and attributes available to describe and record marginalia, this paper reveals how the placement and purpose of early modern marginalia require careful consideration by digital editors. Each element that an encoder might consider using for in-text marginalia, and the customization that proscribes that use, carries different semantic weight. This essay considers the options for encoding marginalia using TEI, details practices of existing projects, and then turns to manuscripts written by Archbishop William Sancroft (1617-1693) as test cases. Ultimately, encoding marginalia is a data-modeling question that asks us to rethink the nature and function of our texts and paratexts, questioning where one ends and the other begins.",
        "article_title": "Encoding the Edge: Manuscript Marginalia and the TEI",
        "authors": [
            {
                "given": "Laura",
                "family": "Estill",
                "affiliation": [
                    "Texas A&M University"
                ]
            }
        ],
        "publisher": null,
        "date": "2016-05-05",
        "keywords": null,
        "journal_title": "Digital Literary Studies",
        "volume": "1",
        "issue": "1",
        "ISSN": [
            {
                "value": "2376-4228",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://journals.psu.edu/dls/article/view/59648",
        "identifier": {
            "string_id": "10.18113/P8dls1159648",
            "id_scheme": "DOI"
        },
        "abstract": "Biopolitics identifies a shift in how government operates, specifically at the level of managing the bodies of citizens. The critical thinkers I discuss in this paper––Michel Foucault, Georgio Agamben, Michael Hardt and Antonio Negri––explore biopolitics and the topic of \"life\": what is life, how is it defined, and whom has the power to control it? In this paper, I argue that the presence of language in electronic literature not only points to the role of language in biopolitical power (or biopower), but also affords electronic literature the ability to act as a site of aesthetic resistance (following Hardt and Negri) operating within and against biopolitical regimes. In particular, I illustrate how 'codework,' a form of electronic literature which integrates natural and programming languages to create its surface-level language, provides a tool from which to think through and work against biopower.  For this, I turn to the writings of Mez Breeze, an electronic author working primarily with codework to explore questions of subjectivity, embodiment, and power in electronic literature.",
        "article_title": "The Biopolitics of Electronic Literature: On the Writings of Mez Breeze",
        "authors": [
            {
                "given": "Kent",
                "family": "Aardse",
                "affiliation": [
                    "University of Waterloo"
                ]
            }
        ],
        "publisher": null,
        "date": "2016-05-05",
        "keywords": null,
        "journal_title": "Digital Literary Studies",
        "volume": "1",
        "issue": "1",
        "ISSN": [
            {
                "value": "2376-4228",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://journals.psu.edu/dls/article/view/59703",
        "identifier": {
            "string_id": "10.18113/P8dls1159703",
            "id_scheme": "DOI"
        },
        "abstract": "This paper offers a unique model for collaborative digital scholarly edition environments that features functions and possibilities associated with  game-related play, challenge, achievement, and narrativity.  These proposed  environments can and should encourage two types of technical education simultaneously: the use of the scholarly edition software, and an increasing mastery of scholarly editing practice. Further, successful models of collaboration found in Massively Multiplayer Online Role-Playing Games can be effectively used to facilitate the operation of collaborative, dynamic editing environments, and achievement \"badges\" along with other ways of acknowledging user contributions are effective ways to validate the gaming \"levels\" and \"achievements\" that various contributors have reached within the editing environment. Functionally incorporating these recognizable game elements into the development of  digital scholarly editions generates an apprenticeship space that continually demands a performative understanding of the kinds of work that go into scholarly editing, encourages collaborative edition development, and clearly establishes who exactly has accomplished that work (and to which level).",
        "article_title": "Gaming the Edition: Modelling Scholarly Editions through Videogame Frameworks",
        "authors": [
            {
                "given": "Jon",
                "family": "Saklofske",
                "affiliation": [
                    "Acadia University The INKE Research Team"
                ]
            },
            {
                "given": "Nina",
                "family": "Belojevic",
                "affiliation": [
                    "University of Victoria"
                ]
            },
            {
                "given": "Alex",
                "family": "Christie",
                "affiliation": [
                    "University of Victoria"
                ]
            },
            {
                "given": "Sonja",
                "family": "Sapach",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "John",
                "family": "Simpson",
                "affiliation": [
                    "Compute Canada"
                ]
            },
            {
                "given": "The INKE Research Team",
                "family": null,
                "affiliation": null
            }
        ],
        "publisher": null,
        "date": "2016-05-05",
        "keywords": null,
        "journal_title": "Digital Literary Studies",
        "volume": "1",
        "issue": "1",
        "ISSN": [
            {
                "value": "2376-4228",
                "type": "electronic"
            }
        ]
    }
]