[
    {
        "url": "http://dx.doi.org/10.16995/dscn.315",
        "identifier": {
            "string_id": "10.16995/dscn.315",
            "id_scheme": "DOI"
        },
        "abstract": "The National Library of Finland has digitized and made available the historical newspapers published in Finland between 1771 and 1910 (Bremer-Laamanen 2014; Kettunen et al. 2014). This collection contains approximately 1.95 million pages in Finnish and Swedish. The Finnish part of the collection consists of about 2.40 billion words. The National Library’s Digital Collections are offered via the digi.kansalliskirjasto.fi web service, also known as Digi. An open data package of the whole collection was released in early 2017 (Pääkkönen et al. 2016). Quality of OCRed collections is an important topic in digital humanities, as it affects general usability and searchability of collections. There is no single available method to assess quality of large collections, but different methods can be used to approximate quality. This paper discusses different corpus analysis style methods to approximate overall lexical quality of the Finnish part of the Digi collection. Methods include usage of parallel samples and word error rates, usage of morphological analysers, frequency analysis of words and comparisons to comparable edited lexical data. Our aim in the quality analysis is twofold: firstly to analyse the present state of the lexical data and secondly, to establish a set of assessment methods that build up a compact procedure for quality assessment after e.g. re-OCRing or post-correction of the material.",
        "article_title": "How to Do Lexical Quality Estimation of a Large OCRed Historical Finnish Newspaper Collection with Scarce Resources",
        "authors": [
            {
                "ORCID": "http://orcid.org/0000-0003-2747-1382",
                "authenticated-orcid": false,
                "given": "Kimmo",
                "family": "Kettunen",
                "affiliation": [
                    "University of Helsinki"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2020-09-21",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "10",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.326",
        "identifier": {
            "string_id": "10.16995/dscn.326",
            "id_scheme": "DOI"
        },
        "abstract": "Social Media and Digital Activism, in the context of the Global South, have continued to redefine identities and transform traditional notions of citizenship, nationhood, and belonging. With the power of digital technologies to bring public and private issues to light, digital cultures have enabled the shaping of contemporary faces of entire nations in the South. The most potent example of how digital activism and new age digital cultures have helped chisel a South Asian queer identity in India and beyond is Section 377, an archaic, colonial law, established in the country by the British Raj, and that until August 2018, criminalized homosexuality as “carnal intercourse” or an “unnatural sexual act.” Although not applicable specifically to homosexuals, it is widely perceived as an anti-queer law in the country; cloaked in colonial textual ambiguity, it directs the colonial desire for sexual control towards colonial societies. This research focuses on an exploration of Indian queer dissident subaltern counterpublics, and how these communities (both members and non-members) congregate on Twitter to combat postcolonial and Victorian structures through new media as a decolonizing and transnational space. Therefore, the hashtags surrounding this event perform and decolonize Indian cyberspaces. The study equally investigates how the new wave of digital activism post reading down of the Section 377 of the Indian Penal Code has fortified identities of the marginalized and the non-marginalized alike and transformed the notion of the “self” and the “other.” Given this premise, this paper employs Twitter Search API to collect and filter tweets that explore the private and public discourses of a digital movement that has proved instrumental in the creation of digital spaces for the marginalized “other.” This body of work contributes to the pool of research that is focused on the understanding of South Asian digital identities and the creation of their digital spaces as a solution for social, legal, and political discrimination.",
        "article_title": "Digital Queer: Tracing the Digital Discourse around Section 377 of the Indian Penal Code",
        "authors": [
            {
                "given": "Narayanamoorthy",
                "family": "Nanditha",
                "affiliation": [
                    "York University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2020-09-09",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "10",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.355",
        "identifier": {
            "string_id": "10.16995/dscn.355",
            "id_scheme": "DOI"
        },
        "abstract": "In this essay, I investigate the development of algorithms from a digital paradigm in Victorian England, specifically through the work of Ada Lovelace and the influences of the Jacquard loom. I consider Lovelace’s algorithms through the framework of poetics, that is, how meaning is made and materialized through symbolic inscription. Within the discursive contexts of industrial manufacturing and Romanticism, I find that an algorithmic mode of production emerges from the consideration and inscription of memory. Since the ramifications of inscription and memory echo throughout contemporary computing and the Digital Humanities, examining the logics and paradigms that computational inscriptions reproduce are increasingly vital today. Thus I ultimately argue for the poetic analyses of algorithms and computer code.",
        "article_title": "The Poetics of Computer Code: Tracing Digital Inscription in Ada Lovelace’s England",
        "authors": [
            {
                "given": "Czander",
                "family": "Tan",
                "affiliation": [
                    "University of Oregon"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2020-07-03",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "10",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.325",
        "identifier": {
            "string_id": "10.16995/dscn.325",
            "id_scheme": "DOI"
        },
        "abstract": "In the summer of 2017, Quinn Dombrowski, an IT staff member in UC Berkeley’s Research IT group, approached Geoffrey Rockwell about the possibility of merging the DiRT Directory with TAPoR, both popular tool discovery portals. Dombrowski could no longer offer the time commitment required to maintain the organizational structure of the volunteer-run tool directory (2018). This decommissioning of DiRT illustrates a set of problems in the digital humanities around tool directories and the tools within as academic contributions. Tool development, in general, is not considered sufficiently scholarly and often suffers from a lack of ongoing support (Ramsay & Rockwell, 2012). When tool discovery portals are no longer maintained due to a lack of ongoing funding, this leads to a loss of digital humanities knowledge and history. While volunteer-based directories require less outright funding, managing and motivating those volunteers to ensure that they remain actively involved in directory upkeep requires a vast amount work to ensure long-term sustainability (Dombrowski, 2018). This paper will explore the difficult history of tool discovery catalogues and portals and the steps being taken to save the DiRT Directory by integrating it into TAPoR. In particular, we will: – Provide a brief history of the attempts to catalogue tools for digital humanists starting with the first software catalogues, such as those circulated through societies, and ending with digital discovery portals, including DiRT Directory and TAPoR. – Discuss the challenges around the maintenance of discovery portals – Consider the design and metadata decisions made in the merging of DiRT Directory with TAPoR.",
        "article_title": "Absorbing DiRT: Tool Directories in the Digital Age",
        "authors": [
            {
                "given": "Kaitlyn",
                "family": "Grant",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Quinn",
                "family": "Dombrowski",
                "affiliation": [
                    "Stanford University"
                ]
            },
            {
                "given": "Kamal",
                "family": "Ranaweera",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Omar",
                "family": "Rodriguez-Arenas",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Stéfan",
                "family": "Sinclair",
                "affiliation": [
                    "McGill University"
                ]
            },
            {
                "given": "Geoffrey",
                "family": "Rockwell",
                "affiliation": [
                    "University of Alberta"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2020-06-03",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "10",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.319",
        "identifier": {
            "string_id": "10.16995/dscn.319",
            "id_scheme": "DOI"
        },
        "abstract": "This article relates to the 2018 CSDH/SCHN conference proceedings. This paper outlines Michael Iantorno’s and Melissa Mony’s experiences with quantitative game analysis by summarizing the first year of development of the prototype ludomusicological database GameSound. To further the discussion, this article also summarizes and analyzes the work of fellow digital humanities scholar Jason Bradshaw, who applied intriguing types of tool-based analysis to BioShock Infinite. To conclude, the paper hypothesizes where this type of research could lead in the future: both for GameSound and for other projects using similar methods and methodologies.",
        "article_title": "GameSound, Quantitative Games Analysis, and the Digital Humanities",
        "authors": [
            {
                "ORCID": "http://orcid.org/0000-0002-5456-1001",
                "authenticated-orcid": false,
                "given": "Michael",
                "family": "Iantorno",
                "affiliation": [
                    "Concordia University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2020-01-23",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "10",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.316",
        "identifier": {
            "string_id": "10.16995/dscn.316",
            "id_scheme": "DOI"
        },
        "abstract": "In this paper, we describe how the hypergeometric test can be used to determine whether a given theme of interest occurs in a storyset at a frequency more than would be expected by chance. By a storyset we mean simply a list of stories defined according to a common attribute (e.g., author, movement, period). The test works roughly as follows: Given a background storyset and a sub-storyset of interest, the test determines whether a given theme is over-represented in the sub-storyset, based on comparing the proportions of stories in the sub-storyset and background storyset featuring the theme. A storyset is said to be “enriched” for a theme with respect to a particular background storyset, when the theme is identified as being significantly over-represented by the test. Furthermore, we introduce here a toy dataset consisting of 280 manually themed Star Trek television franchise episodes. As a proof of concept, we use the hypergeometric test to analyze the Star Trek stories for enriched themes. The hypergeometric testing approach to theme enrichment analysis is implemented for the Star Trek thematic dataset in the R package stoRy. A related R Shiny web application can be found at https://github.com/theme-ontology/shiny-apps.",
        "article_title": "Theme Enrichment Analysis: A Statistical Test for Identifying Significantly Enriched Themes in a List of Stories with an Application to the Star Trek Television Franchise",
        "authors": [
            {
                "given": "Mikael",
                "family": "Onsjö",
                "affiliation": [
                    "Independent Researcher"
                ]
            },
            {
                "given": "Paul",
                "family": "Sheridan",
                "affiliation": [
                    "Hirosaki University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2020-01-23",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "10",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.329",
        "identifier": {
            "string_id": "10.16995/dscn.329",
            "id_scheme": "DOI"
        },
        "abstract": "This essay describes the first phase of the GEMMS project (2014–2019), the purpose of which is to increase access to early modern English manuscript sermons and sermon notes (1530–1715) by creating a freely accessible online bibliographic database of records for these materials. It reviews the need for this resource, the current state of its development, and the challenges and successes to date as well as proposed developments in its next phase.",
        "article_title": "GEMMS (Gateway to Early Modern Manuscript Sermons 1530–1715): Confronting the Challenges of Sermons Research",
        "authors": [
            {
                "given": "Anne",
                "family": "James",
                "affiliation": [
                    "University of Regina"
                ]
            },
            {
                "given": "Jeanne",
                "family": "Shami",
                "affiliation": [
                    "University of Regina"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-12-18",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.352",
        "identifier": {
            "string_id": "10.16995/dscn.352",
            "id_scheme": "DOI"
        },
        "abstract": "It appears that the virtual – in the sense attributed by cybernetics, namely modelling or simulation –, is entering into certain research practices in the human and social sciences, and notably those of certain historians using GIS (or Geographic Information Systems). In that respect, research involving GIS will be examined in order to evaluate, in particular, what the results are for the history discipline in terms of its methods, its concepts, and its renewal, or nonrenewal, of knowledge. Before presenting its initial findings, we will retouch on questions underlying this study and indicate some essential methodological elements.",
        "article_title": "Histoire et SIG: vers une heuristique des cartes relationnelles",
        "authors": [
            {
                "given": "Anolga",
                "family": "Rodionoff",
                "affiliation": [
                    "Universités Paris Lumières", "Université de Saint-Etienne"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-11-04",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.332",
        "identifier": {
            "string_id": "10.16995/dscn.332",
            "id_scheme": "DOI"
        },
        "abstract": "Digital technologies are essential to establishing new forms of dominance through drones and surveillance systems; these forms have significant effects on individuality, privacy, democracy, and American foreign policy; and popular culture registers how the uses of drone technologies for aesthetic, educational, and governmental purposes raise questions about the exercise of individual, governmental, and social power. By extending computational methodologies in the digital humanities like macroanalysis and distant reading in the context of drones and surveillance, this article demonstrates how drone technologies alter established notions of war and peace, guilt and innocence, privacy and the common good; in doing so, the paper connects postcolonial studies to the digital humanities.",
        "article_title": "Drones and Surveillance Cultures in a Global World",
        "authors": [
            {
                "given": "John",
                "family": "Muthyala",
                "affiliation": [
                    "University of Southern Maine"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-09-27",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.347",
        "identifier": {
            "string_id": "10.16995/dscn.347",
            "id_scheme": "DOI"
        },
        "abstract": "This article studies a part of the works of the Wu Ming literary collection. A true cultural, editorial and generational phenomenon in Italy, it is considered emblematic of the network culture and is considered a pioneer of the collision between old and new medias. Thanks to digital technology, we are indeed participating in the multiplication of textualities. Forums, blog, novel, collective forms of writing all are being born in the world of the web, redefining textuality in both its form and its content. This evolution is considered here through a perspective of a more general change in cultural sociability. After historicising these changes. We will commit ourselves to an analysis of its use of digital tools as a means of political and literary expression with the goal of highlighting its intellectual approach. We will show that Wu Ming’s use of the net, expanded to literary work, contributes to the entrenchment of a new culture based on another dialectic between producers and consumers of texts, producing a different view on the works. The web becomes a new channel of exchange, of genre contamination, of meaning transmission, and becomes a free space that establishes a new narrative economy and a redefinition of the scholarly domain.",
        "article_title": "Création littéraire et Web: un cas italien",
        "authors": [
            {
                "given": "Irene",
                "family": "Cacopardi",
                "affiliation": [
                    "Université Paul Valéry 3, Montpellier"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-09-24",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.348",
        "identifier": {
            "string_id": "10.16995/dscn.348",
            "id_scheme": "DOI"
        },
        "abstract": "Critical editing is a practice whose contours have been well established by the philological tradition. The different critical conventions are well known and have been subject to a myriad of scientific studies. Nevertheless, critical edition has been undergoing changes since the development of new technologies. Digital critical editions have multiplied and today represent a large and varied panel. As a consequence, it’s worth observing, beyond technological innovations, what digital editing brings in terms of methodology and publishing conceptualisation. Obviously, in digital editions as in traditional editions, the final goal is offering readers a text that they will be able to consult and use in their research: the edited text should be a stable one, that can be an authoritative resource. The uniqueness of digital edition’s design, however, requires editors to reflect, right from the start of the publication process, on the information that they are going to provide, as well as on the way in which they will be presenting it. From the very beginning of its development, digital editing entails, then, a true awareness of how it will be received. It permits, also, a significant diversification of information presented in editions. It ultimately distinguishes itself with its open nature: digital editing is open in terms of content evolution over time just as it is in terms of collaborative editing.",
        "article_title": "Le positionnement éditorial dans l’édition critique numérique",
        "authors": [
            {
                "given": "Joana",
                "family": "Casenave",
                "affiliation": [
                    "Université de Lille"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-09-18",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.351",
        "identifier": {
            "string_id": "10.16995/dscn.351",
            "id_scheme": "DOI"
        },
        "abstract": "In 1970, Gabrielle Roy published Windflower (La Rivière sans repos), a short novel preceded by three short stories “Nouvelles Esquimaudes.” Conserved in the Gabrielle Roy collection of Library and Archives Canada, the archives contain a myriad of manuscripts, dactylograms and sets of proofs, genuine evidence of word done by this author. In this article, the researchers put forward a meticulous genetic study of the three “Nouvelles Esquimaudes,” which takes the “Voyage en Ungava,” a travel journal written by Gabrielle Roy in 1961 in Fort Chimo, as its starting point. The authors highlight the novelist’s work methods, notably her horizontal and vertical rewriting. The digital publishing of the Windflower archives allows in itself the usage of an enlarged critical apparatus, but it also contains several specific concerns, thus raising several challenges.",
        "article_title": "Les archives sans repos: enjeux d’une édition électronique",
        "authors": [
            {
                "given": "Nathanaël",
                "family": "Pono",
                "affiliation": [
                    "Université du Québec à Montréal"
                ]
            },
            {
                "given": "Jacinthe",
                "family": "Martel",
                "affiliation": [
                    "Université du Québec à Montréal"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-08-12",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.349",
        "identifier": {
            "string_id": "10.16995/dscn.349",
            "id_scheme": "DOI"
        },
        "abstract": "For historians dealing with text, the changeover from paper to digital sources represents a major change. By expanding text archives – turned into hypertexts, un-linear and denaturalised –, the digital increases the navigation capabilities within corpora, reveals new linguistics aspects that can be observed, and transforms our reading practices. Logometry, the method using computer-assisted reading, has been contributing to these evolutions over the last four decades by proposing tools that combine qualitative reading and quantitative approaches to digital corpora, with the goal of formalising the hermeneutic interpretive process. This article will present its principle functions through its application to a corpus of electoral manifestos written under the Fifth Republic (1958–2007).",
        "article_title": "La logométrie en histoire: une herméneutique numérique. Exploration d’un corpus de professions de foi électorales de député-e-s (1958–2007)",
        "authors": [
            {
                "given": "Magali",
                "family": "Guaresi",
                "affiliation": [
                    "Université Libre de Bruxelles, BE", "Université Côte d’Azur"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-08-12",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.346",
        "identifier": {
            "string_id": "10.16995/dscn.346",
            "id_scheme": "DOI"
        },
        "abstract": "This article presents how certain practices in contemporary art enrich the analysis and critical reflections on digital culture, taking art history and museology as two important issues. The former touches on culture’s relational and participatory value in networks; the latter is related to the effects of this value in the visualisation and canonization of works of art. What is the nature of my appropriation of art when I’m invited to choose works, on a museum’s website, to create “my collection,” “my art gallery,” “my personal museum?” Does this type of invitation favour the democratisation of art knowledge? Or, on the contrary, do these initiatives replicate institutional principles that maintain the prescribing museum’s authority? Does participatory cybermuseology present new issues that result in communal action? Or, alternatively, does it consistently reproduce the traditional canonization process of works of art without permitting a critical reinterpretation? To answer these questions, the theoretical analysis presents proposes layouts, online, of works that originate both from the public domain and from collections from large museums, ranging from the artistic practices of Julia Weist to the Google Art Project.",
        "article_title": "Muséologie numérique: Action participative en réseau et canonisation selon l’intelligence artificielle",
        "authors": [
            {
                "given": "Christine",
                "family": "Bernier",
                "affiliation": [
                    "Université de Montréal"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-08-09",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.354",
        "identifier": {
            "string_id": "10.16995/dscn.354",
            "id_scheme": "DOI"
        },
        "abstract": "Digital technologies have profoundly changed our research practices, our editing and publication practices, and how we exchange information. The means have certainly changed, but these striking changes have also influenced the methods and meaning of writing, the concepts of writer and reader, and the methods of access, the tools and methods of distributing texts, images, sounds, etc. Literature has played a major role in the development of cultural domains; it still holds a prominent place, perhaps even more so today, as our current context is greatly associated to the predominance of the textual form. The explosion of data and the transformation of knowledge, both in terms of the quality of available information and the manner of representing it, have furthermore had a considerable impact on human and social sciences research.",
        "article_title": "Introduction: « Humanités numériques: identités, pratiques et théories »",
        "authors": [
            {
                "given": "Sophie",
                "family": "Marcotte",
                "affiliation": [
                    "Concordia University"
                ]
            },
            {
                "given": "Michael",
                "family": "Sinatra",
                "affiliation": [
                    "Université de Montréal"
                ]
            },
            {
                "given": "Stéfan",
                "family": "Sinclair",
                "affiliation": [
                    "McGill University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-08-07",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.350",
        "identifier": {
            "string_id": "10.16995/dscn.350",
            "id_scheme": "DOI"
        },
        "abstract": "Bretez is a cooperative science project linking the humanities and the engineering sciences (digital humanities) whose prime purpose is museography. Its objective, the patrimonial valorisation through its three-dimensional digital restoration and spatial sound restoration, sets itself apart with its new approach to the restoration of the past by combining the 3D with a prominent acoustic aspect that makes the past available and tangible for a very wide audience. This presentation of my work (research focus: archeology of soundscapes) draws on the model that acts as a research template and focuses more specifically on the rendition of soundscapes, while proposing the following question: how can we interpret the past in order to delight our senses without misrepresenting History?",
        "article_title": "Projet Bretez: une pincée de son dans l’Histoire",
        "authors": [
            {
                "given": "Mylène",
                "family": "Pardoen",
                "affiliation": [
                    "MSH LSE/USR2005 (CNRS France)"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-08-05",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.307",
        "identifier": {
            "string_id": "10.16995/dscn.307",
            "id_scheme": "DOI"
        },
        "abstract": "This paper presents the first phase in the development of a new, TEI-based protocol for the encoding of promptbooks. Because the principal function of a promptbook is to record spatiotemporal events whose communicative importance supersedes that of the book in which they are recorded, current standards for digital encoding do not always apply. With the stage managerial artifacts of The. John Gray and the Canadian Stratford Festival Archives as case studies, we provide a rationale for exploring additions to the existing TEI guidelines to account for the unique characteristics of promptbooks.",
        "article_title": "Tagging Time and Space: TEI and the Canadian Stratford Festival Promptbooks",
        "authors": [
            {
                "given": "Jennifer",
                "family": "Roberts-Smith",
                "affiliation": [
                    "University of Waterloo"
                ]
            },
            {
                "given": "Mark",
                "family": "Kaethler",
                "affiliation": [
                    "Medicine Hat College"
                ]
            },
            {
                "given": "Toby",
                "family": "Malone",
                "affiliation": [
                    "SUNY Oswego"
                ]
            },
            {
                "given": "Liza",
                "family": "Giffen",
                "affiliation": [
                    "Stratford Festival Archives"
                ]
            },
            {
                "given": "Martin",
                "family": "Holmes",
                "affiliation": [
                    "University of Victoria"
                ]
            },
            {
                "given": "Janelle",
                "family": "Jenstad",
                "affiliation": [
                    "University of Victoria"
                ]
            },
            {
                "given": "Joseph",
                "family": "Takeda",
                "affiliation": [
                    "University of Victoria"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-05-31",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.292",
        "identifier": {
            "string_id": "10.16995/dscn.292",
            "id_scheme": "DOI"
        },
        "abstract": "This study examines how social media networks are changing the ways party politics and election campaigns are conducted in Nigeria, especially how these technologies are encouraging new ways of wooing voters and engaging ordinary citizens. Specifically, this study focuses on the growing awareness of the use of Twitter for election campaigns and civic engagement between 2012 and 2015. The theoretical framework used in the study adopts approaches from Computer-Mediated Communication (CMC) and Computer-Mediated Discourse Analysis (CMDA- e.g. Herring 2001, 2004). The data set consists of selected microblogging posts extracted from the Twitter handles of two major political parties and their political candidates. Additional Twitter posts on the election-related issues trending during the period provided supplemental data. The data collection procedures comprised media monitoring and use of computer software packages (e.g. SketchEngine, Topsy, AntConc) for online data harvesting over a period of fourteen months. This method was supplemented with manual downloading using google search. The analytical procedure follows the content analysis of significant textual features and discourse patterns in the online political conversation that sheds light on the persuasive use of technologies as discourse strategy. The study thus highlights the sociality of politics and socio-communicative features of Twitter as a campaign tool to mobilise support and woo voters in an emerging democracy.",
        "article_title": "The Twittersphere as Political Engagement Space: A Study of Social Media Usage in Election Campaigns in Nigeria",
        "authors": [
            {
                "given": "Tunde",
                "family": "Opeibi",
                "affiliation": [
                    "University of Lagos"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-04-17",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.301",
        "identifier": {
            "string_id": "10.16995/dscn.301",
            "id_scheme": "DOI"
        },
        "abstract": "The Game of Writing (GWrit) is an online writing environment where students can comment on each other’s writing and where they get rewards for on task activity (gamification). This paper brings together research on GWrit from the following perspectives: gamification, analytic tools, user habits, evaluation and task completion structures. First we introduce the way the system was designed to support experimenting with gamification and show the gamification rule editing environment we are developing. Second, we discuss the ways we are evaluating the interface of GWrit using Cognitive Walkthrough and Heuristic evaluation approaches. Third, we look at user behavior based on Google Analytics and compare this to the behavior expected and desired. Finally, we discuss the role task completion structures play in motivating learning.",
        "article_title": "Introduction to a Class-based Online Writing Environment: Gwrit (Game of Writing)",
        "authors": [
            {
                "given": "Jinman",
                "family": "Zhang",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Geoffrey",
                "family": "Rockwell",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Roger",
                "family": "Graves",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Heather",
                "family": "Graves",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Mark",
                "family": "McKellar",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Kamal",
                "family": "Ranaweera",
                "affiliation": [
                    "University of Alberta"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-04-16",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.302",
        "identifier": {
            "string_id": "10.16995/dscn.302",
            "id_scheme": "DOI"
        },
        "abstract": "This article examines key ethical issues that are continuing to emerge from the task of archiving data scraped from online sources such as social media sites, blogs, and forums, particularly pertaining to online harassment and hostile groups. Given the proliferation of digital social data, an understanding of ethics and data stewardship that evolves alongside the shifting landscape of digital societies is indeed essential.",
        "article_title": "Applying an Ethics of Care to Internet Research: Gamergate and Digital Humanities",
        "authors": [
            {
                "ORCID": "http://orcid.org/0000-0002-4549-0782",
                "authenticated-orcid": false,
                "given": "Todd",
                "family": "Suomela",
                "affiliation": [
                    "Bucknell University Lewisburg, PA"
                ]
            },
            {
                "ORCID": "http://orcid.org/0000-0002-7668-7529",
                "authenticated-orcid": false,
                "given": "Florence",
                "family": "Chee",
                "affiliation": [
                    "Loyola University Chicago"
                ]
            },
            {
                "given": "Bettina",
                "family": "Berendt",
                "affiliation": [
                    "KU Leuven"
                ]
            },
            {
                "ORCID": "http://orcid.org/0000-0001-7430-4742",
                "authenticated-orcid": false,
                "given": "Geoffrey",
                "family": "Rockwell",
                "affiliation": [
                    "University of Alberta Edmonton, AB"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-02-13",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.309",
        "identifier": {
            "string_id": "10.16995/dscn.309",
            "id_scheme": "DOI"
        },
        "abstract": "This article utilizes a combination of digital and traditional literary-critical analysis in order to explore ominous dreams in the Elizabethan dramatist Thomas Kyd’s undoubted plays The Spanish Tragedy (1587), Soliman and Perseda (1588), and Cornelia (1594). The article proceeds to explore the use of dreams in the anonymously printed early modern plays King Leir (1589) and Arden of Faversham (1590) in order to demonstrate that these works are in good accordance with Kyd’s highly individual thought processes and overall dramaturgy. Close reading of these texts is accompanied by an examination of the characteristics of Kyd’s verse style, as well as collocation matching, which provides quantitative and qualitative evidence for Kyd’s idiosyncratic lexicon of words and phrases. This study extends and corrects the work of generations of attribution scholars and suggests that King Leir and Arden of Faversham can be ascribed to Kyd with a high degree of probability.",
        "article_title": "“Fearful Dreams” in Thomas Kyd’s Restored Canon",
        "authors": [
            {
                "given": "Darren",
                "family": "Freebury-Jones",
                "affiliation": [
                    "Cardiff University to Shakespeare Birthplace Trust, in Stratford-upon-Avon"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-02-07",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.299",
        "identifier": {
            "string_id": "10.16995/dscn.299",
            "id_scheme": "DOI"
        },
        "abstract": "From a digital historian’s point of view, Ancien Régime French texts suffer from obsolete grammar, unreliable spelling, and poor optical character recognition, which makes these texts ill-suited to digital analysis. This paper summarizes methodological experiments that have allowed the author to extract useful quantitative data from such unlikely source material. A discussion of the general characteristics of hand-keyed and OCR’ed historical corpora shows that they differ in scale of difficulty rather than in nature. Behavioural traits that make text mining certain eighteenth century corpora particularly challenging, such as error clustering, a relatively high cost of acquisition relative to salience, outlier hiding, and unpredictable patterns of error repetition, are then explained. The paper then outlines a method that circumvents these challenges. This method relies on heuristic formulation of research questions during an initial phase of open-ended data exploration; selective correction of spelling and OCR errors, through application of Levenshtein’s algorithm, that focuses on a small set of keywords derived from the heuristic project design; and careful exploitation of the keywords and the corrected corpus, either as raw data for algorithms, as entry points from which to construct valuable data manually, or as focal points directing the scholar’s attention to a small subset of texts to read. Each step of the method is illustrated by examples drawn from the author’s research on the hand-keyed Encyclopédie and Bibliothèque Bleue and on collections of periodicals obtained through optical character recognition.",
        "article_title": "How to Extract Good Knowledge from Bad Data: An Experiment with Eighteenth Century French Texts",
        "authors": [
            {
                "ORCID": "http://orcid.org/0000-0001-5542-3754",
                "authenticated-orcid": false,
                "given": "François Dominic",
                "family": "Laramée",
                "affiliation": [
                    "Université de Montréal"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-01-30",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.282",
        "identifier": {
            "string_id": "10.16995/dscn.282",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Prototyping Across the Disciplines",
        "authors": [
            {
                "given": "Randa",
                "family": "El Khatib",
                "affiliation": [
                    "University of Victoria"
                ]
            },
            {
                "given": "David Joseph",
                "family": "Wrisley",
                "affiliation": [
                    "New York University Abu Dhabi"
                ]
            },
            {
                "given": "Shady",
                "family": "Elbassuoni",
                "affiliation": [
                    "American University of Beirut"
                ]
            },
            {
                "given": "Mohamad",
                "family": "Jaber",
                "affiliation": [
                    "American University of Beirut"
                ]
            },
            {
                "given": "Julia",
                "family": "El Zini",
                "affiliation": [
                    "American University of Beirut"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2019-01-03",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.278",
        "identifier": {
            "string_id": "10.16995/dscn.278",
            "id_scheme": "DOI"
        },
        "abstract": "Military history has provided significant insight into the factors determining the outcome of armed conflict through time. At the same time, it often fails to adequately assess variables unrelated to historical accounts per se that may contribute to military outcomes. For example, in 1066, English and Norman forces engaged in a decisive battle near Hastings, U.K. Numerous historical accounts have chronicled this event, using a combination of eyewitness and participant testimony, as well as written records, and art forms. Few, however, have paid significant attention to the role of the local landscape in shaping events. In the case of Hastings, the battlefield itself provides an example of the way in which geography can contribute to our understanding of historical events. By applying environmental sources and a regressive cartographic analysis, this study demonstrates that there is, in fact, considerable evidence to suggest how the landscape appeared back to the time of the battle. This finding is significant, insofar as it opens the door to new research on the Battle of Hastings which may shed additional light on the events that occurred there and the factors that influenced the outcome of this crucial conflict in British history. It also reveals the importance of applying new methodological approaches to traditional disciplines such as history, to deepen and expand existing analysis.",
        "article_title": "How did East Sussex Really Appear in 1066? The Cartographic Evidence",
        "authors": [
            {
                "given": "Christopher Macdonald",
                "family": "Hewitt",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2018-10-03",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.283",
        "identifier": {
            "string_id": "10.16995/dscn.283",
            "id_scheme": "DOI"
        },
        "abstract": "The goal of our research is to improve the process of disseminating knowledge about built heritage. To this end, we propose to implement upgradeable digital models that include the time dimension. These models are designed to illustrate the evolution of heritage buildings and sites over time and record the historian’s interpretation of documentary sources. The research objective is to develop a 4D modelling protocol to optimize data organization so information is easier to access and modify. This paper explains why BIM platforms do not seem appropriate tools for the work we are doing. We describe our method based on the synergy between a SQLite database and a 3D software (Autodesk Maya) linked by an algorithm written in Python. We conducted a case study involving a heritage place in Montreal, Canada. This site provided an opportunity to test the protocol developed because it is composed of several buildings that have evolved asynchronously.",
        "article_title": "4D Modelling of Built Heritage: A System Offering an Alternative to Using BIM",
        "authors": [
            {
                "given": "Nathalie",
                "family": "Charbonneau",
                "affiliation": [
                    "Université du Québec à Montréal"
                ]
            },
            {
                "given": "Nicolas",
                "family": "Spiric",
                "affiliation": [
                    "Université du Québec à Montréal"
                ]
            },
            {
                "given": "Vanessa",
                "family": "Blais",
                "affiliation": [
                    "Collège Édouard-Montpetit"
                ]
            },
            {
                "given": "Léon",
                "family": "Robichaud",
                "affiliation": [
                    "Université de Sherbrooke"
                ]
            },
            {
                "given": "Joanne",
                "family": "Burgess",
                "affiliation": [
                    "Université du Québec à Montréal"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2018-09-26",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.291",
        "identifier": {
            "string_id": "10.16995/dscn.291",
            "id_scheme": "DOI"
        },
        "abstract": "Multivariate analysis (MVA) can be applied to the New Testament textual tradition in order to investigate grouping among its witnesses. This article applies certain MVA methods to a number of example data sets. Each method operates on a matrix that tabulates distances between pairs of items in a data set. The simple matching distance, which is the proportion of disagreements, can be used as a metric for calculating distances between New Testament witnesses. Analysis methods called classical multidimensional scaling (CMDS) and divisive clustering (DC) are useful for revealing group structure when it is well defined. However, they are less useful when grouping is not very distinct. A method called partitioning around medoids (PAM) provides another way to divide a data set into groups. Local maxima in a plot of a statistic called the mean silhouette width (MSW) indicate preferred numbers of groups. Statistical analysis of a data set allows upper and lower critical limits to be defined for the distance between a pair of witnesses. Distances between these limits are not significant in the sense that the same range of distances is expected to occur for generated pairs whose states are randomly chosen from the available pool. Distances that are either less than or greater than these critical limits are not likely to happen by chance. A distance less than the lower critical limit indicates an adjacent relationship while one greater than the upper limit implies an opposite relationship. Applying CMDS, DC, and PAM analysis to data for the Gospel of Mark reveals interesting features of the textual landscape. Witnesses tend to form groups that have points of contact with conventional categories such as the “Alexandrian,” “Byzantine,” “Western,” and “Eastern” types identified by prior generations of researchers. Multivariate analysis can also be used for novel purposes such as identifying group representatives, group cores, and readings useful for classification purposes.",
        "article_title": "How to Discover Textual Groups",
        "authors": [
            {
                "given": "Timothy",
                "family": "Finney",
                "affiliation": [
                    "Vose Theological Seminary"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2018-05-10",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.288",
        "identifier": {
            "string_id": "10.16995/dscn.288",
            "id_scheme": "DOI"
        },
        "abstract": "This paper examines the stylometric similarities between James Joyce and Flann O’Brien, demonstrating which works from the latter’s oeuvre are stylistically the most Joycean. We will outline the results of a series of quantitative enquiries focused specifically on Joyce and O’Brien, before offering a number of literary interpretations. It has long been argued that Brian O’Nolan, operating under the pseudonym of Flann O’Brien, is a disciple of James Joyce. This relationship remains a concern for scholars, and so our purpose here is to contribute some computational evidence to the discussion. We pinpoint those exact moments where O’Brien’s style is quantitatively similar to that of Joyce, using our results to re-engage existing arguments with renewed statistical precision.",
        "article_title": "Measuring Joycean Influences on Flann O’Brien",
        "authors": [
            {
                "given": "James",
                "family": "O’Sullivan",
                "affiliation": [
                    "University College Cork"
                ]
            },
            {
                "given": "Katarzyna",
                "family": "Bazarnik",
                "affiliation": [
                    "Jagiellonian University"
                ]
            },
            {
                "given": "Maciej",
                "family": "Eder",
                "affiliation": [
                    "Pedagogical University of Kraków"
                ]
            },
            {
                "given": "Jan",
                "family": "Rybicki",
                "affiliation": [
                    "Jagiellonian University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2018-03-27",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.285",
        "identifier": {
            "string_id": "10.16995/dscn.285",
            "id_scheme": "DOI"
        },
        "abstract": "This paper returns to the relationship of “narrative versus database” (an argument originally made by Lev Manovich in 2001) as one that can be further addressed. A specific issue persists in text analysis research in the digital humanities: the difficulty of representing the figurative meaning of narratives through digital tools. Towards an accommodation, this paper adopts a narratological framework in order to propose alternative models of content management and organization that more closely resemble figurative meaning making in human language. These alternative models therefore better allow for the computational representation of figurative elements that N. Katherine Hayles describes as “the inexplicable, the unspeakable, the ineffable” of narrative literature. This paper argues that the construction of figurative meaning through paradigmatic substitution (as part of an imaginary vocabulary that is drawn from in the process of meaning making) is difficult to account for in the relational database—arguably still the most culturally prominent database model. By focusing on NoSQL (“no” or “not only” Structured Query Language) databases, this paper explores how layers of figurative meaning can be represented together through these flexible and non-relational models. In particular, the ability of non-relational databases to group together multiple values—encouraging their association, comparison, and juxtaposition—can be analyzed as a computational albeit imprecise counterpart to the formation of paradigmatic and figurative meaning. Thus, towards accounting for a word, image, or idea’s layers of meaning as expressed in literature, this paper offers a study of the limitations of digital tools and their critical negotiation with humanities research and reflection.",
        "article_title": "On the Value of Narratives in a Reflexive Digital Humanities",
        "authors": [
            {
                "ORCID": "http://orcid.org/0000-0001-7271-2160",
                "authenticated-orcid": false,
                "given": "Lai-Tze",
                "family": "Fan",
                "affiliation": [
                    "Lingnan University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2018-03-27",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.286",
        "identifier": {
            "string_id": "10.16995/dscn.286",
            "id_scheme": "DOI"
        },
        "abstract": "The Digital Humanities Summer Institute gives students and scholars a chance to broaden their knowledge of the Digital Humanities within a feasible timeframe. The DHSI Colloquium was first founded by Diane Jakacki and Cara Leitch to act as a means of supporting graduates who wanted to be a part of such a gathering. The Colloquium has grown in recent years, to the point where it is now seen as an important part of the field’s conference calendar for emerging and established scholars alike, but it remains a non-threatening space in which students, scholars, and practitioners can share their ideas. This issue is testament to that diversity, as well as the strength of the research being presented at the Colloquium. It includes Scott B. Weingart and Nickoal Eichmann-Kalwara, Mary Borgo, William B. Kurtz, and John Barber. “What’s Under the Big Tent?: A Study of ADHO Conference Abstracts,” which portrays the discipline as one which is dominated by specific groups and practices. Using the Victorian Women Writers Project as a case-study, Mary Borgo treats models for the sustainable growth of TEI-based digital resources. William B. Kurtz details his experiences working on a digital initiative, in this instance, Founders Online: Early Access, and engages with the need for such projects to hold broader public appeal. John Barber’s “Radio Nouspace: Sound, Radio, Digital Humanities,” describes the curation of sound within the context of radio, and how such activity connects to creative digital scholarship. Together, these articles represent the purpose of facilitating a community comprised of divergent interests and perspectives, a community which can often be positively dissonant.",
        "article_title": "Introduction: Digital Humanities as Dissonant",
        "authors": [
            {
                "given": "James",
                "family": "O’Sullivan",
                "affiliation": [
                    "University College Cork"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2018-01-23",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.293",
        "identifier": {
            "string_id": "10.16995/dscn.293",
            "id_scheme": "DOI"
        },
        "abstract": "Bullipedia, the online gastronomic encyclopedia, is an idea yet to be developed. In this work, we analyze Stack Overflow (SO) and extract some good practices from this popular question-and-answer (Q&amp;A) site to incorporate them into the future Bullipedia. SO is an online forum in which users ask and answer questions related to programming, web development, operating systems, and other technical topics. Expertise is rewarded through a detailed reputation system: questions and answers can receive up and downvotes from other members of the community so that their authors (askers and answerers) gain reputation for posing good questions and providing helpful solutions. Besides this, the asker may mark (accept) one of the answers as the best one at any point. In this paper, we present a study on how this reputation system can be used to predict the likely accepted answer (from a set of candidate answers) for a yet unresolved question. In our approach, we selected a subset of questions with their respective answers, and for each answer we created a question-answer pair (quan). Then we extracted a set of key features from every quan, and applied supervised machine learning techniques to train a classifier that learnt, based on those features, whether or not a quan contained the accepted answer for that question. Finally, we made use of the trained classifier to predict if, given a quan (related to a question with no marked answer), its answer might potentially be the accepted one for the question. Our findings show that the model previously obtained predicted the possible answer correctly for every question with high accuracy (88 percent of the time). A question and its accepted answer constitutes a source of quality knowledge, as it provides the solution to a specific problem. We propose to adopt a similar Q&amp;A forum and reputation system for Bullipedia, and then apply a similar classification model to identify the best answer for unsolved questions.",
        "article_title": "Community Engagement and Quality Knowledge with Stackoverflow’s Reputation System: Applications to Bullipedia",
        "authors": [
            {
                "given": "Antonio",
                "family": "Jimenez-Mavillard",
                "affiliation": [
                    "The University of Western Ontario"
                ]
            },
            {
                "given": "Juan-Luis",
                "family": "Suárez",
                "affiliation": [
                    "The University of Western Ontario"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2018-01-23",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.295",
        "identifier": {
            "string_id": "10.16995/dscn.295",
            "id_scheme": "DOI"
        },
        "abstract": "This essay demonstrates how topic modeling can be fruitfully applied to TEI-encoded plays, which allows scholars to analyze speeches by individual characters. Our analysis centers on Shakespeare’s corpus and characters who reappear in multiple plays. Specifically, we use topic models to show that young Prince Hal (in  and 2 Henry IV) does not speak the same language as his later self, Henry V (in his titular play): his linguistic shift mirrors his shift in status. Hal himself announces, “I have turned away my former self”—his change in diction bears out his assertion. Conversely, topic models reveal that Falstaff is Falstaff across multiple plays and genres (notably,  and 2 Henry IV and The Merry Wives of Windsor), despite scholarly claims to that the Falstaff of comedy is a watered-down version of the braggart drunk of the history plays. Ultimately, we hope that this algorithmically-informed analysis of Shakespeare’s plays is not taken as a final answer, but, instead, as a prompt. As this research reveals, topic modeling plays with attention to each speaker opens the door for new comparisons, and in turn, expands on previous interpretations of literature.",
        "article_title": "Is Falstaff Falstaff? Is Prince Hal Henry V?: Topic Modeling Shakespeare’s Plays",
        "authors": [
            {
                "given": "Laura",
                "family": "Estill",
                "affiliation": [
                    "Texas A&M University (TAMU)"
                ]
            },
            {
                "given": "Luis",
                "family": "Meneses",
                "affiliation": [
                    "University of Victoria"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2018-01-23",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "8",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.284",
        "identifier": {
            "string_id": "10.16995/dscn.284",
            "id_scheme": "DOI"
        },
        "abstract": "This study identifies how the flagship Digital Humanities conference has evolved since 2004 and continues to evolve by analyzing the topical, regional, and authorial trends in its presentations. Additionally, we explore the extent to which Digital Humanists live up to the characterization of being diverse, collaborative, and global using the conference as a proxy. Given the increased popularization of “digital humanities” within the last decade, and especially recent successes in popular press and grant initiatives, this study tempers the sometimes utopic rhetoric that appears alongside mentions of the term.",
        "article_title": "What’s Under the Big Tent?: A Study of ADHO Conference Abstracts",
        "authors": [
            {
                "given": "Scott B.",
                "family": "Weingart",
                "affiliation": [
                    "Carnegie Mellon University"
                ]
            },
            {
                "given": "Nickoal",
                "family": "Eichmann-Kalwara",
                "affiliation": [
                    "University of Colorado, Boulder"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-13",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "7",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.274",
        "identifier": {
            "string_id": "10.16995/dscn.274",
            "id_scheme": "DOI"
        },
        "abstract": "In this article I briefly discuss the connections between the geopolitical scenario emerging from the creation of the BRICS New Development Bank, and the digitization of languages and cultures carried out in a substantially Anglophone-driven economic and technological context. The appearance of the new BRICS bank, and especially the plan for an “independent Internet” are not only challenging the financial system, but in the long-run could also affect the current digital knowledge monopolies, activating new ways to encode and decode cultural objects, and challenge present digital standards. Digital Humanists, on all levels, are called upon to react to this developing geopolitical scenario, asking themselves questions about political representation and cultural diversity, encoding standards, digital infrastructures and linguistic hegemonies. An old equilibrium based on unequal power relationships is perhaps close to an end, and this is a unique time and opportunity to create a genuinely democratic and international scholarly community.",
        "article_title": "Digital Humanities and the Geopolitics of Knowledge",
        "authors": [
            {
                "given": "Domenico",
                "family": "Fiormonte",
                "affiliation": [
                    "Dipartimento di Scienze Politiche, Università Roma Tre"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-13",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "7",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.276",
        "identifier": {
            "string_id": "10.16995/dscn.276",
            "id_scheme": "DOI"
        },
        "abstract": "This case study offers strategies for TEI-based projects with limited funding. By focusing on the needs of our volunteers, the Victorian Women Writers Project has developed truly collaborative relationships with the project’s partners. Contributions to the project’s resources have grown out of digital humanities survey courses, literature classes, and independent work. The paper concludes with a brief sketch of our efforts to support continued work by rethinking our social media outreach and our online presence.",
        "article_title": "Toward Sustainable Growth: Lessons Learned Through the Victorian Women Writers Project",
        "authors": [
            {
                "given": "Mary Elizabeth",
                "family": "Borgo",
                "affiliation": [
                    "Department of English, Indiana University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-13",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "7",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.273",
        "identifier": {
            "string_id": "10.16995/dscn.273",
            "id_scheme": "DOI"
        },
        "abstract": "The study has two main parts: the first one reviews the current scholarship and theories about the materiality of text in print and digital form exemplified in the works of Johanna Drucker, Jerome McGann, Matthew Kirschenbaum, G. Thomas Tanselle and D. F. McKenzie and then presents a hybrid model of materiality that is comprehensive and practical. This model is designed to make the most use of the capacities of the digital medium and it stems from an understanding of the material repercussions of the migration from print to digital. The second part elaborates on the elements of the codex book and overviews the history of the novel genre. This is to prepare a basis for a prototype for digitizing novels, called iNovel. The last part of the study presents a detailed description of the prototype and its different tools. This prototype serves as a realization of the theoretical model described earlier.",
        "article_title": "Enter the Digital: Emergent Materiality and the Digitization of Literary Texts: The Novel as a Case Study",
        "authors": [
            {
                "given": "Mohammad Ibrahim",
                "family": "Aljayyousi",
                "affiliation": [
                    "Philadelphia University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-13",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "7",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.277",
        "identifier": {
            "string_id": "10.16995/dscn.277",
            "id_scheme": "DOI"
        },
        "abstract": "Founders Online, a digital initiative of the National Historical Publications and Records Commission (NHPRC) of the U.S. National Archives, launched in June 2013. Since its debut, the site has attracted over a million visitors interested in learning more about the creation of the United States of America in the words of six of its Founding Fathers. Founders Online contains 177,000 letters or other writings of these men and their contemporaries. Widely used by academics and the general public, the site has demonstrated the value of digital humanities’ emphasis on free access. As a former assistant editor at Documents Compass, a program of the Virginia Foundation of the Humanities, I served as a project manager on the Early Access portion of the project. We worked directly with the staffs of the currently active Founding Fathers documentary editing projects to make preliminary versions of unpublished documents available for early viewing on Founders Online. These Early Access documents will eventually be replaced by fully vetted and annotated versions to be completed later by the documentary editing projects. Relying on a large staff of over thirty people, we transcribed or proofread over 50,000 Early Access documents from 2012 to 2015. My Early Access experience demonstrated the need to give employees constant feedback, to reward them for good work, and to encourage specialization among project staff. My experience also reemphasized the need for unified metadata standards when aggregating different sets of data from multiple projects into a single digital platform.",
        "article_title": "Founders Online: Early Access: Reflections on Open Access, Crowd Sourcing, and Metadata Standards",
        "authors": [
            {
                "given": "William B.",
                "family": "Kurtz",
                "affiliation": [
                    "University of Virginia"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-13",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "7",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.275",
        "identifier": {
            "string_id": "10.16995/dscn.275",
            "id_scheme": "DOI"
        },
        "abstract": "Background: The author describes curating sound(s) in a radio context and how this practice prompts creative Digital Humanities research, scholarship, and presentation. The author describes his Radio Nouspace project as a site, focus, and methodology. A particular endeavor is curation by re-creation of vintage radio dramas before live audiences in order to prompt listeners to consider the ability of sounds to convey appreciation, emotion, experience, information, and meaning(s).",
        "article_title": "Radio Nouspace: Sound, Radio, Digital Humanities",
        "authors": [
            {
                "given": "John F.",
                "family": "Barber",
                "affiliation": [
                    "Washington State University Vancouver"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-13",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "7",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.5",
        "identifier": {
            "string_id": "10.16995/dscn.5",
            "id_scheme": "DOI"
        },
        "abstract": "Though the publication of the Complete works of Dutch novelist Willem Frederik Hermans (1992-1995) is a challenge in itself, nowadays the aim of the mere publishing of 24 printed volumes is far from enough. Operating within an academic field of literary theory and criticism, in which a detailed and conscious use of scholarly edited texts is all but obvious, much more effort should be spent to communicate the merits of textual scholarship. With Hermans, an author known for the ongoing revisions of his texts, academic awareness on the textual process and textual fluidity can be raised, by developing digital editions of some of his works, and by integrating genetic criticism's notion of the creative process. But a range of other dissemination strategies should be developed as well. For a project like the Complete works of Willem Frederik Hermans, that almost exclusively takes place within a national context, with a comparatively small group of interested academics, students and other specialists, well-chosen, tailored initiatives should be deployed to reach new and diverse groups of audiences within the general reading public. Within the contexts of an emerging digital culture and a thoroughly changing literary culture and book market, new challenges are abundant. This article focuses on a range of past and future initiatives, all of which were developed in close cooperation with other partners working within the fields of technology and digital culture, literary education and cultural heritage.",
        "article_title": "Chapter 6 Beyond the Great Divide: New explorations in editing the Complete Works of Dutch Novelist Willem Frederik Hermans",
        "authors": [
            {
                "given": "Peter",
                "family": "Kegel",
                "affiliation": [
                    "The Huygens Institute for the History of the Netherlands of the Royal Netherlands Academy of Arts and Sciences"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.4",
        "identifier": {
            "string_id": "10.16995/dscn.4",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Chapter 5Digital editing as autopoietic process",
        "authors": [
            {
                "given": "Jon",
                "family": "DeTombe",
                "affiliation": [
                    "Queen’s University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.41",
        "identifier": {
            "string_id": "10.16995/dscn.41",
            "id_scheme": "DOI"
        },
        "abstract": "Digital Humanities is getting a lot of attention! But do they exist as a community, unified and consistent? Is this community’s government balanced and democratic? Up to now, no study has explored such a community by investigating its members, looking at them through the prism of multilingualism and geography. The \"Who are you, Digital Humanists?\" survey, conducted after THATCamp Luxembourg (Terras 2012b) and promoted at DH2012 (Hambourg), provided an incomplete, though already significant, sample of 850 people who accepted to answer a questionnaire. The survey found a highly mixed linguistic and geographic profile, the existence of outsiders who either were not aware of the study or did not pay attention to it, the marginalization of English as a first language, and the dominance of English as a second language. It showed that Digital Humanities are strongly influenced by History and Classical Studies, but have little or no bearing on disciplines concerned with today’s world, on the one hand, and with Web sciences, data mining and text mining, on the other hand. A major event on cultural diversity, the Digital Humanities 2012, was governed by Europe and North America, namely the United Kingdom and its former colonies (Ireland, Canada, the United States and Australia). The Anglophone community strikes again, it appears. In order to measure progress in the diversity of the power of our community, this paper proposes the creation of an indicator, the Digital Humanities Decision Power (DHDP), which measures the gap between the various groups of Digital Humanists and their power in the field and the scientific selection procedures. On the basis of this indicator, a collective debate is necessary to make our community more responsive to linguistic and geographic diversity. We call this the Finnish Sauna strategy.",
        "article_title": "La stratégie du sauna finlandais: Les frontières des Digital Humanities",
        "authors": [
            {
                "given": "Marin",
                "family": "Dacos",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.8",
        "identifier": {
            "string_id": "10.16995/dscn.8",
            "id_scheme": "DOI"
        },
        "abstract": "In contemplating the design and implementation of new knowledge environments, what can we learn from book history and from the natural world about how environmental systems form, develop, and thrive? This essay uses the theory of ecodynamics to theorize the development of new knowledge environments for academic study, with illustrative examples from the history of the Christian Bible, and concludes by deriving some principles for those of us working to develop new digital scholarly resources.",
        "article_title": "Chapter 10The textual habitat: The development of new knowledge environments",
        "authors": [
            {
                "given": "Brent",
                "family": "Nelson",
                "affiliation": [
                    "University of Saskatchewan"
                ]
            },
            {
                "given": "INKE",
                "family": "Research Group",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.10",
        "identifier": {
            "string_id": "10.16995/dscn.10",
            "id_scheme": "DOI"
        },
        "abstract": "This chapter extends from research on the genealogies of modernist laboratories (aesthetic, scientific, and corporate) and their relationship to the formation of contemporary digital-humanities and new-media laboratories and collaboratories. The trajectory of this project, broadly conceived, leads from the modular principles of early twentieth-century industrial design and avant-garde aesthetics, to the implementation of modular architecture in the construction of mid-century corporate science labs, to the modularization of markup languages, interoperable digital tools, and collaborative and cross-disciplinary lab environments in the late twentieth and early twenty-first centuries. In doing so, I traverse the conjuncture of multiple modularities and disciplinarities—from architecture, art, and industrial design to markup languages, source code, and digital tools—in the historical contexts of cultural, industrial, and postindustrial modernities.",
        "article_title": "Chapter 3ModLabs",
        "authors": [
            {
                "given": "Dean",
                "family": "Irvine",
                "affiliation": [
                    "Dalhousie University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.9",
        "identifier": {
            "string_id": "10.16995/dscn.9",
            "id_scheme": "DOI"
        },
        "abstract": " The history of the first edition of the Oxford English Dictionary can be used as an example of a successful academic-public collaboration. The difficulties and eventual success of the OED are instructive for current academic crowd-sourced projects that are being undertaken with tools developed for the World Wide Web. The success of such projects depends more on the effective management of the project than on the tools it uses.",
        "article_title": "Chapter 8Appeal to the public: Lessons from the early history of the Oxford English Dictionary",
        "authors": [
            {
                "given": "Yin",
                "family": "Liu",
                "affiliation": [
                    "University of Saskatchewan"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.11",
        "identifier": {
            "string_id": "10.16995/dscn.11",
            "id_scheme": "DOI"
        },
        "abstract": "This essay examines the possibilities for creating digital editions as representations of social and topographical networks of time and space, rather than as standalone e-versions of printed books.",
        "article_title": "Chapter 14Beyond GIS: On mapping early modern narratives and the chronotope",
        "authors": [
            {
                "given": "Allison",
                "family": "Muri",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.12",
        "identifier": {
            "string_id": "10.16995/dscn.12",
            "id_scheme": "DOI"
        },
        "abstract": " In this chapter, we assess how existing digital projects that feature women's manuscripts (c. 1550-1900) can aid research on literature, history, and cultural studies. We argue that the best digital remediations of women's manuscripts contribute, paradoxically, both to their hypermediacy (those elements that remind users they are not faced with a manuscript) and their immediacy (those aspects that hide the remediation and encourage users not to reflect on the medium). We showcase the range of scholarly engagement possible through a variety of sites, including British Literary Manuscripts Online, Perdita Manuscripts, and Jane Austen's Fiction Manuscripts. Analyzing these resources demonstrates how they can best be used by teachers and scholars. By evaluating digital remediations of women's manuscripts, we highlight best practices for manuscript digitization and point to new directions for digital projects and literary study.",
        "article_title": "Chapter 12Evaluating digital remediations of women's manuscripts",
        "authors": [
            {
                "given": "Laura",
                "family": "Estill",
                "affiliation": [
                    "Texas A&M University"
                ]
            },
            {
                "given": "Michelle",
                "family": "Levy",
                "affiliation": [
                    "Simon Fraser University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.19",
        "identifier": {
            "string_id": "10.16995/dscn.19",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "A Window Toward the Medium: A Media Specific Analysis of Chemical Landscapes Digital Tales",
        "authors": [
            {
                "given": "Mehdy",
                "family": "Sedaghat Payam",
                "affiliation": [
                    "Sobhe Sadegh Institute of Higher Education"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.13",
        "identifier": {
            "string_id": "10.16995/dscn.13",
            "id_scheme": "DOI"
        },
        "abstract": "Book history's disciplinary focus on the materiality and circulation of texts and textual objects has much to contribute to the domain of digital humanities. This chapter probes the legacy of D.F. McKenzie's notion of 'broken phials' and 'indeterminate texts' using the example of a flagship digital project The Printers' Web undertaken at Wai-te-ata Press, Victoria University of Wellington, New Zealand. It offers an enhanced metacritical understanding of nineteenth century knowledge networks and points to new directions in textual scholarship in the twenty-first century.",
        "article_title": "Chapter 2At the crossroads: Book history meets digital humanities",
        "authors": [
            {
                "given": "Sydney J.",
                "family": "Shep",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.14",
        "identifier": {
            "string_id": "10.16995/dscn.14",
            "id_scheme": "DOI"
        },
        "abstract": "Since the advent of digital scholarly editions, there have been many arguments to the effect that digital versions are able to offer more to humanities scholars than printed ones. Though this opinion is shared by most scholars producing digital editions, a number have also published printed versions alongside or even after launching digital ones.",
        "article_title": "Scholarly editions in print and on the screen: A theoretical comparison",
        "authors": [
            {
                "given": "Daniel",
                "family": "Sondheim",
                "affiliation": [
                    "University of Victoria"
                ]
            },
            {
                "given": "Geoffrey",
                "family": "Rockwell",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Stan",
                "family": "Ruecker",
                "affiliation": [
                    "IIT Institute of Design"
                ]
            },
            {
                "given": "Mihaela",
                "family": "Ilovan",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Luciano",
                "family": "Frizzera",
                "affiliation": [
                    "Simon Fraser University"
                ]
            },
            {
                "given": "Jennifer",
                "family": "Windsor",
                "affiliation": [
                    "University of Alberta"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.15",
        "identifier": {
            "string_id": "10.16995/dscn.15",
            "id_scheme": "DOI"
        },
        "abstract": "Digital textuality will be defining the nature and uses of literacy to the same degree as printing has done since Gutenberg's invention. The article explores the implications of one of the fundamental differences between the screen and paper substrates: digital fluidity versus the fixity of paper.",
        "article_title": "Chapter 1Feeding our reading machines: From the typographic page to the docuverse",
        "authors": [
            {
                "given": "Adriaan Van der",
                "family": "Weel",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.36",
        "identifier": {
            "string_id": "10.16995/dscn.36",
            "id_scheme": "DOI"
        },
        "abstract": "This chapter examines the ethical concerns surrounding Alternate Reality Games and related experiences that blur distinctions between reality and fiction.",
        "article_title": "Towards an ethics of alternate reality games",
        "authors": [
            {
                "given": "Hugh",
                "family": "Davies",
                "affiliation": [
                    "LaTrobe University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.16",
        "identifier": {
            "string_id": "10.16995/dscn.16",
            "id_scheme": "DOI"
        },
        "abstract": "The genre of the scholarly edition is diverse in its forms, but it generally involves a reproduction of original source material in the context of a scholarly apparatus consisting of annotations which add scholarly value to the text by explaining the editorial decisions made in a particular passage, drawing attention to an interesting place in the text, or linking sections of the facsimile with secondary scholarship. This scholarly apparatus acts as a contextualization of the primary material with which it is concerned. Instead of being embedded within the original material, these additions are placed in margins, footers, and appendices separate from but engaged with the material. In every case of a footnote, marginal note, or other part of a scholarly apparatus, we can say that something provided by the editor is a “body” associated with something else that acts as the “target” of the commentary. This association of “body” and “target” is the essence of Open Annotation, an emerging standard on the World Wide Web for associating Web content in this manner. This sense of annotation—of associating one piece of content with another for some express purpose—is the foundation of the Shared Canvas data model, which we present in this chapter as one approach to representing digital facsimile editions in an open, shareable form.",
        "article_title": "​Chapter 9Beyond accessibility: Using Shared Canvas in digital facsimile editions",
        "authors": [
            {
                "given": "James",
                "family": "Smith",
                "affiliation": null
            },
            {
                "given": "Raffaele",
                "family": "Viglianti",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.268",
        "identifier": {
            "string_id": "10.16995/dscn.268",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Arts et littératures hypermédiatiques : éléments pour une valorisation de la culture de l’écran",
        "authors": [
            {
                "given": "Bertrand",
                "family": "Gervais",
                "affiliation": [
                    "Université du Québec à Montréal"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "1",
        "issue": "2",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.48",
        "identifier": {
            "string_id": "10.16995/dscn.48",
            "id_scheme": "DOI"
        },
        "abstract": "In July 2012 the European Parliament defeated the Anti-Counterfeiting Trade Agreement (ACTA). Supposedly the attempt to impose global norms on intellectual property rights and thereby restrict digital copyright was dead. Or was it? This paper argues that the spirit of ACTA may live on in a host of other trade agreements currently being negotiated. That is, ACTA, or even more restrictive versions of it, could be imposed through the back door at least upon weaker states through bilateral agreements with the United States and the European Union. The result could be a spaghetti bowl of rules on digital copyright with some countries enjoying more digital rights, online freedom, and privacy than others.",
        "article_title": "The Rise, Fall, and Rise of ACTA?",
        "authors": [
            {
                "given": "Peter Jay",
                "family": "Smith",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.42",
        "identifier": {
            "string_id": "10.16995/dscn.42",
            "id_scheme": "DOI"
        },
        "abstract": "This article attempts to analyze the definition of \"electronic literature\" as given by the Electronic Literature Organization and to understand the relationship between electronic literature and digital literature. The thesis defended here is that this change of adjective hides a change in the theoretical status of the object that it attempts to define. The definition of electronic literature once concentrated on the tools used in the production of literary works and the critical analysis concentrating on the objects produced with the aid of new technologies. The move to the adjective \"digital\" marks a change in perception: now, from this perspective, the challenge is no longer to study works produced thanks to computers, but to understand the new status of literature in the age of the digital. To demonstrate this thesis, the article proposes to analyze one recent literary example: the 1984 trilogy by Eric Plamondon.",
        "article_title": "La littérature numérique, existe-t-elle?",
        "authors": [
            {
                "given": "Marcello",
                "family": "Vitali-Rosati",
                "affiliation": [
                    "Université de Montréal"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.38",
        "identifier": {
            "string_id": "10.16995/dscn.38",
            "id_scheme": "DOI"
        },
        "abstract": "Contemporary language documentation workflow is a largely digital process. While this has had many benefits for how linguists undertake language documentation projects, it has also lead to a disparity between how the process is conceptualised by academic researchers, and how it is conceptualised by the speakers of endangered languages. In this paper I discuss the nature of this disparity, and illustrate this with my own experience of working with speakers of Tibeto-Burman languages in Nepal. In my own research I have incorporated ongoing discussion regarding digital methods into my working relationships with participants, but other researchers have made digital training a specific feature of their research methodology. I discuss two projects that provide positive models for this kind of digital gap bridging. The first is the Iltyem-iltyem sign website and the second is the Aikuma language documentation phone application. After discussion of these positive developments in digital outreach I discuss some of the challenges that we still face in ensuring that what we do is engaging and relevant for the communities we work with. This discussion is not only relevant for language documentation researchers, but for all who work in the digital humanities, as we need to be more aware of the different needs and levels of digital education of different communities.",
        "article_title": "Language documentation and division: Bridging the digital divide",
        "authors": [
            {
                "given": "Lauren",
                "family": "Gawne",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.37",
        "identifier": {
            "string_id": "10.16995/dscn.37",
            "id_scheme": "DOI"
        },
        "abstract": "The paper explores digital scholarship at Siberian Federal University and considers the incentives for Siberian scholars to use digital data in their research, build their own databases and digital editions, and develop research questions based on new methods and tools. Although the first stage of digital scholarship (providing digital content) seems to be a well mastered skill for Siberian researchers, the second stage of working with digital data and new research questions in the humanities does not seem to be within their comfort zone. We conclude that random digital humanities initiatives do not guarantee either demand for digital humanities or knowledge and understanding of new research questions inspired by new methodologies. Further studies might be needed to understand if we require lobbying for digital humanities and, if so, what kind of promotion, dissemination and training are needed or would be most effective.",
        "article_title": "Digital Humanities at Siberian Federal University",
        "authors": [
            {
                "given": "Inna",
                "family": "Kizhner",
                "affiliation": [
                    "Siberian Federal University"
                ]
            },
            {
                "given": "Igor",
                "family": "Kim",
                "affiliation": [
                    "Siberian Federal University"
                ]
            },
            {
                "given": "Maxim",
                "family": "Rumyantsev",
                "affiliation": [
                    "Siberian Federal University"
                ]
            },
            {
                "given": "Marina",
                "family": "Lapteva",
                "affiliation": [
                    "Siberian Federal University"
                ]
            },
            {
                "given": "Ruslan",
                "family": "Baryshev",
                "affiliation": [
                    "Siberian Federal University"
                ]
            },
            {
                "given": "Nikita",
                "family": "Pikov",
                "affiliation": [
                    "Siberian Federal University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.43",
        "identifier": {
            "string_id": "10.16995/dscn.43",
            "id_scheme": "DOI"
        },
        "abstract": "This paper aims to take into account the process of annotation as it can be inserted in a literary text driven by digital culture. Focusing on a corpus of digital literary texts, it will study how writers use hyperlinking as a way to build a network of allusions or commentaries inside the boundaries of their own text, or as support of reading of an another text. Three ranges of use are to be exposed. The first acts as a mediated reading of one's own work. Guillaume Vissac's Accident de personne, published as a twitter feed in 2010, has been edited as a (digital) whole by digital editor publie.net. The author used hyperlinks to reinforce patterns of similarity between characters and specific circumstances. The second use of semantic links inserts essayistic discourse and urban fabulation, as it can be found in François Bon's Tiers livre, in the web of its tentacular work and in a discursive ground of the social and literary environment of the writer. The third range of use covers writing-as-reading works, where links enact a set of commentaries or a way of rewriting a prior text. Philippe De Jonckheere's site, Désordre.net, and more specifically his project \"Tentative d'épuisement de Tentative d'épuisement d'un lieu parisien de Georges Perec,\" build on this idea. This project takes Perec's own reading of an urban place which tries to exhaust the real world by description, and adds a layer of hyperlinks giving back a reading of the reality depicted by Perec. These three uses show how literary writing in a digital context inherit from the tradition of marginal annotation and inscribe it in the most basic function of electronic publication, which is linking. In that perspective, links appear as a way to build a multidimensional textuality based on the depth of a virtual network.",
        "article_title": "Inner Margins of the Literary Digital Text: From Allusion to Rewriting",
        "authors": [
            {
                "given": "René",
                "family": "Audet",
                "affiliation": [
                    "Université Laval"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.34",
        "identifier": {
            "string_id": "10.16995/dscn.34",
            "id_scheme": "DOI"
        },
        "abstract": " Aequilibrium is a transmedia and location-based experience which engages players in an adventure that blurs the boundaries between digital and physical spaces, imaginary and real people from the local community. The project is the first Italian Alternate Reality Game (ARG) dedicated to Leonardo Da Vinci and is aimed at promoting the territory of Lomellina adopting innovative communication strategies to engage players in a game which is designed to amuse and encourage tourism. The transmedia and the locative experience were designed by a team of researchers from the Politecnico di Torino and Guglielmo Marconi University. Starting from the analysis of the Aequilibrium project, this essay focuses on how alternate reality games can promote participation in cultural experiences which offer cultural activators fostering collaboration and creative grassroots production within communities of players.",
        "article_title": "Alternate Reality Game and Culural Heritage:  The “Aequilibrium” Project",
        "authors": [
            {
                "given": "Domenico",
                "family": "Morreale",
                "affiliation": [
                    "Department of sociological and psycho-pedagogical studies, Guglielmo Marconi University, Rome"
                ]
            },
            {
                "given": "Giulia",
                "family": "Bertone",
                "affiliation": [
                    "DIST - Interuniversity Department of Regional and Urban Studies And Planning, Politecnico Di Torino"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.44",
        "identifier": {
            "string_id": "10.16995/dscn.44",
            "id_scheme": "DOI"
        },
        "abstract": "Stylometry has got a lot of interest during these recent years because it solved many authorship problems and disputes that were difficult to handle. Author discrimination consists in checking whether two texts are written by the same author or not. In this investigation, we try to make an author discrimination between the Quran (The holy words and statements of God in the Islamic religion) and the Hadith (statements said by the prophet Muhammad) in a segmental form. In fact, 14 text segments are extracted from the Quran book and 11 text segments are extracted from the Bukhari Hadith. These segments have more or less the same size in terms of words and the medium size is about 2080 words per text segment. The Quran is taken in its entirety, whereas for the Prophet’s statements, we chose only the certified texts of the Bukhari book. That is, four series of experiments are done and commented. The first series of experiments concerns several experiments of authorship attribution using different state of the art features and classifiers, the second series of experiments analyses the different texts by using a new parameter called COST, the third series of experiments consists in an authorship discrimination using the frequency of a particular word (“الذين ” meaning those/who in English) and the fourth series of experiments performs a hierarchical clustering on the 25 text segments, in order to assess the real number of clusters (author styles) and to see if the hypothesis of a unique author is possible. This investigation, which represents the continuation of a previous research work on the same topic [Sayoud 2012-a], has further clarified an old enigma, which was impossible to solve for fourteen centuries: all the results of this investigation show unanimously that the two books should have two different authors.",
        "article_title": "Segmental Analysis-Based Authorship Discrimination between the Holy Quran and Prophet’s Statements",
        "authors": [
            {
                "given": "Halim",
                "family": "Sayoud",
                "affiliation": [
                    "USTHB University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.35",
        "identifier": {
            "string_id": "10.16995/dscn.35",
            "id_scheme": "DOI"
        },
        "abstract": "That the 2012 Congress of the Canadian Federation for the Humanities and Social Sciences censored the Bonfire of the Humanities, a student-produced alternate reality game, apparently in order to preserve the reputations of its invited speakers and host universities is an alarming incident worthy of further inquiry and censure by Canada's scholarly and artistic communities. Curiously, the justification provided for censoring the game echoes the ethical arguments advanced by scholars and designers of pervasive games who warn that non-player bystanders are at risk of confusing games with reality. This essay considers the case in relation to Jacques Rancière's ethics of recognition. I argue that pervasive gamers should stop disguising their activities to protect bystanders, and begin instead to recognize non-players as equally capable of negotiating the blurred boundaries of game and world. The emancipation of game spectatorship creates genuinely political encounters, and opens up new channels for scholarly experimentation and dissemination.",
        "article_title": "Don't make a scene: Game studies for an uncertain world",
        "authors": [
            {
                "given": "Brian",
                "family": "Greenspan",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.40",
        "identifier": {
            "string_id": "10.16995/dscn.40",
            "id_scheme": "DOI"
        },
        "abstract": "Starting with objectively laconic questions I would like to focus for a moment on the Humanities and encourage to some reflection. For some time researchers have been increasingly interested in entrepreneurship and the commercialisation of research. This phenomenon is discussed in the popular media, but also, perhaps especially, in the universities. The result is various training courses, workshops and conferences aimed at improving university-business collaboration. These have also produced reports and strategies outlining development opportunities. Young researchers (but not only) are encouraged to conduct innovative and modern research that will answer real market needs. And all this work is said to be very important for the development of the country–especially its competitiveness. While it is impossible to disagree with the desire for national improvement, this emphasis on commercialisation does immediately raise a question about where the Humanities fit in. How can they participate into this approach? In which direction should they develop? Can the development of Digital Humanities and media literacy make a difference in a field that is otherwise in danger of being seen as irrelevant to contemporary trends?",
        "article_title": "A co z humanistami? – Cyfrowa humanistyka jako odpowiedź na obecny stan postrzegania humanistyki w polskojęzycznym internecie",
        "authors": [
            {
                "given": "Anna",
                "family": "Sobczak",
                "affiliation": [
                    "Uniwersytet Szczeciński"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.39",
        "identifier": {
            "string_id": "10.16995/dscn.39",
            "id_scheme": "DOI"
        },
        "abstract": "Starting with objectively laconic questions I would like to focus for a moment on the Humanities and encourage to some reflection. For some time researchers have been increasingly interested in entrepreneurship and the commercialisation of research. This phenomenon is discussed in the popular media, but also, perhaps especially, in the universities. The result is various training courses, workshops and conferences aimed at improving university-business collaboration. These have also produced reports and strategies outlining development opportunities. Young researchers (but not only) are encouraged to conduct innovative and modern research that will answer real market needs. And all this work is said to be very important for the development of the country–especially its competitiveness. While it is impossible to disagree with the desire for national improvement, this emphasis on commercialisation does immediately raise a question about where the Humanities fit in. How can they participate into this approach? In which direction should they develop? Can the development of Digital Humanities and media literacy make a difference in a field that is otherwise in danger of being seen as irrelevant to contemporary trends?",
        "article_title": "What about the Humanists? Digital Humanities as an answer to contemporary perceptions of the Humanities on the Polish language Internet",
        "authors": [
            {
                "given": "Anna",
                "family": "Sobczak",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.22",
        "identifier": {
            "string_id": "10.16995/dscn.22",
            "id_scheme": "DOI"
        },
        "abstract": "This paper makes a contribution to the growing literatures on critical media literacy and intellectual property. While new forms of participatory culture, social production, user-generated content and new forms of social engagement have developed through the use of digital technology, those very forms of engagement are shaped by legal definitions and commercial practices that constitute the operating system of the digital economy. It will be shown that a shift toward propertization has occurred in copyright, trademark and the right of publicity. Further, each of these forms of intellectual property law has been strengthened, lengthened and, increasingly, used in relation to the others. The objects of various intellectual property forms (creative works, marks, and publicity rights) are abstracted from their original contexts and treated in an analogous way – as property, by the information and entertainment industries, the courts, and legislators, and even the general public. In such a media ecology it makes sense to see cultural properties as transpropertied, where the multi-faceted character of such intellectual artifacts requires the interaction and protection of formerly distinct forms of IP protection. Using examples from literature, cinema, and comic books the paper will trace the development of transproperty and will offer suggestions for how an understanding of transproperty strengthens our media literacy.",
        "article_title": "Transproperty: Intellectual property and the ideal property form",
        "authors": [
            {
                "given": "Daniel",
                "family": "Downes",
                "affiliation": [
                    "University of New Brunswick"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.21",
        "identifier": {
            "string_id": "10.16995/dscn.21",
            "id_scheme": "DOI"
        },
        "abstract": " The remix demonstrates that creativity is alive and well, but also under attack by corporate copyright holders trying to shut down media sharing and remixed media. Artistry now lies in how pre-existing materials are remixed and rendered new; it is through acts of transformation of the original that the remix's value is found. Artists reuse other works to reveal or transmit political messages, and not simply to re-create them. The remix is not killing narrative but instead is fostering a transformation and renaissance of creative practice, outside of the legal boundaries of copyright. The criminalization of new kinds of creative practice is a growing barrier to the remix's creative renaissance. Remix reimagines pre-existing texts, plots and genres as a way of interrogating the future of culture, via digital collaborative authorship and a distinct remix aesthetic of interruption, disturbance, and capture/leakage.",
        "article_title": "\"It’s Creativity, Jim, but not as we know it\": Authorship in the Age of the Remix.",
        "authors": [
            {
                "given": "Carolyn",
                "family": "Guertin",
                "affiliation": [
                    "Augmented Reality Lab, York University, Toronto"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.3",
        "identifier": {
            "string_id": "10.16995/dscn.3",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Chapter 4Will our children have the chance to do research on today’s digital books?",
        "authors": [
            {
                "given": "Christoph",
                "family": "Bläsi",
                "affiliation": [
                    "Johannes Gutenberg University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.18",
        "identifier": {
            "string_id": "10.16995/dscn.18",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "The great WARC adventure: Using SIPS, AIPS, and DIPS to document SLAPPs",
        "authors": [
            {
                "given": "Ian",
                "family": "Milligan",
                "affiliation": [
                    "York University"
                ]
            },
            {
                "given": "Nick",
                "family": "Ruest",
                "affiliation": null
            },
            {
                "given": "Anna",
                "family": "St.Onge",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.17",
        "identifier": {
            "string_id": "10.16995/dscn.17",
            "id_scheme": "DOI"
        },
        "abstract": "The computational turn in the humanities has precipitated the need for sustainable software development projects that are specifically focused on humanities research problems, and the need for graduate and undergraduate training models that address the trans-disciplinary nature of computational humanities research. In this paper, we describe one approach for addressing those two challenges simultaneously: an interdisciplinary research and development team called the Digital Innovation Group (DigInG). DigInG quickly and necessarily became an experiment in trans-disciplinary education at the interface of digital humanities and computer science. Not only does DigInG play an important role in developing a computational infrastructure for d/cHPS research, it also creates an environment for hands-on training for graduate and undergraduate students in computer science, biology, and history and philosophy of science. We discuss the rationale, benefits, and challenges of DigInG since its inception. Our primary objectives are to broaden the discussion about how digital and computational humanities programs are organized, and to suggest that software development and training in the digital humanities need not be conceived as independent activities.",
        "article_title": "Software development & trans-disciplinary training at the interface of digital humanities and computer science",
        "authors": [
            {
                "given": "B. R. Erick",
                "family": "Peirson",
                "affiliation": null
            },
            {
                "given": "Julia",
                "family": "Damerow",
                "affiliation": [
                    "Center for Biology & Society, School of Life Sciences, Arizona State University"
                ]
            },
            {
                "given": "Manfred",
                "family": "Laubichler",
                "affiliation": [
                    "Center for Biology & Society, School of Life Sciences, Arizona State University", "Santa Fe Institute", "Max Planck Institute for the History of Science", "Marine Biological Laboratory"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.7",
        "identifier": {
            "string_id": "10.16995/dscn.7",
            "id_scheme": "DOI"
        },
        "abstract": "This chapter examines the various textual traditions that inform the design and affordances of three INKE digital tools, namely NewRadial, the Dynamic Table of Contexts, and Bubblelines. In turning to earlier textual exemplars, such as the sammelbände and foldout engravings, the chapter illustrates certain commonalities between past and present textual media. Similarly, by examining the material evidence of Renaissance readers, including manuscript tables of contents and supplements to print indexes, the chapter considers the long history of customization that lies behind many of our digital applications today. In short, the chapter invites readers to situate a series of INKE tools within a much earlier and seemingly unrelated textual tradition.",
        "article_title": "Chapter 11Designed for the digital reader: The textual traditions in, of, and behind NewRadial, the dynamic table of contexts and Bubblelines",
        "authors": [
            {
                "given": "Scott",
                "family": "Schofield",
                "affiliation": [
                    "Huron University College"
                ]
            },
            {
                "given": "INKE",
                "family": "Research Group",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.6",
        "identifier": {
            "string_id": "10.16995/dscn.6",
            "id_scheme": "DOI"
        },
        "abstract": "This article canvasses the multiple meanings of the word \"social\" in the contexts of editions, editing and texts. It may refer to a theory of editing; to varieties of practice; to manners of making; or to characterize the edition itself. Further, not all editions which claim to be \"social,\" in any of these senses, are any such thing. A particularly egregious example is the so-called \"Social edition of the Devonshire manuscript,\" whose claim to be \"social\" is poorly based. However, there is real potential in the making of editions which are more inclusive in their making, which achieve a wider impact and create new understandings in expanding circles of readership, whether or not we choose to label these as \"social.\"",
        "article_title": "Chapter 7Social editions, social editing, social texts",
        "authors": [
            {
                "given": "Peter",
                "family": "Robinson",
                "affiliation": [
                    "University of Saskatchewan"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "6",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.259",
        "identifier": {
            "string_id": "10.16995/dscn.259",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "The Balance between On-line and In-person Interactions: Methods for the Development of Digital Humanities Collaboration",
        "authors": [
            {
                "given": "Lynne",
                "family": "Siemens",
                "affiliation": [
                    "Assistant Professor, School of Public Administration, University of Victoria"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "2",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.258",
        "identifier": {
            "string_id": "10.16995/dscn.258",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Something Borrowed: Sequence Alignment and the Identification of Similar Passages in Large Text Collections",
        "authors": [
            {
                "given": "Mark",
                "family": "Olsen",
                "affiliation": null
            },
            {
                "given": "Russell",
                "family": "Horton",
                "affiliation": null
            },
            {
                "given": "Glenn",
                "family": "Roe",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "2",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.257",
        "identifier": {
            "string_id": "10.16995/dscn.257",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Reading  with the Mandala Browser: A Case Study in Algorithmic Criticism via Experimental Visualization",
        "authors": [
            {
                "given": "Susan",
                "family": "Brown",
                "affiliation": [
                    "University of Guelph"
                ]
            },
            {
                "given": "Stan",
                "family": "Ruecker",
                "affiliation": null
            },
            {
                "given": "Jeffery",
                "family": "Antoniuk",
                "affiliation": null
            },
            {
                "given": "Sharon",
                "family": "Farnel",
                "affiliation": null
            },
            {
                "given": "Matt",
                "family": "Gooding",
                "affiliation": null
            },
            {
                "given": "Stéfan",
                "family": "Sinclair",
                "affiliation": null
            },
            {
                "given": "Matt",
                "family": "Patey",
                "affiliation": null
            },
            {
                "given": "Sandra",
                "family": "Gabriele",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "2",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.241",
        "identifier": {
            "string_id": "10.16995/dscn.241",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "CARCAT: Computer-Assisted Reading and Conceptual Analysis of Texts: An experiment applied to the concept of evolution in the work of Henri Bergson",
        "authors": [
            {
                "given": "Jean",
                "family": "Danis",
                "affiliation": [
                    "Université du Québec à Montréal"
                ]
            },
            {
                "given": "Jean-Guy",
                "family": "Meunier",
                "affiliation": [
                    "Université du Québec à Montréal"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.242",
        "identifier": {
            "string_id": "10.16995/dscn.242",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Electronic Scholarly Editing in the University Classroom: an Approach to Project-based Learning",
        "authors": [
            {
                "given": "Joel E.",
                "family": "Salt",
                "affiliation": null
            },
            {
                "given": "Allison",
                "family": "Muri",
                "affiliation": [
                    "University of Saskatchewan"
                ]
            },
            {
                "given": "Ronald Wayne",
                "family": "Cooley",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.243",
        "identifier": {
            "string_id": "10.16995/dscn.243",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Modular Design, Lateral Project Development, and the Sharing of Work: Lessons from the Edward Winslow Family Papers and the Atlantic Canada Virtual Archives",
        "authors": [
            {
                "given": "Corey",
                "family": "Slumkoski",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.244",
        "identifier": {
            "string_id": "10.16995/dscn.244",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Before the Beginning: The Formation of Humanities Computing as a Discipline in Canada",
        "authors": [
            {
                "given": "Sean",
                "family": "Gouglas",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Geoffrey",
                "family": "Rockwell",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Victoria",
                "family": "Smith",
                "affiliation": null
            },
            {
                "given": "Sophia",
                "family": "Hoosein",
                "affiliation": null
            },
            {
                "given": "Harvey",
                "family": "Quamen",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.236",
        "identifier": {
            "string_id": "10.16995/dscn.236",
            "id_scheme": "DOI"
        },
        "abstract": "From Virgil Thomson’s 1934 musical score for Gertrude Stein’s opera Four Saints in Three Acts, to readings of The Making of Americans (1925) using digital tools, artists and scholars have used musical composition and computational tools to help express something otherwise obscured in traditional readings of Stein’s texts. At first glance, it seems there is little in common between these efforts: readers argue that setting a Steinian text to music is a welcome abstraction that brings the text to new heights of expression, while computing them seems to concretise their subtleties and diminish their expressive possibilities. I argue that it is the situated hermeneutical framework in which visualisations, like musical scores, invite us to \"play,\" that guides our scholarly, interpretive performances with Stein’s texts. In particular, the visualisations I introduce here help us reconsider the significance of oral traditions in Stein’s self-proclaimed magnum opus, The Making of Americans.",
        "article_title": "Distant Listening or Playing Visualisations Pleasantly with the Eyes and Ears",
        "authors": [
            {
                "given": "Tanya",
                "family": "Clement",
                "affiliation": [
                    "University of Texas at Austin"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.235",
        "identifier": {
            "string_id": "10.16995/dscn.235",
            "id_scheme": "DOI"
        },
        "abstract": "In this article, I discuss a project in which I use text mining and corpus linguistics to explore patterns of sentimentality in mid-Victorian novels. The strong and formulaic conventions of sentimentality as a genre enable me to investigate how text analysis, machine classification, and word cloud visualisations can reveal low-level patterns that correspond to the higher-level formations of sentimentality. Specifically, I use the Naïve Bayes classification algorithm and Dunning's Log Likelihood Ratio (through the MONK Project and WordHoard) to identify instances of sentimentality and isolate the words that are most salient in affective writing. I also use the study to think through issues raised when employing computational text analysis and distant reading to inform critical positions.",
        "article_title": "Patterns of Sentimentality in Victorian Novels",
        "authors": [
            {
                "given": "Sara",
                "family": "Steger",
                "affiliation": [
                    "University of Georgia"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.237",
        "identifier": {
            "string_id": "10.16995/dscn.237",
            "id_scheme": "DOI"
        },
        "abstract": "Focusing specifically on how digital content is duplicated across the web (often with and without attribution), this essay argues that humanities practitioners currently need platforms to help them: (1) facilitate the aggregation of web-based content, (2) responsibly embed and share that content, (3) interpret the content in a flexible and open way, (4) identify and create relationships between the content, and (5) express those relationships through a variety of formats, genres, views, and arrangements. To justify these claims, the authors examine two platforms, ThoughtMesh and Scalar, using methods across digital rhetoric, interaction design, data structuring, and software studies. While the essay is largely intended for audiences interested in digital scholarly communications and platform development, it should also appeal to those invested in linked open data, media studies, and computers and writing.",
        "article_title": "After the Document Model for Scholarly Communication: Some Considerations for Authoring with Rich Media",
        "authors": [
            {
                "given": "Jentery",
                "family": "Sayers",
                "affiliation": [
                    "University of Victoria"
                ]
            },
            {
                "given": "Craig",
                "family": "Dietrich",
                "affiliation": [
                    "University of Southern California"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.238",
        "identifier": {
            "string_id": "10.16995/dscn.238",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "How to Read a Literary Visualisation: Network Effects in the Lake School of Romantic Poetry",
        "authors": [
            {
                "given": "Laura",
                "family": "Mandell",
                "affiliation": [
                    "Miami University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.239",
        "identifier": {
            "string_id": "10.16995/dscn.239",
            "id_scheme": "DOI"
        },
        "abstract": "How can crowdsourcing be used in the humanities? This paper describes a crowdsourcing project at the University of Alberta that developed a tool for participants to sign out audio clips for transcribing and translating from Ukrainian. The audio clips were from fieldwork on Ukrainian folklore and include stories, songs, and beliefs. We describe the design process and provideCrowdsourcing only works if you can motivate sufficient participants and different participant communities call for different strategies. an environmental comparison with other crowdsourcing projects. We discuss the challenge of motivating community members with the language skills to volunteer to help with the project. Crowdsourcing only works if you can motivate sufficient participants, and different participant communities call for different strategies.",
        "article_title": "Ukrainian Folklore Audio Project",
        "authors": [
            {
                "given": "Geoffrey",
                "family": "Rockwell",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Natalie",
                "family": "Kononenko",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Megan",
                "family": "Sellmer",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Maryna",
                "family": "Chernyavska",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Karl",
                "family": "Anvik",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.240",
        "identifier": {
            "string_id": "10.16995/dscn.240",
            "id_scheme": "DOI"
        },
        "abstract": "This essay considers the opportunities afforded by the Simulated Environment for Theatre (SET) for exploring the functions of and relationships between historical theatrical texts and other records of performance. Over the course of SET’s development, the system’s digital environment for visualizing theatrical text and performance has increasingly emphasised affordances that are not available in other digital or material environments. Our most recent focus has been on SET’s potential applications for theatre historians, in particular because of the system’s user-controlled, hybrid two- and three-dimensional interface, which permits the simultaneous visualization of a variety of research materials and performance simulations. Through a research project exploring the theatre-historical significance of Soulpepper Theatre’s 2011 production of Judith Thompson’s White Biting Dog in relation to the Tarragon Theatre’s 1984 premiere of the play, we have identified some current strengths of SET as a tool for theatre-historical research, as well as some technical improvements that would enhance its efficacy, and some design challenges warranting further consideration. With some refinements, SET has the potential to add to the affordances offered by existing digital tools through its ability to visualise theatre-historical methodologies and its positioning of the user as the agent of research, making it an environment for historiographical as well as historical scholarship.",
        "article_title": "Visualising Theatre Historiography: Judith Thompson's White Biting Dog (1984 and 2011) in the Simulated Environment for Theatre (SET)",
        "authors": [
            {
                "given": "Jennifer",
                "family": "Roberts-Smith",
                "affiliation": [
                    "University of British Columbia"
                ]
            },
            {
                "given": "Teresa",
                "family": "Dobson",
                "affiliation": [
                    "York University"
                ]
            },
            {
                "given": "Sandra",
                "family": "Gabriele",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Omar",
                "family": "Rodriguez-Arenas",
                "affiliation": [
                    "University of Alberta"
                ]
            },
            {
                "given": "Stan",
                "family": "Ruecker",
                "affiliation": [
                    "McGill University"
                ]
            },
            {
                "given": "Stéfan",
                "family": "Sinclair",
                "affiliation": [
                    "University of Toronto"
                ]
            },
            {
                "given": "Shawn",
                "family": "DeSouza-Coelho",
                "affiliation": [
                    "University of Toronto"
                ]
            },
            {
                "given": "Alexandra",
                "family": "Kovacs",
                "affiliation": [
                    "York University"
                ]
            },
            {
                "given": "Daniel",
                "family": "So",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "3",
        "issue": "2",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.47",
        "identifier": {
            "string_id": "10.16995/dscn.47",
            "id_scheme": "DOI"
        },
        "abstract": "This essay considers the viability of pornography marketed as resistant or revolutionary within hegemonic capitalist and heteronormative contexts. It focuses on three contemporary porn websites: Pornhub, Treasure Island Media, and TROUBLEfilms. In its current context, internet pornography represents a complex web of content owners, producers, distributors, licensees, users, uploaders, downloaders, actors, web hosts, and advertisers, and notions of intellectual property often come into play as porn companies try to make money in an environment in which customers do not want to pay. Using the Salish method of \"storying up\" a phenomenon (Maracle 2007), I narrate the history of obscenity and intellectual property and discuss survival strategies employed by the three exemplary netporn sites. Beginning with copyright's and obscenity's legal foundations in the eighteenth century, the story of porn and intellectual property includes the use of easily-copied porn to create sexual publics in the twentieth century and technological and legal changes to porn's distribution in the twenty-first century. I examine three strategies netporn businesses use to stay afloat in the post-industrial economy. These strategies are the re-intermediation of the industry, management of the pornographer's \"author function,\" and regulation of porn consumption through the sale of identity to viewers. As netporn businesses struggle for control over porn distribution and consumption, they facilitate their own survival by generating new sexual, social and economic norms. These norms mediate between the \"pirate\" culture promised by technology and the culture industry's interest in legitimising and entrenching intellectual property rights.",
        "article_title": "Pornographers and Pirates: Intellectual Property and Netporn",
        "authors": [
            {
                "given": "Sarah",
                "family": "Mann",
                "affiliation": [
                    "Department of Geography, Brock University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": null,
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.260",
        "identifier": {
            "string_id": "10.16995/dscn.260",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Prospero and Plagiarism: Early Modern Studies and the rise of Wikipedia",
        "authors": [
            {
                "given": "Matthew",
                "family": "Steggle",
                "affiliation": [
                    "Sheffield Hallam University"
                ]
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": [],
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "2",
        "issue": "1",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    }
]