[{"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/21640", "identifier": {"string_id": "10.11588/dah.2015.1.21640", "id_scheme": "DOI"}, "abstract": "Has human beauty always been perceived in the same manner? We used a set of 120,000 paintings from different periods to analyze human faces between the 13th and the 20th centuries in order to establish whether there has been a single canon of beauty (that would maximize reproduction probabilities) or whether this has changed over time. Our study shows that when measuring averageness, symmetry, and orientation, the representation of human faces has not remained constant and that there are substantial differences between the faces depicted between the 15th and 18th centuries when compared to those of both the 13th and 20th centuries. Especially significant is the decrease in the perceived beauty of faces in 20th-century paintings, as the freedom of artists and the openness of society fostered the representation of different types of human faces other than that of classical styles.", "article_title": "A Quantitative Approach to Beauty. Perceived Attractiveness of Human Faces in World Painting", "authors": [{"given": "Javier", "family": "De La Rosa", "affiliation": ["University of Western Ontario"]}, {"given": "Juan-Luis", "family": "Suárez", "affiliation": ["University of Western Ontario"]}], "publisher": null, "date": "2015-06-29", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/21639", "identifier": {"string_id": "10.11588/dah.2015.1.21639", "id_scheme": "DOI"}, "abstract": "With reference to the concept of distant reading in literary history, distant viewing is a valuable analogy for a quantitative approach to art history. In this case study of artistic productivity eight samples are analyzed, extracted from a digital thematic research collection about the iconography of Aphrodite/Venus from the Middle Ages to Modern Times. The result is an empirical finding of regularity never before highlighted in art history. The artistic productivity fits perfectly the distribution known as Lotka’s law of scientific productivity in bibliographic science. Issues of collecting and sampling are discussed and the meaning of this empirical finding is hinted. Suggestions for future research are made.", "article_title": "Distant Viewing in Art History. A Case Study of Artistic Productivity", "authors": [{"given": "K.", "family": "Bender", "affiliation": ["independent researcher in Belgium"]}], "publisher": null, "date": "2015-06-29", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/21638", "identifier": {"string_id": "10.11588/dah.2015.1.21638", "id_scheme": "DOI"}, "abstract": "Taking into account the call of this journal to examine the epistemological and methodological assumptions in the field of art history on the verge of its digital turn, the aim of this essay is to contribute to the ongoing discussion by questioning the role of the framing device in the context of image appropriation and critical interpretation of visual documents. Focusing on the cognitive and structural potential of the frame, a common feature between analogue and digital art historical practice, we try to provide points of historical perspective through a selection of particular examples (Giorgio Vasari, Gustav Ludwig and Aby Warburg) and bring them closer to the notions of instrumentation and interface.", "article_title": "Reframing Art History", "authors": [{"given": "Elli", "family": "Doulkaridou", "affiliation": ["University of Paris, Panthéon-Sobonne"]}], "publisher": null, "date": "2015-06-29", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/21634", "identifier": {"string_id": "10.11588/dah.2015.1.21634", "id_scheme": "DOI"}, "abstract": "This paper offers a few reflections on the origins, historiography and condition of the field often referred to as Digital Art History (DAH), with references, among others, to the activities of the Computers and the History of Art group (CHArt, est. 1985) and my personal experience, spanning over 20 years, first as a postgraduate student, then doctoral researcher and eventually Lecturer in DAH. The publications and teaching activities of scholars connected to CHArt are seen as indicative of the evolution of the field internationally. Personal experience, or a reality check, is limited to higher education in the UK. The key argument here concerns the questionable benefit of promoting DAH as a discrete discipline and detaching digital practices from the mainstream history of art and its institutions. When introduced in the late 1990s, the ‘DAH’ served to indicate a dramatic shift in the way art history could be practiced, taught, studied and communicated. The changes were brought about by widening access to computers and information technology. DAH was suggested—“perhaps a little ahead of time—as a new kind of intellectual fusion” (W. Vaughan). It is no longer necessary to argue for the wise use of computers. Digital technology has become part and parcel of teaching, learning and research. It is the History of Art and its more traditional research methods and critical perspectives that are seen at risk of neglect. The theories of crisis, even ‘death’ of Art History have contributed to general anxiety over the discipline’s future. However, a discipline has “the ability and power to control and judge its borders” (R. Nelson). The discipline of Art History is richer and stronger through the fusion of digital scholarship with, not separation, from more traditional methodologies and critical canons. The need to continue with the ‘digital’ distinction is questionable.", "article_title": "Debating Digital Art History", "authors": [{"given": "Anna", "family": "Bentkowska-Kafel", "affiliation": ["King's College London, UK"]}], "publisher": null, "date": "2015-06-29", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/21633", "identifier": {"string_id": "10.11588/dah.2015.1.21633", "id_scheme": "DOI"}, "abstract": "The past five years have witnessed a growing interest amongst art historians in the potential of digital projects to impact, if not transform, the discipline. A steep rise in conferences and institutes dedicated to digital art history, along with funding opportunities and institutional support, has accelerated the rate at which art historians are now engaging with digital techniques. With this new visibility, art historians have criticized themselves for lagging behind other disciplines such as history and archaeology. This article questions the assumption that art historians have been slow to embrace digital tools and methods through a brief historical examination of projects undertaken by institutions and scholars during the infancy of art history computing: the early 1980s through the early 1990s. Using Johanna Drucker's distinction of the \"digitized\" and \"digital\" iterations of art history, this essay traces the genealogies of both categories, arguing that scholars have been more active in theorizing, practicing and creating digital methods than is often seen to be the case. Ultimately, this essay is an attempt to help define from a historical perspective what \"digital art history\" is and how it has been practiced.", "article_title": "Forgotten Genealogies: Brief Reflections on the History of Digital Art History", "authors": [{"given": "Benjamin", "family": "Zweig", "affiliation": ["Visual Arts (CASVA) National Gallery of Art, Washington DC"]}], "publisher": null, "date": "2015-06-29", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/21631", "identifier": {"string_id": "10.11588/dah.2015.1.21631", "id_scheme": "DOI"}, "abstract": "I present a number of core concepts from data science that are relevant to digital art history and the use of quantitative methods to study any cultural artifacts or processes in general. These concepts are objects, features, data, feature space, and dimension reduction. These concepts enable computational exploration of both large and small visual cultural data. We can analyze relations between works on a single artist, many artists, all digitized production from a whole historical period, holdings in museum collections, collection metadata, or writings about art. The same concepts allow us to study contemporary vernacular visual media using massive social media content. (In our lab, we analyzed works by van Gogh, Mondrian, and Rothko, 6000 paintings by French Impressionists, 20,000 photographs from MoMA photography collection, one million manga pages from manga books, one million artworks of contemporary non-professional artists, and over 13 million Instagram images from 16 global cities.) While data science techniques do not replace other art historical methods, they allow us to see familiar art historical material in new ways, and also to study contemporary digital visual culture.", "article_title": "Data Science and Digital Art History", "authors": [{"given": "Lev", "family": "Manovich", "affiliation": ["City University of New York"]}], "publisher": null, "date": "2015-06-29", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/23944", "identifier": {"string_id": "10.11588/dah.2016.2.23944", "id_scheme": "DOI"}, "abstract": "Art Historians who wish to engage with the potential of digital tools for research and narratives about works of art, architecture and cities often have difficulties identifying appropriate software and receiving basic training.  To address this challenge, the Wired! group at Duke University began to offer workshops in 2009, and since 2012 these have been taught on site at Venice International University, which created a laboratory for this purpose.  Our goal has been to assist scholars in learning basic skills not only to create maps, models, and displays that narrate research questions, but also to acquire enough knowledge to join in effective and directed partnerships with computer scientists and engineers. In 2015, the Getty Foundation covered the costs of travel and living expenses for the faculty and participants, while the Delmas Foundation has helped since 2012 with the costs of tuition.", "article_title": "Graduate Workshop on Digital Tools for Art Historians: The Visualizing Venice Summer Program “The Biennale and the City” (2015)", "authors": [{"given": "Caroline", "family": "Bruzelius", "affiliation": ["Duke University"]}], "publisher": null, "date": "2016-10-18", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/33530", "identifier": {"string_id": "10.11588/dah.2016.2.33530", "id_scheme": "DOI"}, "abstract": "In this article we present a case study on digital representation of the art historical research and metadata brought together for a scientific collection catalogue by the Prussian Palaces and Gardens Foundation Berlin-Brandenburg. The resulting interface aims at linking the structure and texture of a collection of drawings by Frederick William IV of Prussia (1795–1861) with additional contextual information. The article describes the context of the larger research project and presents the resulting visualization and interaction techniques specifically designed for dynamic exploration along time and subjects.", "article_title": "Linking structure, texture and context in a visualization of historical drawings by Frederick William IV (1795-1861)", "authors": [{"given": "Katrin", "family": "Glinka", "affiliation": ["Potsdam  University  of Applied Sciences"]}, {"given": "Christopher", "family": "Pietsch", "affiliation": ["Berlin"]}, {"given": "Carsten", "family": "Dilba", "affiliation": ["Prussian Palaces and Gardens Foundation, Berlin-Brandenburg"]}, {"given": "Marian", "family": "Dörk", "affiliation": ["Potsdam  University  of Applied Sciences"]}], "publisher": null, "date": "2016-10-18", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/33529", "identifier": {"string_id": "10.11588/dah.2016.2.33529", "id_scheme": "DOI"}, "abstract": "The following is a description of two novel techniques for the direct visualization of image data. Direct visualizations of image data make use of the images in their original visible format. The first technique, the slice histogram, arranges slices of images as histograms, organized by both visual and non-visual variables. The second technique, the growing entourage plot, organizes high-dimensional clusters of images on a 2D canvas by projection. Both techniques are designed for exploratory analysis of image datasets.", "article_title": "Direct visualization techniques for the analysis of image data: the slice histogram and the growing entourage plot", "authors": [{"given": "Damon", "family": "Crockett", "affiliation": ["Qualcomm Institute, UCSD"]}], "publisher": null, "date": "2016-10-18", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/25337", "identifier": {"string_id": "10.11588/dah.2016.2.25337", "id_scheme": "DOI"}, "abstract": "The development of a professionalized, highly centralized printmaking industry in northern Europe during the mid-sixteenth century has been argued to be the inevitable result of prints' efficacy at reproducing images, and thus encouraging mass production. However, it is unclear whether such a centralized structure was truly inevitable, and if it persisted through the seventeenth century. This paper uses network analysis to infer these historical print production networks from two large databases of existing prints in order to characterize whether and how centralization of printmaking networks changed over the course of this period, and how these changes may have influenced individual printmakers.", "article_title": "Social Network Centralization Dynamics in Print Production in the Low Countries, 1550-1750", "authors": [{"given": "Matthew", "family": "Lincoln", "affiliation": ["Getty Research Institute"]}], "publisher": null, "date": "2016-10-18", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/23489", "identifier": {"string_id": "10.11588/dah.2016.2.23489", "id_scheme": "DOI"}, "abstract": "In this paper, by extending the methodology of media archaeology to the praxis of Cultural Analytics/Media Visualization I ask how have we compared multitude of diverse images and what can we learn about the narratives that these comparisons allow? I turn to the work of Aby Warburg who attempted to organize close to two thousand images in his Mnemosyne Atlas. In comparing contemporary methods of image data visualization through cultural analytics method of remapping and the turn of the century methodology developed by Warburg under the working title of the “iconology of intervals,” I examine the shifts and continuities that have shaped informational aesthetics as well as data-driven narratives. Furthermore, in drawing parallels between contemporary Cultural Analytics/Media Visualization techniques, and Aby Warburg’s Atlas, I argue that contextual and image color data knowledge should continue to be important for digital art history. More specifically, I take the case study of Warburg’s Panel 45 in order to explore what we can learn through different visualization techniques about the role of color in the representation of violence and the promise of prosperous civil society.", "article_title": "Images as Data: Cultural Analytics and Aby Warburg’s Mnemosyne", "authors": [{"given": "Stefka", "family": "Hristova", "affiliation": ["Michigan  Technological University"]}], "publisher": null, "date": "2016-10-18", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/23250", "identifier": {"string_id": "10.11588/dah.2016.2.23250", "id_scheme": "DOI"}, "abstract": "GLAM institutions all over the world are digitizing their collections. As the number of items in such a collection amounts to tens or even hundreds of thousands, providing comprehensible access and presentation becomes increasingly difficult. At the same time, a steadily growing amount of this data is openly available. This gives rise to various projects approaching the hidden treasures in these collections with computational tools. The project presented here, Gugelmann Galaxy, lets the user explore an entire collection of digitized images and their textual metadata in an immersive three-dimensional cloud, whose configuration can be rearranged according to different criteria. The project questions traditional models of categorization and curating and implements alternative approaches prototypically.", "article_title": "Gugelmann Galaxy: An Unexpected Journey through a collection of Schweizer Kleinmeister", "authors": [{"given": "Mathias", "family": "Bernhard", "affiliation": ["ETH  Zurich"]}], "publisher": null, "date": "2016-10-18", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/23376", "identifier": {"string_id": "10.11588/dah.2016.2.23376", "id_scheme": "DOI"}, "abstract": "In the past few years, the number of fine-art collections that are dig- itized and publicly available has been growing rapidly. With the availability of such large collections of digitized artworks comes the need to develop multime- dia systems to archive and retrieve this pool of data. Measuring the visual similar- ity between artistic items is an essential step for such multimedia systems, which can benefit more high-level multimedia tasks. In order to model this similarity between paintings, we should extract the appropriate visual features for paintings and find out the best approach to learn the similarity metric based on these fea- tures. We investigate a comprehensive list of visual features and metric learning approaches to learn an optimized similarity measure between paintings. We de- velop a machine that is able to make aesthetic-related semantic-level judgments, such as predicting a painting’s style, genre, and artist, as well as providing simi- larity measures optimized based on the knowledge available in the domain of art historical interpretation. Our experiments show the value of using this similarity measure for the aforementioned prediction tasks.", "article_title": "Large-scale Classification of Fine-Art Paintings: Learning The Right Metric on The Right Feature", "authors": [{"given": "Babak", "family": "Saleh", "affiliation": ["Rutgers university"]}, {"given": "Ahmed", "family": "Elgammal", "affiliation": ["Rutgers university"]}], "publisher": null, "date": "2016-10-18", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/24761", "identifier": {"string_id": "10.11588/dah.2016.2.24761", "id_scheme": "DOI"}, "abstract": "World population and the number of cultural artifacts are growing exponentially or faster, while cultural interaction approaches the fidelity of a global nervous system. Every day hundreds of millions of images are loaded into social networks by users all over the world. As this myriad of new artifacts veils the view into the past, like city lights covering the night sky, it is easy to forget that there is more than one Starry Night, the painting by Van Gogh.Like in ecology, where saving rare species may help us in treating disease, art and architectural history can reveal insights into the past, which may hold keys to our own future. With humanism under threat, facing the challenge of understanding the structure and dynamics of art and culture, both qualitatively and quantitatively, is more crucial now than it ever was. The purpose of this article is to provide perspective in the aim of figuring out the process of art history – not art history as a discipline, but the actual history of all made things, in the spirit of George Kubler and Marcel Duchamp. In other words, this article deals with the grand challenge of developing a systematic science of art and culture, no matter what, and no matter how. <br>", "article_title": "Figuring out Art History", "authors": [{"given": "Maximilian", "family": "Schich", "affiliation": ["University of Texas at Dallas"]}], "publisher": null, "date": "2016-10-18", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "http://journals.ub.uni-heidelberg.de/index.php/dah/article/view/33527", "identifier": {"string_id": "10.11588/dah.2016.2.33527", "id_scheme": "DOI"}, "abstract": "The use of the computer in Art History is changing the approach towards our objects of research. Now, we are able to compute more images than a human can see in a lifetime. That, in turn, calls for a new definition of the role of the researcher and the tools being used. The access to large amounts of visual data stands in a tradition of conventional methods of Art History, but also augments them with quantity. This article proposes a theoretical model on which to build an understanding of the meta image with which we interactively derive our conclusions.", "article_title": "Big Image Data within the Big Picture of Art History", "authors": [{"given": "Harald", "family": "Klinke", "affiliation": ["LMU München"]}], "publisher": null, "date": "2016-10-18", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/34297", "identifier": {"string_id": "10.11588/dah.2018.3.34297", "id_scheme": "DOI"}, "abstract": "Sustained dialogue and collaborative work between art historians and technologists has a great deal to offer both fields of inquiry. In this paper, we propose that effective collaborations in Digital Art History, however, require more than just a humanist and a technologist to succeed. Indeed, we find that there are four different roles that need to be filled: Humanist, Technologist, Data Steward, and Catalyst. Our approach is predicated on a few foundational convictions. First, we believe that art historians and technologists occupy distinct problem spaces. As we will outline, although these realms are distinct they are not of necessity in opposition to one another. Second, we bring to the fore essential questions about the status and function of data that must be addressed by the collaborators: what sort of data are being used? What counts as effective and compelling analysis of this data? Third, we recognize that there are certain structural impediments to collaboration, such as different reward structures and motivations. Finally, we assert that each of the participants must have a deep commitment to their particular engagement with the project, which requires sustained effort and the maintenance of disciplinary respect. We firmly believe that the most effective of these projects will not be based on technological solutionism, but rather will be founded in the most humanistic of tools: empathy and respect.", "article_title": "A Role-Based Model for Successful Collaboration  in Digital Art History", "authors": [{"given": "Alison", "family": "Langmead", "affiliation": ["University of Pittsburgh"]}, {"given": "Tracey", "family": "Berg-Fulton", "affiliation": ["Carnegie Museum of Art"]}, {"given": "Thomas", "family": "Lombardi", "affiliation": ["Washington and Jefferson College"]}, {"given": "David", "family": "Newbury", "affiliation": ["Carnegie Museum of Art"]}, {"given": "Christopher", "family": "Nygren", "affiliation": ["University of Pittsburgh"]}], "publisher": null, "date": "2018-07-31", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/47287", "identifier": {"string_id": "10.11588/dah.2018.3.47287", "id_scheme": "DOI"}, "abstract": "This essay explores the parallel rising of computer vision technology and digital art history, examining some of the current possibilities and limits of computational techniques applied to the cultural and historical studies of images. A fracture emerges: computer scientists seem to lack in the critical approach typical of the humanities, a shortfall which sometimes condemns their attempts to remain technological curiosities. For their part, humanists lack in technical knowledge that is needed to directly investigate big archives of images, with the result that art historians often must limit their attempts in the computer-aided inquires on texts or metadata databases, a task that does not imply the study of the images themselves. A future dialogue between the two areas is claimed as a necessity to foster this new branch of knowledge.", "article_title": "Computational Imagination and Digital Art History", "authors": [{"given": "Giacomo", "family": "Mercuriali", "affiliation": ["Università degli Studi di Milano"]}], "publisher": null, "date": "2018-07-31", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/49916", "identifier": {"string_id": "10.11588/dah.2018.3.49916", "id_scheme": "DOI"}, "abstract": "The History of Art is in the midst of its own big bang. Amit Sood, the head of the Google Cultural Institute and Art Project, announced such in February 2016 at the Innovation Conference TED in Vancouver. Through its “Arts & Culture” program, Google already offers virtual tours of over one thousand museums and cultural institutions throughout the world, and also provides access to more than six million high-resolution digitized works of art (it should be noted that these figures continue to rise steeply).", "article_title": "Big Bang Art History", "authors": [{"given": "Ulrich", "family": "Pfisterer", "affiliation": ["Ludwig Maximilians Universität in Munich"]}], "publisher": null, "date": "2018-07-31", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/49915", "identifier": {"string_id": "10.11588/dah.2018.3.49915", "id_scheme": "DOI"}, "abstract": "This article responds to two issues affecting the field of contemporary art history: digital technology and the so-called computational turn in the humanities. It is divided into two parts: the first connects problems with “digital art history,” an offspring of digital humanities, to neoliberal metrics; the second suggests how digital art history’s“distant reading” might nevertheless be deployed critically in the analysis of contemporary art.", "article_title": "Against Digital Art History", "authors": [{"given": "Claire", "family": "Bishop", "affiliation": ["City University of New York"]}], "publisher": null, "date": "2018-07-31", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/49914", "identifier": {"string_id": "10.11588/dah.2018.3.49914", "id_scheme": "DOI"}, "abstract": "CyArk is a California-based nonprofit dedicated to digitally documenting and preserving world heritage. Since 2003, they have used photogrammetry and laserscanning to capture 3D data for over 200 sites; most recently, they have partnered with Google Arts & Culture to create an open-access platform for these sites . Here, two members of the CyArk team, John Ristevski (Chairman and CEO) and Elizabeth Lee (Vice President of Programs and Development) sit down with Justin Underhill to discuss the past and present of digital cultural heritage.", "article_title": "In Conversation with CyArk: Digital Heritage in the 21st Century", "authors": [{"given": "Justin", "family": "Underhill", "affiliation": ["CyArk"]}], "publisher": null, "date": "2018-07-31", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/32703", "identifier": {"string_id": "10.11588/dah.2018.3.32703", "id_scheme": "DOI"}, "abstract": "Uncertainty is ubiquitous in everyday life and especially domains like engineering and industry, risk management or financial markets are increasingly aware of the far-reaching impact of uncertain data. Well-established research fields like the natural sciences are ever since concerned with the intangible phenomenon of uncertainty, as well as several disciplines like geography, information visualization, or any field concerned with the past. In this context, a range of disciplinary approaches were surveyed with regard to methods and techniques developed and applied to deal with uncertainty. As a result thereof various efforts were made to consider suitable taxonomies, quantification methods and visualization strategies. Emphasize is particularly laid on archaeology, highlighting the three-dimensional digital modeling and reconstruction activities and correlated archaeological discourse of the last two decades.  Important for all disciplines however is the highly complex interrelation between uncertainty and visualization for the appropriate and comprehensible representation of gained results.  Therefore, a range of visualization strategies is introduced, such as non-photorealistic rendering techniques, visual cues or several means for (re)contextualization, which evolved from disciplinary discourse in recent years. Also, some general visualization problems are mentioned. The final thoughts are meant to be somehow encouraging to consciously and creatively utilize uncertainty for future work in 3D modeling/reconstruction projects.", "article_title": "Ubiquitous uncertainty: From a discomforting awareness towards a versatile potential.", "authors": [{"given": "Una Ulrike", "family": "Schäfer", "affiliation": ["Humboldt University"]}], "publisher": null, "date": "2018-07-31", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/32544", "identifier": {"string_id": "10.11588/dah.2018.3.32544", "id_scheme": "DOI"}, "abstract": "Starting in 2003 the Department of Architecture of the University of Leuven (KU Leuven) has conducted digital reconstructions as subject of several master’s dissertations. Over the years different topics have been the subject of study, ranging from Burgundian residences to lost religious heritage, thus addressing a range of methodological difficulties specific to dealing with historic architecture using modern technologies. As Historic Building Information Modeling (HBIM) has found its way to a broader audience over the last few years, attention must be paid to the methodology and the communication of these reconstructions towards a wider audience. Using these new technologies inevitably changes the perspective of the viewer, shifting from a distant observer to a close inspector (keeping in mind that many of the reconstructed elements were never supposed to be seen up close). Together with these new approaches new means of communication and visualization need to be realized, fitting the possibilities of the reconstructions.", "article_title": "(Re-)Creating the past: 10 years of digital historical reconstructions using BIM", "authors": [{"given": "Stefan", "family": "Boeykens", "affiliation": ["University of Leuven, KU Leuven"]}, {"given": "Sanne", "family": "Maekelberg", "affiliation": ["University of Leuven, KU Leuven"]}, {"given": "Krista", "family": "De Jonge", "affiliation": ["University of Leuven, KU Leuven"]}], "publisher": null, "date": "2018-07-31", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/32473", "identifier": {"string_id": "10.11588/dah.2018.3.32473", "id_scheme": "DOI"}, "abstract": "Digital 3D reconstruction methods have been widely applied to support research and the presentation of historical objects since the 1980s. Whereas 3D reconstruction has been incorporated into a multitude of research applications, essential methodological foundations for more widespread utilisation of digital reconstructions have yet to be developed. Against this background, the aim of this article is to consider the question as to how the methodology of 3D reconstruction alters research cultures in architectural and art history by exemplifying three problem areas, (1) research functions of 3D reconstructions and their drawback to a current research culture in art history, (2) consequences of cross-disciplinary project-based teamwork as main cooperation format within 3D reconstruction projects, and (3) problems and difficulties caused by imagery as primary media for research and communication.", "article_title": "3D Reconstruction Techniques as a Cultural Shift in Art History?", "authors": [{"given": "Sander", "family": "Münster", "affiliation": ["TU Dresden, Dresden University of Technology"]}, {"given": "Kristina", "family": "Friedrichs", "affiliation": ["TU Dresden, Dresden University of Technology"]}, {"given": "Wolfgang", "family": "Hegel", "affiliation": ["Würzdburg University"]}], "publisher": null, "date": "2018-07-31", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/49913", "identifier": {"string_id": "10.11588/dah.2018.3.49913", "id_scheme": "DOI"}, "abstract": "As data storage, computational processing power, and retrieval costs diminish, many traditional technologies of data-compression are becoming obsolete. This unprecedented state of data opulence, where more and more data are expected to be always more easily available at ever decreasing costs, is bringing about significant changes in contemporary computation, and fostering a revival of Artificial Intelligence technologies that were seen until recently as of limited practical use. A similar techno-cultural disruption is already conspicuously affecting architectural design. Informational models in three dimensions are replacing the basic tools of the designer’s trade since the Renaissance – scaled drawings in plans, elevations, and sections. Furthermore, Big Data and computation allow digital designers to compose and engage with the messiness of some natural processes without going through the traditional mediation of abstract and general mathematical theories and patterns. Just like computation is replacing the causal laws of modern science with the brute force of data-driven simulation and optimization, blunt information retrieval is increasingly, albeit often subliminally, replacing causality-driven, teleological historiography, and demoting all modern and traditional tools of story-building and story-telling. This major anthropological upheaval challenges our ancestral dependance on shared master-narratives of our cultures and histories.", "article_title": "Big Data and the End of History", "authors": [{"given": "Mario", "family": "Carpo", "affiliation": ["University College London"]}], "publisher": null, "date": "2018-07-31", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/73978", "identifier": {"string_id": "10.11588/dah.2019.4.73978", "id_scheme": "DOI"}, "abstract": "This summary is a short overview of a roundtable discussion that took place at the Renaissance Society of America on the topic of the structure and organization of a Digital Humanities curriculum. I invited two representatives of European and two of US curricula, which were split up respectively into one for Digital Art History and one for general Digital Humanities: Leif Isaksen (Professor of Digital Humanities, Exeter), Peter Bell (Junior professor for Digital Humanities, with a focus on Digital Art History, Erlangen-Nürnberg), Hannah Jacobs (Digital Humanities Specialist in the Wired! Lab for Digital Art & Visual Culture, Duke University), and Ashley Sanders Garcia (Vice Chair of the Digital Humanities Program, UCLA). Both of the European cases are recent implementations of new curricula, whereas the US-American had established courses. While established studies do exist in Europe, as for example at the University of London, they are still quite rare.", "article_title": "Summary of the Roundtable “Setting up a DH Curriculum or Certificate” at the Annual Meeting of the Renaissance Society of America (Toronto, March 19, 2019)", "authors": [{"given": "Angela", "family": "Dressen", "affiliation": ["I Tatti, The Harvard University Center for Italian Renaissance Studies"]}], "publisher": null, "date": "2020-07-23", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/72071", "identifier": {"string_id": "10.11588/dah.2019.4.72071", "id_scheme": "DOI"}, "abstract": "Technology is used to compress time and space but at the cost of ‘nearness’. This means it maintains a distance and disjoint between qualitative and quantitative techniques, and therefore between humanists and technology. The knowledge representations that humanists require to investigate a given subject are not the same as those mandated by technologists and database systems more concerned with scale and the efficiency of data processing and retrieval, rather than context and meaning. This perpetuates a humanist perception of information systems as either, useful but ancillary, or problematic. This paper describes an intervention that seeks to combine the qualitative with the quantitative through collaborative research, expressive structured data, and a human-centered and participatory approach to the ‘knowledge graph’. Its design is based on an understanding of the history of historical textual narrative and the benefit of approaching quantitative issues from the bottom up, or qualitatively, incorporating different levels of generalisation, perspectives (different vantage point on reality), and approaches to connections across time and space. A specialist question based on the designs of the artist, Katsushika Hokusai is used as a basis to illustrate how ‘micro’ research questions contribute, in part, to bigger questions and higher quality quantitative analysis.", "article_title": "The problem of distance in digital art history", "authors": [{"given": "Dominic", "family": "Oldman", "affiliation": ["British Museum"]}, {"given": "Diana", "family": "Tanase", "affiliation": ["British Museum"]}, {"given": "Stephanie", "family": "Santschi", "affiliation": ["British Museum"]}], "publisher": null, "date": "2020-03-20", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/72070", "identifier": {"string_id": "10.11588/dah.2019.4.72070", "id_scheme": "DOI"}, "abstract": "The digital medium allows visitors, curators and art historians to gain new insights into their collections through data analysis and rich, interactive visualizations. Motivated by the rise of large-scale cultural heritage collections that have emerged on the Web, we argue that Formal Concept Analysis can be used to highlight the relationships between objects and their features within digital art collections and provide a means for visitors to explore these collections via interactive, narrated pathways. Our work presents four research projects that span 10 years from 2005 - 2015 – ImageSleuth, The Virtual Museum of the Pacific, A Place for Art and a scalability study of Formal Concept Analysis as applied to a data-set from the Brooklyn Museum. Our approach is based on the idea that much of the meaning that can be interpreted from museum collections lies – at least in part – in the way that objects are related to one another. Our work examines how Formal Concept Analysis can drive explorative, narrative-based visitor experiences and reveal new insights into cultural heritage collections.", "article_title": "Navigating Context, Pathways and Relationships in Museum Collections using Formal Concept Analysis", "authors": [{"given": "Richard J.", "family": "Cole", "affiliation": ["Amazon Inc, Seattle, WA, USA"]}, {"given": "Frithjof", "family": "Dau", "affiliation": ["SAP Research, Dresden, Germany"]}, {"given": "Jon", "family": "Ducrou", "affiliation": ["Amazon Inc, Brisbane, Australia"]}, {"given": "Peter W.", "family": "Eklund", "affiliation": ["Deakin University, Geelong, Australia"]}, {"given": "Tim", "family": "Wray", "affiliation": ["IT University of Copenhagen, Denmark"]}], "publisher": null, "date": "2020-03-20", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/72068", "identifier": {"string_id": "10.11588/dah.2019.4.72068", "id_scheme": "DOI"}, "abstract": "This paper creates a conceptual frame and explanatory point of reference for the collection of papers presented at the exploratory workshop “Data Science for Digital Art History: Tackling Big Data Challenges, Algorithms, and Systems” organized at the KDD 2018 Conference in Data Mining and Knowledge Discovery held in London in August 2018. The goal of the workshop was to probe the field and to build a constructive interdisciplinary dialogue between two research areas: Data Science and Art History. The workshop’s chairs and the authors of this paper share the conviction that Data Science can enrich art studies while analysis of visual data can have a positive impact on Data Science. Thus, the research initiative tried to critically reflect on the interdisciplinary collaboration between diverse research communities and its epistemological and ontological effects.", "article_title": "Method in Interdisciplinary Research", "authors": [{"given": "Ewa", "family": "Machotka", "affiliation": ["Stockholm University"]}, {"given": "Panagiotis", "family": "Papapetrou", "affiliation": ["Stockholm University"]}], "publisher": null, "date": "2020-03-20", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/52672", "identifier": {"string_id": "10.11588/dah.2019.4.52672", "id_scheme": "DOI"}, "abstract": "As art museums undergo a digital transformation, institutions rethink physical exhibitions and print publications to create online resources which expand or replicate their traditional functions. Collection websites, online exhibitions, online publications, exhibition websites, and online exhibition catalogues coexist with interactive features which cannot be easily categorized in the previous typologies, the exhibition and the publication. Moreover, often these different types of online resources share characteristics and functions. This article intends to define two of the most relevant online resources typologies in art museums, the online exhibition and the online publication. The aim of it is to discuss and understand the importance of rethinking traditional typologies in the digital age. If typologies are necessary is because they help us to advance previous models. Both the definition and discussion are built upon the perspectives of art museums practitioners and a scholarly audience collected through interviews. The viewpoints of the two collectives help us understand existing conventions, preferences, and needs with regards to online exhibitions and publications in art museums.", "article_title": "Defining online resources typologies in art museums: online exhibitions and publications", "authors": [{"given": "Maribel", "family": "Hidalgo Urbaneja", "affiliation": ["University of Glasgow"]}], "publisher": null, "date": "2020-05-26", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/52795", "identifier": {"string_id": "10.11588/dah.2019.4.52795", "id_scheme": "DOI"}, "abstract": "The technological progress of the past decades has had a transformative effect on both cultural institutions and academic research. It is generally accepted that mass digitization projects led by museums, libraries and archives have allowed institutions to reach new audiences and increase the impact of their collections, while the emergence of digital libraries and other types of digital resources has opened up new opportunities for scholars in terms of accessing diverse types of information. Yet, our knowledge of the impact of these resources on the scholarly workflow beyond the stage of discovery remains limited; this paper argues for the importance of understanding user behavior and needs for building digital resources that have a positive effect on the whole scholarly workflow. By employing an ethnographic approach to the study of art historians’ habits we get a detailed view of the effect that digitization and digital resource design can have on scholars’ work, from the seeking of the information to the construction of the research argument. The complex information behavior of art historians and the challenges they often face when interacting with digital resources make them a great example to demonstrate the impact that these can have on the research process.", "article_title": "The impact of digitization and digital resource design on the scholarly workflow in art history", "authors": [{"given": "Christina", "family": "Kamposiori", "affiliation": ["University College London"]}, {"given": "Simon", "family": "Mahony", "affiliation": ["University College London"]}, {"given": "Claire", "family": "Warwick", "affiliation": ["Durham University"]}], "publisher": null, "date": "2020-02-25", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/67697", "identifier": {"string_id": "10.11588/dah.2019.4.67697", "id_scheme": "DOI"}, "abstract": "This essay explores the ways in which queer critical theory might be productively applied to digital art history and curatorial practice. Reflecting on a recent critically-acclaimed exhibition at the Williams College Museum of Art (WCMA), the author creates a theoretical framework of digital and aesthetic futurity that accords well with a curatorial exercise in visualizing queer affective networks on social media.", "article_title": "Queer criticalities", "authors": [{"given": "Horace D.", "family": "Ballard", "affiliation": ["Williams College Museum of Art"]}], "publisher": null, "date": "2019-11-04", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/66410", "identifier": {"string_id": "10.11588/dah.2019.4.66410", "id_scheme": "DOI"}, "abstract": "This speculative fiction narrates the experience of a virtual museum environment in the near future. The description extends current capabilities of linked data, visualization, and computational analytics while adding features of virtual and augmented reality. The essay takes a skeptical view of the increased spectacularization of cultural memory experience even as it explores the potential for enriched research, pedagogy, and public knowledge that emerging technological platforms may provide.", "article_title": "The Museum Opens", "authors": [{"given": "Johanna", "family": "Drucker", "affiliation": ["UCLA"]}], "publisher": null, "date": "2019-09-09", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}, {"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/75504", "identifier": {"string_id": "10.11588/dah.2020.5.75504", "id_scheme": "DOI"}, "abstract": "The multifaceted history of digital art has also entailed an evolution of understanding the complex relationships between the material and immaterial in the digital medium. This text traces the histories of digital objects and systems from the 1960s to the so-called ‘post-digital’ era, which finds its artistic expression in works shaped by digital technologies and networks, yet taking the material form of objects such as paintings, sculptures, or photographs. The term neomateriality is used here to capture an objecthood that reflects back the data of humans and the environment, or reveals the way in which digital processes perceive and shape our world. Digital materialities are considered in relation to network cultures and politics, as well as art institutions.", "article_title": "Digital Art Now", "authors": [{"given": "Christiane", "family": "Paul", "affiliation": ["Sheila C. Johnson Design Center", "School of Media Studies at The New School", "Whitney Museum of American Art"]}], "publisher": null, "date": "2020-09-04", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}]