{"url": "http://dx.doi.org/10.1093/llc/fqx056", "identifier": {"string_id": "10.1093/llc/fqx056", "id_scheme": "DOI"}, "abstract": "The question of translators’ stylistic visibility in translated texts has been a recurring theme in translation studies. Recently, the employment of state-of-the-art stylometric methods such as multivariate statistical analysis or machine learning techniques has enabled important progress to be made in exploring the problem. Nevertheless, studies are conflicting in their findings. Some find evidence of translators’ stylistic presence, while others fail to do so. The lack of agreement in the literature makes one suspect some contextual factors affecting the degree of translators’ visibility. The present study focuses on one such possible factor—language combinations involved in translation. It is hypothesized that the farther the two languages involved are structurally apart, the more likely it is for the translator’s style to gain visibility as the increased distance will allow the translator greater freedom to be creative with his or her choices. The present study applies bootstrap consensus tree analysis and consensus network analysis to 175 samples of contemporary literary translation in two language pairs—the intimate pair of French and English and the distant pair of Korean and English. The analysis supports the hypothesis by showing that the authors completely override their translators to claim authorship in the French group, while authorial presence is significantly diminished in the Korean group, resulting in greater visibility for some translators.", "article_title": "Do language combinations affect translators’ stylistic visibility in translated texts?", "authors": [{"given": " Changsoo", "family": "Lee", "affiliation": [{"original_name": "Hankuk University of Foreign Studies, Seoul, Republic of Korea", "normalized_name": "Hankuk University of Foreign Studies", "country": "South Korea", "identifiers": {"ror": "https://ror.org/051q2m369", "GRID": "grid.440932.8"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2017-11-07", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}