{"url": "http://dx.doi.org/10.16995/dscn.16", "identifier": {"string_id": "10.16995/dscn.16", "id_scheme": "DOI"}, "abstract": "The genre of the scholarly edition is diverse in its forms, but it generally involves a reproduction of original source material in the context of a scholarly apparatus consisting of annotations which add scholarly value to the text by explaining the editorial decisions made in a particular passage, drawing attention to an interesting place in the text, or linking sections of the facsimile with secondary scholarship. This scholarly apparatus acts as a contextualization of the primary material with which it is concerned. Instead of being embedded within the original material, these additions are placed in margins, footers, and appendices separate from but engaged with the material. In every case of a footnote, marginal note, or other part of a scholarly apparatus, we can say that something provided by the editor is a “body” associated with something else that acts as the “target” of the commentary. This association of “body” and “target” is the essence of Open Annotation, an emerging standard on the World Wide Web for associating Web content in this manner. This sense of annotation—of associating one piece of content with another for some express purpose—is the foundation of the Shared Canvas data model, which we present in this chapter as one approach to representing digital facsimile editions in an open, shareable form.", "article_title": "​Chapter 9Beyond accessibility: Using Shared Canvas in digital facsimile editions", "authors": [{"given": "James", "family": "Smith", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Raffaele", "family": "Viglianti", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Open Library of the Humanities", "date": "2017-10-19", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "6", "issue": null, "ISSN": [{"value": "1918-3666", "type": "electronic"}]}