{"url": "http://dx.doi.org/10.1353/dph.2016.0010", "identifier": {"string_id": "10.1353/dph.2016.0010", "id_scheme": "DOI"}, "abstract": "Manuscript 5366 of the Bibliothèque de l’Arsenal in Paris is a fifteenth-century miscellany written on paper that reproduces several religious texts in Middle French and two short fragments in Latin. The first group of texts—the Gospel of Nicodemus and La vengence Vaspasien (“The Revenge of Emperor Vespasian”, ff. 1r-86r)—is signed with the words: “Cest liure est a Nicole de Bretaigne qui le trouuera cy li rende et elle poyra bien le vin” (“This book belongs to Nicole de Bretaigne; she will pour a good quantity of wine for the finder who returns it”; Paris, Bibliothèque de l’Arsenal, MS 5366, f. 86r). This note is written in the same color ink as the preceding texts and in the same handwriting. Starting on the verso side of this leaf a slightly different hand, most likely a reader, has added three short fragments in French based on the Gospels. The thematic unity of these later additions suggests that they were the result of the spiritual needs and preferences of an owner of this manuscript, most likely a laywoman. Although the involvement of professional scribes cannot be ruled out entirely, this article will argue that one or several laypeople, most likely women, were responsible for the production of this manuscript.", "article_title": "Nicole de Bretaigne and a Fifteenth-Century Collection of Religious Texts in French: Paris, Bibliothèque de l’Arsenal, MS 5366", "authors": [{"given": "Margriet", "family": "Hoogvliet", "affiliation": [{"original_name": "University of Groningen", "normalized_name": "University of Groningen", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/012p63287", "GRID": "grid.4830.f"}}]}], "publisher": "Johns Hopkins University Press", "date": "2017-01-22", "keywords": null, "journal_title": "Digital Philology: A Journal of Medieval Cultures", "volume": "5", "issue": "2", "ISSN": [{"value": "2162-9552", "type": "electronic"}]}