{"identifier": {"string_id": "10.16995/dm.52", "id_scheme": "DOI"}, "abstract": "This article illustrates how mathematical and statistical tools designed to handle relational data may be useful to help decipher the most important features and defects of a large historical database and to gain knowledge about a corpus made of several thousand documents. Such a relational model is generally enough to address a wide variety of problems, including most databases containing relational tables. In mathematics, it is referred to as a network or a graph. The article's purpose is to emphasise how a relevant relational model of a historical corpus can serve as a theoretical framework which makes available automatic data mining methods designed for graphs. By such methods, for one thing, consistency checking can be performed so as to extract possible transcription errors or interpretation errors during the transcription automatically. Moreover, when the database is so large that a human being is unable to gain much knowledge by even an exhaustive manual exploration, relational data mining can help elucidate the database's main features. First, the macroscopic structure of the relations between entities can be emphasised with the help of network summaries automatically produced by classification methods. A complementary point of view is obtained via local summaries of the relation structure: a set of network-related indicators can be calculated for each entity, singling out, for instance, highly connected entities. Finally, visualisation methods dedicated to graphs can be used to give the user an intuitive understanding of the database. Additional information can be superimposed on such network visualisations, making it possible to intuitively link the relations between entities using attributes that describe each entity. This overall approach is here illustrated with a large corpus of medieval notarial acts, containing several thousand transactions and involving a comparable number of persons.", "article_title": "Exploration of a Large Database of French Notarial Acts with Social Network Methods", "authors": [{"given": "Fabrice", "family": "Rossi", "affiliation": [{"original_name": "SAMM, Université Paris 1", "normalized_name": "Paris 13 University", "country": "France", "identifiers": {"ror": "https://ror.org/0199hds37", "GRID": "grid.11318.3a"}}]}, {"given": "Nathalie", "family": "Villa-Vialaneix", "affiliation": [{"original_name": "SAMM, Université Paris 1", "normalized_name": "Paris 13 University", "country": "France", "identifiers": {"ror": "https://ror.org/0199hds37", "GRID": "grid.11318.3a"}}, {"original_name": "INRA, UR0875 MIA-T, Toulouse,", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Florent", "family": "Hautefeuille", "affiliation": [{"original_name": "TRACES, Université Toulouse 2", "normalized_name": "Paul Sabatier University", "country": "France", "identifiers": {"ror": "https://ror.org/02v6kpv12", "GRID": "grid.15781.3a"}}]}], "publisher": "Open Library of the Humanities", "date": "2017-05-31", "keywords": null, "journal_title": "Digital Medievalist", "volume": "9", "issue": null, "ISSN": [{"value": "1715-0736", "type": "electronic"}], "url": "http://dx.doi.org/10.16995/dm.52"}