{"url": "http://dx.doi.org/10.1093/llc/fqw063", "identifier": {"string_id": "10.1093/llc/fqw063", "id_scheme": "DOI"}, "abstract": "This article describes the research and development (R&D) work done as an extension to the multilingual cross-domain client application prototype for UNL-ization and NL-ization for natural language processing (NLP) application developed by Agarwal and Kumar (A multilingual cross-domain client application prototype for UNL-ization and NL-ization for NLP applications. Digital Scholarship in the Humanities, 2016)1. A common platform has been developed and made live for worldwide users where they can share their Interactive Analyzer and EUGENE (dEep-to-sUrface GENErator) resources and exploit already shared resources by other users for UNL-ization and NL-ization. This article also highlights that how the existing platform can be used by other researchers and developers to make their UNL-based Web applications language-independent and can make it available to computational linguists, researchers, developers, and general audience globally. Such kind of platform is definitely useful for all UNL-based R&D activities being done throughout the geography. The platform gives 100% accuracy. However, the correctness depends on the F-measure of the respective Analysis and Generation module being used.", "article_title": "A public platform for developing language-independent applications", "authors": [{"given": " Vaibhav", "family": "Agarwal", "affiliation": [{"original_name": "Thapar University, CSED, India", "normalized_name": "Thapar University", "country": "India", "identifiers": {"ror": "https://ror.org/00wdq3744", "GRID": "grid.412436.6"}}]}, {"given": " Parteek", "family": "Kumar", "affiliation": [{"original_name": "Thapar University, CSED, India", "normalized_name": "Thapar University", "country": "India", "identifiers": {"ror": "https://ror.org/00wdq3744", "GRID": "grid.412436.6"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2017-02-04", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}