{"url": "http://dx.doi.org/10.3389/fdigh.2017.00020", "identifier": {"string_id": "10.3389/fdigh.2017.00020", "id_scheme": "DOI"}, "abstract": "This article provides insights into aspects of tempo and rhythmic elaboration in Hindustani music, based on a study of a large corpus of recorded performances. Typical tempo developments and stress patterns within a metrical cycle are computed, which we refer to as tempo and rhythm patterns, respectively. Rhythm patterns are obtained by aggregating spectral features over metrical cycles. They reflect percussion patterns that are frequent in the corpus and enable a discussion of the relation between such patterns and the underlying metrical framework, the tāl. Tempo patterns, on the other hand, are computed using reference beat annotations. They document the dynamic development of tempo throughout a metrical cycle and reveal insights into the flexibility of time in Hindustani music for the first time using quantitative methods on a large set of performances. Focusing on aspects of tempo and rhythm, we demonstrate the value of a computational methodology for the analysis of large music corpora by revealing the range of tempi used in performances, intra-cycle tempo dynamics and percussion accents at different positions of the tāl cycle.", "article_title": "Aspects of Tempo and Rhythmic Elaboration in Hindustani Music: A Corpus Study", "authors": [{"given": "Ajay", "family": "Srinivasamurthy", "affiliation": [{"original_name": "Music Technology Group, Universitat Pompeu Fabra, Spain", "normalized_name": "Pompeu Fabra University", "country": "Spain", "identifiers": {"ror": "https://ror.org/04n0g0b29", "GRID": "grid.5612.0"}}]}, {"given": "Andre", "family": "Holzapfel", "affiliation": [{"original_name": "Media Technology and Interaction Design Department, KTH Royal Institute of Technology, Sweden", "normalized_name": "Royal Institute of Technology", "country": "Sweden", "identifiers": {"ror": "https://ror.org/026vcq606", "GRID": "grid.5037.1"}}]}, {"given": "Kaustuv Kanti", "family": "Ganguli", "affiliation": [{"original_name": "Department of Electrical Engineering, Indian Institute of Technology Bombay, India", "normalized_name": "Indian Institute of Technology Bombay", "country": "India", "identifiers": {"ror": "https://ror.org/02qyf5152", "GRID": "grid.417971.d"}}]}, {"given": "Xavier", "family": "Serra", "affiliation": [{"original_name": "Music Technology Group, Universitat Pompeu Fabra, Spain", "normalized_name": "Pompeu Fabra University", "country": "Spain", "identifiers": {"ror": "https://ror.org/04n0g0b29", "GRID": "grid.5612.0"}}]}], "publisher": "Frontiers Media SA", "date": "2017-10-31", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "4", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}