{"url": "http://dx.doi.org/10.3389/fdigh.2017.00021", "identifier": {"string_id": "10.3389/fdigh.2017.00021", "id_scheme": "DOI"}, "abstract": "Halal is a notion that applies to both objects and actions, and means permissible according to Islamic law. It may be most often associated with food and the rules of selecting, slaughtering, and cooking animals. In the globalized world, halal can be found in street corners of New York and beauty shops of Manila. In this study, we explore the cultural diversity of the concept, as revealed through social media, and specifically the way it is expressed by different populations around the world, and how it relates to their perception of (i) religious and (ii) governmental authority, and (iii) personal health. Here, we analyze two Instagram datasets, using Halal in Arabic (325,665 posts) and in English (1,004,445 posts), which provide a global view of major Muslim populations around the world. We find a great variety in the use of halal within Arabic, English, and Indonesian-speaking populations, with animal trade emphasized in first (making up 61% of the language’s stream), food in second (80%), and cosmetics and supplements in third (70%). The commercialization of the term halal is a powerful signal of its detraction from its traditional roots. We find a complex social engagement around posts mentioning religious terms, such that when a food-related post is accompanied by a religious term, it on average gets more likes in English and Indonesian, but not in Arabic, indicating a potential shift out of its traditional moral framing.", "article_title": "#Halal Culture on Instagram", "authors": [{"given": "Yelena", "family": "Mejova", "affiliation": [{"original_name": "Qatar Computing Research Institute, Hamad Bin Khalifa University, Qatar", "normalized_name": "Hamad bin Khalifa University", "country": "Qatar", "identifiers": {"ror": "https://ror.org/03eyq4y97", "GRID": "grid.452146.0"}}]}, {"given": "Youcef", "family": "Benkhedda", "affiliation": [{"original_name": "Ecole Nationale Supérieure d’Informatique, Algeria", "normalized_name": "École Nationale Supérieure d'Informatique", "country": "Algeria", "identifiers": {"ror": "https://ror.org/04dj1dn66", "GRID": "grid.442337.5"}}]}, {"given": "Khairani ", "family": "Khairani", "affiliation": [{"original_name": "Faculty of Economics and Business, Universitas Indonesia, Jakarta, Indonesia", "normalized_name": "University of Indonesia", "country": "Indonesia", "identifiers": {"ror": "https://ror.org/0116zj450", "GRID": "grid.9581.5"}}]}], "publisher": "Frontiers Media SA", "date": "2017-11-02", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "4", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}