{
    "doi:10.3366/ijhac.2012.0035": {
        "abstract": " As Taiwan was governed by several colonial powers in the past, many places of interest reflect the cultural influences during different periods of the nation's history. However, people may be unaware of the historical background when they visit such places, so they are unable to annotate their photographs with appropriate descriptions. Helping people find historical information about places of interest in a short time is therefore an important issue. In this paper, we propose a multifaceted photo summarisation approach that exploits a host of analytical techniques. The techniques include content-based image and colour analysis, as well as data mining techniques, which are used to annotate images with relevant information. The system also contains a user interface that provides users with an interactive recommendation method for image annotation, and helps them annotate their collections by suggesting several relevant annotation terms. The annotation database is integrated with related information obtained from the Taiwan e-Learning and Digital Archives Program in order to generate a relevant semantic snippet for each image. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0035",
        "url": "https://doi.org/10.3366/ijhac.2012.0035",
        "doi": "10.3366/ijhac.2012.0035",
        "year": "2012",
        "pages": "8-21",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Annotating photographs of places of interest in Taiwan – a multifaceted photo summarisation method based on TELDAP",
        "author": "Hsiao, Yu-Ting and Cheng, Chun-Yuan and Li, Cheng-Hung and Wang, Yu-Zheng and Wang, Hsiang-An",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0035"
    },
    "doi:10.3366/ijhac.2012.0036": {
        "abstract": " The Qing Imperial Court documents are a major source of primary research material for studying the Qing era China since they provide the most direct and first-hand details of how national affairs were handled. However, the way Qing archived these documents has made it cumbersome to collect documents covering the same event and rebuild their original contexts. In this paper, we describe some information technology that we have developed to discover two important and useful relations among these documents. The first is the citation relation among the Imperial Edicts and the Memorials. We discovered 6,801 pairs from the 37,831 Taiwan-related Imperial Court documents in the Taiwan History Digital Library (THDL) and produced 1,101 graphs of successive citations, which we call IE-M diagrams. The second relation is a template relation, which indicates groups of documents that were created following a specific format. Numerical data can also be tabulated from these documents and be used for further analysis. Our studies show how information technology can be used to discover useful contexts from seemingly unrelated historical documents. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0036",
        "url": "https://doi.org/10.3366/ijhac.2012.0036",
        "doi": "10.3366/ijhac.2012.0036",
        "year": "2012",
        "pages": "22-41",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Discovering relationships from imperial court documents of Qing China",
        "author": "Hsiang, Jieh and Chen, Shih-Pei and Ho, Hou-Ieong and Tu, Hsieh-Chang",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0036"
    },
    "doi:10.3366/ijhac.2012.0037": {
        "abstract": " In Europe, Japanese ceramic and lacquer objects have been collected and used as interior decoration since the early seventeenth century. In the nineteenth century, the worldwide fashion for Japonisme generated an extensive trade in various Japanese decorative arts. Consequently, museums and private collections all over the world have rich holdings of Japanese decorative arts. Despite their popularity and profound influence on Western applied arts, the systematic research of Japanese decorative arts in Western collections is backward compared to the investigation of other art forms. It is actually difficult to gain access to the objects scattered in numerous collections or to achieve high-quality images, not to mention that there are only a few specialists capable of documenting the objects. Generally, that is why there are only very few online databases dedicated to decorative arts. The Art Research Centre, Ritsumeikan University (Kyoto, Japan), has developed databases of various Japanese cultural assets, tangible as well as intangible art forms and, based on the expertise in developing scholarly databases, has launched online image databases of three-dimensional art objects. The purpose of the project is to advance searchable, academic databases and to foster international cooperation between researchers and students of Japanese art by sharing high-quality images on the Web. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0037",
        "url": "https://doi.org/10.3366/ijhac.2012.0037",
        "doi": "10.3366/ijhac.2012.0037",
        "year": "2012",
        "pages": "42-56",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Digital archive project to catalogue exported Japanese decorative arts",
        "author": "Bincsik, Monika and Maezaki, Shinya and Hattori, Kenji",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0037"
    },
    "doi:10.3366/ijhac.2012.0038": {
        "abstract": " In this study we illustrate how data sets, defined and set up independently in digital archive projects, can be linked to mutually enrich each other. The data linked are the digital tombstone archive ThakBong and the visionary use of the 1956 census by Chen and Fried1, published in 1968 as ‘The Distribution of Family Names in Taiwan’. We explain, through which assumptions the dimensions of the two data sets can be mapped, so that values missing in one set can be completed by the second or, estimated values can be replaced by more reliable values. Conflicting values in both set trigger hypotheses concerning the validity of the data sets. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0038",
        "url": "https://doi.org/10.3366/ijhac.2012.0038",
        "doi": "10.3366/ijhac.2012.0038",
        "year": "2012",
        "pages": "57-70",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Matching digital tombstone documentation to unearthed census data: surveying Taiwan's family names, ethnicities and homelands",
        "author": "Streiter, Oliver and Goudin, Yoann and Huang, Chun (Jimmy) and Lin, Ann Meifang",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0038"
    },
    "doi:10.3366/ijhac.2012.0039": {
        "abstract": " This article introduces a case of across sectors partnerships related to the digitalisation of the industrial heritage in Taiwan. With common values and endeavors on the part of personnel, the National Science and Technology Museum and Chunghwa Telecom Company are cooperating to preserve and digitalise telecom artifacts and relevant historical materials. The results of this partnership are plentiful, and include: digitalisation and interpretation of the telecom heritage, establishment of a digital database, a variety of digital content applications, such as: websites, physical exhibitions, publications, cultural goods, etc. Key successful factors related to this partnership are also listed. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0039",
        "url": "https://doi.org/10.3366/ijhac.2012.0039",
        "doi": "10.3366/ijhac.2012.0039",
        "year": "2012",
        "pages": "71-86",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Partnership on digitalisation of industrial heritage: a case of telecommunications artifacts and historical materials in Taiwan",
        "author": "Yeh, Shang-Ching",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0039"
    },
    "doi:10.3366/ijhac.2012.0040": {
        "abstract": " This paper presents a unified content and service digital museum (UCSDM) concept model to depict the issues of unifying global content, services and users and connecting numerous value-added applications in both virtual and physical spaces to meet the needs of individuals and target groups from a global and long-term perspective. A unified content and service management system framework, which comprises the unified content and processes, unified content and services structures, and a unified content and service management system to fulfil the UCSDM concept model is proposed. A practical implementation of a large-scale digital museum project that includes virtual and physical content, services, and users of a natural science museum has been successfully implemented to demonstrate the feasibility of the proposed framework. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0040",
        "url": "https://doi.org/10.3366/ijhac.2012.0040",
        "doi": "10.3366/ijhac.2012.0040",
        "year": "2012",
        "pages": "87-99",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "A unified content and service management model for digital museums",
        "author": "Hsu, Tien-Yu",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0040"
    },
    "doi:10.3366/ijhac.2012.0041": {
        "abstract": " This paper offers an overview of the Library of Congress Geography and Map Division and its efforts to digitise the collection. The number of hard copy maps is huge: over 5.5 million, most of them un-catalogued. New maps continue to be added to the collection, some in new, digital formats. The Library of Congress has been in the forefront of developing digital collections and providing digital access to its collections via the Internet. The Library's American Memory collection is described here, from its origins in the 1980s to its current format. American Memory's access to the Geography and Map collections is profiled, with features of the digital collection presented in detail. American Memory is constantly undergoing revision. The Geography and Map division currently features collections highlighting the American Civil War, Liberia, the Revolutionary war, early railroad maps, the Louisiana Purchase, and U.S. National Parks. The wealth of information contained in the map collection makes these digitisation efforts worthwhile even though only a small percentage of the total items can be posted online. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0041",
        "url": "https://doi.org/10.3366/ijhac.2012.0041",
        "doi": "10.3366/ijhac.2012.0041",
        "year": "2012",
        "pages": "100-110",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "From Washington to the world: maps and digital archives at the Library of Congress",
        "author": "Zhang, Min",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0041"
    },
    "doi:10.3366/ijhac.2012.0042": {
        "abstract": " Logistically, the data associated with biological collections can be divided into three main categories for digitisation: i) Label Data: the data appearing on the specimen on a label or annotation; ii) Curatorial Data: the data appearing on containers, boxes, cabinets and folders which hold the collections; iii) Supplementary Data: the data held separately from the collections in indices, archives and literature. Each of these categories of data have fundamentally different properties within the digitisation framework which have implications for the data capture process. These properties were assessed in relation to alternative data entry workflows and methodologies to create a more efficient and accurate system of data capture. We see a clear benefit in the prioritisation of curatorial data in the data capture process. These data are often only available at the cabinets, they are in a format suitable for allowing rapid data entry, and they result in an accurate cataloguing of the collections. Finally, the capture of a high resolution digital image enables additional data entry to be separated into multiple sweeps, and optical character recognition (OCR) software can be used to facilitate sorting images for fuller data entry, and giving potential for more automated data entry in the future. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0042",
        "url": "https://doi.org/10.3366/ijhac.2012.0042",
        "doi": "10.3366/ijhac.2012.0042",
        "year": "2012",
        "pages": "111-119",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Data concepts and their relevance for data capture in large scale digitisation of biological collections",
        "author": "Haston, Elspeth and Cubey, Robert and Harris, David J.",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0042"
    },
    "doi:10.3366/ijhac.2012.0043": {
        "abstract": " This article introduces an electronic records preservation mechanism designed by the National Archives Administration (NAA) for use by Taiwan's governmental agencies. This mechanism is based on migration technologies using encapsulated XML files as the preservation units. NAA implemented a pilot programme in 2004 to test the feasibility of an electronic records preservation software system. Based on the results, NAA started in 2006 to draft management regulations for governmental agencies related to the preservation of electronic records. In April 2011 NAA launched an Electronic Records Technical Service Center to provide consultation to record managers about preservation technologies. Under the service center, NAA also established an electronic records preservation laboratory, responsible for developing tools to enhance electronic records preservation capabilities for governmental agencies. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0043",
        "url": "https://doi.org/10.3366/ijhac.2012.0043",
        "doi": "10.3366/ijhac.2012.0043",
        "year": "2012",
        "pages": "120-132",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "An electronic records preservation mechanism for Taiwan's governmental agencies",
        "author": "Chang, Wen-Hsi",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0043"
    },
    "doi:10.3366/ijhac.2012.0044": {
        "abstract": " This paper provides an overview of a case study research that investigated the use of Digital Library (DL) resources in two undergraduate classes and explored faculty and students' perceptions of educational digital libraries. This study found that students and faculty use academic DLs primarily for textual resources, but turn to the open Web for visual and multimedia resources. The study participants did not perceive academic libraries as a useful source of digital images and used search engines when searching for visual resources. The limited use of digital library resources for teaching and learning is associated with perceptions of usefulness and ease of use, especially if considered in a broader information landscape, in conjunction with other library information systems, and in the context of Web resources. The limited use of digital libraries is related to the following perceptions: 1) Library systems are not viewed as user-friendly, which in turn discourages potential users from trying DLs provided by academic libraries; 2) Academic libraries are perceived as places of primarily textual resources; perceptions of usefulness, especially in regard to relevance of content, coverage, and currency, seem to have a negative effect on user intention to use DLs, especially when searching for visual materials. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0044",
        "url": "https://doi.org/10.3366/ijhac.2012.0044",
        "doi": "10.3366/ijhac.2012.0044",
        "year": "2012",
        "pages": "133-147",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Perceptions of usability and usefulness of digital libraries",
        "author": "Matusiak, Krystyna K.",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0044"
    },
    "doi:10.3366/ijhac.2012.0045": {
        "abstract": " Museums need an interactive data collection and visualisation tool for their artefacts. This paper describes a study in which we enable access to Chinese and Japanese cultural heritage information from two history museums, the National Palace Museum in Taiwan and the Tokugawa Art Museum in Japan. Results from these museum databases were used to develop a prototype system to demonstrate advanced cultural learning and historical timeline functionalities for foreigners. This system is based on temporal data from the museums’ databases, and provided the user with powerful data manipulation and graphical visualisation tools. It might become a basis of an interactive digital museum system for Chinese and Japanese heritages especially for foreign users. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0045",
        "url": "https://doi.org/10.3366/ijhac.2012.0045",
        "doi": "10.3366/ijhac.2012.0045",
        "year": "2012",
        "pages": "148-159",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "A museum exhibits support system based on history and culture literacy",
        "author": "Chen, Yu-Lin and Lai, Ting-Sheng and Yasuda, Takami and Yokoi, Shigeki",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0045"
    },
    "doi:10.3366/ijhac.2012.0046": {
        "abstract": " In the development of young children's senses and action mobility, good visual cognition could help them with good habits of reading, writing, and logical learning. Digital teaching materials are common in use of enhancing the creativity and learning effects. Within them, the interacting manners and their influences on learning effects and learning attitudes lead to enhance the learning motivations and effects. The fun of game maintains a longer learning attention and advances the cognitive skills in easy manners. Thus, this study intends to design a learning system – GoGoBox – by using augmented virtual technology. The methodology is to device a testing game, pre-test and after-test, to test a group of young children so as to understand the learning effects of augmented virtual game of GoGoBox on their visual cognitive skills. The esult of this study is: this learning system – GoGoBox can enhance the young children's cognitive skills. Furthermore, after experiencing this learning system, children's cognitive capability of visual discerning, figure and background, visual memory, and visual closure is all enhanced. The learning effects of visual discerning stand out of four. The capability of special relationship is with no apparent influences. There is no differentiation between male and female. Apparently the older children of 6 have better cognitive skills than those of 5. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0046",
        "url": "https://doi.org/10.3366/ijhac.2012.0046",
        "doi": "10.3366/ijhac.2012.0046",
        "year": "2012",
        "pages": "160-171",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Influences on children's visual cognition capabilities through playing ‘intelligent matrix’ developed by the augmented virtual reality technology",
        "author": "Ho, Pei-Chi and Chung, Szu-Ming and Lin, Yi-Hua",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0046"
    },
    "doi:10.3366/ijhac.2012.0047": {
        "abstract": " The current study proposes a computer-assisted instruction (CAI) system built on game design, which aims to increase students' enjoyment, motivation, and immersion. Its main objective is to evaluate the effects of CAI with different interactive interfaces in a learning environment. The authors developed an educational game with a vision-based interface and a keyboard/mouse to compare the differences in children's learning experiences when using different input interfaces. The evaluation of the proposed system was based on the questionnaire findings; the participants are 60 third- and fourth-grade students in Taiwan. The authors addressed the issue of the participants' experience in gender and personal preferences for computer games. Through the questionnaire and data analysis, this study found that a vision-based interface not only attracts the interest of children, but also stimulates their learning motivation. The findings have highlighted the value of the present CAI system with a vision-based interface and confirmed an improvement in learning motivation. Classroom observation indicates that the introduction of a CAI system with a novel interface can be a useful tool for enhancing classroom learning activities. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0047",
        "url": "https://doi.org/10.3366/ijhac.2012.0047",
        "doi": "10.3366/ijhac.2012.0047",
        "year": "2012",
        "pages": "172-183",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "A computer-assisted instruction system with a vision-based interactive interface for children",
        "author": "Wang, Hsueh-Wu and Wu, Wei-Hsien and Lu, Su-Ju and Fan, Ping-Lin and Lo, Ya-Ting",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0047"
    },
    "doi:10.3366/ijhac.2012.0048": {
        "abstract": " To realise the of promotion and sustainable development for the digital archives programme, the National Museum of Natural Science (NMNS) developed a game-based learning website for children with knowledgeable, storytelling, explorative learning, joyful and personalised characteristics. This website applied design principles including interdisciplinary island maps for exploration, theme-based design with learning content and games, multi-user interactive learning environments, good use of digital archives knowledge repositories, supporting school teaching and learning and personalised membership service. Some game factors were also infused into the website including curiosity, fantasy, self value, challenge, sense of control, exploring experience, sense of achievement, competitiveness, interpersonal interaction and virtual socialisation. An evaluation result indicates that the game-based learning website can inspire learning motivation and enhance learning effectiveness for children. In the near future a virtual-and-physical blended learning service model will be delivered to children by creating personalised and collaborative learning services across onsite and online spaces. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0048",
        "url": "https://doi.org/10.3366/ijhac.2012.0048",
        "doi": "10.3366/ijhac.2012.0048",
        "year": "2012",
        "pages": "184-203",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Constructing a gamed-based learning website for children",
        "author": "Hsu, Tien-Yu",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0048"
    },
    "doi:10.3366/ijhac.2012.0049": {
        "abstract": " This study explores the possibility of using musicals to teach English with instructional VCD for following practice, and investigates whether it helps social economically disadvantaged aboriginal students overcome their difficulties with English and enhance their learning motivation. A series of surveys and interviews were conducted to investigate the influence of this intervention. The results showed that about 90 per cent of responded students in the intervention group considered learning English through musical interesting and it helped them to be more confident in English. About 80 per cent of students indicated that they would actively practice English through ways such as imitating singers to sing an English song. About 60 per cent of students felt more comfortable speaking English loudly and were less afraid of talking to others in English. Further comparison show that there was a significant difference between students who participated (n=39) and who didn't participate (n=15) in the English musical programme. Only about 60 per cent of those in the control group would actively learn English. Being unaware of the English musical programme, only half of the students considered learning English through acting interesting. The results of this exploratory study show musicals can provide the opportunity for the students to use language meaningfully and appropriately. The use of drama activities in second language learning helps the learners to be more imaginative, creative and less frustrated as they become more confident in the process of learning English as a second language. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0049",
        "url": "https://doi.org/10.3366/ijhac.2012.0049",
        "doi": "10.3366/ijhac.2012.0049",
        "year": "2012",
        "pages": "204-210",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Learning english through musicals: a case study of social economically disadvantaged aboriginal students in Eastern Taiwan",
        "author": "Lei, Lih-Wei and Huang, Cheng-Fang",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0049"
    },
    "doi:10.3366/ijhac.2012.0050": {
        "abstract": " ALA-accredited programs for Master of Library and Information Studies, are offered only in 63 of the total 3000 colleges and universities in the United States and Canada. The professional goals and objectives of the current 2008 Accreditation Standards are highlighted and applied to both traditional on-campus and the newly created eLearning courses for the MLS/MLIS programs. Factors for establishing the MLS eLearning program at SCSU and the methods for quality control and assessment of the MLS online courses are explained. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0050",
        "url": "https://doi.org/10.3366/ijhac.2012.0050",
        "doi": "10.3366/ijhac.2012.0050",
        "year": "2012",
        "pages": "211-223",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "The establishment of an e-learning program for the master of library science degree at Southern Connecticut State University – case analysis",
        "author": "Sche, Josephine Yu Chen",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0050"
    },
    "doi:10.3366/ijhac.2012.0051": {
        "abstract": " Developments in technological tools happen every day. Developments in the publication of e-Books and production of e-readers also are happening daily. Currently, young people who live in highly technological areas are exposed to books not only through an adult's reading, but also by independently accessing e-Books which are available on the internet or on CD-ROMs. These multimedia tools usually provide assistance in oral reading, written text, oral discourse, music, sound effects, and animations1. The main purpose of this study was to investigate the influence of integrating e-Books into elementary school science and technology classes on students' learning effectiveness. This study employed nonequivalent group pre-test/post-test quasi-experimental design which consisted of conducting learning activities for 20 minutes a period, three periods a week, for a total of six weeks. In this study, there were 60 elementary sixth-grade students who were equally divided into an experimental group and a control group. The experiment design applied an e-Book Learning method for the experimental group and a Paper-Based Learning method for the control group, respectively. The instruments of this study consisted of three scales: (1) learning motivation scale, (2) learning attitude scale, and (3) learning effectiveness scale. After the experimental instruction, the data were analysed using seven different statistical methods: a Pearson correlation analysis, canonical correlation analysis, one-way MANCOVA, one-way MANOVA, one-way ANCOVA, path analysis, t-test, and paired t-test. These statistical methods enabled us to reach four conclusions: (1) There was no significant difference in learning effectiveness of e-Books integrated instruction between students of different sexes; (2) There was significant correlation between learning motivation and learning effectiveness of science and technology domain for the experimental group students; (3) There was significant correlation between learning attitudes and learning effectiveness in the science and technology domain for the experimental group students; (4) The experimental group students had a positive attitude toward e-Books integrated instruction. They thought the use of e-Books could enhance learning effectiveness and improve learning motivation. ",
        "eprint": "https://doi.org/10.3366/ijhac.2012.0051",
        "url": "https://doi.org/10.3366/ijhac.2012.0051",
        "doi": "10.3366/ijhac.2012.0051",
        "year": "2012",
        "pages": "224-235",
        "number": "1-2",
        "volume": "6",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "The learning effectiveness of integrating e-books into elementary school science and technology classes",
        "author": "Wen, Jia-Rong and Chuang, Ming Kuang and Kuo, Sheng-Huang",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2012.0051"
    },
    "doi:10.3366/ijhac.2013.0057": {
        "abstract": " This paper briefly describes examples of large-scale digital projects in three areas of humanistic study: Classical, Medieval and Renaissance and Early Modern studies. The projects illustrate the ways in which the application of technology and new divisions of labour among institutions and individuals affect the deployment and creative use of primary sources in these three fields. The paper then highlights some of the larger implications of these projects for scholarly communications, particularly in the requirements for systems of data curation in the humanities, particular forms of publication, and new kinds of infrastructure. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0057",
        "url": "https://doi.org/10.3366/ijhac.2013.0057",
        "doi": "10.3366/ijhac.2013.0057",
        "year": "2013",
        "pages": "13-28",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Digital Humanities and the Changing Ecology of Scholarly Communications",
        "author": "Waters, Donald J.",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0057"
    },
    "doi:10.3366/ijhac.2013.0058": {
        "abstract": " The European amount of digitized material is growing very rapidly, as national, regional and European programmes support the digitization processes by museums, libraries, archives, archaeological sites, and audiovisual repositories. The generation of digital cultural heritage is accelerated also by the impulse of Europeana that is fostering the European cultural institutions to produce even more digital content. Moreover digital cultural heritage content are complex and interlinked through many relations. European countries are working for the future, in order to create a data infrastructure devoted to cultural heritage research. Currently, Europe have twin projects (DC-NET and INDICATE) ongoing and a new international coordination action is under preparation to design a validated roadmap for the preservation of digital cultural content. These initiatives are contributing to smooth the way to the Open Science Infrastructure for Digital Cultural Heritage, which is foreseen in 2020. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0058",
        "url": "https://doi.org/10.3366/ijhac.2013.0058",
        "doi": "10.3366/ijhac.2013.0058",
        "year": "2013",
        "pages": "29-46",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "A Data Infrastructure for Digital Cultural Heritage: Characteristics, Requirements and Priority Services",
        "author": "Fresa, Antonella",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0058"
    },
    "doi:10.3366/ijhac.2013.0059": {
        "abstract": " DARIAH (Digital Research Infrastructure for the Arts and Humanities) is part of the European Strategy on Research Infrastructures. Among 38 projects originally on this roadmap, DARIAH is one of two projects addressing social sciences and humanities. According to its self-conception and its political mandate DARIAH has the mission to enhance and support digitally-enabled research across the humanities and arts. DARIAH aims to develop and maintain an infrastructure in support of ICT-based research practices. One main distinguishing aspect of DARIAH is that it is not focusing on one application domain but especially addresses the support of interdisciplinary research in the humanities and arts. The present paper first gives an overview on DARIAH as a whole and then focuses on the important aspect of technical, syntactic and semantic interoperability. Important aspects in this respect are metadata registries and crosswalk definitions allowing for meaningful cross-collection and inter-collection services and analysis. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0059",
        "url": "https://doi.org/10.3366/ijhac.2013.0059",
        "doi": "10.3366/ijhac.2013.0059",
        "year": "2013",
        "pages": "47-58",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "DARIAH(-DE): Digital Research Infrastructure for the Arts and Humanities — Concepts and Perspectives",
        "author": "Henrich, Andreas and Gradl, Tobias",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0059"
    },
    "doi:10.3366/ijhac.2013.0060": {
        "abstract": " This paper will explore potential roles for libraries in support of data-intensive research and inquiry. Scholars and researchers from many disciplines are using vast amounts of data to advance our understanding of both the physical nature of our world and its place in the universe, as well as to gain new insights into the behaviours of societies and individuals. Humanists are rapidly integrating newly digitised corpora, digital representations of material culture and spatial and temporal indexed data into their scholarly endeavours. Libraries have undergone significant transformation over the past several decades in confronting the “digital deluge” and integrating digital content into their holdings. However assuming additional responsibilities for managing and making large and complex data sets available and providing new tools for users presents significant challenges given limited resources. This paper examines data-intensive scholarship and suggest viable roles for libraries. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0060",
        "url": "https://doi.org/10.3366/ijhac.2013.0060",
        "doi": "10.3366/ijhac.2013.0060",
        "year": "2013",
        "pages": "59-71",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "New Roles for Libraries in Supporting Data-Intensive Research and Advancing Scholarly Communication",
        "author": "Griffin, Stephen",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0060"
    },
    "doi:10.3366/ijhac.2013.0061": {
        "abstract": " Archives, being original records of all human activities, provide first-hand sources for historical research. However, due to the geographic location of Taiwan and its political vicissitudes, many of these primary records and valuable resources of Taiwan history have been drained with human relocation to overseas and remained in foreign countries. In 2007, the ‘International Collaboration of Taiwan Historical Resources Acquisition Project’ was launched, aiming to collect and acquire precious historical materials scattered overseas with digital archiving strategies and value-added approaches. Taking into consideration the constraints of time and distance, the project focused first in acquiring historical resources of the Qing Dynasty and Japanese Era, while at the same time continued the ongoing practice of the Institute of Taiwan History in collecting and obtaining historical materials from the greater society. In the past five years, precious sources and data have been gathered through the international academic network. The achievements include acquisition of historical images of Taiwan, personal documents, official records etc. and authorization for online publication of historical materials. As seen in the above, the Institute of Taiwan History, Academia Sinica has by now successfully accumulated rich experiences in digitising archival materials and gained fruitful achievement over the years. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0061",
        "url": "https://doi.org/10.3366/ijhac.2013.0061",
        "doi": "10.3366/ijhac.2013.0061",
        "year": "2013",
        "pages": "72-83",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Strategies and Achievements of Overseas Taiwanese Archives Acquisition",
        "author": "Hsu, Hsueh-chi",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0061"
    },
    "doi:10.3366/ijhac.2013.0062": {
        "abstract": " In this paper, we present a member-centred virtual and physical unification digital museum (MVPU-DM) service framework for the construction of a holistic, practical and sustainable service model based on the unification of content, service and member resources from both virtual and physical spaces. This model can be applied to provide benefits and personalisation services for loyal members and to strengthen the promotion and marketing performance of museums. This member-centred virtual framework consists of three layers: the unified resource management, member-centred service linkage and personalisation service, and the member-oriented virtual/physical hybrid service layers. A practical case of such a digital museum project in the National Museum of Natural Science, Taiwan is presented to demonstrate the concrete feasibility of the proposed framework. The sustainability issues and gap analysis are also discussed in this research. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0062",
        "url": "https://doi.org/10.3366/ijhac.2013.0062",
        "doi": "10.3366/ijhac.2013.0062",
        "year": "2013",
        "pages": "84-99",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "A Digital Museum Framework Based on a Member-Centred Virtual-and-Physical Unification Service Model",
        "author": "Hsu, Tien-Yu",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0062"
    },
    "doi:10.3366/ijhac.2013.0063": {
        "abstract": " Distinguished anthropologist Michael Moerman's donation of his ethnographic fieldwork materials in 2005 to the Anthropological Archives of the Princess Maha Chakri Sirindhorn Anthropology Centre (SAC) posed new and compelling questions to the SAC's archival management staff. They have sought to strike a balance between the academic needs of users and the ethical and legal considerations in the management and distribution of tangible and intangible cultural property from the source communities where Moerman did his research. Endeavouring to develop a protocol for the management of an ethnographic archival database, the SAC is aware of its obligation to build awareness of the cultural rights of the source community as the rightful owners of this cultural property. By incorporating the views of multiple stakeholders in a previously binary division of materials as ‘sensitive’ or ‘non-sensitive’, it is trying to take into account a diversity of views about access to these cultural materials. One aim of our research was, thus, to highlight the role of the archivists themselves by asking them to review and question their own processes and contributions to the management of anthropological archives. We expect that the conclusions and observations drawn from this study will be used to create a SAC protocol for cultural information management and distribution. Though the Tai Lue source community that Moerman studied in the 1960s does not have a pre-existing cultural protocol to determine the parameters surrounding digital repatriation and access, the community's opinions and reflections will be fully considered in the creation of the SAC protocol for use as an initial guideline. Thus, the second aim of our research was to elicit and examine the community's reactions to ethnographic material deriving from it, in order to highlight the issue of a community's collective right to be involved in preservation of and access to such material. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0063",
        "url": "https://doi.org/10.3366/ijhac.2013.0063",
        "doi": "10.3366/ijhac.2013.0063",
        "year": "2013",
        "pages": "100-110",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Ethics, Access, and Rights in Anthropological Archive Management: A Case Study from Thailand",
        "author": "Sookprasert, Thanwadee and Rungcharoensuksri, Sittisak",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0063"
    },
    "doi:10.3366/ijhac.2013.0064": {
        "abstract": " We have developed a software platform for converting the Chinese classics into a digital format which the original layout is preserved. This method of conversion allows those that are not experts in classical Chinese literature, even those that do not understand Chinese, to partake in the proof-reading process. Since this kind of application involves complicated manipulation of 2D graphics, in the past, we have no choice but writing a native desktop program, with the introduction of CANVAS tag to the HTML 5 standards, we are able to move our code from desktop to browser without any plug-in or JAVA applet. The cost of cross-platform development and maintenance is greatly reduced. In order to clarify the various elements involved in the conversion and proof-reading process, we will use Duan Yu Cai's compilation of the Shuowen Jiezi1 as an example throughout this paper. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0064",
        "url": "https://doi.org/10.3366/ijhac.2013.0064",
        "doi": "10.3366/ijhac.2013.0064",
        "year": "2013",
        "pages": "111-119",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Preserving the Original Layout of Ancient Chinese Texts Using HTML5: Using Shuowen Jiezi as an Example",
        "author": "Yap, Cheah-Shen and McIlwaine, Ian",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0064"
    },
    "doi:10.3366/ijhac.2013.0065": {
        "abstract": " This paper tackles the question of the rise and the use of the tánghào , a mythological placename, on Taiwan's tombstones. This type of placename started to be used during the Japanese colonisation of Taiwan (1895–1945) and replaced placenames, that referred to regions where migration to Taiwan had started generations ago. The questions raised by the tánghào concern its function and meaning in a constantly renegotiated and redefined society. Why was a mythological placename adopted and how could this placename survive changes in regimes and burial practices? The framework we adopt for our analysis is that of Digital Anthropology (DA), using an archive of approximately 35.000 digitised tombstones plus digitised segments of statal discourse. The first puzzle parts of this investigation hint to an extremely diversified, non-orchestrated onset of the new practice. Later, the tánghào was instrumented for nationalist ROC ideologies and fully implemented into burial practices by new professionals, who sell the tánghào as the “right way to do”. The involvement of the ROC state in this propagation of the tánghào can be traced back through character variants that spilled over from offical documents onto tombstone inscriptions. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0065",
        "url": "https://doi.org/10.3366/ijhac.2013.0065",
        "doi": "10.3366/ijhac.2013.0065",
        "year": "2013",
        "pages": "120-143",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Tackling the Question of Tanghao on Taiwan's Tombstones in the Framework of Digital Anthropology",
        "author": "Streiter, Oliver and Goudin, Yoann",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0065"
    },
    "doi:10.3366/ijhac.2013.0066": {
        "abstract": " Traditional Chinese characters are currently used in Taiwan (Republic of China), Hong Kong and Macau. They maintain the original form of the Chinese characters, which have great aesthetic value. When printing, removable types are used, which are cased according to ‘script matrices.’ Script matrices are sculptured based on handwritten Chinese characters, and present the beauty of Chinese characters. The ‘Fengxing’ and ‘Rixing’ matrices are the only two remaining regular Chinese script matrices in all of Taiwan; they are a testament to the history Taiwan's printing industry. To preserve the ‘Fengxing’ matrices, with a total number of 3,780, we first recast the lead types from those matrices held at the National Science and Technology Museum (NSTM) by the Type-Casting Machine at the Rixing Type Foundries. The fonts of the lead types were printed by the Typographic Printing Press. The lead type, matrix and font from a regular traditional Chinese script were collated and then digitised by digital camera, another process used for their preservation. The lead types, matrices and digitalised copies were then stored and preserved in the NSTM. After the ‘Fengxing’ and ‘Rixing’ fonts will have been compared and analyzed, they will be combined, and a regular font for all commonly used Chinese characters (as designated by the Ministry of Education) will thereby be created. In this way, we will functionally preserve regular traditional Chinese type script and will give this representative script a new life in the digital age. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0066",
        "url": "https://doi.org/10.3366/ijhac.2013.0066",
        "doi": "10.3366/ijhac.2013.0066",
        "year": "2013",
        "pages": "144-155",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "The Preservation and Digitalisation of Matrices of Regular Traditional Chinese Script and Related Fonts",
        "author": "Huang, Jun-Fu and Yeh, Shang-Ching and Tseng, Chi-Shu",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0066"
    },
    "doi:10.3366/ijhac.2013.0067": {
        "abstract": " ICOMOS emphasised in the 2008 Québec Declaration that the ‘Spirit of Place,’ possessed by monuments and sites, must be preserved, the idea spread and promoted, and that digital technology should be extensively utilised. Xuejia Tzu-chi Temple in Taiwan, an ancestral temple that inherited the traditional belief of Bao Sheng Da Di (, God of medicine) from Baijiao , holds much religious significance and is crucial to the residents' spiritual sustenance and community. Among those objects preserved in this temple are the intricate Ye Wang's Koji potteries as well as various other precious cultural relics, making the palace an important research base for Taiwan's traditional arts. As such, religion, society, art and other elements coalesce to form the unique spirit of place of the Tzu-chi Temple. This study, under the principle of continuity in space, focuses on the temple square, corridors spanning different areas, the pantheon, and uses ‘image-based interactive panoramic imaging technology’ to capture a total of 45 spatial scenes, recording the overall spatial construct and the paths within which the space could move, completing the spirit of space of the object, and recording the track of space. Then setting this as the basis for establishing a recording of various activities of the humanities and for preserving the spirit of place of the Xuejia Tzu-chi Temple for future generations, we hope that the results of this study will provide various relevant types of digital recording for research on spatial construct in monuments. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0067",
        "url": "https://doi.org/10.3366/ijhac.2013.0067",
        "doi": "10.3366/ijhac.2013.0067",
        "year": "2013",
        "pages": "156-171",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "The Use of Digital Images Recording Historical Sites and ‘Spirit of Place’: A Case Study of Xuejia Tzu-chi Temple",
        "author": "Tseng, Yung-Kuan and Chen, Hong-Kun and Hsu, Pi-Yen",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0067"
    },
    "doi:10.3366/ijhac.2013.0068": {
        "abstract": " This article introduces a website, Industrial Heritage in Taiwan (IHT), which integrates various digital resources of industrial heritage including artifacts, photos and files for the use of the general public. The authors illustrate the website's stages of establishment and features of this website, including an access channel for the general public and database/back office system. Though there is room for the website to improve, this case shows a successful attempt to virtually integrate various digital resources of Taiwan's industrial heritage. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0068",
        "url": "https://doi.org/10.3366/ijhac.2013.0068",
        "doi": "10.3366/ijhac.2013.0068",
        "year": "2013",
        "pages": "172-188",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "The Virtual Integration of Industrial Heritage Resources: an Example of an ‘Industrial Heritage in Taiwan’ Website",
        "author": "Yeh, Shang-Ching and Huang, Jun-Fu",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0068"
    },
    "doi:10.3366/ijhac.2013.0069": {
        "abstract": " The unique colour representation of Oriental art work distinguishes itself from what has been seen in Western art work. Not only the traditional Oriental watercolour paintings but also the ancient Chinese porcelains show a great deal of interesting colours that have been archived by digital camera in digital archive practice. However, the majority of the current digital cameras operate with RGB filters, which record every pixel in a tri-chromatic manner. There are several limitations for such a tri-chromatic camera. One is that it describes the colour of the object only by three primary colours. Another is that the image captured is strongly influenced by the illumination at the scene, such that the archived image appears as it does specifically under that lighting condition, not as the original object itself. With such limitations, a problem called ‘metamerism’ may occur when an object is viewed under different illuminations. This creates a serious problem when colour is a critical factor in the digital archiving process. Spectral imaging technology is capable of capturing the colour in spectral form, and the spectral reflectance of each pixel is recorded accordingly. With consequent analysis and process, art works can be archived with high precision spectral data with the advantages of resolving the issue of metamerism and of reproducing the art work under any kind of illumination. Another advantage of spectral imaging technology is that it captures and analyzes the spectral data of an art work without any physical contact. In this study ancient Chinese blue-and-white porcelains collected by the Hwa-Kang Museum of the Chinese Culture University are digitised by spectral imaging technology. A custom-built spectral camera is used to capture the spectral image by using a new spectrograph device. Statistics analysis is used to extract the primary spectral reflectance from the captured spectral data. Comparisons can then be made to explore the differences among the colour primaries of the porcelains. This new spectral system and the colour analysis of blue-and-white porcelain as well as the resulting spectral characteristics of this porcelain can be a new benchmark for the museum community in digital archiving. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0069",
        "url": "https://doi.org/10.3366/ijhac.2013.0069",
        "doi": "10.3366/ijhac.2013.0069",
        "year": "2013",
        "pages": "189-200",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Non-Contact Color Analysis and Digital Archive Method for Blue-and-White Porcelain by Using Spectral Imaging Technology",
        "author": "Shyu, M. James and Lee, Margaret Chen",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0069"
    },
    "doi:10.3366/ijhac.2013.0070": {
        "abstract": " ‘The Compilation and Promotion of the Greater Danshui Artist Map’ is the first-stage plan from the ‘New Taipei City Artist Map Project’ by Culture Affairs Bureau of New Taipei C ity. The goal of this project, named ‘One Year, One Village’, is to conduct field survey, in-depth interviews, artwork digitisation and promotional events on artists and art villages within Ney Taipei City. Information from the research and its resulting digitised visual and audio contents will become the foundation for future development and production of arts emerging from the growing cultural originality in New Taipei C ity. In addition to utilizing the traditional ‘direct observation’ approaches to obtain first-hand information and establish contacts with local artists, the research also takes on a field survey approach to conduct verbal interviews and complete digital photographs of artists’ artworks. The combination of these methods had achieved a complete and accessible artist archive for the Greater Danshui. Using the surveyed results and digital content, the Greater Danshui artists map website, (http://artist-map.ntpc.gov.tw/sd\\_/) was completed and a pamphlet for arts of Greater Danshui was published. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0070",
        "url": "https://doi.org/10.3366/ijhac.2013.0070",
        "doi": "10.3366/ijhac.2013.0070",
        "year": "2013",
        "pages": "201-215",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "The New Taipei City Artist Map Project: The Compilation and Promotion of the Greater Danshui Artist Map",
        "author": "Hsieh, Yung-Cheng and Cheng, Ssu-Yu",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0070"
    },
    "doi:10.3366/ijhac.2013.0071": {
        "abstract": " IASA-TC 05 on Handling and Storage of Audio and Video Carriers is the most recent of a series of standards issued by the Technical Committee of the International Association of Sound and Audiovisual Archives. Edited by Dietrich Schüller and Albrecht Häfner, this standard explains function, composition, and life expectancy of audiovisual carriers, from the early cylinders to hard disk drives and solid states memories, describes the influence of environmental parameters to the various carries and surveys recent recommendations on handling and storage. By these background explanations the document will go beyond a mere collection of rules as it assists archivists to responsibly adapt idealised standard prescriptions to the specific, often suboptimal conditions and circumstances of their archives. This introduction also provides a preview on most recent research and experiences that have led to new insights into some of the carrier deterioration phenomena, consequently leading to an adaptation of previously published recommendations. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0071",
        "url": "https://doi.org/10.3366/ijhac.2013.0071",
        "doi": "10.3366/ijhac.2013.0071",
        "year": "2013",
        "pages": "216-221",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Introduction to IASA-TC 05: Handling and Storage of Audio and Video Carriers",
        "author": "Schüller, Dietrich",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0071"
    },
    "doi:10.3366/ijhac.2013.0072": {
        "abstract": " English phrasal verbs such as ‘call off’ (a game due to rain) and (the buttons) ‘come off’ are difficult for non-native speakers to learn because the meanings of many phrasal verbs are not compositions of the meanings of each component. It was reported that the use of phrasal verbs was avoided by non-native speakers and that the mastery of collocations was hampered by a strong influence from the learner's native language. Therefore, to prevent such interference from learners’ native languages, it would be appropriate to learn phrasal verbs directly through nonverbal media such as pictures and sound. A web application was developed for the picture-based e-learning of phrasal verbs. An experiment was conducted, which consisted of a sequence of two sessions with a week-long break in between. In order to investigate the learning effectiveness, two methods were compared: one with the display of meaning with still pictures, and the other with Japanese word glosses. Two groups participated in the experiment, and each group had both methods. The only difference was the sequence of the order of the two methods. This paper reports the comparative results of the two post-tests by the two groups, discusses some of the findings, and offers several suggestions. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0072",
        "url": "https://doi.org/10.3366/ijhac.2013.0072",
        "doi": "10.3366/ijhac.2013.0072",
        "year": "2013",
        "pages": "222-233",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Picture-Based e-Learning of English Phrasal Verbs: A Comparative Study of the Use of Pictures and L1 Glosses",
        "author": "Oe, Yumiko and Alam, Yukiko Sasaki",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0072"
    },
    "doi:10.3366/ijhac.2013.0073": {
        "abstract": " Reading fluency is considered critical in skillful reading in that many reading training tools are developed for improving the fluency. Most of the tools are computer-based applications with a screen-based interface to provide multimedia learning environment. However, many students still prefer using paper materials especially for reading activities because of many familiar experiences of learning with a pen and paper. Also, many studies indicate that paper still plays an important role especially in reading activities. For addressing the issue, a paper-based digital pen with digital functions is used in paper materials for assisting in reading, and a novel fluency intervention program is designed in the hope of being easily and fully incorporated into regular classrooms for helping students achieve reading fluency. An actual study incorporating this fluency program was carried out in an English course in a regular EFL classroom in Taiwan. During the course, students were able to use the digital pen to interact paper materials for one-on-one digital support, including playing a model of fluent reading, recording their independent practice and playing back such recordings for confirmation. Thereby, the students required minimum behavior changes during learning and were able to have significant opportunities to practice each major component of fluency program in a comfortable and assisted way and thus to improve their reading fluency. Because of the intervention program being new to the teacher and students, the repertory grid technique was further applied as a tool for eliciting precise understanding of the students’ preferences toward the program. Finally, the teacher was able to give suggestions and advices to the students during the learning activities and thus this approach effectively helped the students make substantial gains in reading fluency. ",
        "eprint": "https://doi.org/10.3366/ijhac.2013.0073",
        "url": "https://doi.org/10.3366/ijhac.2013.0073",
        "doi": "10.3366/ijhac.2013.0073",
        "year": "2013",
        "pages": "234-246",
        "number": "supplement",
        "volume": "7",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Using a Paper-based Digital Pen for Supporting English Courses in Regular Classrooms to Improve Reading Fluency",
        "author": "Tan, Chia-Chen and Chen, Chih-Ming and Lee, Hahn-Ming",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2013.0073"
    },
    "doi:10.3366/ijhac.2014.0095": {
        "abstract": " Digital technology has profoundly altered nearly every aspect of our lives. The little iPhone we carry in our pocket or purse connects us with those we know and love, while also connecting us to news channels, daily newspapers, music, television, movies, this afternoon's weather, and much more. We should expect that same digital technology that is now nearly ubiquitous to have similarly dramatic effects on information, education,and scholarship. This paper explores the changes in expectations that faculty and students have for gaining access to digital information, and how librarians are responding to those expectations. The online learning landscape is changing rapidly, and and institutions of higher education are responding to a system that was designed to be delivered directly to students. Although online learning systems are regularly discussed in the media, there continues to be a dearth of hard evidence about the efficacy of these sytems. Finally, the paper takes a look at the scholarly enterprise, ietsef. After a century or more of the ‘sage on stage’ teaching model and the lone scholar alone in his office or laboratory doing research, these methods have been dramatically influenced by digital technology. These changes wrought by digital technology compel libraries, faculty, and universities to consider collaborative and consortial approaches to providing services and improving the scholarly enterprise. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0095",
        "url": "https://doi.org/10.3366/ijhac.2014.0095",
        "doi": "10.3366/ijhac.2014.0095",
        "year": "2014",
        "pages": "1-11",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "The Digital Transformation of Information, Education, and Scholarship",
        "author": "Marcum, Deanna",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0095"
    },
    "doi:10.3366/ijhac.2014.0096": {
        "abstract": " The practices of knowledge management (KM) are complicated and usually difficult of accomplishment. In most situations, KM is introduced on a departmental or even individual level, leading to the Content Silo Trap where content, applications, and services are created in isolation. To address the issue, this paper proposes, for museums, a Unified Knowledge-based Content Management Framework, which consists of the Unified Process of Knowledge Content Development, the Multi-layered Reusable Knowledge Content Structures, and the Unified Knowledge-based Content Management System. The first declares tasks for the museum staff to perform while building and utilizing knowledge. The second abstracts content in consistent structures for reuse. The last comprises subsystems serving functionalities for knowledge-based content management. The proposed framework has been successfully introduced in the National Museum of Natural Science to manage tasks and operations on a daily basis. In addition, a platform based on the framework is implemented to support knowledge-based content management, value-added application and service development, and business marketing. The overall practical experience is a valuable reference for museums, the academia, and the industry. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0096",
        "url": "https://doi.org/10.3366/ijhac.2014.0096",
        "doi": "10.3366/ijhac.2014.0096",
        "year": "2014",
        "pages": "12-28",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "A Unified Knowledge-Based Content Management Framework towards Value-Added Application and Service Development and Business Marketing for Museums: The Case Study of the National Museum of Natural Science in Taiwan",
        "author": "Hsu, Tien-Yu and Yeh, Jen-Yuan",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0096"
    },
    "doi:10.3366/ijhac.2014.0097": {
        "abstract": " The number of retracted peer reviewed scientific publications in the biomedical field has exponentially increased 15 times since early 2000 while the total number of publications only increased 1.44 times over the same period. Although retractions are rare (only 1 in 5,000 of all publications), the data and the science propounded by the retracted papers have significant impact because many retracted papers are published in high impact journals and are highly cited by other scientists. The scientific data contained in a retracted paper should be erased from the data bank. Even after retraction, many of these papers continue to be cited or can re-appear in future literature citation after a number of years. Recent analysis shows that in the fields of life science and medicine, 67.4\\% of the retracted papers are due to misconduct, of which 43.4\\% are due to fraud or suspected fraud. These flawed papers have high impact on public health and patient care as illustrated here by the cases of Wakefield and Potti. It is suggested here that a more stringent process of publication is necessary, including the review process and author certification of responsible citations of the literature that does not contain retractions. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0097",
        "url": "https://doi.org/10.3366/ijhac.2014.0097",
        "doi": "10.3366/ijhac.2014.0097",
        "year": "2014",
        "pages": "29-37",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "A Need to Archive Correct Biomedical Scientific Data and to Prevent Continued Citation of Retracted Scientific Publications",
        "author": "Tchao, Ruy",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0097"
    },
    "doi:10.3366/ijhac.2014.0098": {
        "abstract": " This programme aims to digitize video collections hosted by the Museum of Shadow Play of the Kaohsiung City Cultural Affairs Bureau in Taiwan. Two main studies have been made based on this programme: Firstly, this project cooperates with the museum and digitizes films kept there, whilst also constructing a Web 2.0 interactive online platform to promote the culture of shadow puppet theatre. Secondly, based on the study of the museum archives, this study designed and validated three prototypes of social interfaces representing the cultural context by taking advantage of interactive technology, namely ‘narrative media of shadow play’. Several exhibitions and interdisciplinary projects have been established, which support digital art, history and museum areas. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0098",
        "url": "https://doi.org/10.3366/ijhac.2014.0098",
        "doi": "10.3366/ijhac.2014.0098",
        "year": "2014",
        "pages": "38-48",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "A Case Study of a Digital Archives Programme: The Development of Digital Shadow Plays in Taiwan",
        "author": "Chen, Tin-Kai",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0098"
    },
    "doi:10.3366/ijhac.2014.0099": {
        "abstract": " In this paper we approach the paradigmatic changes in the inscriptions of Taiwan's tombstones not as statistic phenomenon, which can be traced on maps and timelines, but as phenomena that occurred in the history of individual families. For this purpose, tombstones are connected into networks of family relations, created through references from different tombstones to a common set of person. Using the edges of these tombstone networks in a chronological order, we obtain a workable data structure to follow transformations in a family line. The unexpected problems we encoutered with this research approach, e.g. the absence of references in many regions to mourners by names and the reduction of workable data with each processing step, are discussed and possible solutions are suggested. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0099",
        "url": "https://doi.org/10.3366/ijhac.2014.0099",
        "doi": "10.3366/ijhac.2014.0099",
        "year": "2014",
        "pages": "49-83",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Extracting Family Genealogies from Taiwan's Tombstones for a Study of Historical Changes in Tombstone Inscriptions",
        "author": "Streiter, Oliver and Goudin, Yoann",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0099"
    },
    "doi:10.3366/ijhac.2014.0100": {
        "abstract": " University museums are considered centers of object-based research. In object-based research, two interactive cycles connect collections and research during the production of new scientific results. To achieve good circulation of these two interactive cycles, connections between collection items and research publications are indispensable. However, these connections are currently made on a voluntary basis by each university museum. We expect that the establishment of a two-way connection system between collections and research will serve a new scientific infrastructure and worldwide framework. We propose the conceptual design of the ‘Connections between Collections and Research’ (CCR) database that might be linked with research publication and museum collection databases. Connections between research and collections will contribute to scientific clarity and visibility, support collection management, and promote disciplinary and interdisciplinary science based on each collection. Cooperation and networking by university museums, as well as by institutes and scientists that maintain and utilize collections is required in order to realize the development of this scientific infrastructure. By reflecting the resources of university collections and scientists in various research fields, including information science, university museums worldwide might make significant contributions to the establishment and organization of a new system that aims to connect collections and research. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0100",
        "url": "https://doi.org/10.3366/ijhac.2014.0100",
        "doi": "10.3366/ijhac.2014.0100",
        "year": "2014",
        "pages": "84-94",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Connecting Museum Collections and Research as Scientific Infrastructure",
        "author": "Motokawa, Masaharu and Gotoh, Haruyoshi and Yamashita, Shunsuke and Nagamasu, Hidetoshi and Ohno, Terufumi",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0100"
    },
    "doi:10.3366/ijhac.2014.0101": {
        "abstract": " This research project attempts to build a new cooperative model with the superintendents of school districts of various states in the United States. The idea behind the project is based on the urgent need of Mandarin Chinese courses in middle school level in the US. Since most school districts encounter the problem of not having enough Chinese teachers or teaching resources, offering Chinese courses through internet videoconferencing from Taiwan could be a feasible solution. This project involved some aspects including teaching materials design specifically for online instruction, communication with schools and their teachers/students, teacher's training for synchronized online instruction, e-learning platform and facilities arrangement, and problem solving along the implementation process. The program has been implemented during the year of 2012. We have cooperative agreements with five schools districts in different states and have established a workable operation model for this international cooperation. Through this cooperative model, American students gain the benefit of learning resources through internet, and Mandarin educators and researchers in Taiwan also gain new insights on how to promote the Chinese language learning in the global community. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0101",
        "url": "https://doi.org/10.3366/ijhac.2014.0101",
        "doi": "10.3366/ijhac.2014.0101",
        "year": "2014",
        "pages": "95-106",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "An International Cooperative Model of Online Chinese Courses",
        "author": "Hsin, Shih-Chang and Wang, Ching-Wei and Huang, Yu-Hui",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0101"
    },
    "doi:10.3366/ijhac.2014.0102": {
        "abstract": " The amount of data produced by the Cultural Heritage sector is continually increasing thanks to the numerous initiatives put in place by the cultural institutions for the digitization of their content. This process has also been accelerated by the emergence of cultural portals including regional, national and thematic portals and the European cultural portal Europeana. The Digital Cultural Heritage (DCH) sector also has the challenge of the complexity of the information itself. This is because of the relationship that each cultural object has with the collections it is part of, with the memory institutions where it is held, with the other objects of the same nature and/or culturally connected with it, and the many other types of relationships that represent the real scientific value of the digitised cultural object (be it a book, an archival record, an artefact from a museum, a sound recording or a video). Further, the investment in the production of the digital cultural heritage data is extremely high because the description of each object requires the human intervention of experts in the sector in order to associate the necessary metadata. Automatic extraction of knowledge (metadata) from the digital representation of cultural items is still far from being at a production level. It is not yet commonly available or seamless to the cultural institutions that are engaged in the digitisation of their collections. In addition to the DCH content that derive from digitisation processes applied to the tangible heritage, also born digital cultural heritage is more and more a reality, particularly in the artistic scenario. Plastic artists are commonly using 3D modelling for their studies. Architects, writers, multimedia artists, graphic designers and almost all other artistic expressions produce data that need to be preserved for the researchers of today and for the future generations. Digital cultural data is therefore extremely precious and its preservation is more and more an imperative priority. This paper intends to discuss these matters in the light of the ongoing work carried out by the DCH-RP project (www.dch-rp.eu) funded by the European Commission. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0102",
        "url": "https://doi.org/10.3366/ijhac.2014.0102",
        "doi": "10.3366/ijhac.2014.0102",
        "year": "2014",
        "pages": "107-123",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Digital Cultural Heritage Roadmap for Preservation",
        "author": "Fresa, Antonella",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0102"
    },
    "doi:10.3366/ijhac.2014.0103": {
        "abstract": " With a collection of unique and rare books and extensive experience in their digitization, National Central Library (NCL) has since 2001 established itself as a leader in this effort. As such the Asian Division of the Library of Congress (LC) invited NCL to collaborate on digitizing important rare Chinese books in its collection. NCL had previously established an objective to collect unique and valuable resources on Chinese studies from around the world, and thus engage in international projects to digitize collections of rare Chinese books. The collaboration with LC marked one of the first of NCL's digitization project. The project began in 2005 and ended in 2012, during which a total of 2,025 titles of rare books were digitized and made available on the internet. In 2010 and 2011, the University of Washington and the University of California Berkeley also signed an agreement with NCL to collaborate on additional rare Chinese books digitization projects. This paper outlines NCL's current modus operandi, cites successful examples, and delineates current fruitful outcomes and value-added applications. It is hoped that this may serve as useful information for others who are also seeking international collaboration projects for digital archives. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0103",
        "url": "https://doi.org/10.3366/ijhac.2014.0103",
        "doi": "10.3366/ijhac.2014.0103",
        "year": "2014",
        "pages": "124-151",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "International Collaboration on Digitization of Rare Chinese Books at National Central Library: Models and Outcomes",
        "author": "Yu, Hsiao-Ming",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0103"
    },
    "doi:10.3366/ijhac.2014.0104": {
        "abstract": " Museums around the world have built databases with metadata about millions of objects, their history, the people who created them, and the entities they represent. This data is stored in proprietary databases and is not readily available for use. Recently, museums embraced the Semantic Web as a means to make this data available to the world, but the experience so far shows that publishing museum data to the linked data cloud is difficult: the databases are large and complex, the information is richly structured and varies from museum to museum, and it is difficult to link the data to other datasets. This paper describes the process of publishing the data of the Smithsonian American Art Museum (SAAM). We describe the database-to-RDF mapping process, discuss our experience linking the SAAM dataset to hub datasets such as DBpedia and the Getty Vocabularies, and present our experience in allowing SAAM personnel to review the information to verify that it meets the high standards of the Smithsonian. Using our tools, we helped SAAM publish high-quality linked data of their complete holdings: 41,000 objects and 8,000 artists. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0104",
        "url": "https://doi.org/10.3366/ijhac.2014.0104",
        "doi": "10.3366/ijhac.2014.0104",
        "year": "2014",
        "pages": "152-166",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Publishing the Data of the Smithsonian American Art Museum to the Linked Data Cloud",
        "author": "Szekely, Pedro and Knoblock, Craig A. and Yang, Fengyu and Fink, Eleanor E. and Gupta, Shubham and Allen, Rachel and Goodlander, Georgina",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0104"
    },
    "doi:10.3366/ijhac.2014.0105": {
        "abstract": " E-learning technology has evolved to become a robust tool for complementing traditional face-to-face knowledge delivery in Teaching and Learning (T\\&L). Confident in the capability of this technological advancement, the Malaysian Ministry of Higher Education has mandated that by year 2015 all universities must have the capacity to deliver 30\\% of T\\&L via e-learning. Significant resources are allocated to empower research and implementation towards the attainment of this aspiration. The choice of general physics at the pre-U level as the domain of e-learning appears promising. This paper presents the implementation of a suite of e-learning modules within the framework of blended learning for pre-U general physics. General physics at the pre-U level provides an important knowledge interface and linkage between high-school and university science curriculum. Success at this entrance level would pave the way to better knowledge attainment and dissemination at higher levels in subsequent years. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0105",
        "url": "https://doi.org/10.3366/ijhac.2014.0105",
        "doi": "10.3366/ijhac.2014.0105",
        "year": "2014",
        "pages": "167-178",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "e-Learning for College Physics: Bridging Knowledge Gap in Science",
        "author": "Koh, Hock Lye and Teh, Su Yean",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0105"
    },
    "doi:10.3366/ijhac.2014.0106": {
        "abstract": " This study applied Speech-to-Text Recognition (STR) technology during teaching and learning activities to assist learning. Two experiments were carried out in this study. In the first experiment, the STR technology was applied during one-way lectures and students' oral presentations in an online synchronous cyber classroom. In the second experiment, the STR technology was applied during seminars in a traditional classroom. This study aimed to investigate participants' perceptions toward the STR technology, the effectiveness of applying the STR technology on learning, and participants' learning behavior to use STR-texts. This paper reports and discusses results of the study. Furthermore, this paper provides research and practical implications for using STR-texts effectively. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0106",
        "url": "https://doi.org/10.3366/ijhac.2014.0106",
        "doi": "10.3366/ijhac.2014.0106",
        "year": "2014",
        "pages": "179-189",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Investigating Applications of Speech-to-Text Recognition to Assist Learning in Online and Traditional Classrooms",
        "author": "Shadiev, Rustam and Hwang, Wu-Yuin and Huang, Yueh-Min",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0106"
    },
    "doi:10.3366/ijhac.2014.0107": {
        "abstract": " A major goal of this study is to provide a practical Web application for English word-reordering problems that records and reproduces learners' mouse trajectories. The authors believe that trajectories include useful clues to the nature of learners' processes for solving problems, including any hesitation they may experience in completing a task. In this paper, we will introduce the Web application we have developed so far and discuss ways in which to analyse the recorded mouse trajectories, such as the numbers of U-turns and drag and drops, in relation to the scores and newly incorporated ‘degree of confidence’ parameter. Empirical findings and statistical, correlation analysis from two experiments will support the conclusion that the mouse trajectories help to reflect learners' understanding more accurately than when their understanding is measured merely by their scores (that is, measured merely by their percentage of correct answers). It is our hope that the system will be applied as a tool for on-site teachers to develop their teaching strategies. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0107",
        "url": "https://doi.org/10.3366/ijhac.2014.0107",
        "doi": "10.3366/ijhac.2014.0107",
        "year": "2014",
        "pages": "190-205",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Web Application for Measuring Learners' Knowledge of English Syntax: Analyzing the Relationship between Mouse Trajectories and Learners' Understanding",
        "author": "Zushi, Mitsumasa and Miyazaki, Yoshinori and Norizuki, Ken",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0107"
    },
    "doi:10.3366/ijhac.2014.0108": {
        "abstract": " This study employs a content analysis approach to analyze the Websites of four major science centers in Taiwan. The aim is to determine if their Websites meet the criteria of ‘Evaluating Science WWW Resources’ established by North Carolina State University. The criteria consist of five categories and 29 items. The five categories are: Science Content Issues, Navigation, Website Design, Performance, and Multimedia Issues. The results of this study indicate that the Websites of the four science centers mostly conformed to the criteria, and their e-resources are sufficient for the general public. However, several recommendations are proposed based from the results. In Science Content Issues, a description about the responsible authors including their credentials, emails, and biographical information should be added so that the content can be validated by scientists or professional educators. In Multimedia Issues, Web 2.0 social networks may be added to allow users to share information in real time. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0108",
        "url": "https://doi.org/10.3366/ijhac.2014.0108",
        "doi": "10.3366/ijhac.2014.0108",
        "year": "2014",
        "pages": "206-220",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Analysis of Major National Science Center Websites in Taiwan",
        "author": "Chen, Chia-Hsiang and Ke, Hao-Ren",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0108"
    },
    "doi:10.3366/ijhac.2014.0109": {
        "abstract": " The purpose of this study was to develop a three-phase integrative task-based course for achieving communicative effectiveness in two aspects. One aspect was to combine E-simulation with Facebook online chat in a computerised environment. E-activities may not only captivate participants and allow them to be immersed in friendly user interfaces, but also permit participants to engage in pre-task and online planning. Consequently, E-activities may enhance production performance in the complexity and accuracy dimensions, which were based on those described in previous studies. The other aspect was to observe the effects on the L2 production of learners according to the aforementioned computer-mediated communication (CMC) settings by manipulating task repetition. Whereas rehearsal can improve the performance of a task, it was also used to distinguish between the differences among tasks performed with the same partner or with a different partner. The theory of task-based language learning and teaching (TBLT) was investigated to determine whether further modification or extension was needed in these CMC settings. The results of this study showed that task repetition enhanced the performance of learners regarding syntactic variety and lexical complexity. Task repetition had more positive effects on the changed-partner group than it had on the same-partner group. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0109",
        "url": "https://doi.org/10.3366/ijhac.2014.0109",
        "doi": "10.3366/ijhac.2014.0109",
        "year": "2014",
        "pages": "221-236",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Effects of Task Repetition on L2 Oral (in Written Form) Production in Computer-Mediated Communication",
        "author": "Liao, Pao-Ling and Fu, Kuoen",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0109"
    },
    "doi:10.3366/ijhac.2014.0110": {
        "abstract": " This paper covers work using historical geographic information systems (GIS) by the Electronic Cultural Atlas Initiative (ECAI)2 to trace early navigation in Monsoon Asia. To open a scholarly Web-based platform to a broader audience, the ECAI Austronesia Team is collaborating with the Maritime Buddhism project conceived by Lewis Lancaster. The Maritime Buddhism project is being developed to reach general audiences with a high level of interactivity and 3D visualizations featuring historic timelines, ships, trade routes and trade winds, travelling monks, life at ports, and stories. To allow the information to be more accessible, mobile phone apps and multi-media museum displays are being developed. Austronesian speaking peoples made navigation a way of life across the Indian and Pacific oceans spanning thousands of years. The goal of this integration of content and technology is to enable our understanding of Monsoon Asia, its diffusion of culture, and oceanic navigation to become alive and accessible. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0110",
        "url": "https://doi.org/10.3366/ijhac.2014.0110",
        "doi": "10.3366/ijhac.2014.0110",
        "year": "2014",
        "pages": "237-252",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Early Austronesian Historical Voyaging in Monsoon Asia: Heritage and Knowledge for Museum Displays Utilizing Texts, Archaeology, Digital Interactive Components, and GIS Approaches",
        "author": "Blundell, David and Zerneke, Jeanette",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0110"
    },
    "doi:10.3366/ijhac.2014.0111": {
        "abstract": " The ‘group relocation’ policy imposed during the Japanese colonial period in Taiwan is arguably one of the most notorious policies to be imposed upon indigenes. As a result of this project, almost half of Taiwanese indigenes were resettled from the high mountain areas to the lowlands. Relocated populations needed to adjust themselves to new circumstances, and relocation became a traumatic memory for many. What is interesting is that relocating villages is not, historically, an uncommon occurrence for most Taiwanese indigenous groups. This suggests that ‘relocating villages’, in and of itself, might not be overly problematic for indigenous populations. Why then did the Japanese relocation policy come to be regarded as such a traumatic event? In this paper, I will present a sketch of how the Japanese relocation policy became regarded as such a traumatic event for many indigenous groups, and explore the reason the Thao people, living by Sun Moon Lake of central Taiwan, had a very different experience of relocation. Moreover, I also describe the relationship between the mapping project of Traditional Territories of Indigenous Peoples that began in 2002 and the collection of oral histories of indigenous relocation. ",
        "eprint": "https://doi.org/10.3366/ijhac.2014.0111",
        "url": "https://doi.org/10.3366/ijhac.2014.0111",
        "doi": "10.3366/ijhac.2014.0111",
        "year": "2014",
        "pages": "253-262",
        "number": "supplement",
        "volume": "8",
        "journal": "International Journal of Humanities and Arts Computing",
        "title": "Mapping Austronesian Legends and Trails of Central Taiwan at Sun Moon Lake",
        "author": "Mitsuda, Yayoi",
        "ENTRYTYPE": "article",
        "ID": "doi:10.3366/ijhac.2014.0111"
    }
}