{"url": "http://dx.doi.org/10.1353/dph.2014.0010", "identifier": {"string_id": "10.1353/dph.2014.0010", "id_scheme": "DOI"}, "abstract": "The academic study of medieval manuscripts has always been undertaken as if in dialogue with printed books. This essay takes as its starting point the changes in the nature of printed books that have come about in the last decade with the dramatic increase in data storage and retrieval capabilities, paying particular attention to the impact of book digitization by Google Books and similar programs. After first considering how targeted textual searching has changed the way books are used for research—inverting the traditional hierarchy of text and reader by allowing the latter to use the text with greater speed and control than ever before—I suggest that the change in the function of books can also entail for medievalists a change in the meaning of manuscripts. Because manuscripts provide much more information than that which is encoded in their text, including many elements that defy systematic characterization, their idiosyncratic nature seems to be enhanced in comparison to the increasingly utilitarian nature of searchable books. Taking as an exemplary case the digitization of University of Coimbra MS 720, a late-medieval copy of the Dagger of Faith (Pugio fidei) by the Catalan Dominican Ramon Martí, this essay offers some personal reflections on the ways that the use of texts, information, and manuscripts is changing in the age of digital books.", "article_title": "Cracking the Code: Reflections on Manuscripts in the Age of Digital Books", "authors": [{"given": "Ryan", "family": "Szpiech", "affiliation": [{"original_name": "University of Michigan", "normalized_name": "University of Michigan–Ann Arbor", "country": "United States", "identifiers": {"ror": "https://ror.org/00jmfr291", "GRID": "grid.214458.e"}}]}], "publisher": "Johns Hopkins University Press", "date": "2014-07-20", "keywords": null, "journal_title": "Digital Philology: A Journal of Medieval Cultures", "volume": "3", "issue": "1", "ISSN": [{"value": "2162-9552", "type": "electronic"}]}