{"url": "http://dx.doi.org/10.1145/2594443", "identifier": {"string_id": "10.1145/2594443", "id_scheme": "DOI"}, "abstract": "This article is devoted to a novel application of the micro-3D modeling based on shape from focus. A 3D portable digital microscope prototype has been used for the first time in order to analyze gold punchwork on medieval panel paintings. In general, the 3D domain provides a more flexible and complete characterization of these decorative elements than traditional photographic documentation. Low-magnification 3D digital microscopy is well suited for analyzing morphologies, depths, and profiles of different punch marks. Here, we used these parameters for interpreting the punching process and recognizing sliding and bouncing effects. The 3D reconstruction of the surface engraved also allowed identifying types of anomalies that could be useful as possible authentication markers. The advantages of the present approach with respect to the photographic documentation are of general valence and can be exploited in order to document, parameterize, and interpret a variety of engraving works on panel paintings and metal artifacts.", "article_title": "3D Digital Microscopy for Characterizing Punchworks on Medieval Panel Paintings", "authors": [{"given": "I.", "family": "Cacciari", "affiliation": [{"original_name": "Istituto di Fisica Applicata “Nello Carrara,” Consiglio Nazionale delle Ricerche, Firenze", "normalized_name": "Nello Carrara Institute of Applied Physics", "country": "Italy", "identifiers": {"ror": "https://ror.org/00dqega85", "GRID": "grid.466837.8"}}]}, {"given": "P.", "family": "Nieri", "affiliation": [{"original_name": "Soprintendenza BAPSAE di Pisa e Livorno, Museo Nazionale di San Matteo, Pisa", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "S.", "family": "Siano", "affiliation": [{"original_name": "Istituto di Fisica Applicata “Nello Carrara,” Consiglio Nazionale delle Ricerche, Firenze", "normalized_name": "Nello Carrara Institute of Applied Physics", "country": "Italy", "identifiers": {"ror": "https://ror.org/00dqega85", "GRID": "grid.466837.8"}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2014-10-14", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "7", "issue": "4", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}