{"url": "http://dx.doi.org/10.1093/llc/fqu040", "identifier": {"string_id": "10.1093/llc/fqu040", "id_scheme": "DOI"}, "abstract": "Stories of several characters, where different characters may engage in separate activities at different locations over the same period, are produced by humans as linear discourses with no difficulty. The present article addresses this issue by engineering a computational model of the relevant task understood as that of composing a narrative discourse for the events in a chess game. The task of narrative composition is modelled as a set of operations that need to be carried out to obtain a span of narrative discourse from a set of events that inspire the narration. The model explores a set of intermediate representations required to capture the structure that is progressively imposed on the material, and connects this content planning task with a classic pipeline for natural language generation. Several strategies are explored for the linearization procedure and for the evaluation of its results. Additionally, the article considers this productive task immersed in a self-evaluation cycle where the produced discourse is validated via the construction of a possible interpretation (based exclusively on the information available in the discourse itself) and a comparison between this interpretation and the original source material.", "article_title": "Composing narrative discourse for stories of many characters: A case study over a chess game", "authors": [{"given": " Pablo", "family": "Gervás", "affiliation": [{"original_name": "Universidad Complutense de Madrid", "normalized_name": "Complutense University of Madrid", "country": "Spain", "identifiers": {"ror": "https://ror.org/02p0gd045", "GRID": "grid.4795.f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014-08-22", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "4", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}