{"url": "http://dx.doi.org/10.1093/llc/fqu017", "identifier": {"string_id": "10.1093/llc/fqu017", "id_scheme": "DOI"}, "abstract": "This article addresses the ‘meaning problem’ of unsupervised topic modeling algorithms using a tool called the Networked Corpus, which offers a way to visualize topic models alongside the texts themselves. We argue that the relationship between quantitative methods and qualitative interpretation can be reframed by investigating the long history of machine learning procedures and their historical antecedents. The new method of visualization presented by the Networked Corpus enables users to compare the results of topic models with earlier methods of topical representation such as the 18th-century subject index. Although the article provides a brief description of the tool, the primary focus is to describe an argument for this kind of comparative analysis between topic models and older genres that perform similar tasks. Such comparative analysis provides a new method for developing conceptual histories of the categories of meaning on which the topic model and the index depend. These devices are linked by a shared attempt to represent what a text is ‘about’, but the concept of ‘aboutness’ has evolved over time. The Networked Corpus enables researchers to discover congruities and contradictions in how topic models and indexes represent texts in order to examine what kinds of information each historically situated device prioritizes.", "article_title": "Visibility and meaning in topic models and 18th-century subject indexes", "authors": [{"given": " Jeffrey M.", "family": "Binder", "affiliation": [{"original_name": "Department of English, The Graduate Center, City University of New York, New York, NY, USA", "normalized_name": "City University of New York", "country": "United States", "identifiers": {"ror": "https://ror.org/00453a208", "GRID": "grid.212340.6"}}]}, {"given": " Collin", "family": "Jennings", "affiliation": [{"original_name": "Department of English, New York University, New York, NY, USA", "normalized_name": "New York University", "country": "United States", "identifiers": {"ror": "https://ror.org/0190ak572", "GRID": "grid.137628.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014-05-09", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}