{"url": "http://dx.doi.org/10.1093/llc/fqu026", "identifier": {"string_id": "10.1093/llc/fqu026", "id_scheme": "DOI"}, "abstract": "This paper charts the origins, trajectory, development, challenges, and conclusion of Project Bamboo, a humanities cyberinfrastructure initiative funded by the Andrew W. Mellon Foundation between 2008 and 2012. Bamboo aimed to enhance arts and humanities research through the development of infrastructure and support for shared technology services. Its planning phase brought together scholars, librarians, and IT staff from a wide range of institutions, in order to gain insight into the scholarly practices Bamboo would support, and to build a community of future developers and users for Bamboo’s technical deliverables. From its inception, Bamboo struggled to define itself clearly and in a way that resonated with scholars, librarians, and IT staff alike. The early emphasis on a service-oriented architecture approach to supporting humanities research failed to connect with scholars, and the scope of Bamboo’s ambitions expanded to include scholarly networking, sharing ideas and solutions, and demonstrating how digital tools and methodologies can be applied to research questions. Funding constraints for Bamboo’s implementation phase led to the near-elimination of these community-oriented aspects of the project, but the lack of a shared vision that could supersede the individual interests of partner institutions resulted in a scope around which it was difficult to articulate a clear narrative. When Project Bamboo ended in 2012, it had failed to realize its most ambitious goals; this article explores the reasons for this, including technical approaches, communication difficulties, and challenges common to projects that bring together teams from different professional communities.", "article_title": "What Ever Happened to Project Bamboo?", "authors": [{"given": " Quinn", "family": "Dombrowski", "affiliation": [{"original_name": "Research IT, UC Berkeley, Berkeley, CA 94720, USA", "normalized_name": "University of California, Berkeley", "country": "United States", "identifiers": {"ror": "https://ror.org/01an7q238", "GRID": "grid.47840.3f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2014-06-17", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "29", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}