{"url": "http://dx.doi.org/10.2218/ijdc.v9i1.304", "identifier": {"string_id": "10.2218/ijdc.v9i1.304", "id_scheme": "DOI"}, "abstract": " Data sharing is a difficult process for both the data producer and the data reuser. Both parties are faced with more disincentives than incentives. Data producers need to sink time and resources into adding metadata for data to be findable and usable, and there is no promise of receiving credit for this effort. Making data available also leaves data producers vulnerable to being scooped or data misuse. Data reusers also need to sink time and resources into evaluating data and trying to understand them, making collecting their own data a more attractive option. In spite of these difficulties, some data producers are looking for new ways to make data sharing and reuse a more viable option. This paper presents two cases from the surface and climate modeling communities, where researchers who produce data are reaching out to other researchers who would be interested in reusing the data. These cases are evaluated as a strategy to identify ways to overcome the challenges typically experienced by both data producers and data reusers. By working together with reusers, data producers are able to mitigate the disincentives and create incentives for sharing data. By working with data producers, data reusers are able to circumvent the hurdles that make data reuse so challenging. ", "article_title": "Data Producers Courting Data Reusers: Two Cases from Modeling Communities", "authors": [{"given": "Jillian", "family": "Wallis", "affiliation": [{"original_name": "University of California", "normalized_name": "California Coast University", "country": "United States", "identifiers": {"ror": "https://ror.org/05t99sp05", "GRID": "grid.468726.9"}}]}], "publisher": "Edinburgh University", "date": "2014-06-12", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "9", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}