{"url": "https://doi.org/10.3366/ijhac.2014.0127", "identifier": {"string_id": "10.3366/ijhac.2014.0127", "id_scheme": "DOI"}, "abstract": " This paper uses Land Tax records to attempt to reconstruct the pattern of urbanization in a Pennine fringe township which formed part of the Lancashire cotton complex during the early industrial revolution. It uses logic programming to articulate rules to develop a longitudinal approach which chains together individual Land Tax records for successive years to identify perduring property objects, which are then located geographically using the pooled descriptors drawn from the returns. It investigates not only house repopulation, but also the character of new property development, of sub-division and amalgamation of holdings and the changing control of housing. It allows a remarkably detailed reconstruction of change in the particular locality, revealing events that have gone unnoticed. Pent-up demand associated with proto-industrialization combined with the self-interest of a major absentee landlord to allow a flurry of small scale construction between 1785 and 1805; property then converted to workers’ housing with the onset of industrial urbanism. More generally, it is suggested that a computational approach of this sort allows for a more serious engagement with a source all too often dismissed as unpromising. The paper concludes by drawing out implications of the work for more traditional approaches to interpreting Land Tax returns. ", "article_title": "Reconstructing Urbanization of a Pennine Fringe Township Through Computational Chaining of Land Tax Records: Mottram in Longdendale 1784–1830", "authors": [{"given": "Peter", "family": "Bibby", "affiliation": [{"original_name": "University of Sheffield", "normalized_name": "University of Sheffield", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/05krs5044", "GRID": "grid.11835.3e"}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2014-10-07", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "8", "issue": "2", "ISSN": [{"value": null, "type": null}]}