{"url": "http://dx.doi.org/10.4000/jtei.949", "identifier": {"string_id": "10.4000/jtei.949", "id_scheme": "DOI"}, "abstract": "As part of a larger pilot study on the evaluation of digital scholarship, we consider what role, if any, the TEI Consortium and user community might play in evaluating scholarship that utilize the TEI tag set. Our rationale for focusing on the role of the TEI Consortium in the discussion of evaluation is twofold. First, the TEI Guidelines represents an encoding standard for texts that is supported by a large community actively interested in the application and development of these standards. Second, feedback concerning evaluation criteria for digital scholarship has not been explicitly gathered from the TEI community and may provide additional understanding of the value, process, and assessment of text encoding. Determining what to evaluate and how to do so reveals the community’s definitions of scholarship in general. The clarification and articulation of evaluation criteria, therefore, remains a high priority as digital scholarship continues to develop.", "article_title": "Evaluating Digital Scholarship: Suggestions and Strategies for the Text Encoding Initiative", "authors": [{"given": "Sarah L.", "family": "Pfannenschmidt", "affiliation": [{"original_name": "University of Texas at Austin School of Information", "normalized_name": "The University of Texas at Austin", "country": "United States", "identifiers": {"ror": "https://ror.org/00hj54h04", "GRID": "grid.89336.37"}}]}, {"given": "Tanya E.", "family": "Clement", "affiliation": [{"original_name": "University of Texas at Austin School of Information", "normalized_name": "The University of Texas at Austin", "country": "United States", "identifiers": {"ror": "https://ror.org/00hj54h04", "GRID": "grid.89336.37"}}]}], "publisher": "OpenEdition", "date": "2014-11-15", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 7", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}