{"url": "http://dx.doi.org/10.1093/llc/fqn004", "identifier": {"string_id": "10.1093/llc/fqn004", "id_scheme": "DOI"}, "abstract": "Today's corpus tools offer the user a wide range of features that greatly facilitate the linguistic analysis of large amounts of authentic language data (e.g. frequency distributions, collocations, keywords, etc.). However, these tools typically fail to address the fundamental need of the linguist to add interpretive information to a concordance or query result, by coding individual concordance lines for structural, functional, discoursal, and other features in a flexible way. The ability to add such qualitative data is indispensable to a fuller understanding of the phenomenon under investigation as it allows the linguist to produce more rigorous descriptions—and theories—about language in use. Our article has two aims: first, to assess the merits and drawbacks of existing solutions, by surveying what can be achieved using state-of-the-art corpus tools and generic database software; second, we draw up a set of desiderata and recommendations for the incorporation of flexible encoding features into future corpus tools. We describe an initial step in this direction, with a recent enhancement to the BNCweb corpus analysis software. More generally, we hope our suggestions will lead to linguists and software developers working together more closely to ensure that the needs of the former are provided for by the available technology.", "article_title": "Corpus Tools and Methods, Today and Tomorrow: Incorporating Linguists' Manual Annotations", "authors": [{"given": "N.", "family": "Smith", "affiliation": [{"original_name": "School of English, Sociology, Politics & Contemporary History, University of Salford, Manchester, UK", "normalized_name": "University of Salford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01tmqtf75", "GRID": "grid.8752.8"}}]}, {"given": "S.", "family": "Hoffmann", "affiliation": [{"original_name": "Department of Linguistics & English Language, Lancaster University, Lancaster, UK", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}, {"given": "P.", "family": "Rayson", "affiliation": [{"original_name": "Department of Computing, Lancaster University, Lancaster, UK", "normalized_name": "Lancaster University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04f2nsd36", "GRID": "grid.9835.7"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2008-03-18", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "23", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}