{"url": "http://dx.doi.org/10.2218/ijdc.v3i2.56", "identifier": {"string_id": "10.2218/ijdc.v3i2.56", "id_scheme": "DOI"}, "abstract": "Computer games, like other digital media, are extremely vulnerable to long-term loss, yet little work has been done to preserve them. As a result we are experiencing large-scale loss of the early years of gaming history. Computer games are an important part of modern popular culture, and yet are afforded little of the respect bestowed upon established media such as books, film, television and music. We must understand the reasons for the current lack of computer game preservation in order to devise strategies for the future. Computer game history is a difficult area to work in, because it is impossible to know what has been lost already, and early records are often incomplete. This paper uses the information that is available to analyse the current status of computer game preservation, specifically in the UK. It makes a quantitative analysis of the preservation status of computer games, and finds that games are already in a vulnerable state. It proposes that work should be done to compile accurate metadata on computer games and to analyse more closely the exact scale of data loss, while suggesting strategies to overcome the barriers that currently exist.", "article_title": "‘Grand Theft Archive’: A Quantitative Analysis of the State of Computer Game Preservation", "authors": [{"given": "Paul", "family": "Gooding", "affiliation": [{"original_name": "BBC Sport Library, London", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Melissa", "family": "Terras", "affiliation": [{"original_name": "University College London", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}], "publisher": "Edinburgh University", "date": "2008-12-02", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "3", "issue": "2", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}