{"url": "http://dx.doi.org/10.2218/ijdc.v3i1.41", "identifier": {"string_id": "10.2218/ijdc.v3i1.41", "id_scheme": "DOI"}, "abstract": "The explosion in the production of scientific data in recent years is placing strains upon conventional systems supporting integration, analysis, interpretation and dissemination of data and thus constraining the whole scientific process. Support for handling large quantities of diverse information can be provided by e-Science methodologies and the cyber-infrastructure that enables collaborative handling of such data. Regard needs to be taken of the whole process involved in scientific discovery. This includes the consideration of the requirements of the users and consumers further down the information chain and what they might ideally prefer to impose on the generators of those data. As the degree of digital capture in the laboratory increases, it is possible to improve the automatic acquisition of the ‘context of the data’ as well as the data themselves. This process provides an opportunity for the data creators to ensure that many of the problems they often encounter in later stages are avoided. We wish to elevate curation to an operation to be considered by the laboratory scientist as part of good laboratory practice, not a procedure of concern merely to the few specialising in archival processes. Designing curation into experiments is an effective solution to the provision of high-quality metadata that leads to better, more re-usable data and to better science.", "article_title": "Curation of Laboratory Experimental Data as Part of the Overall Data Lifecycle", "authors": [{"given": "Jeremy", "family": "Frey", "affiliation": [{"original_name": "University of Southampton", "normalized_name": "University of Southampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01ryk1543", "GRID": "grid.5491.9"}}]}], "publisher": "Edinburgh University", "date": "2008-12-02", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "3", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}