{"url": "http://dx.doi.org/10.1145/2700425", "identifier": {"string_id": "10.1145/2700425", "id_scheme": "DOI"}, "abstract": "Over the past three decades, the introduction of digital technologies in the field of architectural documentation has profoundly changed tools and acquisition techniques. Most of the developments concern metrical and colorimetric characteristics of the objects studied. These developments, surrounding the practice of architectural survey, tend to respond primarily to the requirements of completeness. In this context, it seems necessary to assess the impact of these instruments on the cognitive value of architectural representation. With a strong technological presence, the study of the built heritage is facing a problem of “information overload.” Indeed, this strong technological presence fails to strengthen representation in its role as a vehicle of knowledge. Confronted with the intelligibility deficit, this article proposes an original approach for reading morphological features of an artifact by using a bottom-up approach: the meaning of elements (i.e., their semantic layouts) come from a statistical analysis of the major shape discontinuities of a collection of instances. The idea is to rely on data accumulation to render apparent high-level semantic structures from the comparative analysis of common low-level geometric features. The principles introduced are illustrated by the study of 31 columns of the cloister of the abbey of Saint-Michel-de-Cuxa. To summarize, the first objective is to understand how digital technologies can help us in the analysis of artistic and technical production of Romanesque columns. The second objective is to automatically identify the common semantic articulations of the entire collection to build a reference model for the future assessment of each artifact.", "article_title": "What Do Thirty-One Columns Say about a “Theoretical” Thirty-Second?", "authors": [{"given": "David Lo", "family": "Buglio", "affiliation": [{"original_name": "Faculty of Architecture, Université libre de Bruxelles (ULB), Belgium // UMR 3495 CNRS/MCC MAP Gamsau, Marseille, France", "normalized_name": "Université Libre de Bruxelles", "country": "Belgium", "identifiers": {"ror": "https://ror.org/01r9htc13", "GRID": "grid.4989.c"}}]}, {"given": "Vanessa", "family": "Lardinois", "affiliation": [{"original_name": "UMR 3495 CNRS/MCC MAP Gamsau, Marseille, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Livio De", "family": "Luca", "affiliation": [{"original_name": "UMR 3495 CNRS/MCC MAP Gamsau, Marseille, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Association for Computing Machinery (ACM)", "date": "2015-03-03", "keywords": null, "journal_title": "Journal on Computing and Cultural Heritage", "volume": "8", "issue": "1", "ISSN": [{"value": "1556-4673", "type": "print"}, {"value": "1556-4711", "type": "electronic"}]}