{"url": "http://dx.doi.org/10.1093/llc/fqv011", "identifier": {"string_id": "10.1093/llc/fqv011", "id_scheme": "DOI"}, "abstract": " Understanding the relationship between political regimes and language, while a popular theme among historians and linguists, is empirically difficult. This study suggests a preliminary empirical framework. A quantitative analysis of the Google Books 1-Gram German corpus from the year 1870 to 1945 provides empirical evidence consistent with George Orwell’s hypothesis that everyday language deteriorates under dictatorships, through the inversion of words’ underlying meanings. More specifically, this article shows that six non-technical non-Nazi words— Demokratie (democracy), Freiheit (freedom), Frieden (peace), Herrlichkeit (glory), Gerechtigkeit (justice), and Heldentumd (heroism)—are (1) highly correlated with explicitly Nazi words; (2) negatively correlated with Germany’s level of democracy; and (3) negatively correlated with the count of riots, anti-government protests, and government crises, implying that these words were not used as a form of protest. The use of these words increased sharply under the Nazi government, which banned all publications that were critical of the government. These correlations cannot tell us whether the relationship is causal, and we cannot be sure whether the corpus under study is truly representative. Replicating this empirical framework on other corpora, pushing the period under study further back in time, or using 2-gram data sets can all help assess this study’s findings. ", "article_title": "Politics and the German language: Testing Orwell’s hypothesis using the Google N-Gram corpus", "authors": [{"given": " Paul", "family": "Caruana-Galizia", "affiliation": [{"original_name": "Institute of Economic History, Humboldt University Berlin, Berlin, Germany", "normalized_name": "Humboldt University of Berlin", "country": "Germany", "identifiers": {"ror": "https://ror.org/01hcx6992", "GRID": "grid.7468.d"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2015-04-02", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "31", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}