{"url": "http://dx.doi.org/10.17928/jjadh.1.1_10", "identifier": {"string_id": "10.17928/jjadh.1.1_10", "id_scheme": "DOI"}, "abstract": "The UC CEISMIC Canterbury Earthquakes Digital Archive was established in response to the devastating earthquakes that struck Canterbury region in New Zealand from September 2010 onwards, including 4 quakes of magnitude 6 or greater and over 11,000 aftershocks. 185 people died and significant parts of Christchurch city were either destroyed or have needed to be demolished, resulting in financial losses of an estimated NZ$30 billion. The rebuild is expected to take 10 – 15 years, and the UC CEISMIC archive is designed to accommodate this, acting as a distributed national (and eventually international) repository for digital content produced as a result of the earthquakes. This paper outlines the design principles and architecture of the archive, describing the commitment to open access and open source that allowed the project team to bring together a broad-ranging national consortium comprised of leading cultural organizations, who work alongside content providers ranging from individual citizens, government agencies and community groups, to large media companies. Principles common to the digital humanities community were used to bond the broader project team, in an interesting example of scholar-led community engagement. The goal is to provide a model that can be used, either in whole or in part, by future teams in need of similar capability.", "article_title": "Open Principles, Open Data: The Design Principles and Architecture of the UC CEISMIC Canterbury Earthquakes Digital Archive", "authors": [{"given": "James", "family": "Smithies", "affiliation": [{"original_name": "University of Canterbury", "normalized_name": "University of Canterbury", "country": "New Zealand", "identifiers": {"ror": "https://ror.org/03y7q9t39", "GRID": "grid.21006.35"}}]}, {"given": "Paul", "family": "Millar", "affiliation": [{"original_name": "University of Canterbury", "normalized_name": "University of Canterbury", "country": "New Zealand", "identifiers": {"ror": "https://ror.org/03y7q9t39", "GRID": "grid.21006.35"}}]}, {"given": "Chris", "family": "Thomson", "affiliation": [{"original_name": "University of Canterbury", "normalized_name": "University of Canterbury", "country": "New Zealand", "identifiers": {"ror": "https://ror.org/03y7q9t39", "GRID": "grid.21006.35"}}]}], "publisher": "Japanese Association for Digital Humanities", "date": "2015-09-01", "keywords": null, "journal_title": "Journal of the Japanese Association for Digital Humanities", "volume": "1", "issue": "1", "ISSN": [{"value": "2188-7276", "type": "electronic"}]}