{"url": "http://dx.doi.org/10.2218/ijdc.v10i2.329", "identifier": {"string_id": "10.2218/ijdc.v10i2.329", "id_scheme": "DOI"}, "abstract": "There is increasing pressure from funders, publishers, the public, universities and other research organisations for researchers to improve their data management and sharing practices. However, little is known about researchers’ data management and sharing practices and concerns. The research reported in this paper seeks to address this by providing insight into the research data management and sharing practices of academics at ten universities in New South Wales, Australia. Empirical data was taken from a survey to which 760 academics responded, with 634 completing at least one section. Results showed that at the time of the survey there were a wide variety of research data in use, including analogue data, and that the challenges researchers faced in managing their data included finding safe and secure storage, particularly after project completion, but also during projects when data are used (and thus stored) on a wide variety of less-than-optimal temporary devices. Data sharing was not widely practiced and only a relatively small proportion of researchers had a research data management plan. Since the survey was completed much has changed: capacities and communities are being built around data management and sharing and policies, and guidelines are being constructed. Data storage and curation services are now more freely available. It will be interesting to observe how the findings of future studies compare with those reported here.", "article_title": "Research Data Management Practices: A Snapshot in Time", "authors": [{"given": "Mary Anne", "family": "Kennan", "affiliation": [{"original_name": "Charles Sturt University – Sydney", "normalized_name": "Charles Sturt University", "country": "Australia", "identifiers": {"ror": "https://ror.org/00wfvh315", "GRID": "grid.1037.5"}}]}, {"given": "Lina", "family": "Markauskaite", "affiliation": [{"original_name": "University of Sydney", "normalized_name": "University of Sydney", "country": "Australia", "identifiers": {"ror": "https://ror.org/0384j8v12", "GRID": "grid.1013.3"}}]}], "publisher": "Edinburgh University", "date": "2015-07-29", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "10", "issue": "2", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}