{"url": "http://dx.doi.org/10.2218/ijdc.v10i1.344", "identifier": {"string_id": "10.2218/ijdc.v10i1.344", "id_scheme": "DOI"}, "abstract": "The Data Curation Profiles Toolkit (DCPT) emerged out of a Purdue University Libraries’ 2004 initiative to engage in multidisciplinary research. It is a tool developed to assist librarians and other information professionals to conduct data interviews and identify the needs of researchers when managing, sharing, or curating their data. The DCPT has been widely adopted and applied in various contexts but its usability as a tool has not been formally assessed. To address this need, we have conducted a survey of users of the DCPT. The survey included quantitative measures of potential influencing factors of using the DCPT and its perceived usability (its usefulness as a tool and its ease of use). Open-ended questions about users’ experiences with the DCPT were also included to better understand the strengths and weaknesses of the tool, as well as areas that could be improved. Factor analysis of the quantitative results and subsequent regression models revealed several underlying factors that affect the perceived usability of the DCPT. Responses to the open-ended questions revealed several themes of users’ concerns: the amount of time required to use the DCPT, the structure and format of the DCPT, alignment of the DCPT with particular contexts, and the use of the DCPT to engage faculty and the library community. By correlating themes identified from the open-ended questions with the analysis of quantitative data, this paper provides the first empirical assessment of the DCPT that could help further improve the toolkit’s usability based on user needs and expectations. The methodology used in the study could readily be applied to assess and improve the utility of other tools used by data and information professional. ", "article_title": "Assessing Perceived Usability of the Data Curation Profile Toolkit Using the Technology Acceptance Model", "authors": [{"given": "Tao", "family": "Zhang", "affiliation": [{"original_name": "Purdue University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Lisa", "family": "Zilinski", "affiliation": [{"original_name": "Carnegie Mellon University", "normalized_name": "Carnegie Mellon University", "country": "United States", "identifiers": {"ror": "https://ror.org/05x2bcf33", "GRID": "grid.147455.6"}}]}, {"given": "D. Scott", "family": "Brandt", "affiliation": [{"original_name": "Purdue University", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Jake", "family": "Carlson", "affiliation": [{"original_name": "University of Michigan", "normalized_name": "University of Michigan–Ann Arbor", "country": "United States", "identifiers": {"ror": "https://ror.org/00jmfr291", "GRID": "grid.214458.e"}}]}], "publisher": "Edinburgh University", "date": "2015-01-30", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "10", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}