{"url": "http://dx.doi.org/10.5399/uo/hsda.4.1.3470", "identifier": {"string_id": "10.5399/uo/hsda.4.1.3470", "id_scheme": "DOI"}, "abstract": "The title does not refer to the application of knowledge through faculty engagement in community-based research, teaching and service – something that is usually understood as community-engaged scholarship. The change of paradigm referred to in the title should be understood within the broader framework of the general transformation of our participatory or convergence culture in the age of social and “spreadable” media (to use a terminology made current by Richard Jenkins). As the Web 2.0 evolves toward the Web 3.0, or the semantic web, community-engaged scholarship remains one of the most crucial components of this larger and more pervasive phenomenon and this also refers to the \"academic community\" at large. What is at stake is not only the transformation of the procedures of scholarly research and learning but also and more importantly the transformation of its goals: traditionally based (at least in the humanities) on the individual researcher and author, knowledge work, or the scholarly mode of production, is increasingly overhauled into a collective, collaborative enterprise, on a much larger scale. Moreover, the general move from discursive to graphic-algorithmic forms of data visualization and interpretation (including textual data), has eventful consequences for critical thinking: as humanists engaged with a potentially radical transformation of the community we belong to, our most daunting task is how to transpose traditional scholarly practices onto the new platform, envisioning new goals and outputs for our traditional tasks.", "article_title": "Change of Paradigm: From Individual to Community-Based Scholarship", "authors": [{"given": "Massimo", "family": "Riva", "affiliation": [{"original_name": "Brown University", "normalized_name": "Brown University", "country": "United States", "identifiers": {"ror": "https://ror.org/05gq02987", "GRID": "grid.40263.33"}}]}], "publisher": "Oregon State University", "date": "2015-09-23", "keywords": null, "journal_title": "Humanist Studies & the Digital Age", "volume": "4", "issue": "1", "ISSN": [{"value": "2158-3846", "type": "electronic"}]}