{"url": "http://dx.doi.org/10.1093/llc/16.3.287", "identifier": {"string_id": "10.1093/llc/16.3.287", "id_scheme": "DOI"}, "abstract": "The World of Dante [http://www.iath.virginia.edu/dante/] offers a hypermedia environment for the study of the Inferno. Developed under the auspices of the Institute for Advanced Technologies in the Humanities (IATH), the major sections of the project include a visual archive of approximately three hundred images; the TEI-tagged Italian text of the Inferno, presented through Dynaweb; and a text visualization, a VRML model of the Inferno. This paper describes the visual material found on the project, explains the tagging criteria employed in the markup of the poem, and clarifies the type of research that the project makes possible. The project went online in December 1997. Readers have often been struck by the clarity, variety, and complexity of Dante's comparisons. T. S. Eliot considered Dante unequalled in his ability to form ‘clear visual images’ (Eliot, Dante, Faber & Faber, London, 1929, p. 22). In his essay, ‘A Reading of the Inferno’, Eliot singles out for praise the remarkable quality of Dante's ‘visual imagination’, citing as an example the comparison of a group of men who gaze at Dante and Virgil in the dark to an old tailor peering at the eye of his needle (Inf. 15. 21). Eliot's remarks concerning the remarkable nature of Dante's similes arise in the midst of a discussion of the poetics of the Inferno. Hell is the most material of the three realms of the Afterlife. Dante mentions about one hundred places in the Inferno, sixty in the Purgatorio, and twenty in the Paradiso. Dante's Hell is made up of precipitous slopes, barren forests, thunderous waterfalls, bloody rivers, and burning sands. To convey the savage nature of these places, Dante often evokes the landscape of his own Italy. Yet the multitude of natural, architectural, and geographical allusions that constitute Dante's material world are unfamiliar to most readers. One of the principal objectives of The World of Dante is to make Dante's universe more accessible to students of the poem.", "article_title": "The World of Dante: a hypermedia archive for the study of the Inferno", "authors": [{"given": " Deborah", "family": "Parker", "affiliation": [{"original_name": "University of VirginiaCharlottesville, VA, USA", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004-11-11", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "16", "issue": "3", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}