{"url": "http://dx.doi.org/10.1093/llc/18.1.63", "identifier": {"string_id": "10.1093/llc/18.1.63", "id_scheme": "DOI"}, "abstract": "This paper looks at the usability of XML for the electronic publication of field reports by commercial archaeological units. The field reports fall into the field of grey literature as they are produced as client reports by commercial units as part of the planning process and do not receive official publication or widespread dissemination. The paper uses a small commercial unit called ARCUS at the University of Sheffield as a case study and to mark up a sample of excavation report using XML and the TEI Lite DTD. It also looks at the possibility of incorporating controlled archaeological vocabulary into the DTD. The paper comes to the conclusion that the electronic publication of grey reports would be very useful as it would allow a quicker response time and a rapid dissemination of information within the fast‐moving and changing environment of commercial archaeology. XML would be a useful tool for the publication of field reports as it would allow practitioners to selectively download separate sections of field reports that are of particular importance to them and to improve the searchability of reports on the web. It is recognized that national archaeological institutions will also have to accept electronic versions of field reports in order for them to be able to be built into the financial framework of a commercial project design.", "article_title": "The Publication of Archaeological Excavation Reports Using XML", "authors": [{"given": "C.", "family": "Meckseper", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004-11-10", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "18", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}