{"url": "http://dx.doi.org/10.1093/llc/16.2.161", "identifier": {"string_id": "10.1093/llc/16.2.161", "id_scheme": "DOI"}, "abstract": "This paper describes the philosophy behind what represents one of the most ambitious projects of its kind ever to have been undertaken in the Spanish-speaking world: the Miguel de Cervantes Digital Library (http://cervantesvirtual.com/). It explains the reasons behind its creation, the private–public sector alliance that has made it possible, and the new ground being explored by its creators in terms of the new services it offers to its audience worldwide and of innovative application of digital methods. The final section of the paper deals with the technical underpinnings of this project at present and in the future, reporting continuing research and development activities being carried out at the Miguel de Cervantes Digital Library in the field of text markup and derived applications, such as automatic transformation of documents to different formats and complex searches performed upon the small textual objects defined by the markup scheme. A brief survey of works done on Named Entity Recognition that can be applied to automatic markup is also included. Finally, there are some comments on the research lines we intend to follow concerning information retrieval and filtering from structurally marked-up texts.This is a fascinating period in the history of libraries and publishing. For the first time, it is possible to build large-scale services where collections of information are stored in digital formats and retrieved over the networks (Arms, 2000).", "article_title": "The Miguel de Cervantes Digital Library: the Hispanic voice on the web", "authors": [{"given": " Alejandro", "family": "Bia", "affiliation": [{"original_name": "University of Alicante, Alicante, Spain", "normalized_name": "University of Alicante", "country": "Spain", "identifiers": {"ror": "https://ror.org/05t8bcz72", "GRID": "grid.5268.9"}}]}, {"given": " Andrés", "family": "Pedreño", "affiliation": [{"original_name": "University of Alicante, Alicante, Spain", "normalized_name": "University of Alicante", "country": "Spain", "identifiers": {"ror": "https://ror.org/05t8bcz72", "GRID": "grid.5268.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004-11-11", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "16", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}