{"url": "http://dx.doi.org/10.1093/llc/16.1.99", "identifier": {"string_id": "10.1093/llc/16.1.99", "id_scheme": "DOI"}, "abstract": "The paper describes the creation of a digital network of the extant Middle High German dictionaries. As these works of reference, i.e. the Mittelhochdeutsches Worterbuch by Benecke-Muller-Zarncke, the Mittelhochdeutsches Handwdrterbuch and its supplement by Lexer, and the Findebuch, are very closely interconnected and can only be used simultaneously, they were ideal candidates for the composition of an electronic dictionary compound. In creating that network, the data have been encoded according to the Guidelines of the Text Encoding Initiative. Such markup when applied to historical dictionaries raised some problems, which are discussed in the second part of this paper. The main section deals with the graphical user interface of the digital dictionary and shows various searches in the dictionary database. Examples of philologjc relevance are not only given as far as full text retrieval is concerned but also for queries with the aid of preclassified criteria such as, for example, parts of speech, specific text types, or word forms in foreign languages. The institutional and organizational preconditions of the digitization are finally outiined. The simultaneous use of the dictionaries closely tied together already in their printed form will be made much easier by the digital network. Moreover, this network might well be a starting point for a web that interlinks all major dictionaries of the historical periods and of the dialects of the German language..", "article_title": "New directions in middle high German lexicography: dictionaries interlinked electronically", "authors": [{"given": " Johannes", "family": "Fournier", "affiliation": [{"original_name": "University of TrierTrier, Germany", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2004-11-11", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "16", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}