<html>
<head><script src="//archive.org/includes/analytics.js?v=cf34f82" type="text/javascript"></script>
<script type="text/javascript">window.addEventListener('DOMContentLoaded',function(){var v=archive_analytics.values;v.service='wb';v.server_name='wwwb-app201.us.archive.org';v.server_ms=628;archive_analytics.send_pageview({});});</script><script type="text/javascript" src="/_static/js/playback.bundle.js?v=VsAvnOBw" charset="utf-8"></script>
<script type="text/javascript" src="/_static/js/wombat.js?v=cRqOKCOw" charset="utf-8"></script>
<script type="text/javascript">
  __wm.init("http://web.archive.org/web");
  __wm.wombat("http://www.hum.gu.se:80/allcach2004/AP/html/prop33.html","20040903094138","http://web.archive.org/","web","/_static/",
	      "1094204498");
</script>
<link rel="stylesheet" type="text/css" href="/_static/css/banner-styles.css?v=bsmaklHF" />
<link rel="stylesheet" type="text/css" href="/_static/css/iconochive.css?v=qtvMKcIJ" />
<!-- End Wayback Rewrite JS Include -->

<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>ALLC/ACH Conference 2004 Abstract: Hermeneia: un banco de recursos multiling&uuml;e para el estudio de la literatura a trav&eacute;s de las tecnolog&iacute;as digitales</title>
</head>
<body bgcolor="#FFFFE0"><!-- BEGIN WAYBACK TOOLBAR INSERT -->
<style type="text/css">
body {
  margin-top:0 !important;
  padding-top:0 !important;
  /*min-width:800px !important;*/
}
</style>
<script>__wm.rw(0);</script>
<div id="wm-ipp-base" lang="en" style="display:none;direction:ltr;">
<div id="wm-ipp" style="position:fixed;left:0;top:0;right:0;">
<div id="wm-ipp-inside">
  <div style="position:relative;">
    <div id="wm-logo" style="float:left;width:110px;padding-top:12px;">
      <a href="/web/" title="Wayback Machine home page"><img src="/_static/images/toolbar/wayback-toolbar-logo-200.png" srcset="/_static/images/toolbar/wayback-toolbar-logo-100.png, /_static/images/toolbar/wayback-toolbar-logo-150.png 1.5x, /_static/images/toolbar/wayback-toolbar-logo-200.png 2x" alt="Wayback Machine" style="width:100px" border="0" /></a>
    </div>
    <div class="r" style="float:right;">
      <div id="wm-btns" style="text-align:right;height:25px;">
                  <div id="wm-save-snapshot-success">success</div>
          <div id="wm-save-snapshot-fail">fail</div>
          <a id="wm-save-snapshot-open" href="#"
	     title="Share via My Web Archive" >
            <span class="iconochive-web"></span>
          </a>
          <a href="https://archive.org/account/login.php"
             title="Sign In"
             id="wm-sign-in"
          >
            <span class="iconochive-person"></span>
          </a>
          <span id="wm-save-snapshot-in-progress" class="iconochive-web"></span>
        	<a href="http://faq.web.archive.org/" title="Get some help using the Wayback Machine" style="top:-6px;"><span class="iconochive-question" style="color:rgb(87,186,244);font-size:160%;"></span></a>
	<a id="wm-tb-close" href="#close" onclick="__wm.h(event);return false;" style="top:-2px;" title="Close the toolbar"><span class="iconochive-remove-circle" style="color:#888888;font-size:240%;"></span></a>
      </div>
      <div id="wm-share">
          <a href="/web/20040903094138/http://web.archive.org/screenshot/http://www.hum.gu.se/allcach2004/AP/html/prop33.html"
             id="wm-screenshot"
             title="screenshot">
            <span class="wm-icon-screen-shot"></span>
          </a>
	<a id="wm-share-facebook" href="#" data-url="http://web.archive.org/web/20040903094138/http://www.hum.gu.se:80/allcach2004/AP/html/prop33.html" title="Share on Facebook" style="margin-right:5px;" target="_blank"><span class="iconochive-facebook" style="color:#3b5998;font-size:160%;"></span></a>
	<a id="wm-share-twitter" href="#" data-url="http://web.archive.org/web/20040903094138/http://www.hum.gu.se:80/allcach2004/AP/html/prop33.html" title="Share on Twitter" style="margin-right:5px;" target="_blank"><span class="iconochive-twitter" style="color:#1dcaff;font-size:160%;"></span></a>
      </div>
    </div>
    <table class="c" style="">
      <tbody>
	<tr>
	  <td class="u" colspan="2">
	    <form target="_top" method="get" action="/web/submit" name="wmtb" id="wmtb"><input type="text" name="url" id="wmtbURL" value="http://www.hum.gu.se/allcach2004/AP/html/prop33.html" onfocus="this.focus();this.select();" /><input type="hidden" name="type" value="replay" /><input type="hidden" name="date" value="20040903094138" /><input type="submit" value="Go" /></form>
	  </td>
	  <td class="n" rowspan="2" style="width:110px;">
	    <table>
	      <tbody>
		<!-- NEXT/PREV MONTH NAV AND MONTH INDICATOR -->
		<tr class="m">
		  <td class="b" nowrap="nowrap">Aug</td>
		  <td class="c" id="displayMonthEl" title="You are here: 09:41:38 Sep 03, 2004">SEP</td>
		  <td class="f" nowrap="nowrap"><a href="http://web.archive.org/web/20041025014245/http://www.hum.gu.se:80/allcach2004/AP/html/prop33.html" title="25 Oct 2004"><strong>Oct</strong></a></td>
		</tr>
		<!-- NEXT/PREV CAPTURE NAV AND DAY OF MONTH INDICATOR -->
		<tr class="d">
		  <td class="b" nowrap="nowrap"><img src="/_static/images/toolbar/wm_tb_prv_off.png" alt="Previous capture" width="14" height="16" border="0" /></td>
		  <td class="c" id="displayDayEl" style="width:34px;font-size:24px;white-space:nowrap;" title="You are here: 09:41:38 Sep 03, 2004">03</td>
		  <td class="f" nowrap="nowrap"><a href="http://web.archive.org/web/20041025014245/http://www.hum.gu.se:80/allcach2004/AP/html/prop33.html" title="01:42:45 Oct 25, 2004"><img src="/_static/images/toolbar/wm_tb_nxt_on.png" alt="Next capture" width="14" height="16" border="0" /></a></td>
		</tr>
		<!-- NEXT/PREV YEAR NAV AND YEAR INDICATOR -->
		<tr class="y">
		  <td class="b" nowrap="nowrap">2003</td>
		  <td class="c" id="displayYearEl" title="You are here: 09:41:38 Sep 03, 2004">2004</td>
		  <td class="f" nowrap="nowrap">2005</td>
		</tr>
	      </tbody>
	    </table>
	  </td>
	</tr>
	<tr>
	  <td class="s">
	    	    <div id="wm-nav-captures">
	      	      <a class="t" href="/web/20040903094138*/http://www.hum.gu.se/allcach2004/AP/html/prop33.html" title="See a list of every capture for this URL">6 captures</a>
	      <div class="r" title="Timespan for captures of this URL">03 Sep 2004 - 21 Apr 2005</div>
	      </div>
	  </td>
	  <td class="k">
	    <a href="" id="wm-graph-anchor">
	      <div id="wm-ipp-sparkline" title="Explore captures for this URL" style="position: relative">
		<canvas id="wm-sparkline-canvas" width="625" height="27" border="0"></canvas>
	      </div>
	    </a>
	  </td>
	</tr>
      </tbody>
    </table>
    <div style="position:absolute;bottom:0;right:2px;text-align:right;">
      <a id="wm-expand" class="wm-btn wm-closed" href="#expand" onclick="__wm.ex(event);return false;"><span id="wm-expand-icon" class="iconochive-down-solid"></span> <span style="font-size:80%">About this capture</span></a>
    </div>
  </div>
    <div id="wm-capinfo" style="border-top:1px solid #777;display:none; overflow: hidden">
                    <div id="wm-capinfo-collected-by">
    <div style="background-color:#666;color:#fff;font-weight:bold;text-align:center">COLLECTED BY</div>
    <div style="padding:3px;position:relative" id="wm-collected-by-content">
            <div style="display:inline-block;vertical-align:top;width:50%;">
			<span class="c-logo" style="background-image:url(https://archive.org/services/img/alexacrawls);"></span>
		Organization: <a style="color:#33f;" href="https://archive.org/details/alexacrawls" target="_new"><span class="wm-title">Alexa Crawls</span></a>
		<div style="max-height:75px;overflow:hidden;position:relative;">
	  <div style="position:absolute;top:0;left:0;width:100%;height:75px;background:linear-gradient(to bottom,rgba(255,255,255,0) 0%,rgba(255,255,255,0) 90%,rgba(255,255,255,255) 100%);"></div>
	  Starting in 1996, <a href="http://www.alexa.com/">Alexa Internet</a> has been donating their crawl data to the Internet Archive.  Flowing in every day, these data are added to the <a href="http://web.archive.org/">Wayback Machine</a> after an embargo period.
	</div>
	      </div>
      <div style="display:inline-block;vertical-align:top;width:49%;">
			<span class="c-logo" style="background-image:url(https://archive.org/services/img/alexa_dy)"></span>
		<div>Collection: <a style="color:#33f;" href="https://archive.org/details/alexa_dy" target="_new"><span class="wm-title">Alexa Crawls DY</span></a></div>
		<div style="max-height:75px;overflow:hidden;position:relative;">
	  <div style="position:absolute;top:0;left:0;width:100%;height:75px;background:linear-gradient(to bottom,rgba(255,255,255,0) 0%,rgba(255,255,255,0) 90%,rgba(255,255,255,255) 100%);"></div>
	  Crawl data donated by Alexa Internet. This data is currently not publicly accessible
	</div>
	      </div>
    </div>
    </div>
    <div id="wm-capinfo-timestamps">
    <div style="background-color:#666;color:#fff;font-weight:bold;text-align:center" title="Timestamps for the elements of this page">TIMESTAMPS</div>
    <div>
      <div id="wm-capresources" style="margin:0 5px 5px 5px;max-height:250px;overflow-y:scroll !important"></div>
      <div id="wm-capresources-loading" style="text-align:left;margin:0 20px 5px 5px;display:none"><img src="/_static/images/loading.gif" alt="loading" /></div>
    </div>
    </div>
  </div></div></div></div><div id="donato" style="position:relative;width:100%;">
  <div id="donato-base">
    <iframe id="donato-if" src="https://archive.org/includes/donate.php?as_page=1&amp;platform=wb&amp;referer=http%3A//web.archive.org/web/20040903094138/http%3A//www.hum.gu.se/allcach2004/AP/html/prop33.html"
	    scrolling="no" frameborder="0" style="width:100%; height:100%">
    </iframe>
  </div>
</div><script type="text/javascript">
__wm.bt(625,27,25,2,"web","http://www.hum.gu.se/allcach2004/AP/html/prop33.html","20040903094138",1996,"/_static/",["/_static/css/banner-styles.css?v=bsmaklHF","/_static/css/iconochive.css?v=qtvMKcIJ"]);
  __wm.rw(1);
</script>
<!-- END WAYBACK TOOLBAR INSERT -->
<h2 align="center">Hermeneia: un banco de recursos multiling&uuml;e para el estudio de la literatura a trav&eacute;s de las tecnolog&iacute;as digitales</h2>
<p align="CENTER">
<i>
Paper
</i>
</p>
<p align="CENTER">
Moll, Isabel Clara (Universitat Oberta de Catalunya (UOC)) imoll@uoc.edu<br>
Canadell, Roger (Universitat Oberta de Catalunya (UOC)) rcanadell@uoc.edu<br>

</p>
<center>
<table border="1">
<tr>
<td>
<p>
<b>Contact Information recorded for this paper is:</b>
</p>
Av. Tibidabo, 39-43<br>
08035 Barcelona<br>
Catalunya (Spain)<br>

<br>
<i>Telephone: </i>932537570<br>
<i>FAX: </i>934176495<br>
</td>
</tr>
</table>
<br>
<br>
<table border="1">
<tr>
<td colspan="2">
<p>
<b>The equipment requirements recorded for this paper are:</b>
</p>
</td>
</tr>
<tr>
<td width="50%"><b>Computer Requirements:</b>
<br>
Power Point<br>

</td><td width="50%"><b>Special Equipment:</b>
<br>
<i>(nothing recorded)</i>

<br>

</td>
</tr>
</table>
</center>
<hr>


<p>Nadie se atreve ya a negar que Internet est&aacute; cambiando nuestras vidas, la manera de actuar, de relacionarnos, de consumir, de informarnos, de aprender. Como en el resto de &aacute;reas del conocimiento y de la cultura, la literatura tambi&eacute;n ha encontrado su espacio propio en la red, y las tecnolog&iacute;as de la informaci&oacute;n y la comunicaci&oacute;n han introducido nuevos cambios en la manera como &eacute;sta se crea, se estudia, se ense&ntilde;a y se recibe en nuestros d&iacute;as. El proyecto de investigaci&oacute;n Hermeneia: Estudios Literarios y Tecnolog&iacute;as Digitales apuesta claramente por una literatura emergente que consideramos, sin duda, un campo muy f&eacute;rtil que es necesario empezar a labrar a trav&eacute;s de la reflexi&oacute;n y la valoraci&oacute;n de las consecuencias de la aplicaci&oacute;n de las TIC en los procesos de composici&oacute;n, recepci&oacute;n, distribuci&oacute;n y docencia del producto literario. Para ello, el grupo Hermeneia  ha definido como &aacute;mbitos tem&aacute;ticos de investigaci&oacute;n a) el estudio de las alteraciones en las formas de creaci&oacute;n y de difusi&oacute;n de la literatura &ndash;y sus efectos- a lo largo de la historia, b) las TIC y la difusi&oacute;n de la literatura, c) las TIC y la docencia de la literatura, d) el hipertexto como convergencia entre la teor&iacute;a literaria y la tecnolog&iacute;a, y e) el estudio de la creaci&oacute;n literaria electr&oacute;nica (e-literatura).</p>
	
<p align="CENTER">
<img src="/web/20040903094138im_/http://www.hum.gu.se/allcach2004/AP/img/im27.gif"></p>
<p>Una de las herramientas b&aacute;sicas que hemos concebido para el proyecto Hermeneia ha sido su p&aacute;gina web (<a href="www.uoc.edu/in3/hermeneia">www.uoc.edu/in3/hermeneia</a>). [IMAGEN 1: home_hermeneia.gif]. La p&aacute;gina pretende ser un espacio en el cual se puedan analizar y discutir los aspectos m&aacute;s controvertidos e interesantes del nuevo panorama literario que empieza a perfilarse. Una de las bases sobre las cuales trabaja Hermeneia &ndash;y cualquier grupo de investigaci&oacute;n- es el de esbozar el estado de la cuesti&oacute;n. En nuestro caso, a la hora de realizar esta operaci&oacute;n, tan significativo ser&aacute; lo que vayamos encontrando por el camino como aquellos vac&iacute;os que quedan por llenar, de tal manera que podamos discernir en un futuro qu&eacute; es lo que nosotros aportamos, cu&aacute;les son los silencios que m&aacute;s nos preocupan, pero tambi&eacute;n cu&aacute;les son las carencias m&aacute;s importantes que deben ser subsanadas. Asimismo, la web del grupo de investigaci&oacute;n pretende ser un instrumento b&aacute;sico para la comunicaci&oacute;n entre los miembros del grupo (que provienen de dieciocho universidades: catalanas, inglesas, francesas, finlandesas, italianas y norteamericanas) y tambi&eacute;n representa una oportunidad de oro para poner al alcance de la comunidad universitaria, docente e investigadora, una labor que debe sobrepasar necesariamente &mdash;y esta es una de las posibilidades m&aacute;s atrayentes que nos ofrece el medio&mdash; las fronteras acad&eacute;micas m&aacute;s inmediatas, m&aacute;s cercanas a los investigadores del grupo, para conciliar los intereses y la adhesi&oacute;n de estudiosos que no pertenec&iacute;an al equipo original y que han reforzado las propuestas de estudio, as&iacute; como la variedad ling&uuml;&iacute;stica en que se generan, con el consiguiente beneficio de las distintas literaturas nacionales. Con ello se ha logrado que investigadores europeos y americanos formen parte del grupo de forma abierta y con distintos grados de vinculaci&oacute;n y  colaboraci&oacute;n. El multiling&uuml;ismo de la p&aacute;gina, que se ofrece en versi&oacute;n catalana, espa&ntilde;ola, francesa e inglesa facilita, bajo nuestro parecer, la consecuci&oacute;n de estos objetivos, a la vez que se esfuerza por actuar de &ldquo;contenedor&rdquo; o &ldquo;preservador&rdquo; de creaciones literarias y de reflexiones te&oacute;ricas en lenguas como el portugu&eacute;s, el italiano, y el alem&aacute;n, adem&aacute;s del catal&aacute;n, el espa&ntilde;ol, el ingl&eacute;s o el franc&eacute;s. En este sentido, la web de HERMENEIA act&uacute;a tambi&eacute;n como preservadora del patrimonio literario electr&oacute;nico en la red. Una especie de &ldquo;museo&rdquo; que alberga la creaci&oacute;n y la reflexi&oacute;n sobre la literatura en un entorno inform&aacute;tico.</p>
	
<p>Sin embargo, la p&aacute;gina est&aacute; orientada b&aacute;sicamente hacia el an&aacute;lisis te&oacute;rico de las nuevas formas de creaci&oacute;n literaria que se han afianzado con la amplia implantaci&oacute;n de las tecnolog&iacute;as digitales en la sociedad contempor&aacute;nea y por ello nos interesa plantearnos los interrogantes m&aacute;s significativos desde la teor&iacute;a literaria a prop&oacute;sito del mundo literario digital. En este sentido, se ofrece un banco de recursos que alberga un cat&aacute;logo de m&aacute;s de dos centenares de enlaces a textos te&oacute;ricos, que se va actualizando peri&oacute;dicamente (Sala de Lectura - <a href="http://web.archive.org/web/20040903094138/http://www.uoc.edu/in3/hermeneia/sala_de_lectura.htm">http://www.uoc.edu/in3/hermeneia/sala_de_lectura.htm</a>), en el cual se encuentran los textos m&aacute;s relevantes del panorama internacional y una secci&oacute;n dedicada a la producci&oacute;n generada por el mismo grupo de investigaci&oacute;n, as&iacute; como una agenda de congresos y simposios y un resumen de las actividades investigadoras realizadas por el grupo. Las nuevas formas de creaci&oacute;n literaria (e-literatura) han permitido confeccionar una Antolog&iacute;a de Literatura Digital (<a href="http://web.archive.org/web/20040903094138/http://www.uoc.edu/in3/hermeneia/antologia.htm">http://www.uoc.edu/in3/hermeneia/antologia.htm</a>) de casi doscientas creaciones que complementa los aspectos te&oacute;ricos con la posibilidad de consultar ejemplos pr&aacute;cticos de escritura digital en diversas lenguas.</p>
	
<p>Gracias a la reflexi&oacute;n que nos permite desarrollar todo este material compilado es posible lanzar una mirada cr&iacute;tica sobre el presente de la literatura digital, su teorizaci&oacute;n, su pr&aacute;ctica, sus formas de difusi&oacute;n, etc., para lo cual se ha elaborado un llamado &ldquo;cibermapa&rdquo; (<a href="http://web.archive.org/web/20040903094138/http://www.uoc.edu/in3/hermeneia/cibermapa.htm">http://www.uoc.edu/in3/hermeneia/cibermapa.htm</a>) de m&aacute;s de un centenar de fichas que permita establecer cu&aacute;l es el estado de la cuesti&oacute;n, aunque admitamos que este estado de la cuesti&oacute;n est&aacute; sometido a un proceso de cambio continuo. [IMAGEN 2: cibermapa.gif].</p>
	
<p align="CENTER">
<img src="/web/20040903094138im_/http://www.hum.gu.se/allcach2004/AP/img/im28.gif"></p>
<p>Este &ldquo;cibermapa&rdquo; nace con la voluntad ingenua de cumplir la funci&oacute;n de mediador, entre el p&uacute;blico interesado en la literatura y en Internet, mediante la descripci&oacute;n de un panorama descomunalmente vasto. Por ello, cualquier clasificaci&oacute;n que haya surgido de esta observaci&oacute;n previa de la red siempre ser&aacute; una clasificaci&oacute;n inexacta, parcial, porque parte de una realidad que no tiene medidas humanas. O sea, que la motivaci&oacute;n inicial que aport&oacute; Vannevar Bush a la concepci&oacute;n de un sistema de tratamiento de la informaci&oacute;n que permitiera poner al alcance de muchos lo que en principio empezaba a parecer inabarcable (Memex), es la misma que nos lleva a nosotros a intentar definir unos itinerarios de navegaci&oacute;n que relacionan la literatura y las nuevas tecnolog&iacute;as, y que pretende encontrar puntos destacables y decisivos que sirvan, tambi&eacute;n, para desarrollar la investigaci&oacute;n. [IMAGEN 3: ficha_cibermapa.gif]</p>
	
<p align="CENTER">
<img src="/web/20040903094138im_/http://www.hum.gu.se/allcach2004/AP/img/im29.gif"></p>
<p>Esta primera fase del trabajo del grupo de investigaci&oacute;n (2002-2003) ha servido para hacer el mapa digital-literario y ahora llega el momento de hacer an&aacute;lisis cr&iacute;ticos m&aacute;s profundos sobre herramientas de ense&ntilde;anza as&iacute; como sobre obras digitales concretas. Esto nos permitir&aacute; pasar al desarrollo de una metodolog&iacute;a propia acerca de la investigaci&oacute;n en esta &aacute;rea que, esperamos,  pueda exportarse a otros grupos de investigaci&oacute;n.</p>
	
<p>Por otro lado, este joven proyecto, adem&aacute;s de poner de manifiesto, analizar y estudiar la confluencia entre la teor&iacute;a de la literatura y las tecnolog&iacute;as digitales, pretende que estos estudios influyan en el &aacute;mbito de la docencia -especialmente la docencia virtual de literatura en la Universitat Oberta de Catalunya- a trav&eacute;s de los usos pedag&oacute;gicos de los medios digitales. Esta influencia se ha concretado en la confecci&oacute;n de hipertextos educativos (<a href="http://web.archive.org/web/20040903094138/http://www.uoc.edu/in3/hermeneia/exemples.htm">http://www.uoc.edu/in3/hermeneia/exemples.htm</a>) que forman parte de los materiales did&aacute;cticos con los que trabajan los estudiantes de nuestra universidad. [IMAGEN 4: ejemplo_did&aacute;ctico.gif]. De esta manera, se pone de manifiesto que un mayor conocimiento del medio posibilita no s&oacute;lo la renovaci&oacute;n de la tarea docente sino que tambi&eacute;n redunda en un mayor rendimiento acad&eacute;mico, adem&aacute;s de promover el cambio en la concepci&oacute;n del estudio de la literatura, tanto por parte de los estudiantes como de los profesores. Algunos de estos Ejemplos Did&aacute;cticos elaborados por profesores y estudiantes tambi&eacute;n son accesibles a trav&eacute;s de la web de Hermeneia y ponen de manifiesto la uni&oacute;n entre la generaci&oacute;n y la transmisi&oacute;n de conocimiento. De este modo tambi&eacute;n perseguimos una actitud &eacute;tica fundamentada en el intercambio cient&iacute;fico y en las formas de colaboraci&oacute;n abierta y constructiva en medios acad&eacute;micos, y tratamos de dar salida a nuestra voluntad de compartir el conocimiento, de integrar la investigaci&oacute;n y retroalimentar con ella la docencia.</p>




<p align="CENTER">
<img src="/web/20040903094138im_/http://www.hum.gu.se/allcach2004/AP/img/im30.gif"></p>
<h3>References</h3>
<table>
<tr>
<td valign="TOP" width="50"><a name="enBibliography">Bibliography</a></td><td>Bush, Vannevar (1945): &ldquo;As we may think&rdquo;, The Atlantic Monthly, 1, 1001-108.
</td>
</tr>
<tr>
<td valign="TOP" width="50"><a name="enBibliography">Bibliography</a></td><td>Castells, Manuel (2001): La galaxia internet (reflexiones sobre internet, empresa y sociedad, Barcelona, Plaza &amp; Jan&eacute;s. 
</td>
</tr>
<tr>
<td valign="TOP" width="50"><a name="enBibliography">Bibliography</a></td><td>Cl&eacute;ment, Jean (2000): &ldquo;Hypertexte et complexit&eacute;&rdquo;, &Eacute;tudes Fran&ccedil;aises, 36, 2, 39-57. 
</td>
</tr>
<tr>
<td valign="TOP" width="50"><a name="enBibliography">Bibliography</a></td><td>Landow, George P. (comp.) (1997): Teor&iacute;a del hipertexto, Barcelona, Paid&oacute;s.</td>
</tr>
</table>
</body>
</html>
<!--
     FILE ARCHIVED ON 09:41:38 Sep 03, 2004 AND RETRIEVED FROM THE
     INTERNET ARCHIVE ON 22:08:20 Nov 27, 2020.
     JAVASCRIPT APPENDED BY WAYBACK MACHINE, COPYRIGHT INTERNET ARCHIVE.

     ALL OTHER CONTENT MAY ALSO BE PROTECTED BY COPYRIGHT (17 U.S.C.
     SECTION 108(a)(3)).
-->
<!--
playback timings (ms):
  captures_list: 544.924
  exclusion.robots: 0.157
  exclusion.robots.policy: 0.15
  RedisCDXSource: 8.479
  esindex: 0.008
  LoadShardBlock: 489.054 (3)
  PetaboxLoader3.datanode: 79.393 (4)
  CDXLines.iter: 43.886 (3)
  PetaboxLoader3.resolve: 241.979 (2)
  load_resource: 77.828
-->