[
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/8631",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/8631",
            "id_scheme": "DOI"
        },
        "abstract": "La lettura della poesia è uno degli aspetti più trascurati dagli studi italiani di Critica e Linguistica. Questa ricerca sperimentale, sulla scia degli studi di Beccaria [2], esplora l’apparato musicale di un componimento poetico attraverso le metodologie della Fonetica strumentale. Lo studio si concentra sulla prosodia delle letture del Congedo del viaggiatore cerimonioso di Giorgio Caproni. Gli approcci sono di tipo qualitativo e quantitativo: dall’analisi della lettura dell’autore, l’osservazione si è estesa ad altre undici voci, differenti sul piano professionale e diacronico (poeti contemporanei, speaker radiofoniche e attori). L’ascolto rappresenta l’avvio della ricerca, unito all’osservazione di oscillogrammi e spettrogrammi e alla loro annotazione a mezzo del software Praat: il dato sonoro, tuttavia, viene sempre messo in relazione con il dato testuale. Lo sguardo comparativo evidenzia un’eterogeneità dei dati, collocabile in una norma generale, con un sistema di convergenze consistente: si sono individuate inoltre tendenze prevalenti, ad esempio a livello melodico e di suddivisione prosodica. Lo studio, oltre a evidenziare varietà linguistiche considerevoli, rivela aspetti della poesia italiana da sempre trascurati e ora esperibili, grazie alle tecnologie e ai mezzi di studio sviluppati. Il lavoro fin qui svolto si propone, inoltre, come punto di partenza per “VIP – Voices of Italian Poets”, progetto dedicato a letture originali e contemporanee di poesie italiane del Novecento, corredate da annotazioni linguistiche a diversi livelli.",
        "article_title": "Prosodie del Congedo – Analisi fonetica comparativa di dodici letture della prosopopea di Giorgio Caproni",
        "authors": [
            {
                "given": "Valentina",
                "family": "Colonna",
                "affiliation": [
                    "Università degli Studi di Genova-Università degli Studi di Torino"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-12-18",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/8630",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/8630",
            "id_scheme": "DOI"
        },
        "abstract": "This paper explores how metaphors in Dante’s Commedia can be identified, classified and organized in a database so as to provide thorough and solid data to aid their understanding. All metaphors in the poem are first identified through a linguistic procedure called MIP (i.e. Metaphor Identification Process), based on the comparison between the contextual and the basic meaning of each word-unit. The metaphors thus identified are later classified based on syntactic, semantic and rhetorical structure criteria, taking into account both medieval explanations of figurative language and the features of Dante’s metaphors that have always struck the readers of his poem. The findings from this combined linguistic and stylistic analysis provide evidence to support tenets put forward by some literary scholars (e.g. that metaphors increase in number and complexity throughout the poem) and show that metaphors converge in sections of political and religious invective, where one of the main purposes of the author is to elevate his style. The study suggests that a systematic multi-dimensional analysis of metaphor can shed light on its conceptual importance in a text and raise awareness of all its stylistic traits.",
        "article_title": "«Totus poema eius ubique mirabiliter figuratus». Identifying, classifying and describing Dante’s metaphors",
        "authors": [
            {
                "given": "Gaia",
                "family": "Tomazzoli",
                "affiliation": [
                    "Université Paris 3 - Sorbonne Nouvelle"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-12-18",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/8632",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/8632",
            "id_scheme": "DOI"
        },
        "abstract": "Sir. Arthur Conan Doyle was an esteemed and highly experienced physician and much of his medical knowledge spreads into his literary works. In this paper, we propose to study the medical terminology in the stories of Sherlock Holmes through the combination of a mixed method of quantitative and qualitative analysis. Our approach is based on 1) the automatic extraction of medical terminology throughthetidytextR package for text analyses, 2) a terminological analysis by means of the model of terminological record designed fortheTriMED database, and 3) the study of collocations through the linguistic tool Sketch Engine. Thanks to this approach, we perform a linguistic analysis in order to evaluate different terminological aspects such as: the semantic variation due to temporal and historical factors, the difference of the context of use, the change of meaning based on the reference corpus, the variation of use depending on speakers/writers register and, finally, the relationship between terms and their collocations from the syntactic viewpoint.",
        "article_title": "(Not so) Elementary, my dear Watson! A different perspective on medical terminology",
        "authors": [
            {
                "given": "Federica",
                "family": "Vezzani",
                "affiliation": [
                    "University of Padua"
                ]
            },
            {
                "given": "Giorgio Maria",
                "family": "Di Nunzio",
                "affiliation": [
                    "University of Padua"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-12-18",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/8745",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/8745",
            "id_scheme": "DOI"
        },
        "abstract": "The present study draws on corpus stylistics (cf. Semino, Short 2004; Hoover 2007; Mahlberg 2014; Hoover, Culpeper, O’Halloran 2014, to name a few) to investigate the narrative style in Stephenie Meyer’s The Twilight Saga (2005-2008). In particular, it focuses on keywords generated using Wordsmith Tools version 7 (Scott 2017), and the BNC as reference corpus. Qualitative and quantitative analyses show that the most frequent lexical words (nouns, adjectives, and verbs) reflect the writer’s focus on carefully selected physical elements of the characters. More specifically, the nouns preferentially denote specific physical attributes of the characters, the adjectives provide a general description of the protagonists and the setting, while the verbs used present the actions of all the characters, their interaction with the other protagonists, and their position in the narrative situation.",
        "article_title": "Narrative descriptions in Stephenie Meyer’s Twilight Saga. A corpus stylistics perspective.",
        "authors": [
            {
                "given": "Daniela",
                "family": "Cesiri",
                "affiliation": [
                    "Ca’ Foscari Università di Venezia"
                ]
            },
            {
                "given": "Francesca",
                "family": "Coccetta",
                "affiliation": [
                    "Ca’ Foscari Università di Venezia"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-12-18",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/8629",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/8629",
            "id_scheme": "DOI"
        },
        "abstract": "This paper discusses whether the quantitative analysis of auxiliary tun in the Erzehlungen aus den mittlern Zeiten (1624), the first German translation of the Italian short story collection Novellino, can help uncover new aspects of the metalinguistic reflection of the Fruchtbringende Gesellschaft. The Fruchtbringende Gesellschaft was the first German society that focussed on the improvement of the German language, and the Erzehlungen are a product of the “language work” of this society. In the Fruchtbringende Gesellschaft East Central / Low German were seen as the model for a new standard literary German. The metalinguistic writings of the Fruchtbringende Gesellschaft voice this opinion explicitly when describing the rules for orthography, phonotactics and morphology but, as it was typical in the seventeenth-century, they don’t give any rule for syntactic correct structures. Therefore, the question whether the syntax of this newly founded literary German had to be regionally marked as well, can only be inferred by observing the syntactic properties of the texts that resulted from the Fruchtbringende Gesellschaft’s “language work”. The quantitative analysis of auxiliary tun in the Erzehlungen will show that the use of this construction in the studied translation bears a Low German regional markedness. This quantitative linguistic analysis could thus shed some light on the question of which regional variety the first German “linguistic” society considered to be the model for syntactic correctness.",
        "article_title": "Quantifying auxiliary tun to study seventeenth-century German metalinguistic reflection",
        "authors": [
            {
                "given": "Lucia",
                "family": "Assenzi",
                "affiliation": [
                    "Independent Researcher"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-12-18",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/8615",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/8615",
            "id_scheme": "DOI"
        },
        "abstract": "In this paper I discuss the distribution of grammatical monosyllables in the iambic pentameter line. I show that in Milton's Paradise Lost, the word OF appears with greater than expected frequency at the beginning of the line; 27% of all instances of OF are in the first of the ten metrical positions, and 5% of all the lines begin with OF, making it the most frequent line-initial word. I suggest that this might reflect the way that Milton uses enjambment in the poem. It also means that OF may function as a clue to the beginning of the line, in the context of other evidence for lineation, essential if the audience is to establish the metrical form of the poem. In constrast, in the eighteenth century blank verse long poems of Thomson and Cowper, the word AND is relatively frequent at the beginning of the line. But Wordsworth uses both OF and AND as frequent line-initial words,(merging Milton's formal practice with the practice of other writers. The paper concludes by reflecting on the relation between statistical characteristics of text and probabilistic aspects of our knowledge of literary form.",
        "article_title": "“Of” in Paradise Lost as evidence for the metrical line",
        "authors": [
            {
                "given": "Nigel",
                "family": "Fabb",
                "affiliation": [
                    "University of Strathclyde"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-12-18",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9050",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9050",
            "id_scheme": "DOI"
        },
        "abstract": "In this work, we present LOD Navigator, a data visualisation and exploration tool to track the lives and trajectories of Italian Shoah Victims. We take advantage of the work done at the Contemporary Jewish Documentation Center in Milan (CDEC), leading to the publication of a database of Linked Open Data (LOD) containing information about the life and persecution of each victim. Such database was then enriched semi-automatically and uploaded in the LOD Navigator, giving the possibility of getting new insight into collective traits of the Italian Shoah tragedy and into personal stories of victims. Information is now available and can be navigated in an intuitive and interactive way.",
        "article_title": "LOD Navigator: Tracing Movements of Italian Shoah Victims",
        "authors": [
            {
                "given": "Rachele",
                "family": "Sprugnoli",
                "affiliation": [
                    "Fondazione Bruno Kessler, Trento"
                ]
            },
            {
                "given": "Giovanni",
                "family": "Moretti",
                "affiliation": [
                    "Fondazione Bruno Kessler, Trento"
                ]
            },
            {
                "given": "Sara",
                "family": "Tonelli",
                "affiliation": [
                    "Fondazione Bruno Kessler, Trento"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9049",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9049",
            "id_scheme": "DOI"
        },
        "abstract": "The European Holocaust Research Infrastructure (EHRI) is a large-scale EU project that involves 23 institutions and archives working on Holocaust studies, from Europe, Israel and the US. In its first phase (2011-2015) it aggregated archival descriptions and materials on a large scale and built a Virtual Research Environment (portal) for Holocaust researchers based on a graph database. In its second phase (2015-2019), EHRI-2 seeks to enhance the gathered materials using semantic approaches: enrichment, co-referencing, interlinking. Semantic integration involves four of the 14 EHRI-2 work packages and helps integrate databases, free text, and metadata to interconnect historical entities (people, organizations, places, historic events) and create networks. We will present some of the EHRI-2 technical work, including critical issues we have encountered.",
        "article_title": "Semantic Archive Integration for Holocaust Research. The EHRI Research Infrastructure",
        "authors": [
            {
                "given": "Vladmir",
                "family": "Alexiev",
                "affiliation": [
                    "Ontotext Corp., Sofia, Bulgaria"
                ]
            },
            {
                "given": "Ivelina",
                "family": "Nikolova",
                "affiliation": [
                    "Ontotext Corp., Sofia, Bulgaria"
                ]
            },
            {
                "given": "Neli",
                "family": "Hateva",
                "affiliation": [
                    "Ontotext Corp., Sofia, Bulgaria"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9048",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9048",
            "id_scheme": "DOI"
        },
        "abstract": "NIOD, Network War Collections (Netwerk Oorlogsbronnen) and EHRI all work on connecting and making war and Holocaust collections findable and (re-)usable. And both use new technology and Linked Open Data for these goals. This paper gives an overview of the latest developments of the work done in the Netherlands. It is organized around the axis of What, Where, Who &amp; When.",
        "article_title": "Holocaust and World War Two Linked Open Data Developments in the Netherlands",
        "authors": [
            {
                "given": "Annelies",
                "family": "Van Nispen",
                "affiliation": [
                    "NIOD Institute for War-, Holocaust and Genocide Studies / European Holocaust Research Infrastructure, Herengracht 380 Amsterdam"
                ]
            },
            {
                "given": "Lizzy",
                "family": "Jongma",
                "affiliation": [
                    "Network War Collections / Netwerk Oorlogsbronnen, Herengracht 380 Amsterdam"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9047",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9047",
            "id_scheme": "DOI"
        },
        "abstract": "JudaicaLink is a novel resource which provides a knowledge base of Jewish culture and history. It is based on multilingual domain-specific information from encyclopedias and general-purpose knowledge bases such as The Integrated Authority File (GND) of the German National Library. JudaicaLink can be used for contextualization of metadata, i.e., entity resolution within and linking of metadata to improve resource access and to provide richer context to the user. Many resources for contextualization, particularly specialized resources for the given domain, are only available in unstructured form. General-purpose resources like DBpedia are hard to use due to their sheer size while only a very small subset of the data is actually relevant. Therefore, JudaicaLink aims at integrating relevant subsets of various data sources to function as a single hub for the contextualization process. JudaicaLink is freely available on the Web as Linked Open Data. In this paper, we explain how JudaicaLink is built, how it can be accessed by users, as well as its architecture, technical implementation, applications and relations to Jewish culture.",
        "article_title": "JudaicaLink: A Knowledge Base for Jewish Culture and History",
        "authors": [
            {
                "given": "Kay",
                "family": "Eckert",
                "affiliation": [
                    "Web-based Information Systems and Services, Stuttgart Media University Germany"
                ]
            },
            {
                "given": "Maral",
                "family": "Dadvar",
                "affiliation": [
                    "Web-based Information Systems and Services, Stuttgart Media University Germany"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9046",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9046",
            "id_scheme": "DOI"
        },
        "abstract": "In this paper we would like to present some ideas on the use of the archival standards in various contexts that exemplify the complexity of such standards and provide users with innovative ways to handle EAD content. Our main idea is that researchers, Cultural heritage institutions, archival portals and standards maintenance bodies could greatly benefit from a multiscale modelling of archival data, but also from multiscale representations and documentations. A first step is on the way to being cleared in the domain of the management of heterogeneous archival sources in one single environment, namely a federated portal, like in EHRI. We built a methodology based on a specification and customisation method inspired from the long lasting experience of the Text Encoding Initiative (TEI) community. In the TEI framework, one has the possibility of defining project-specific sub-sets or extensions of the TEI guidelines while maintaining both the technical (XML schemas) and editorial (documentation) specification within a single framework. Using the same framework for EAD data allows us to express precise content-oriented rules combined with some interesting possibilities of integrating the human readable documentation in the validation process.",
        "article_title": "Towards Multiscale Archival Digital Data",
        "authors": [
            {
                "given": "Laurent",
                "family": "Romary",
                "affiliation": [
                    "INRIA - Institut national de recherche en informatique et en automatique, 2 rue Simone Iff, Paris"
                ]
            },
            {
                "given": "Charles",
                "family": "Riondet",
                "affiliation": [
                    "INRIA - Institut national de recherche en informatique et en automatique, 2 rue Simone Iff, Paris"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9044",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9044",
            "id_scheme": "DOI"
        },
        "abstract": "Digital audiovisual archives of Holocaust survivor testimonies follow a common classifying practice organizing the material at the unit of the individual. They thus prioritize the uniqueness of each survivor’s story and approach survival as a personal ordeal. The online meta-database of Greek Jewish Holocaust survivors’ testimonies (http://gjst.ha.uth.gr/en/) exemplifies this logic of archiving the historical experience and its mnemonic narrativization. The current project Bonds of Survival critically rethinks these methodological premises of the digital Holocaust archive. It complements current emphasis on the Holocaust survivor and her experience by shifting attention from the individual to her social relations. Taking the relationship as the organizing unit of the archiving order, it uses social network visualization tools to collect, categorize, and display the social interactions of survivors. Researchers can thus more accurately determine the weight and ontology of social relations in the camps and systematically explore the linkages between survival strategies, identity formation, and modes of social interaction.",
        "article_title": "From Individual Survival to Social Networks of Survivors: Rethinking the Digital Archive of the Greek Holocaust",
        "authors": [
            {
                "given": "Paris",
                "family": "Papamichos Chronakis",
                "affiliation": [
                    "Department of Classics and Mediterranean Studies, University of Illinois at Chicago, US"
                ]
            },
            {
                "given": "Giorgios",
                "family": "Antoniou",
                "affiliation": [
                    "Department of History and Archaeology Aristotle University of Thessaloniki, Greece"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9043",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9043",
            "id_scheme": "DOI"
        },
        "abstract": "This paper presents the digital interview collections available at Freie Universität Berlin, focusing on the online archive Forced Labor 1939–1945. Then, it discusses the potentials and challenges of digital curation and analysis of testimony collections within different direction of the Digital Humanities. Finally, it looks at some online learning environments based on these interviews archives.",
        "article_title": "Digital Interview Collections at Freie Universität Berlin. Survivors’ Testimonies as Research Data",
        "authors": [
            {
                "given": "Cord",
                "family": "Pagenstecher",
                "affiliation": [
                    "Center for Digital Systems Freie Universität Berlin, Berlin, Germany"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9042",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9042",
            "id_scheme": "DOI"
        },
        "abstract": "The Fortunoff Archive recently completed a number of important milestones including the digitization of its entire collection, the development of a digital access system, migration of legacy metadata, and the launch of a partner site program that provides remote access to testimonies at universities and research institutes. This paper will present an overview of these new digital initiatives.",
        "article_title": "Fortunoff Video Archive: New Initiatives for a New Digital Archive",
        "authors": [
            {
                "given": "Kevin",
                "family": "Glick",
                "affiliation": [
                    "Fortunoff Video Archive for Holocaust Testimonies, Yale University Library, New Haven, USA"
                ]
            },
            {
                "given": "Stephen",
                "family": "Naron",
                "affiliation": [
                    "Fortunoff Video Archive for Holocaust Testimonies, Yale University Library, New Haven, USA"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9041",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9041",
            "id_scheme": "DOI"
        },
        "abstract": "This paper explains Yad Vashem’s role as a data aggregator, describing its experience in adapting to the changes in the ways data are shared and procured in the present. The challenges of integration of heterogeneous shared data and the workflows and processes devised in Yad Vashem Archive in order to deal with this task are presented. These processes are then illustrated by discussing a data integration use case",
        "article_title": "Integration of Heterogeneous Shared Data:Yad Vashem’s Perspective as a Data Aggregator",
        "authors": [
            {
                "given": "Olga",
                "family": "Tolokonsky",
                "affiliation": [
                    "Yad Vashem, Archives Division, Jerusalem, Israel"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9040",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9040",
            "id_scheme": "DOI"
        },
        "abstract": "In this paper, I discuss using digital names lists compiled from analog sources for social network analysis. Using examples from finding aids of archival collections, I demonstrate how social network analysis can show relationships and contrasts between different datasets of names or be used to show relationships within a single set of names. Data visualization tools such as Gephi aid in the analysis and present the relationships in an easily understandable way. Exposing relationships between collections or within a collection increases its findability.",
        "article_title": "Using Names Lists for Social Network Analysis",
        "authors": [
            {
                "given": "Megan",
                "family": "Lewis",
                "affiliation": [
                    "U.S. Holocaust Memorial Museum, Washington DC, US"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9039",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9039",
            "id_scheme": "DOI"
        },
        "abstract": "This paper explores diverse areas of considerations regarding sharing data relating to Holocaust collections, from institutional, motivational, ethical, and technical points of view.",
        "article_title": "Some Perspectives on the Practice of Sharing Collection Data",
        "authors": [
            {
                "given": "Michael",
                "family": "Levy",
                "affiliation": [
                    "United States Holocaust Memorial Museum, Washington DC, USA"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9038",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9038",
            "id_scheme": "DOI"
        },
        "abstract": "In this paper are illustrated the arrangement and the digitization processes at the State Archives of Venice. The aim is to valorize the heritage here preserved on Jews persecution happened between 1938 and 1945.",
        "article_title": "Sources for the History of the Holocaust Extant in the State Archives of Venice. Inventory Projects and Digitization",
        "authors": [
            {
                "given": "Andrea",
                "family": "Pelizza",
                "affiliation": [
                    "Archivio di Stato di Venezia, Venezia, Italy"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9037",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9037",
            "id_scheme": "DOI"
        },
        "abstract": "Introduction to the Workshop \"Data Sharing, Holocaust Documentation and the Digital Humanities: Best Practices, Case Studies and Benefits.\"",
        "article_title": "The Archival Series Concerning the Confiscation of Jewish Property Found in the Archives of the Prefecture of Venice",
        "authors": [
            {
                "given": "Raffaele",
                "family": "Santoro",
                "affiliation": [
                    "Archivio di Stato di Venezia, Venezia, Italy"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9036",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9036",
            "id_scheme": "DOI"
        },
        "abstract": "The European Holocaust Research Infrastructure (EHRI) started its work in October 2010 with financial support from the European Union. The project, which is currently under its second funding phase, continues developing according to its’ mission to support the Holocaust research community by building a digital infrastructure and facilitating human networks and by helping networking of Holocaust researchers and archives. EHRI provides online access to information about dispersed sources relating to the Holocaust through its Online Portal. Tools and methods are developed that enable researchers and archivists to collaboratively work with such sources and explore new methodologies within digital humanities. This contribution seeks to present the resources and services EHRI has to offer to the research community, with a special emphasis on the EHRI Portal.",
        "article_title": "Data Sharing, Holocaust Documentation and the Digital Humanities: Introducing the European Holocaust Research Infrastructure (EHRI)",
        "authors": [
            {
                "given": "Veerle",
                "family": "Vanden Daelen",
                "affiliation": [
                    "Kazerne Dossin, Memorial, Museum and Documentation Centre on Holocaust and Human Rights, Mechelen, Belgium"
                ]
            }
        ],
        "publisher": null,
        "date": "2019-03-05",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9877",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9877",
            "id_scheme": "DOI"
        },
        "abstract": "This paper presents a study carried out to survey the digital skills of Italian students belonging to the latest generation of digital natives and currently enrolled in university courses of humanities, in which IT and digital skills risk to be neglected both by the students’ interest and the range of offered courses. The study aims to understand how students perceive their level of digital skills and whether there is a discrepancy between their self-assessed level and their actual knowledge. Participants answered a survey of four sections, including preliminary questions, two self-assessment parts and a section containing multiple-choice questions, based on the European Framework of Digital Competences, on both theoretical and practical aspects of IT and digital skills. Results show that participants tend to overestimate their digital skills and that they lack knowledge of basic topics. Besides outlining the digital competences of Italian humanities students, this study points out digital skills that should be strengthen, whereas they are often taken for granted by teachers and institutions, although students need those skills in their university and professional life, but also for their daily digital needs.",
        "article_title": "Students of humanities and digital skills: a survey on Italian university students",
        "authors": [
            {
                "given": "Floriana",
                "family": "Sciumbata",
                "affiliation": [
                    "Università di Trieste"
                ]
            }
        ],
        "publisher": null,
        "date": "2020-05-19",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9959",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9959",
            "id_scheme": "DOI"
        },
        "abstract": "Negli ultimi anni la tecnologia blockchain si sta diffondendo sempre più su larga scala in diversi settori di ricerca, inclusi i Beni Culturali. Esistono diverse tipologie di blockchain, che possono essere classificate sia in base al tipo di utenti che possono accedervi, sia in base alle funzionalità che offrono. Questo articolo descrive uno studio teorico in cui si confrontano due blockchain molto diverse tra di loro: Ethereum e Hyperledger, al fine di definire quale delle due è maggiormente indicata per la memorizzazione di beni culturali tangibili contenuti in archivi digitali. Dopo una breve descrizione delle due tecnologie, verrà descritto un possibile scenario di applicazione abbastanza generico per poter capire quale delle due tecnologie meglio soddisfa i requisiti. Verrà quindi effettuato il confronto tra le due blockchain sulla base di problematiche generali, requisiti architetturali e considerazioni varie. Come risultato del confronto, emergerà che Hyperledger Fabric è più adatta nel contesto degli archivi digitali.",
        "article_title": "The Use of Blockchain for Digital Archives: a comparison between Ethereum and Hyperledger (AIUCD 2019)",
        "authors": [
            {
                "given": "Angelica",
                "family": "Lo Duca",
                "affiliation": [
                    "Institute of Informatics and Telematics - National Research Council"
                ]
            },
            {
                "given": "Clara",
                "family": "Bacciu",
                "affiliation": [
                    "Institute of Informatics and Telematics - National Research Council"
                ]
            },
            {
                "given": "Andrea",
                "family": "Marchetti"
            }
        ],
        "publisher": null,
        "date": "2020-05-19",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9976",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9976",
            "id_scheme": "DOI"
        },
        "abstract": "Il contributo, nato dall’esperienza di un progetto di edizione digitale finanziato da una Marie Curie Fellowship (DigiFlorimont, grant n° 745821), intende fare il punto sulla questione, ancora problematica, della produzione di file XML-TEI. Gli strumenti sono infatti ben lontani dall’essere ergonomici. La questione è spinosa in quanto la lacuna strumentale incide sia sulla diffusione della pratica editoriale digitale, sia sulla qualità della codifica proposta. Il rischio è quello di continuare a produrre “codifiche semplici con strumenti complessi” quando ormai la quotidianità dovrebbe essere la produzione di “codifiche complesse con strumenti semplici”. Il progetto DigiFlorimont ha implicato la creazione di un editor-prototipo XML-TEI capace di generare il codice in modo automatico a partire da una sintassi simbolica (sul modello Markdown) applicata a un file .TXT associato con un .CSV. È stato così possibile realizzare una codifica complessa secondo un modello di testo concepito come un database di parole, pronto a essere utilizzato per altre analisi al di là degli obiettivi specifici del contesto di produzione. Si precisa in questo modo il ruolo del “filologo digitale”, responsabile della diffusione all’interno della comunità accademica di un testo filologicamente E informaticamente corretto, “pronto all’uso”, secondo un modello di capitalizzazione progressiva del lavoro di analisi.",
        "article_title": "Complessità della codifica ed ergonomia strumentale nel contesto XML-TEI: dove siamo? (Bilancio a partire da un nuovo progetto di edizione digitale medievale)",
        "authors": [
            {
                "given": "Marta",
                "family": "Materni",
                "affiliation": [
                    "Université Grenoble Alpes"
                ]
            }
        ],
        "publisher": null,
        "date": "2020-05-19",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9958",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9958",
            "id_scheme": "DOI"
        },
        "abstract": "La declinazione della testualità digitale in processi conversazionali è ciò che caratterizza il social web. Data la diffusione di questo fenomeno vanno individuate quelle caratteristiche alla base di un uso proficuo e consapevole, in un'analisi in cui vanno inclusi tutti quei casi, e relative riflessioni, trasversali tra il paradigma tipografico e quello computazionale e tra la comunicazione testuale e quella visiva. Lo scopo è quello di bilanciare l'aspetto performativo/narrativo da un lato e logico/strutturale dall'altro, all'interno di un contesto di partecipazione attiva.",
        "article_title": "Testi e conversazioni. Il racconto collettivo dei social network",
        "authors": [
            {
                "given": "Federico",
                "family": "Meschini",
                "affiliation": [
                    "Università degli Studi della Tuscia"
                ]
            }
        ],
        "publisher": null,
        "date": "2020-05-19",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9931",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9931",
            "id_scheme": "DOI"
        },
        "abstract": "Since the seminal publication of “Web as Corpus” [1], the potential of creating corpora from the web has been realized for good for the creation of both online and offline corpora: noisy vs. clean, balanced vs. convenient, annotated vs. raw, small vs. big are only some antonyms that can be used to describe the range of possible corpora that can be and have been created. In our case, in the wake of the project Under Resourced Language Content Finder (URLCoFi), we describe a systematic approach to the compilation of corpora for low (or under) resource(d) languages (LRL) from the web in connection with a free eLearning course funded by studiumdigitale at Goethe University, Frankfurt. Despite the ease of retrieval of documents from the web, some characteristics of the digital medium introduce certain difficulties. For instance, if someone was to collect all documents on the web in a certain language, firstly, the collection could only be a snapshot since the web constantly changes content and secondly, there would be no way to ascertain completeness. In this paper, we show ways to deal with such difficulties in search scenarios for LRLs presenting experiences springing from a course about this topic. [1] A. Kilgarriff and G. Grefenstette, “Web as corpus,” in Proceedings of Corpus Linguistics 2001, 2001, pp. 342–344.",
        "article_title": "A Manual for Web Corpus Crawling of Low Resource Languages",
        "authors": [
            {
                "given": "Armin",
                "family": "Hoenen",
                "affiliation": [
                    "Institute for Empirical Linguistics\r\nGoethe University Frankfurt"
                ]
            },
            {
                "given": "Cemre",
                "family": "Koc",
                "affiliation": [
                    "Institute for Empirical Linguistics\r\nGoethe University Frankfurt"
                ]
            },
            {
                "given": "Marc Daniel",
                "family": "Rahn",
                "affiliation": [
                    "Institute for Empirical Linguistics\r\nGoethe University Frankfurt"
                ]
            }
        ],
        "publisher": null,
        "date": "2020-05-19",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9975",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9975",
            "id_scheme": "DOI"
        },
        "abstract": "Il progetto LiLa: Linking Latin intende creare una Knowledge Base di risorse linguistiche (corpora, lessici digitali e strumenti di trattamento automatico del linguaggio) per lo studio del latino secondo il modello dei Linked Open Data. Questo articolo descrive gli obiettivi e le motivazioni del progetto, soffermandosi in particolare sulla centralità del lemma come forma che consente di creare la rete di informazioni linguistiche. L’architettura di LiLa s’incentra dunque sul nodo cardine rappresentato dal lemma e sulle sue proprietà morfologiche. L’articolo discute le strategie impiegate per creare una banca dati di lemmi latini che possa supportare tale modello, e i primi esperimenti volti a connettere risorse testuali (treebank del latino) alla raccolta dei lemmi.",
        "article_title": "LiLa: Linking Latin Risorse linguistiche per il latino nel Semantic Web (AIUCD 2019)",
        "authors": [
            {
                "given": "Francesco",
                "family": "Mambrini",
                "affiliation": [
                    "Università Cattolica del Sacro Cuore, Milano"
                ]
            },
            {
                "given": "Flavio Massimiliano",
                "family": "Cecchini",
                "affiliation": [
                    "Università Cattolica del Sacro Cuore, Milano"
                ]
            },
            {
                "given": "Greta",
                "family": "Franzini",
                "affiliation": [
                    "Università Cattolica del Sacro Cuore, Milano"
                ]
            },
            {
                "given": "Eleonora",
                "family": "Litta",
                "affiliation": [
                    "Università Cattolica del Sacro Cuore, Milano"
                ]
            },
            {
                "given": "Marco Carlo",
                "family": "Passarotti",
                "affiliation": [
                    "Università Cattolica del Sacro Cuore, Milano"
                ]
            },
            {
                "given": "Paolo",
                "family": "Ruffolo",
                "affiliation": [
                    "Università Cattolica del Sacro Cuore, Milano"
                ]
            }
        ],
        "publisher": null,
        "date": "2020-05-19",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9919",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9919",
            "id_scheme": "DOI"
        },
        "abstract": "L’articolo presenta il progetto di didattica integrata Filosofia &amp; Migrazioni. Progettare, realizzare e promuovere contenuti culturali digitali (https://filosofiamigrazioni.wordpress.com/) nato nel 2017 dalla collaborazione tra ricercatrici di Storia e di Filosofia del Consiglio Nazionale delle Ricerche (CNR) e della Società Filosofica Italiana (SFI) - Sezione Romana. Nell’articolo viene descritto il progetto e il modello di progetto realizzato attraverso il lavoro congiunto di ricercatori, docenti e studenti come esempio di integrazione dei programmi curriculari con lo studio delle migrazioni contemporanee e lo sviluppo di competenze e contenuti digitali. La presentazione si concentra sulle molteplici connessioni tra mondo della ricerca e mondo della scuola; la complementarietà e l’integrazione fra conoscenze e competenze; l’importanza di un uso critico e consapevole degli strumenti e delle metodologie digitali. Si sottolineano i diversi elementi di criticità individuati soprattutto nell’ancora embrionale processo di alfabetizzazione digitale di docenti e studenti, nella inadeguatezza delle infrastrutture e della cultura digitale nelle scuole, nella difficoltà ad usare in modo critico le tecnologie.",
        "article_title": "Progettare, realizzare e promuovere contenuti culturali digitali. Un esempio di didattica integrata: il progetto “Filosofia &amp; Migrazioni”",
        "authors": [
            {
                "given": "Ada",
                "family": "Russo",
                "affiliation": [
                    "Istituto per il Lessico Intellettuale Europeo e Storia delle Idee - CNR"
                ]
            },
            {
                "given": "Cristina",
                "family": "Marras",
                "affiliation": [
                    "Istituto per il Lessico Intellettuale Europeo e Storia delle Idee - CNR"
                ]
            }
        ],
        "publisher": null,
        "date": "2020-05-19",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "https://umanisticadigitale.unibo.it/article/view/9881",
        "identifier": {
            "string_id": "https://doi.org/10.6092/issn.2532-8816/9881",
            "id_scheme": "DOI"
        },
        "abstract": "In higher education we witness a unique conjuncture: on the one hand, students who attend academic courses are the first generation to have fully grown in a digitalized world; on the other hand, teachers, while having grown and studied in a still largely analogue world, have witnessed the evolution of today’s techno-society since its infancy. By connecting the field of the Digital Humanities with education, this article discusses the conception, design and results of two practice-based teaching experiences which were aimed at exploring the tensions embedded in our daily use of digital technologies, as well as in today’s techno-society as a whole. The first one is a “digital autoethnography” developed at the City University of Hong Kong; the second one refers to the course “Anthropology of Communication” – co-delivered at Politecnico of Milan – which adopted a “connected intelligence” approach to urge students to reflect on tomorrow’s techno-society in a collaborative way. While the first experience was chiefly a self-reflexive study on the impact of social media on the individual, the second one mapped the main criticalities of techno-society as a whole, according to seven macro-themes, and asked students to elaborate possible solutions. Both courses considered students as active learners/users, insofar as they at the forefront of today digital revolution, but also the subjects most in need of critical tools to face it.",
        "article_title": "Digital Autoethnography &amp; Connected Intelligence: Two Qualitative Practice-Based Teaching Methods for the Digital Humanities",
        "authors": [
            {
                "given": "Stefano",
                "family": "Calzati",
                "affiliation": [
                    "Nurkse Department, Tallinn University of Technology"
                ]
            }
        ],
        "publisher": null,
        "date": "2020-05-19",
        "keywords": null,
        "journal_title": "Umanistica Digitale",
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": "2532-8816",
                "type": "electronic"
            }
        ]
    }
]