[
    {
        "url": "http://dx.doi.org/10.16995/dscn.30",
        "identifier": {
            "string_id": "10.16995/dscn.30",
            "id_scheme": "DOI"
        },
        "abstract": "In this paper, we will explore certain points of intersection between digital text and literary text, without limiting our analysis to “digital literature.” Instead, we will adopt an intermedial approach to our investigation to identify productive dialectic avenues for reflection. This paper will therefore outline how establishing a relationship between digital and literary text leads us to reconsider the mediality of literary text and what this reconceptualization of text shows us in terms of parallels between digital and literary text, in particular with regard to movement production. The novel, Océan mer (OM), by Alessandro Baricco (1998), will be used to illustrate our view.",
        "article_title": "Mouvement et relations intermédiales, du numérique au texte littéraire",
        "authors": [
            {
                "given": "Élisabeth",
                "family": "Routhier",
                "affiliation": {
                    "original_name": "Université de Montréal",
                    "normalized_name": "University of Montreal",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/0161xgx34",
                        "GRID": "grid.14848.31"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.29",
        "identifier": {
            "string_id": "10.16995/dscn.29",
            "id_scheme": "DOI"
        },
        "abstract": "What can we learn from the discourse around text tools? More than might be expected. The development of text analysis tools has been a feature of computing in the humanities since IBM supported Father Busa's production of the Index Thomisticus (Tasman 1957). Despite the importance of tools in the digital humanities (DH), few have looked at the discourse around tool development to understand how the research agenda changed over the years. Recognizing the need for such an investigation a corpus of articles from the entire run of Computers and the Humanities (CHum) was analyzed using both distant and close reading techniques. By analyzing this corpus using traditional category assignments alongside topic modelling and statistical analysis we are able to gain insight into how the digital humanities shaped itself and grew as a discipline in what can be considered its \"middle years,\" from when the field professionalized (through the development of journals like CHum) to when it changed its name to \"digital humanities.\" The initial results (Simpson et al. 2013a; Simpson et al. 2013b), are at once informative and surprising, showing evidence of the maturation of the discipline and hinting at moments of change in editorial policy and the rise of the Internet as a new forum for delivering tools and information about them.",
        "article_title": "The Rise and Fall Tool-Related Topics in CHum",
        "authors": [
            {
                "given": "John",
                "family": "Simpson",
                "affiliation": {
                    "original_name": "University of Alberta",
                    "normalized_name": "University of Alberta",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/0160cpw27",
                        "GRID": "grid.17089.37"
                    }
                }
            },
            {
                "given": "Geoffrey",
                "family": "Rockwell",
                "affiliation": null
            },
            {
                "given": "Amy",
                "family": "Dyrbye",
                "affiliation": null
            },
            {
                "given": "Ryan",
                "family": "Chartier",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.32",
        "identifier": {
            "string_id": "10.16995/dscn.32",
            "id_scheme": "DOI"
        },
        "abstract": "Modern-day data visualizations have emerged as a new visual language to represent, explore, and convey data, either quantitative or qualitative. Writings in the field of data visualizations have focused predominantly on the computational nature of these algorithm-based representations (Chen and Czerwinski 2000). As an alternative, I propose an approach based on user experience design to both assessing and designing data visualizations, in the recognition that using a visualization of this kind is a form of experience that can benefit from explicit planning. Following a review of a wide range of examples, I conclude by offering the following eight factors:",
        "article_title": "Visualization as experience",
        "authors": [
            {
                "given": "Tomoko",
                "family": "Ichikawa",
                "affiliation": {
                    "original_name": "IIT Institute of Design",
                    "normalized_name": "Induk University",
                    "country": "South Korea",
                    "identifiers": {
                        "ror": "https://ror.org/056fjw561",
                        "GRID": "grid.448983.a"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.31",
        "identifier": {
            "string_id": "10.16995/dscn.31",
            "id_scheme": "DOI"
        },
        "abstract": "Addressing a larger context of trends shaping and influencing change in the humanities and the cultures of the university, this text follows the Antonio Zampolli Prize Lecture given on 2 July 2014 at U Lausanne, exploring and encouraging the digital humanities' positive role in the process of the humanities' digital self-determination in the digital realm. Considered in this engagement are: the important (and profitably-elusive) process of defining digital humanities; foundational notions of the methodological commons and communities of practice, and the ways in which they originate, are fostered, are engaged, and themselves engage; and the value of an open approach to current and future work on modeling humanistic data and process, in ways that build on these foundations to embrace the communities and constituencies served by the humanities.",
        "article_title": "Communities of practice, the methodological commons, and digital self-determination in the Humanities",
        "authors": [
            {
                "given": "Ray",
                "family": "Siemens",
                "affiliation": {
                    "original_name": "University of Victoria",
                    "normalized_name": "University of Victoria",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/04s5mat29",
                        "GRID": "grid.143640.4"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.33",
        "identifier": {
            "string_id": "10.16995/dscn.33",
            "id_scheme": "DOI"
        },
        "abstract": "If intermedial phenomena are as old as the oldest media, the development of the intermedial theory is much more recent. In fact, this theory has emerged from the last major technological change, that related to digital. This article provides an analysis of this thought from a historical perspective. It seems that there are two major periods of the intermedial theory, first, what we might call the mediatic period, based on the central concept of medium. The second would be the post-mediatic period which is dominated by the idea of mediation.",
        "article_title": "The “In-between” of What? Intermedial Perspectives on the Concept of Borders/Boundaries",
        "authors": [
            {
                "given": "Jean-Marc Larrue",
                "family": "Larrue",
                "affiliation": {
                    "original_name": "Université de Montréal",
                    "normalized_name": "University of Montreal",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/0161xgx34",
                        "GRID": "grid.14848.31"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.24",
        "identifier": {
            "string_id": "10.16995/dscn.24",
            "id_scheme": "DOI"
        },
        "abstract": "Even though large aggregations of humanities data are emerging through the efforts of significant federations, the larger the collection, the more difficult it is for large-scale standards to effectively account for and relate the complex variety of data objects and their characteristics. How can we simultaneously embrace this complexity with the help of the computer and achieve interoperability while still retaining the interpretative flexibility that is the heart of meaningful humanities work? Additionally, what scale is the optimal viewpoint through which we can do humanities-related work on such large data sets? At what point do we lose a humanist sensibility when working with big data, and how do we take advantage of computing technology to pluralize perspective, confront complexity, avoid reductiveness and preserve meaning as we interpret meaningful subsets of big data collections? NewRadial— an INKE prototype—addresses these questions by enabling users to connect and explore humanities databases across plural scales of engagement without imposing a universal metadata standard. Its web-based environment visually displays the objects of humanities databases in a manner that encourages browsing, searching, collecting, organizing, connecting and annotating, modelling a way to bring different standards and ontological perspectives together without negating their differences or requiring conformity to a reductive or limiting overall system.",
        "article_title": "NewRadial: Challenging scales and standards of humanities scholarship through new knowledge environment prototypes",
        "authors": [
            {
                "given": "Jon",
                "family": "Saklofske",
                "affiliation": {
                    "original_name": "Acadia University",
                    "normalized_name": "Acadia University",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/00839we02",
                        "GRID": "grid.411959.1"
                    }
                }
            },
            {
                "given": "The INKE",
                "family": "Research Team",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.25",
        "identifier": {
            "string_id": "10.16995/dscn.25",
            "id_scheme": "DOI"
        },
        "abstract": "Using large-scale analysis of a music-download database provided by MixRadio, a leading online music-service provider formerly under Nokia ownership, this paper investigates the following in relation to global-music consumption: (1) differences in the downloading trajectories of various musical genres; (2) the extent to which downloading trajectories are invariant with respect to countries and/or genres; and (3) possible links between the downloading behaviour of various genre-defined user subgroups and pre-existing music-personality studies. Substantial differences were observed between download trajectories pertaining to pop, rap, rock and metal—metal, in particular, was seen to exaggerate features of rock's trajectory. Of the genres studied, metal was found to have the only invariant trajectory, seemingly impervious to the local conditions of the country in which it was downloaded. Similarly, musical styles within Brazil were found to be downloaded in more or less the same way, in contrast to the UK where download trajectories varied with musical genre. Lastly, the analysis demonstrated a statistical link between pre-existing music-personality research and patterns of downloading within the metadata, suggesting that different downloading behaviours are due, in part, to differences in personality.",
        "article_title": "Generalizing case-based analyses in the study of global music consumption",
        "authors": [
            {
                "given": "Matthew",
                "family": "Woolhouse",
                "affiliation": {
                    "original_name": "School of the Arts McMaster University",
                    "normalized_name": "McMaster University",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/02fa3aq29",
                        "GRID": "grid.25073.33"
                    }
                }
            },
            {
                "given": "James",
                "family": "Renwick",
                "affiliation": {
                    "original_name": "University of Toronto",
                    "normalized_name": "University of Toronto",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/03dbr7087",
                        "GRID": "grid.17063.33"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.26",
        "identifier": {
            "string_id": "10.16995/dscn.26",
            "id_scheme": "DOI"
        },
        "abstract": "Bullipedia, the online gastronomic encyclopedia, is an idea yet to be developed. In this work, we analyze a community formed around a food magazine, Taste of Home (ToH), and extract some good practices to incorporate them to the future Bullipedia.",
        "article_title": "From Taste of Home to Bullipedia: collaboration, motivations and trust",
        "authors": [
            {
                "given": "Antonio",
                "family": "Jimenez-Mavillard",
                "affiliation": {
                    "original_name": "The Cultureplex Lab - Western University",
                    "normalized_name": "Western University",
                    "country": "Cambodia",
                    "identifiers": {
                        "ror": "https://ror.org/02agqkc58",
                        "GRID": "grid.443228.b"
                    }
                }
            },
            {
                "given": "Juan Luis",
                "family": "Suarez",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.28",
        "identifier": {
            "string_id": "10.16995/dscn.28",
            "id_scheme": "DOI"
        },
        "abstract": "This paper discusses the unique asymmetric collaboration process used at CanLit Guides in the first phase of its development. CanLit Guides began as a project to mobilize the massive digital archive (1959-2008) of the scholarly journal Canadian Literature. The Guides introduce undergraduate students to areas of scholarly and critical concern in the larger field of Canadian Literature and culture. The editors of Canadian Literature enabled graduate students to develop teamwork, research, teaching, and digital writing skills by employing them as developers, researchers, and writers. The project supports open access, scholarly collaboration, and the creation of new digital genres. As the project evolved, however, it became clear that getting a team of scholars to work on a hierarchized, or what we call \"asymmetric,\" collaboration between the editors and the graduate students, is particularly difficult, and can lead to issues of doneness and sprawl. Producing a collaborative and democratic workflow process enabled us to write a robust collection of guides in innovative digital genres. This paper pays particular attention to issues of authorship that come up with any collaborative digital writing project, and it discusses the complexities of the graduate student experience of working on a digital pedagogical development team.",
        "article_title": "Asymmetric Digital Collaboration and Collective Authorship: On Digital Genres and Writing Processes for CanLit Guides",
        "authors": [
            {
                "given": "Mike",
                "family": "Borkent",
                "affiliation": null
            },
            {
                "given": "Jamie",
                "family": "Paris",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.27",
        "identifier": {
            "string_id": "10.16995/dscn.27",
            "id_scheme": "DOI"
        },
        "abstract": "In the preface to her influential book, Lesbian images, writer for The Body Politic and person in the Lesbian and Gay Liberation in Canada (LGLC) data set, Canadian author Jane Rule stresses the importance of not reducing human experience in order to understand it. Lesbian Images, her collective biography, or prosopography, of lesbian writers therefore offers a view of the complexity of life, presenting as \"many answers as there are voices to speak… for no one can comfortably dismiss all those who find a place in these pages\" (1975 vi). The Lesbian and Gay Liberation in Canada project (LGLC) is using prosopography to respond to Rule's call to document the complexity of gay and lesbian lives. While prosopography has traditionally been used to uncover the averages, the norms, and the likely lives of people about whom historians have little information (for example, Roman slaves or Anglo-Saxon peasants), LGLC is taking up prosopography, not to fill in gaps or to reduce liberationists to a few statistical averages, but to develop new knowledge about how the ideas at the heart of the liberation movement, and the communities that espoused them, shaped Canadian culture.",
        "article_title": "Lesbian and Gay Liberation in Canada: Representing the Dyke Dynamo",
        "authors": [
            {
                "given": "Michelle",
                "family": "Schwartz",
                "affiliation": {
                    "original_name": "Ryerson University",
                    "normalized_name": "Ryerson University",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/05g13zd79",
                        "GRID": "grid.68312.3e"
                    }
                }
            },
            {
                "given": "Constance",
                "family": "Crompton",
                "affiliation": {
                    "original_name": "University of British Columbia, Okanagan Campus",
                    "normalized_name": "University of British Columbia",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/03rmrcq20",
                        "GRID": "grid.17091.3e"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.1",
        "identifier": {
            "string_id": "10.16995/dscn.1",
            "id_scheme": "DOI"
        },
        "abstract": "This article interrogates tensions in Digital Humanities (DH) and calls for critical introspection of our practices. Arguing that digital humanities (dh) has become a site of struggle for the future of the academy, the essay rejects a monolithic understanding of dh, arguing that such a representation encourages tensions by hiding the varying disciplinary knowledge productions, national structures, and local contexts that form specific dh practices. Insisting on specificity as a counter narrative to that of the sweeping representation of DH's revolutionary change, the article suggests that the current analysis of dh as a battle between insiders and outsiders is a potentially destructive form of resistance. Attending to continued problems with the treatment of race and gender in the field, the essay argues that such issues are core to particular dh practices.  Cet article s'interroge sur les tensions dans les Humanités numériques (Hn) et fait appel à une introspection critique de nos pratiques. Affirmant que les humanités numériques (hn) sont devenues un lieu de lutte pour l'avenir de l'académie, la thèse rejette une compréhension monolithique des hn, estimant qu'une telle représentation encourage les tensions en dissimulant les productions de connaissances disciplinaires, les structures nationales, et les contextes locaux variables qui forment des pratiques précises en hn. En insistant sur la spécificité comme moyen de contrer la narration à la représentation absolue du changement révolutionnaire des Hn, l'article suggère que l'analyse actuelle des hn comme une lutte entre internes et externes est une forme de résistance qui pourrait être éventuellement destructrice. S'attaquant aux problèmes persistants du traitement des races et des genres dans le domaine, la thèse soutient que de telles questions sont au cœur des pratiques particulières des hn.",
        "article_title": "Digital Humanities futures: Conflict, power, and public knowledge",
        "authors": [
            {
                "given": "Amy E.",
                "family": "Earhart",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.265",
        "identifier": {
            "string_id": "10.16995/dscn.265",
            "id_scheme": "DOI"
        },
        "abstract": "Humanities scholars have long claimed the importance of browsing in the library stacks as part of their research process. The digitization practices of libraries and archives, while meant to assist with preservation and access, make the physical browsing experience impossible. While there have been various attempts to recreate this experience online, none as yet has created a digital tool which users can interact with as they move through the physical material in the library. This paper aims to introduce the concept of the Serendipitous Tool for Augmenting Knowledge (STAK), a geolocative app that allows users to access material complementary to what they are looking at on library shelves. The authors outline the research behind STAK, the potential for locative media and augmented reality in libraries, and the design requirements for STAK. Finally, they outline two elements of serendipity that they hope to emulate in STAK: Noticing, and Capture and Recall. By enhancing the physical collection with digital information, STAK aims to bring scholars the best of both worlds, and to encourage them to return to the physical library to explore, learn, and browse.  Depuis longtemps, les chercheurs des sciences humaines soulignent l’importance dans leur processus de recherche de parcourir des ouvrages dans les rayons des bibliothèques. Bien que les pratiques de numérisation des bibliothèques et des archives aient pour objet d’aider la préservation et l’accès, elles rendent aussi impossible l’expérience de la consultation physique sur place. Il y a bien eu diverses tentatives pour recréer cette expérience en ligne, mais aucune n’a jusqu’à présent créé un outil numérique avec lequel les usagers peuvent interagir alors qu’ils consultent physiquement la documentation dans la bibliothèque. Cet article vise à introduire le concept de Serendipitous Tool for Augmenting Knowledge (STAK) (Outil fortuit pour l’enrichissement de la connaissance), une application géo-locative qui permet aux usagers d’avoir accès à une documentation complémentaire à celle qu’ils recherchent dans les rayons de la bibliothèque. Les auteurs présentent la recherche motivant STAK, le potentiel des médias locatifs et de la réalité enrichie dans les bibliothèques, et les exigences de la conception de STAK. Enfin, ils soulignent deux éléments d’heureux hasard qu’ils espèrent imiter dans STAK: Constater, et Saisir et Rappeler. En optimisant la collection physique au moyen de l’information numérique, STAK vise à apporter aux chercheurs le meilleur des deux mondes, et à les encourager à retourner dans la bibliothèque physique pour explorer, apprendre et parcourir les ouvrages.",
        "article_title": "STAK – Serendipitous tool for augmenting knowledge: A conceptual tool for bridging digital and physical resources",
        "authors": [
            {
                "given": "Kim",
                "family": "Martin",
                "affiliation": {
                    "original_name": "University of Guelph",
                    "normalized_name": "University of Guelph",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/01r7awg59",
                        "GRID": "grid.34429.38"
                    }
                }
            },
            {
                "given": "Brian",
                "family": "Greenspan",
                "affiliation": {
                    "original_name": "Carleton University",
                    "normalized_name": "Carleton University",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/02qtvee93",
                        "GRID": "grid.34428.39"
                    }
                }
            },
            {
                "given": "Anabel",
                "family": "Quan-Haase",
                "affiliation": {
                    "original_name": "University of Western Ontario",
                    "normalized_name": "Western University",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/02grkyz14",
                        "GRID": "grid.39381.30"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.2",
        "identifier": {
            "string_id": "10.16995/dscn.2",
            "id_scheme": "DOI"
        },
        "abstract": "In recent years, every measure of significant change from research to academic programming and hiring indicates that Digital Humanities (DH) has moved from nascent to significant on the higher education landscape. But is the future of DH bright? In addressing this question, the goal of this paper is three-fold: to stimulate further historical research on the emergence and development of DH; to provoke further critical analysis of current activities and initiatives; and to help cultivate creative thinking about how we can work together to ensure the ability of digitally-enabled scholarship to enhance knowledge and understanding of human expression and action. With examples primarily from what began as History and Computing as well as other text-based Humanities fields, this discussion does not seek to capture the diversity of developments across the Humanities. Rather, it attempts to build on pioneering efforts by Susan Hockey, John Bonnett, Kevin Kee, Ian Milligan and others to examine the multi-faceted activities that, in hindsight, we are beginning to connect within a nascent narrative of DH's history. While this paper offers only select contributions in the pursuit of this goal, the hope is that greater attention to the surprising features of the past will better emphasize their enduring and changing importance for DH's uncertain future.  En 2015, toutes les mesures de changements importants, de la recherche aux programmes d'études et d'embauche, indique que les humanités numériques sont passées de naissantes à importantes dans le paysage de l'enseignement supérieur. Mais est-ce que l'avenir des humanités numériques est prometteur? Pour aborder cette question, le but de cet exposé est triple : stimuler une recherche historique plus poussée sur l'émergence et le développement des humanités numériques, provoquer une analyse critique plus poussée des activités et initiatives actuelles, et aider à cultiver la pensée créative pour tenter de découvrir comment nous pouvons travailler ensemble pour assurer la capacité des érudits qui maîtrisent l'instrument numérique à rehausser les connaissances et la compréhension de l'expression et de l'action humaine. Principalement au moyen d'exemples de ce qui a commencé comme « histoire et informatique » ainsi que d'autre champs des humanités axés sur le texte, cette discussion ne cherche pas à saisir la diversité des développements à travers les humanités. Elle tente plutôt de tirer parti des efforts de pionniers comme Susan Hockey, John Bonnett, Kevin Kee, Ian Milligan et d'autres personnes pour examiner les activités à multiples facettes que, avec le recul, nous commençons à raccorder au sein d'un récit naissant de l'histoire des humanités numériques. Bien que cet exposé n'offre que des contributions choisies dans la poursuite de cet objectif, nous espérons qu'une plus grande attention aux caractéristiques surprenantes du passé permettra de mieux mettre en valeur leur importance durable et changeante pour l'avenir incertain des humanités numériques.",
        "article_title": "The surprising ascendance of Digital Humanities: And some suggestions for an uncertain future",
        "authors": [
            {
                "given": "Chad",
                "family": "Gaffield",
                "affiliation": {
                    "original_name": "University of Ottawa",
                    "normalized_name": "University of Ottawa",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/03c4mmv16",
                        "GRID": "grid.28046.38"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.272",
        "identifier": {
            "string_id": "10.16995/dscn.272",
            "id_scheme": "DOI"
        },
        "abstract": "TheCulturist.ca is the result of a term long course within the Digital Humanities Minor for undergraduate students, worked on in collaboration with the CulturePlex Lab at Western University. An experiment in independent journalism and multimedia production, this website highlights research undertaken by undergraduate students incorporating various disciplines in an attempt to make their academic work accessible to and garnering attention from a wider public outside the university. Students in charge of creating and maintaining the project work collaboratively and produce a best practices document while learning the strategies involved in organically generating a user base for their content online.",
        "article_title": "The business of culture, a single subject community: lessons from The Culturist",
        "authors": [
            {
                "given": "Nandita",
                "family": "Dutta",
                "affiliation": {
                    "original_name": "Western University",
                    "normalized_name": "Western University",
                    "country": "Cambodia",
                    "identifiers": {
                        "ror": "https://ror.org/02agqkc58",
                        "GRID": "grid.443228.b"
                    }
                }
            },
            {
                "given": "Bennett",
                "family": "McArthur",
                "affiliation": {
                    "original_name": "Simon Fraser University",
                    "normalized_name": "Simon Fraser University",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/0213rcc28",
                        "GRID": "grid.61971.38"
                    }
                }
            },
            {
                "given": "Antonio",
                "family": "Jimenez-Mavillard",
                "affiliation": {
                    "original_name": "Western University",
                    "normalized_name": "Western University",
                    "country": "Cambodia",
                    "identifiers": {
                        "ror": "https://ror.org/02agqkc58",
                        "GRID": "grid.443228.b"
                    }
                }
            },
            {
                "given": "Juan Luis",
                "family": "Suarez",
                "affiliation": {
                    "original_name": "Western University",
                    "normalized_name": "Western University",
                    "country": "Cambodia",
                    "identifiers": {
                        "ror": "https://ror.org/02agqkc58",
                        "GRID": "grid.443228.b"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.266",
        "identifier": {
            "string_id": "10.16995/dscn.266",
            "id_scheme": "DOI"
        },
        "abstract": "Lev Manovich posits that new media and the World Wide Web are modular or layered in nature, similar to structural computer programming in that their distinct elements are combinative while retaining independence. Modular structures and systems (such as Lego, mobile apps, computer software, and even language itself) exchange precision, specific connectivity, narrative stability, and a focus on progressive products for flexibility, general compatibility, adaptiveness and a focus on aggregative processes. These attributes are well suited for new knowledge environments: Peter Schillingsburg sees modularity at the heart of dynamic digital collaboration and Susan Brown (et al) liken the modularity of digital projects to the cumulative nature of academic periodicals but caution that such projects are still often judged “as if they were a book,” or by their apparent finishedness. While scholarly journal articles and monographs, as finished products of scholarly activity, are not often constructed to demonstrate modularity or to function as modular components in broader arenas of scholarly communication, they could be reimagined as such (beyond citation). This is something that the NewRadial environment encourages through its modular design and in the kinds of modular scholarly communication that it facilitates.",
        "article_title": "Connecting the dots: Integrating modular networks and narrativity in digital scholarship",
        "authors": [
            {
                "given": "Amy",
                "family": "Robinson",
                "affiliation": {
                    "original_name": "Acadia University",
                    "normalized_name": "Acadia University",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/00839we02",
                        "GRID": "grid.411959.1"
                    }
                }
            },
            {
                "given": "Jon",
                "family": "Saklofske",
                "affiliation": {
                    "original_name": "Acadia University",
                    "normalized_name": "Acadia University",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/00839we02",
                        "GRID": "grid.411959.1"
                    }
                }
            },
            {
                "given": "The INKE Research",
                "family": "Team",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "9",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.55",
        "identifier": {
            "string_id": "10.16995/dscn.55",
            "id_scheme": "DOI"
        },
        "abstract": "While plagiarism in digital classrooms has been am important topic of discussion in the literature on post-secondary teaching and learning, too often this discussion has been framed in unhelpful polemic and moral terms. In contrast, this paper argues that using a peer-evaluation flipped marking system in a learning management system (LMS) as part of a plagiarism deterrence strategy can help to create a learning environment where students engage with the ideas of their peers and begin to feel like their ideas matter to others. In such a climate, students may feel less alienated from the university community and more connected to the class and their peers, and as such, they may be less likely to plagiarise their work. A way to deal with plagiarism is to help students become engaged with their peers as fellow academics and as members of micro academic communities.",
        "article_title": "Flipped Marking and Plagiarism Avoidance in a Digital Age",
        "authors": [
            {
                "given": "Jamie",
                "family": "Paris",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.56",
        "identifier": {
            "string_id": "10.16995/dscn.56",
            "id_scheme": "DOI"
        },
        "abstract": "The videogame industry is a considerable market: in 2012, the industry was worth over $86 billion USD and about seventy-two percent of American households play videogames. It is unsurprising, then, that commercial and educational developers and/or researchers have sought to capitalise on videogames. Games and simulation technologies have been used for educational purposes for thousands of years prior to the digital era (Gee 2007). Digital games, however, offer many new affordances including increased accessibility, reinforced automation (i.e., fair and consistent application of rules), embedded data-gathering for assessment, dynamic adaptation to student needs, the ability to simulate complex situations for student inquiry in a safe context, and reduced overall costs (Jin and Low 2011). However, it is difficult to assess the process of serious game development and effectiveness of educational play. Many serious games retrofit assessment late into the project, creating a gap between original intents and the game's current uses, limiting effectiveness of measuring and meeting the project's goals. As such, we propose an assessment framework that synthesises work from various fields (educational assessment, game design, usability, project management) that aims to guide researchers and game developers through a project from its inception to the end by presenting specific topics to address and questions to answer throughout the game design phase of the project. By building assessment into the game development from the get-go, original intents and a game's current uses can more closely align, allowing for stronger, purposeful games.",
        "article_title": "Assessing Serious Games: The GRAND Assessment Framework",
        "authors": [
            {
                "given": "Domini",
                "family": "Gee",
                "affiliation": {
                    "original_name": "University of Alberta",
                    "normalized_name": "University of Alberta",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/0160cpw27",
                        "GRID": "grid.17089.37"
                    }
                }
            },
            {
                "given": "Man-Wai",
                "family": "Chu",
                "affiliation": {
                    "original_name": "University of Alberta",
                    "normalized_name": "University of Alberta",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/0160cpw27",
                        "GRID": "grid.17089.37"
                    }
                }
            },
            {
                "given": "Simeon",
                "family": "Blimke",
                "affiliation": {
                    "original_name": "University of Alberta",
                    "normalized_name": "University of Alberta",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/0160cpw27",
                        "GRID": "grid.17089.37"
                    }
                }
            },
            {
                "given": "Geoffrey",
                "family": "Rockwell",
                "affiliation": {
                    "original_name": "University of Alberta",
                    "normalized_name": "University of Alberta",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/0160cpw27",
                        "GRID": "grid.17089.37"
                    }
                }
            },
            {
                "given": "Sean",
                "family": "Gouglas",
                "affiliation": {
                    "original_name": "University of Alberta",
                    "normalized_name": "University of Alberta",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/0160cpw27",
                        "GRID": "grid.17089.37"
                    }
                }
            },
            {
                "given": "David",
                "family": "Holmes",
                "affiliation": {
                    "original_name": "University of Alberta",
                    "normalized_name": "University of Alberta",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/0160cpw27",
                        "GRID": "grid.17089.37"
                    }
                }
            },
            {
                "given": "Shannon",
                "family": "Lucky",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.54",
        "identifier": {
            "string_id": "10.16995/dscn.54",
            "id_scheme": "DOI"
        },
        "abstract": "As Daniel O'Donnell's review of global participation in digital humanities suggests, digital activity may be correlated with the economic situation of a country, such that countries with high income witness a high participation in digital activities while countries with average or low income have partial or low participation (2012). Therefore, in this paper, I investigate the digital culture of Nigeria as a developing country with the goal of teasing out explanations for the gaps between digital literacy and digital humanities activities. I focus on the reasons for a low participation in digital humanities activities in the country by looking into the problems that internet users face in the country and why, despite the amount of digital activities taking place in the country, there appears to be an absence of digital humanities in academia. I conclude by proposing ways through which digital humanities can be incorporated into the Nigerian digital culture, especially in the education sector.",
        "article_title": "The Digital Humanities and Digital Literacy: Understanding the Digital Culture in Nigeria",
        "authors": [
            {
                "given": "Titilola Lucy",
                "family": "Babalola",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.53",
        "identifier": {
            "string_id": "10.16995/dscn.53",
            "id_scheme": "DOI"
        },
        "abstract": "Drawing on Lacanian psychoanalysis and digital media studies, this paper explores the radical disconnect between the home as an object of desire and the house as the space in which the fantasy of home is staged. This paper examines how both digital and physical spaces inform one another and transform the interior and exterior boundaries of the house.",
        "article_title": "The House of the Future: Mediating Open Enclosures",
        "authors": [
            {
                "given": "Sarah",
                "family": "Thorne",
                "affiliation": {
                    "original_name": "Carleton University",
                    "normalized_name": "Carleton University",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/02qtvee93",
                        "GRID": "grid.34428.39"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.52",
        "identifier": {
            "string_id": "10.16995/dscn.52",
            "id_scheme": "DOI"
        },
        "abstract": "In John Napier’s classic study of the structure, function, and behavior of the human hand, he states that \"[i]magination is basic to tool-making. All human-made tools start off as chunks of undifferentiated material, which are then shaped according to some cerebral blueprint of what is required\" (1993, 99). These words can be productively repurposed to describe the digital humanities practice of tool making, tool use, and modelling. After all, making, shaping, and using tools for analysis, archiving, and visualisation has become central to humanistic research methods. Napier's \"cerebral blueprint\" blends imaginative and technical ways of making that emulates how digital humanists seek out new insights alongside technological development. As increasing numbers of digital humanists hone their literacy of the programming languages to build and remake tools, I argue that the means by which we describe this particular philosophy of tool use will become an increasingly thorny issue that may even hinder the usefulness of the knowledge produced by the digital humanities. Therefore, digital humanists will need to find ways to negotiate this role in the humanities and better define their critical agency within the history of epistemology. Additionally, a collaborative development of tools requires a theoretical framework that is critical of the value of data derived from literature in a purely instrumental way and is able to redefine research artifacts in the humanities to include digital tools.",
        "article_title": "\"To think a world without thought\": Negotiating Speculative Realism in a Digital Humanities Practice",
        "authors": [
            {
                "given": "Aaron",
                "family": "Mauro",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.51",
        "identifier": {
            "string_id": "10.16995/dscn.51",
            "id_scheme": "DOI"
        },
        "abstract": "Using a music-download database provided by the Nokia Corporation, this paper explores three primary questions: (1) Do different musical genres create different patterns of downloading? (2) Do different countries download a particular song in different ways? And (3) how do different events affect downloading? Question (1) is studied in relation to representative songs from the pop, rap and rock genres, and reveals rock to be significantly different from pop and rap in a number of key respects. Question (2) investigates the downloading patterns of a mainstream pop song in Brazil, Germany, Italy, and Mexico. Using Kolmogorov-Smirnoff tests to compare the countries’ download distributions, Brazil is found to be substantially dissimilar to the other countries. And Question (3) is explored with respect to types of event, the first \"musical\" (Adele's Grammy Awards triumph in February 2012), and the second \"extra-musical\" (the death of Michael Jackson in June 2009). The extra-musical event is found to have had a far greater effect on downloading patterns than the musical event. The findings are discussed in relation to various factors, including musical genres, the music industry, social media, and globalisation.",
        "article_title": "Every Track You Take: Analysing the Dynamics of Song and Genre Reception Through Music Downloading",
        "authors": [
            {
                "given": "Matthew",
                "family": "Woolhouse",
                "affiliation": {
                    "original_name": "School of the Arts McMaster University",
                    "normalized_name": "McMaster University",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/02fa3aq29",
                        "GRID": "grid.25073.33"
                    }
                }
            },
            {
                "given": "James",
                "family": "Renwick",
                "affiliation": {
                    "original_name": "McMaster University",
                    "normalized_name": "McMaster University",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/02fa3aq29",
                        "GRID": "grid.25073.33"
                    }
                }
            },
            {
                "given": "Dan",
                "family": "Tidhar",
                "affiliation": {
                    "original_name": "University of Cambridge",
                    "normalized_name": "University of Cambridge",
                    "country": "United Kingdom",
                    "identifiers": {
                        "ror": "https://ror.org/013meh722",
                        "GRID": "grid.5335.0"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.50",
        "identifier": {
            "string_id": "10.16995/dscn.50",
            "id_scheme": "DOI"
        },
        "abstract": "What is the best model for public-facing digital literary editions? In 2011, Touch Press released The Waste Land for iPad, an interactive tablet application showcasing T.S. Eliot's notorious 1922 poem The Waste Land. From an academic editorial standpoint, Touch Press's edition has some grave issues. From a popular standpoint, The Waste Land for iPad is successful and well-received. This article asks: How can the tenets of humanities design and scholarly editorial practice be reconciled with the priorities of those who are currently in charge of widespread development and dissemination of cultural content through digital means? By briefly analysing The Waste Land for iPad and contrasting findings to the author's own attempt at developing a digital literary application (Weird Fiction), this article juxtaposes popularity and precision, ethics and economics in the field of cultural production.",
        "article_title": "Considering The Waste Land for iPad and Weird Fiction as models for the public digital edition",
        "authors": [
            {
                "given": "Alyssa",
                "family": "Arbuckle",
                "affiliation": {
                    "original_name": "University of Victoria",
                    "normalized_name": "University of Victoria",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/04s5mat29",
                        "GRID": "grid.143640.4"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.49",
        "identifier": {
            "string_id": "10.16995/dscn.49",
            "id_scheme": "DOI"
        },
        "abstract": "This paper presents an experiment in \"investigative tagging\" applied to a project that is building an archive of early modern collections of curiosities. It proposes that before we begin imposing a structure on our material of study, we need to discover the shape of the data as it presents itself in these materials. The design of this experiment is presented here, along with analysis of the results and their implication for the project, as well as some observations about the experiment and its implementation.",
        "article_title": "Investigative Tagging: Modelling the Early Modern Cabinet of Curiosities",
        "authors": [
            {
                "given": "Brent",
                "family": "Nelson",
                "affiliation": {
                    "original_name": "Univeristy of Saskatchewan",
                    "normalized_name": "University of Saskatchewan",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/010x8gc63",
                        "GRID": "grid.25152.31"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.58",
        "identifier": {
            "string_id": "10.16995/dscn.58",
            "id_scheme": "DOI"
        },
        "abstract": "The Virtual Paul's Cross Project, funded by a grant from the National Endowment for the Humanities, helps us to explore public preaching in early modern London, enabling us to experience a Paul's Cross sermon as a performance, as an event unfolding in real time in the context of an interactive and collaborative occasion. This Project uses architectural modelling software and acoustic simulation software to give us access experientially to a particular event from the past–the Paul's Cross sermon John Donne delivered on Tuesday, November 5, 1622. These tools enable us to integrate the physical traces of pre-Fire St. Paul's Cathedral with the surviving visual record of the cathedral and its surroundings to create a visual model of the Cathedral and its churchyard. They also enable us to experience a historically informed interpretation of Donne's preaching style, based on contemporary descriptions of his capacity to engage his congregations imaginatively and emotionally and to delight them with his wit. We are also able to assess the audibility of a sermon delivered without amplification in a large open space for people positioned at different places in the crowd, and in the presence of different sizes of congregation.",
        "article_title": "Recovering Lost Acoustic Spaces: St. Paul's Cathedral and Paul's Churchyard in 1622",
        "authors": [
            {
                "given": "John",
                "family": "Wall",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.57",
        "identifier": {
            "string_id": "10.16995/dscn.57",
            "id_scheme": "DOI"
        },
        "abstract": "The Papers of George Washington Financial Series is a born-digital project that will publish all of Washington’s financial records – a total of several thousand distinct documents. These are not only numerous, but very diverse and complicated documents, including receipts, invoices, day books, and double entry ledgers that each comprise thousands of discrete transactions. These documents record in depth and in detail every aspect of Washington’s business enterprises, from the account books detailing activities at Mount Vernon and his farms to the books he kept while away at war and during his presidency. This article briefly examines some of the major issues faced in early project development and how they were handled in our content management system, DocTracker.",
        "article_title": "Working with the Financial Records of George Washington: Document vs. Data",
        "authors": [
            {
                "given": "Jennifer",
                "family": "Stertzer",
                "affiliation": {
                    "original_name": "University of Virginia Papers of George Washington",
                    "normalized_name": null,
                    "country": null,
                    "identifiers": {
                        "ror": null,
                        "GRID": null
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.59",
        "identifier": {
            "string_id": "10.16995/dscn.59",
            "id_scheme": "DOI"
        },
        "abstract": "The humanities are undergoing profound shifts in the nature of the processes used to produce scholarly work. As this migration to digital practices is increasingly accepted at universities and public institutions, such bodies have realised they must develop consistent policies governing the practice, implementation, and evaluation of digital scholarship. The formal debate about these processes in relation to faculty and administration is well underway. Similar discussions from the perspective of graduate students working on large-scale, collaborative digital projects has until now been limited to passing conversations at conferences and intradepartmental gestures, with occasional online discussions occurring in venues frequented by early career digital practitioners. This contribution revisits and rehearses, in textual form, issues raised and discussions had at a roundtable at the 2012 conference of the Canadian Society for Digital Humanities devoted to exploring the role of graduate students in the forming digital scholarly environment.",
        "article_title": "Conversation, Collaboration, Credit: The Graduate Researcher in the Digital Scholarly Environment",
        "authors": [
            {
                "given": "Daniel James",
                "family": "Powell",
                "affiliation": null
            },
            {
                "given": "Matt",
                "family": "Bouchard",
                "affiliation": {
                    "original_name": "University of Toronto",
                    "normalized_name": "University of Toronto",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/03dbr7087",
                        "GRID": "grid.17063.33"
                    }
                }
            },
            {
                "given": "Melissa",
                "family": "Dalgleish",
                "affiliation": {
                    "original_name": "York University",
                    "normalized_name": "York University",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/05fq50484",
                        "GRID": "grid.21100.32"
                    }
                }
            },
            {
                "given": "Andy",
                "family": "Keenan",
                "affiliation": {
                    "original_name": "University of Toronto",
                    "normalized_name": "University of Toronto",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/03dbr7087",
                        "GRID": "grid.17063.33"
                    }
                }
            },
            {
                "given": "Alyssa",
                "family": "McLeod",
                "affiliation": {
                    "original_name": "Royal Ontario Museum",
                    "normalized_name": "Royal Ontario Museum",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/00vcj2z66",
                        "GRID": "grid.421647.2"
                    }
                }
            },
            {
                "given": "Tara",
                "family": "Thomson",
                "affiliation": {
                    "original_name": "University of Victoria",
                    "normalized_name": "University of Victoria",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/04s5mat29",
                        "GRID": "grid.143640.4"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.60",
        "identifier": {
            "string_id": "10.16995/dscn.60",
            "id_scheme": "DOI"
        },
        "abstract": "An open society is a cherished liberal ideal, but one necessarily limited by a need for privacy. When Louis Brandeis first formulated \"the right to privacy\" in 1890, it was in response to advances in the technology of photography and the growth of the tabloid press. Today once again new technologies threaten privacy. Real concerns exist about the security of digital data, especially as it affects our personal identity. Furthermore, the development of Web 2.0 and the growth of social media allow ordinary people to collaborate and share information on an unprecedented scale. On the positive side, these digital technologies have given rise to citizen journalism that calls authority to account. At the same time our media-saturated climate has created a \"panoptic\" society, and encouraged a penchant for validation through self-exposure. This culture of hypervisibility in confluence with a generation that has grown up \"digitally native\" reveals the paradoxes of living life in the open.",
        "article_title": "Living in the Open",
        "authors": [
            {
                "given": "Ron",
                "family": "Tetreault",
                "affiliation": null
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "0",
        "issue": "0",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.80",
        "identifier": {
            "string_id": "10.16995/dscn.80",
            "id_scheme": "DOI"
        },
        "abstract": "Digital project teams are by definition comprised of people with various skills, disciplines, and content knowledge. Collaboration within these teams is undertaken by librarians, academics, undergraduate and graduate students, research assistants, computer programmers and developers, content experts, and other individuals. While this diversity of people, skills and perspectives creates benefits for the teams, at the same time, it creates a series of challenges which must be minimized to ensure project success. Drawing upon interview and survey data, this paper explores the benefits, challenges, and patterns of interaction associated with these types of project teams. It will conclude with a series of recommendations focused on harnessing the advantages while minimizing the challenges.",
        "article_title": "“More Minds are Brought to Bear on a Problem”: Methods of Interaction and Collaboration within Digital Humanities Research Teams",
        "authors": [
            {
                "given": "Lynne",
                "family": "Siemens",
                "affiliation": {
                    "original_name": "University of Victoria",
                    "normalized_name": "University of Victoria",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/04s5mat29",
                        "GRID": "grid.143640.4"
                    }
                }
            },
            {
                "given": "Richard",
                "family": "Cunningham",
                "affiliation": {
                    "original_name": "Acadia University",
                    "normalized_name": "Acadia University",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/00839we02",
                        "GRID": "grid.411959.1"
                    }
                }
            },
            {
                "given": "Wendy",
                "family": "Duff",
                "affiliation": {
                    "original_name": "University of Toronto",
                    "normalized_name": "University of Toronto",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/03dbr7087",
                        "GRID": "grid.17063.33"
                    }
                }
            },
            {
                "given": "Claire",
                "family": "Warwick",
                "affiliation": {
                    "original_name": "University College London",
                    "normalized_name": "University College London",
                    "country": "United Kingdom",
                    "identifiers": {
                        "ror": "https://ror.org/02jx3x895",
                        "GRID": "grid.83440.3b"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "2",
        "issue": "2",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.82",
        "identifier": {
            "string_id": "10.16995/dscn.82",
            "id_scheme": "DOI"
        },
        "abstract": "The Renaissance English Knowledgebase (REKn) is an electronic knowledgebase consisting of primary and secondary materials (text, image, and audio) related to the Renaissance period. The limitations of existing tools to accurately search, navigate, and read large collections of data in many formats, coupled with the findings of our research into professional reading, led to the development of a Professional Reading Environment (PReE) to meet these needs. Both were conceived as necessary components of a prototype textual environment for an electronic scholarly edition of the Devonshire Manuscript. This article offers an overview of the development of both REKn and PReE at the Electronic Textual Cultures Laboratory (ETCL) at the University of Victoria, from proof of concept through to their current iteration, concluding with a discussion about their future adaptation, implementation, and integration with other projects and partnerships.",
        "article_title": "Prototyping the Renaissance English Knowledgebase (REKn) and Professional Reading Environment (PReE), Past, Present, and Future Concerns: A Digital Humanities Project Narrative",
        "authors": [
            {
                "given": "Ray",
                "family": "Siemens (Editor)",
                "affiliation": {
                    "original_name": "University of Victoria",
                    "normalized_name": "University of Victoria",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/04s5mat29",
                        "GRID": "grid.143640.4"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "2",
        "issue": "2",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.79",
        "identifier": {
            "string_id": "10.16995/dscn.79",
            "id_scheme": "DOI"
        },
        "abstract": "Reading seems so natural to us as adults that we tend to forget how long it took us to master that activity. We also tend to believe that reading has always been the same and follows the same pattern independently of the culture, the objectives of the reader, the nature of the text, and the extent to which different mediums allow certain modes of reading and discourage others. As a consequence, in a time of rapid technological change, there is a lot of anxiety in the media about a possible decline in the ability to read. In this paper, I will try to put those claims in perspective and I will make the case that we are engaged in a global shift from immersive to ergative reading.",
        "article_title": "Some Considerations about the Future of Reading",
        "authors": [
            {
                "given": "Christian",
                "family": "Vandendorpe (Founding Editor)",
                "affiliation": {
                    "original_name": "Université d'Ottawa",
                    "normalized_name": "University of Ottawa",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/03c4mmv16",
                        "GRID": "grid.28046.38"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "2",
        "issue": "2",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.16995/dscn.81",
        "identifier": {
            "string_id": "10.16995/dscn.81",
            "id_scheme": "DOI"
        },
        "abstract": "\"Testing the Limits\" reflects upon the implications of a conceptual paradigm shift in theoretical approaches to the use of immersive technologies in a postcolonial, post-positivistic world. This reflection means bringing into proximity alternative explanatory models of \"reality\"—such as the indigenous philosophy of Leroy Little Bear where it relates to Western science, David Peat's thoughts on quantum theory and his collaboration with Leroy Little Bear, and the theory of synchronicity as developed by Carl G. Jung in collaboration with physicist Wolfgang Pauli—where these models open into alternative worldviews which offer a hypothetical rapprochement in the history of consciousness between science and art. This study, therefore, focuses less on the use of immersive technology in the Humanities than on the instrumentality of theory itself in constructing perceptual models of reality (including scientific and artistic worldviews), especially where it is \"virtual\" and where it needs to consider diverse philosophies, scientific theories and representations of space/time in relation to subjectivities. To illustrate this claim, the media work by Canadian artist Char Davies will be offered as a case study; Davies has gone on record seeking to subvert the visual aesthetic in VR and 3D computer graphics, which, in striving for \"ever great photo realism,\" serves only to reinforce \"the Cartesian divide between dominating subject and passive object.\" It is relevant in the context of this essay that Char Davies is a software developer and artist whose work is informed not only by her understanding of the history of consciousness in Western metaphysics, but also by her understanding of the relation of such history to quantum theory.",
        "article_title": "\"Testing the Limits\": What Happens When Digital Humanities Meets Alternative Worldviews",
        "authors": [
            {
                "given": "Jodey",
                "family": "Castricano",
                "affiliation": {
                    "original_name": "University of British Columbia",
                    "normalized_name": "University of British Columbia",
                    "country": "Canada",
                    "identifiers": {
                        "ror": "https://ror.org/03rmrcq20",
                        "GRID": "grid.17091.3e"
                    }
                }
            }
        ],
        "publisher": "Open Library of the Humanities",
        "date": "2017-10-19",
        "keywords": null,
        "journal_title": "Digital Studies/Le champ numérique",
        "volume": "2",
        "issue": "2",
        "ISSN": [
            {
                "value": "1918-3666",
                "type": "electronic"
            }
        ]
    }
]