[
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqaa002/5775571",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqaa002",
            "id_scheme": "DOI"
        },
        "abstract": "The extraction of large amounts of multilingual parallel text from web resources is a widely used technique in natural language processing. However, automatically collected parallel corpora usually lack precise metadata, which are crucial to accurate data analysis and interpretation. The combination of automated extraction procedures and manual metadata enrichment may help address this issue. Wikipedia is a promising candidate for the exploration of the potential of said combination of methods because it is a rich source of translations in a large number of language pairs and because its open and collaborative nature makes it possible to identify and contact the users who produce translations. This article tests to what extent translated texts automatically extracted from Wikipedia by means of neural networks can be enriched with pertinent metadata through a self-submission-based user survey. Special emphasis is placed on data usefulness, defined in terms of a catalogue of previously established assessment criteria, most prominently metadata quality. The results suggest that from a quantitative perspective, the proposed methodology is capable of capturing metadata otherwise not available. At the same time, the crowd-based collection of data and metadata may face important technical and social limitations.",
        "article_title": "Automatically extracted parallel corpora enriched with highly useful metadata? A Wikipedia case study combining machine learning and social technology",
        "authors": [
            {
                "given": "Ahmad",
                "family": "Aghaebrahimian"
            },
            {
                "given": "Andy",
                "family": "Stauder"
            },
            {
                "given": "Michael",
                "family": "Ustaszewski"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T19:00:50.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqaa007/5804949",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqaa007",
            "id_scheme": "DOI"
        },
        "abstract": "Computing machines allow quantitative analysis of large databases of text, providing knowledge that is difficult to obtain without using automation. This article describes Universal Data Analysis of Text (UDAT) —a text analysis method that extracts a large set of numerical text content descriptors from text files and performs various pattern recognition tasks such as classification, similarity between classes, correlation between text and numerical values, and query by example. Unlike several previously proposed methods, UDAT is not based on frequency of words and links between certain key words and topics. The method is implemented as an open-source software tool that can provide detailed reports about the quantitative analysis of sets of text files, as well as exporting the numerical text content descriptors in the form of comma-separated values files to allow statistical or pattern recognition analysis with external tools. It also allows the identification of specific text descriptors that differentiate between classes or correlate with numerical values and can be applied to problems related to knowledge discovery in domains such as literature and social media. UDAT is implemented as a command-line tool that runs in Windows, and the open source is available and can be compiled in Linux systems. UDAT can be downloaded from http://people.cs.ksu.edu/∼lshamir/downloads/udat.",
        "article_title": "UDAT: Compound quantitative analysis of text using machine learning",
        "authors": [
            {
                "given": "Lior",
                "family": "Shamir"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T20:06:02.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqaa014/5836757",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqaa014",
            "id_scheme": "DOI"
        },
        "abstract": "This article investigates the collocational behavior of English modal auxiliaries such as may and might with the aim of finding corpus-based measures that distinguish between different modal expressions and that allow insights into why speakers may choose one over another in a given context. The analysis uses token-based semantic vector space modeling (Heylen et al., 2015, Monitoring polysemy. Word space models as a tool for large-scale lexical semantic analysis. Lingua, 157: 153–72; Hilpert and Correia Saavedra, 2017, Using token-based semantic vector spaces for corpus-linguistic analyses: From practical applications to tests of theoretical claims. Corpus Linguistics and Linguistic Theory) in order to determine whether different modal auxiliaries can be distinguished in terms of their collocational profiles. The analysis further examines whether different senses of the same auxiliary exhibit divergent collocational preferences. The results indicate that near-synonymous pairs of modal expressions, such as may and might or must and have to, differ in their distributional characteristics. Also, different senses of the same modal expression, such as deontic and epistemic uses of may, can be distinguished on the basis of distributional information. We discuss these results against the background of previous empirical findings (Hilpert, 2016, Construction Grammar and its Application to English, 2nd edn. Edinburgh: Edinburgh University Press, Flach, in press, Beyond modal idioms and modal harmony: a corpus-based analysis of gradient idiomaticity in modal-adverb collocations. English Language and Linguistics) and theoretical issues such as degrees of grammaticalization (Correia Saavedra, 2019, Measurements of Grammaticalization: Developing a Quantitative Index for the Study of Grammatical Change. PhD Dissertation, Université de Neuchâtel) and the avoidance of synonymy (Bolinger, 1968, Entailment and the meaning of structures. Glossa, 2(2): 119–27).",
        "article_title": "Disentangling modal meanings with distributional semantics",
        "authors": [
            {
                "given": "Martin",
                "family": "Hilpert"
            },
            {
                "given": "Susanne",
                "family": "Flach"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T06:01:46.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz072/5612984",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz072",
            "id_scheme": "DOI"
        },
        "abstract": [
            "Most commentators locate the origin of digital humanities (DH) in computational text analysis of the mid-twentieth century, beginning in 1946 with Roberto Busa’s plans for the Index Thomisticus, a massive attempt to encode nearly 11 million words of Thomas Aquinas’ writings on IBM punch cards. This event (and the narrative that follows) is found throughout the literature, leading some to believe that early DH work ‘concentrated, perhaps somewhat narrowly, on text analysis (such as classification systems, mark-up, text encoding, and scholarly editing)’ (Presner, 2010, p. 6). Others seem convinced that DH is still only text analysis or too dominated by it (Meeks, 2013)—and misguided in its approach (Fish, 2012). Meanwhile, Underwood (2017) has recently made a case for disentangling distant reading methods from DH generally, noting that the former predates and does not depend on digital technology.",
            "This article presents an empirical perspective on the early history of DH by tracing publications in two foundational journals (Computers and the Humanities (CHum), established in 1966, and Literary and Linguistic Computing (LLC), established in 1986), with particular emphasis on media types, authors’ disciplines and locations, and teaching and learning. In doing so, we examine the extent to which early DH work focused on text analysis as well as broader trends in the early history of the field."
        ],
        "article_title": "The early history of digital humanities: An analysis of Computers and the Humanities (1966–2004) and Literary and Linguistic Computing (1986–2004)",
        "authors": [
            {
                "given": "Chris Alen",
                "family": "Sula"
            },
            {
                "given": "Heather V",
                "family": "Hill"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T23:06:42.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz073/5614588",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz073",
            "id_scheme": "DOI"
        },
        "abstract": "This article presents a digitally assisted mode of close listening as an innovative way of analysing poetry, through the implementation of a recently developed web-based tool called Visualising Voice, initially conceived to facilitate performance studies of French poetry. This article begins by establishing the status of close listening practices and their importance as a means of studying poetry in French, as well as considering the possibilities afforded by applying these practices to studying poetry in other languages. It then goes on to examine how the Visualising Voice tool can be applied to case studies of two poems—Charles Baudelaire’s ‘L’Albatros’ (‘The Albatross’) and Paul Verlaine’s ‘Green’—each performed by three different speakers. This article argues that close listening using the Visualising Voice tool reveals subtle differences in the handling of metrical features and differences in performance styles of the same poem, which would be unlikely to be perceived by traditional listening methods. This article thus contends that close listening practices not only take the study of poetry beyond traditional modes of textual analysis but also that facilitating these practices through digital methodologies—such as those offered by the Visualising Voice tool—can transform the way in which poetry is read and understood beyond the academic sphere, in particular by general and younger audiences.",
        "article_title": "Visualising Voice: Analysing spoken recordings of nineteenth-century French poetry",
        "authors": [
            {
                "given": "Caroline",
                "family": "Ardrey"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T23:06:00.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz060/5614584",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz060",
            "id_scheme": "DOI"
        },
        "abstract": "I model a critical posthumanist pedagogy that uses text analysis software and is aimed at higher education students. A key purpose of the pedagogy is to help students enhance empathetic, critical and independent thinking. For their project assignment, the student chooses an unfamiliar campaign seeking to eliminate suffering and extend rights. They gather all texts from the campaign website into a corpus, which thus represents the campaign writ large. Then they use appropriate software to ascertain, efficiently and rigorously, common campaign concerns across this corpus. This puts students in a position to discern any significant concerns in the campaign corpus that are not addressed in text(s) supporting the status quo which the campaign opposes. Should significant omissions be found, students critically evaluate the status quo text(s) from the campaign’s perspective. Since this perspective derives from the student identifying (at least temporarily) with software generated data, it is a posthuman subjectivity. Engaging digitally and empathetically with a campaign’s data at scale for creation of a posthuman subjectivity can broaden awareness of disadvantage, discrimination, and suffering as well as expand horizons. Moreover, at the end of the assignment, the student is expected to formulate their own position vis-à-vis the previously unfamiliar campaign. Conditions have been created then for the student to enhance independent thinking too.",
        "article_title": "A posthumanist pedagogy using digital text analysis to enhance critical thinking in higher education",
        "authors": [
            {
                "given": "Kieran",
                "family": "O'Halloran"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T01:46:01.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz079/5637295",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz079",
            "id_scheme": "DOI"
        },
        "abstract": "Is there a way to ensure older adults can bridge the digital divide and engage with online cultural heritage? How can cinema-going memories encourage cross-generational engagement? This article proposes to address these issues by using the Italian Cinema Audiences research project as a case study, and specifically cinema-going memories as intangible cultural heritage (Ercole et al., 2016, Cinema heritage in Europe: preserving and sharing culture by engaging with film exhibition and audiences. Editorial. Alphaville: Journal of Film and Screen Media, 11(Summer): 1–12. Web. ISSN: 2009-4078). It aims to tackle the difficulty of engaging the older generation with the digital world, by proposing and testing new ways to resolve it. Through a mixed-methods ethnographic approach, this article investigates different strategies: the use of social media platforms; a cross-generational activity involving Historypin, a digital, user-generated archive of crowdsourced historical material; an online dedicated archive built in collaboration with the older adults involved in the project. These different solutions aim not only at increasing digital engagement among older adults, but also at furthering younger generations’ involvement in shared cultural heritage in an online context. By focusing on the memories of cinema-going in 1950s Italy, the article explores the implications of the advantages and disadvantages of these different approaches. It also tests Anja K. Leist’s research findings (2013, Social media use of older adults: a mini-review. Gerontology, 59(4): 378–84) on the key role of moderators (the younger generation) to help novice users (the older generation) in the ‘continuous engagement’ in digital environments. We conclude that in order to bridge the digital divide two components are necessary simultaneously: the creation of digital platforms in which the older generations are both curators and users, and the support of and interaction with younger generations.",
        "article_title": "Bridging the digital divide: Older adults’ engagement with online cinema heritage",
        "authors": [
            {
                "given": "Silvia",
                "family": "Dibeltulo"
            },
            {
                "given": "Sarah",
                "family": "Culhane"
            },
            {
                "given": "Daniela",
                "family": "Treveri Gennari"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T00:42:20.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz081/5670586",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz081",
            "id_scheme": "DOI"
        },
        "abstract": "This article reports on a study of interfaces to long-lived digital humanities (DH) resources using an innovative combination of research methods from book history, interface design, and digital preservation and curation to investigate how interfaces to DH resources have changed over time. To do this, we used the Internet Archive’s Wayback machine to investigate the original presentation and all subsequent changes to the interfaces of a small sample of projects. The study addresses the following questions: What can we learn from a study of interfaces to DH material? How have interfaces to DH materials changed over the course of their existence? Do these changes affect the way the resource is used, and the way it conveys meaning? Should we preserve interfaces for future scholarship? We show that a valuable information may be derived from the interfaces of long-lived projects. Visual design can communicate subtle messages about the way the resource was originally conceived by its creators and subsequent changes show how knowledge of user behaviour developed in the DH community. Interfaces provide information about the intellectual context of early digital projects. They can also provide information about the changing place of DH projects in local and national infrastructures, and the way that projects have sought to survive in challenging funding environments.",
        "article_title": "Interfaces, ephemera, and identity: A study of the historical presentation of digital humanities resources",
        "authors": [
            {
                "given": "Claire",
                "family": "Warwick"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T03:09:22.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz063/5673744",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz063",
            "id_scheme": "DOI"
        },
        "abstract": "Our article uses text mining techniques to examine confidential letters sent from the Bank of England’s Prudential Regulation Authority (PRA) to financial institutions it supervises. These letters are a ‘report card’ written to firms annually, and are the most important, regularly recurring written communication sent from the PRA to firms it supervises. Using two complementary machine learning techniques—random forests and logistic ridge regression—we explore whether the letters vary in substance and style depending on the size and importance of the firm to whom the PRA is writing. We find that letters to high impact firms use more evaluative, judgment-based language, and adopt a more forward-looking perspective. We also examine how PRA letters differ from similarly purposed letters written by its predecessor, the Financial Services Authority. We find evidence that PRA letters are different, with a greater degree of forward-looking language and directiveness, reflecting the shift in supervisory approach that has occurred in the UK following the financial crisis of 2007–09.",
        "article_title": "Text mining letters from financial regulators to firms they supervise",
        "authors": [
            {
                "given": "David",
                "family": "Bholat"
            },
            {
                "given": "James",
                "family": "Brookes"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T03:10:11.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz087/5712971",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz087",
            "id_scheme": "DOI"
        },
        "abstract": "While the field of digital humanities continues to evolve and expand, the affordances of the digital medium are becoming increasingly applicable to research in the field of education. This article provides an overview of some of the issues involved with publishing educational research as a digital web-based thesis. It also introduces the term multimodal theses and dissertations (MTDs) and reports on a Ph.D. research project which is an early example of an MTD in the field of education. The purpose of this article is three-fold: (1) to stand on the shoulders of those in the digital humanities to expand the growing field of digital scholarship to include education; (2) to report on a range of unanticipated affordances arising from the MTD format in addition to the obvious benefits of ease of use, embedded media, and functionality; (3) to propose a transdisciplinary protocol for digital scholarship to assist researchers, librarians, and graduate school administrators in various disciplines.",
        "article_title": "A transdisciplinary protocol for digital scholarship",
        "authors": [
            {
                "given": "Brendan",
                "family": "Jacobs"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T19:33:50.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz085/5717927",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz085",
            "id_scheme": "DOI"
        },
        "abstract": "Computational stylistics has developed various methods for investigating and attributing authorship of collaborative literary texts. This article investigates ‘precursory authorship’ (Love, 2002): that is, the authorial traces of a source text that inform—to a greater or lesser degree—a subsequent literary output, in order to establish its relevance for our approach to and understanding of the linguistic properties of literary style. Precursory authorship and derivative adaptations are common features of early modern English drama, and the study focusses on two case studies relating to the plays of Restoration playwright, Aphra Behn (c. 1640–89). Using a combination of quantitative methods (Rolling Delta (RD), principal components analysis (PCA), Delta, and Hierarchical Cluster Analysis), the investigation highlights the presence of precursory authorial style in Behn’s The Rover and an anonymous work associated with Behn, The Counterfeit Bridegroom. The results suggest that precursory authorial style is identifiable in both cases, not only through a similarity with the source text but, to a lesser degree, other texts by the precursory author as well. The anonymous play yields complex and non-confirmatory evidence for Behn’s authorship. Methodologically, RD is most sensitive to precursory collaboration. Collectively, the findings highlight the importance of stylistic factors when describing and interpreting literary linguistic quantitative data: precursory authorial style is another facet that intersects with properties such as time period and genre. The article urges a more critical and theoretically informed view of authorially aligned linguistic style.",
        "article_title": "Stylistic palimpsests: Computational stylistic perspectives on precursory authorship in Aphra Behn’s drama",
        "authors": [
            {
                "given": "Mel",
                "family": "Evans"
            },
            {
                "given": "Alan",
                "family": "Hogarth"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T01:55:41.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz043/5536316",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz043",
            "id_scheme": "DOI"
        },
        "abstract": "Experience through sight has been recognized as a contributing factor in the shaping of historic landscapes, where humans could express themselves in response to their aesthetic and intellectual qualities. What was experienced, however, was not only dependent on the ‘prospect’, or landscape view, but also on the individual ‘perspective’ of the spectator. Three-dimensional Geographical Information Systems (3D GIS) has enabled investigations into landscape visibility within digitized historic environments and can therefore assist the analysis and understanding of this phenomenon. This article applies 3D GIS to a currently under-researched area of landscape history, English designed landscapes of the 16th and 17th centuries. From country houses and gardens to parks and working estates, these landscapes were manipulated in response to the landowners’ ‘perspectives’ towards the landscape, which subsequently determined the visibility or invisibility of features within certain ‘prospects’. This concept was dubbed ‘The Royaltie of Sight’ by Henry Wotton in 1624. By using 3D GIS to recreate a designed landscape that poses challenges which have previously hindered its analysis, the characteristics of ‘prospects’ can be ascertained using viewshed analysis and the individual ‘perspective’ of the landowner interpreted using phenomenology and reception theory. The results presented in this article demonstrate how 3D GIS has benefited studies into English designed landscapes and improved knowledge of how perception influenced landscape change.",
        "article_title": "3D GIS and ‘The Royaltie Of Sight’: Recreating ‘Prospects’ and ‘Perspectives’ within an English designed landscape c. 1550–1660",
        "authors": [
            {
                "given": "Elizabeth",
                "family": "Stewart"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T23:50:13.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/Supplement_1/i17/5542057",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz027",
            "id_scheme": "DOI"
        },
        "abstract": "Eye-tracking—the process of capturing and measuring human eye movement—is becoming an increasingly prevalent tool in the cultural heritage sector to understand visual processing and audience behaviours. Yet, most applications to date have focused on individual artworks and distinctions between representative/non-representative topics, with little prior work on the effects of differing written interpretations on the visual exploration of collections of artworks, particularly with devotional themes. This article reports on an eye-tracking study that explored responses to the unique collection of Francisco de Zurbarán paintings in County Durham. Using eye-tracking technology in a laboratory setting, we evaluated the viewing behaviour of three participant groups to determine whether the accompanying written context influences how digital reproductions are experienced. In addition to demonstrating statistically significant variations in aesthetic appreciation, the experiments showed that the gaze can be redirected towards areas of conceptual significance. Most importantly, we were able to challenge the assumption that viewers always look at faces (Bindemann et al., 2005). Our findings make an important new contribution to the scholarly understanding of how audiences view, appreciate, and understand artworks and to museum and heritage practices relevant to the display of art.",
        "article_title": "Aesthetic appreciation and Spanish art: insights from eye-tracking",
        "authors": [
            {
                "given": "Claire",
                "family": "Bailey-Ross"
            },
            {
                "given": "Andrew M",
                "family": "Beresford"
            },
            {
                "given": "Daniel T",
                "family": "Smith"
            },
            {
                "given": "Claire",
                "family": "Warwick"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T01:12:54.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz054/5542072",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz054",
            "id_scheme": "DOI"
        },
        "abstract": "Multispectral (MSI) imaging of historical documents can recover lost features, such as text or drawings. This technique involves capturing multiple images of a document illuminated using different wavelengths of light. The images created must be registered in order to ensure optimal results are produced from any subsequent image processing techniques. However, the images may be misaligned due to the presence of optical elements such as filters, or because they were acquired at different times or because the images were captured from different copies of the documents . There is little prior work or information available about which image registration techniques are most appropriate. Image registration of multispectral images is challenging as the illumination changes for each image and the features visible in images captured at different wavelengths may not appear consistently throughout the image sequence. Here, we compare three image registration techniques: two based on similarity measures and a method based on phase correlation. These methods are characterized by applying them to realistic surrogate images and then assessed on three different sets of real multispectral images. Mutual information is recommended as a measure for affine image registration when working with multispectral images of documentary material as it was proven to be more robust than the other techniques tested.",
        "article_title": "Affine registration of multispectral images of historical documents for optimized feature recovery",
        "authors": [
            {
                "given": "Cerys",
                "family": "Jones"
            },
            {
                "given": "William A",
                "family": "Christens-Barry"
            },
            {
                "given": "Melissa",
                "family": "Terras"
            },
            {
                "given": "Michael B",
                "family": "Toth"
            },
            {
                "given": "Adam",
                "family": "Gibson"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T00:33:25.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz042/5549976",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz042",
            "id_scheme": "DOI"
        },
        "abstract": "The article offers a state-of-the-art overview of a number of Digital Humanities (DH) initiatives that have emerged in Sweden over the past decade. We identify two major developments that seem to be taking place within DH, with a specific focus on the infrastructural aspects of the development: (1) a strive to open up and broaden the research output and (2) multi-disciplinary collaboration and its effects. The two major components accentuate the new infrastructural patterns that are developing and the challenges these infer on universities. While current research is at large multi-disciplinary, developing infrastructures also enable the move towards post-disciplinarity, bringing the universities closer to the surrounding society. At five universities in Sweden, individual-sited infrastructures supporting DH research have been built today. They are complemented by national and international infrastructures, thus supporting developments and tackling some of the major challenges. In the article, the relations between individual disciplines, the question of multi- and post-disciplinarity, and the field of Digital Humanities are discussed, while stressing the factors necessary—sine qua non—for a fruitful development of the scholarly infrastructures.",
        "article_title": "Digital humanities in Sweden and its infrastructure: Status quo and the sine qua non",
        "authors": [
            {
                "given": "Koraljka",
                "family": "Golub"
            },
            {
                "given": "Elisabet",
                "family": "Göransson"
            },
            {
                "given": "Anna",
                "family": "Foka"
            },
            {
                "given": "Isto",
                "family": "Huvila"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T00:51:33.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz059/5565265",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz059",
            "id_scheme": "DOI"
        },
        "abstract": "Despite the commonly reported underuse of linking adverbials of contrast and concession (such as yet, nevertheless) by English as a Foreign Language (EFL) learners in writing, relatively little is known about the use of structural conjunctions in this regard. The present work uses a corpus approach to investigate the use of while, a polysemous conjunction of contrast and concession, in the writing of Chinese EFL learners as compared with their British native-speaker counterparts. The analysis of while-clauses is informed by clause-complexing and textual descriptions of clause in Systemic Functional Linguistics (Halliday and Matthiessen, 2013). Preference for initial concessive while-clauses by native-speaker students was found, in sharp contrast to the dominant use of final adversative while-clauses by Chinese EFL learners. Analysis of the native-speaker data revealed that initial concessive while-clause is characterized by equivalence or relatedness of topical themes of while-clause and its main clause, confirming the discourse-organizing function of thematic hypotactic clauses. In addition, the pattern of non-human subjects and low-value modal operators (e.g. While this … may …) associated dominantly and exclusively with initial concessive while-clauses in the native corpus serves further evidence of distinctive features of concessive while-clauses. This study adds to a growing body of literature on the SFL approach to second language writing and is among the first to combine corpus-based methodologies and SFL theoretical framework to analyze logico-semantic relations. The study concludes with some pedagogical implications for teaching adversative and concessive while-clauses to EFL learners.",
        "article_title": "Adversative versus concessive while-clauses in native and learner English texts: A corpus-based systemic functional description",
        "authors": [
            {
                "given": "Yan",
                "family": "Zhang"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T00:16:46.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz068/5601610",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz068",
            "id_scheme": "DOI"
        },
        "abstract": "This article aims to offer a methodological contribution to digital humanities by exploring the value of a mixed-method approach to uncover and understand historical patterns in large quantities of textual data. It refines the distant reading technique of topic modelling (TM) by using the discourse-historical approach (DHA——Wodak, 2001) in order to analyse the mechanisms underlying discursive practices in historical newspapers. Specifically, we investigate public discourses produced by Italian minorities and test the methodology on a corpus of digitized Italian ethnic newspapers published in the USA between 1898 and 1920 (ChroniclItaly—Viola, 2018). This combined methodology, which we suggest to label ‘discourse-driven topic modelling’ (DDTM), enabled us to triangulate linguistic, social, and historical data and to examine how the changing experience of migration, identity construction, and assimilation was reflected over time in the accounts of the minorities themselves. The results proved DDTM to be effective in obtaining a categorization of the topics discussed in the immigrant press. The changing distribution of topics over time revealed how the Italian immigrant community negotiated their sense of connectedness with both the host country and the homeland. At the same time, without jeopardizing the analytical depth of the findings, the method proved its value of minimizing the risk of biases when identifying the topics which stemmed from the results rather than from preconceived assumptions.",
        "article_title": "Mining ethnicity: Discourse-driven topic modelling of immigrant discourses in the USA, 1898–1920",
        "authors": [
            {
                "given": "Lorella",
                "family": "Viola"
            },
            {
                "given": "Jaap",
                "family": "Verheul"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T22:45:37.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz016/5419271",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz016",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Transcribear – Introducing a secure online transcription and annotation tool",
        "authors": [
            {
                "given": "Yu-Hua",
                "family": "Chen"
            },
            {
                "given": "Radovan",
                "family": "Bruncak"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T01:09:05.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz022/5485806",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz022",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "The visual side of digital humanities: a survey on topics, researchers, and epistemic cultures",
        "authors": [
            {
                "given": "Sander",
                "family": "Münster"
            },
            {
                "given": "Melissa",
                "family": "Terras"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T01:00:27.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz028/5497836",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz028",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Judging style: The case of Bush versus Gore",
        "authors": [
            {
                "given": "Matthew L",
                "family": "Jockers"
            },
            {
                "given": "Fernando",
                "family": "Nascimento"
            },
            {
                "given": "George H",
                "family": "Taylor"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T00:40:45.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqy077/5510046",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy077",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "History playground: A tool for discovering temporal trends in massive textual corpora",
        "authors": [
            {
                "given": "Thomas",
                "family": "Lansdall-Welfare"
            },
            {
                "given": "Nello",
                "family": "Cristianini"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T07:55:27.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz037/5522525",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz037",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Dialect borders—political regions are better predictors than economy or religion",
        "authors": [
            {
                "given": "Curdin",
                "family": "Derungs"
            },
            {
                "given": "Christian",
                "family": "Sieber"
            },
            {
                "given": "Elvira",
                "family": "Glaser"
            },
            {
                "given": "Robert",
                "family": "Weibel"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T22:46:17.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz039/5523023",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz039",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Gender ideology and identity in humorous social media memes",
        "authors": [
            {
                "given": "Victoria O",
                "family": "Gbadegesin"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T02:55:40.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqy080/5281241",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy080",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "The digital humanist: Contested status within contesting futures",
        "authors": [
            {
                "given": "Costas",
                "family": "Papadopoulos"
            },
            {
                "given": "Paul",
                "family": "Reilly"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T15:52:54.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqy083/5299608",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy083",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Digital dance scholarship: Biomechanics and culturally situated dance analysis",
        "authors": [
            {
                "given": "Miguel",
                "family": "Escobar Varela"
            },
            {
                "given": "Luis",
                "family": "Hernández-Barraza"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T07:50:49.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqy087/5303640",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy087",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "‘The Michael Jordan of greatness’—Extracting Vossian antonomasia from two decades of <i>The New York Times</i> , 1987–2007",
        "authors": [
            {
                "given": "Frank",
                "family": "Fischer"
            },
            {
                "given": "Robert",
                "family": "Jäschke"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T07:52:17.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz006/5308384",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz006",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Sensorial discourse and corpus in the digital humanities era: The example of the wine language",
        "authors": [
            {
                "given": "Matthieu",
                "family": "Bach"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T23:24:05.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqy074/5310055",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy074",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Toward Kurdish language processing: Experiments in collecting and processing the AsoSoft text corpus",
        "authors": [
            {
                "given": "Hadi",
                "family": "Veisi"
            },
            {
                "given": "Mohammad",
                "family": "MohammadAmini"
            },
            {
                "given": "Hawre",
                "family": "Hosseini"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T15:02:44.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz009/5316018",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz009",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Towards an ontology-based iconography",
        "authors": [
            {
                "given": "Richard",
                "family": "Gartner"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T22:25:14.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz007/5345107",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz007",
            "id_scheme": "DOI"
        },
        "abstract": "The Territorial Papers of the United States are a valuable and underused resource containing almost 10,000 documents written between 1789 and 1848 about the formation of new sovereign states from US territory. These communications between the federal government and frontier settlers comprise the actual discourse of the nation’s expansion over six decades. Digitizing the Territorial Papers permits the possibility of analyzing the entire corpus globally. Text mining and topic modeling methods give us a lens on the language patterns through which new state governments and the expanding nation were formed. An initial statistical analysis of the textual information provides a visualization of content, helps discern how ideals about governance emerged, and lays the foundation for developing more sophisticated hypotheses and theoretical constructs.",
        "article_title": "A case study in text mining: Textual analysis of the Territorial Papers",
        "authors": [
            {
                "given": "Johannes",
                "family": "Ledolter"
            },
            {
                "given": "Lea",
                "family": "VanderVelde"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T22:51:30.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz005/5345242",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz005",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Linguistic characteristics of Chinese register based on the Menzerath—Altmann law and text clustering",
        "authors": [
            {
                "given": "Renkui",
                "family": "Hou"
            },
            {
                "given": "Chu-Ren",
                "family": "Huang"
            },
            {
                "given": "Kathleen",
                "family": "Ahrens"
            },
            {
                "given": "Yat-Mei Sophia",
                "family": "Lee"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T23:06:29.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/Supplement_1/i100/5381103",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz011",
            "id_scheme": "DOI"
        },
        "abstract": "Digital humanities projects have long relied on various schema languages—chiefly, RELAX NG and Schematron—for validating the XML documents in their data collections; however, these languages are limited in their ability to check for consistency, coherence, and completeness across the entire project. In our work as part of “Endings”, an umbrella project that comprises four diverse digital edition projects from different fields, we have developed a methodology for checking and enforcing correctness, completeness, and coherence across the entire document set. The following article describes the various stages (what we term “levels”) of our diagnostics process, all of which are driven by XSLT (Extensible Stylesheet Language Transformations) stylesheets, and produce a human readable report. These levels include checks for referential integrity, correct entity tagging, and potential duplicates in the data set. Using examples from the Endings projects, we show how diagnostic processes not only ensure correctness in the data set, but can also aid in determining project milestones and completion dates. Diagnostics, we argue, are thus a crucial extension to schema-based validation for complex digital projects and can provide concrete ways for digital humanities projects to enforce coherence and consistency and track their progress toward completion.",
        "article_title": "Beyond validation: Using programmed diagnostics to learn about, monitor, and successfully complete your DH project",
        "authors": [
            {
                "given": "Martin",
                "family": "Holmes"
            },
            {
                "given": "Joseph",
                "family": "Takeda"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T01:35:34.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqz018/5396720",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqz018",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Digital studies and transcontextualization of the humanities: The case of organology",
        "authors": [
            {
                "given": "Sanela",
                "family": "Nikolić"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T01:07:06.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/3/616/5161109",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy057",
            "id_scheme": "DOI"
        },
        "abstract": "The term ‘digital humanities’ may be understood in three different ways: as ‘digitized humanities’, by dealing essentially with the constitution, management, and processing of digitized archives; as ‘numerical humanities’, by putting the emphasis on mathematical abstraction and the development of numerical and formal models; and as ‘humanities of the digital’, by focusing on the study of computer-mediated interactions and online communities. Discussing their methods and actors, we show how these three potential acceptations cover markedly distinct epistemological endeavors and, eventually, non-overlapping scientific communities.",
        "article_title": "Digital, digitized, and numerical humanities",
        "authors": [
            {
                "given": "Camille",
                "family": "Roth"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T15:50:58.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/3/513/5168497",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy063",
            "id_scheme": "DOI"
        },
        "abstract": "Scattered throughout the International Tracing Service (ITS) digital archive, one of the largest and most heterogeneous collections of Holocaust-related material, are hundreds of thousands of reference cards to official death certificates recording a fraction of individuals who perished within concentration camps. These cards represent the most comprehensive collection of digital material pertaining to these death certificates issued by Sonderstandesamt Arolsen, a German civil registry office. However, the reference cards can only be found dispersed throughout the Central Name Index (CNI), ITS’s 46+ million-card finding aid that is indexed only by name. Consequently, aggregating the death certificate reference cards for research requires an intractable manual search. I adopt template matching and machine learning to automate the retrieval of these cards from the ITS digital archive. I demonstrate the efficacy of my method on a test set of 22,117 hand-classified cards, reporting 100% precision and 100% recall. Running this algorithm on 39,967,358 scans of cards from the CNI, I identify 312,183 death certificate reference cards in 13.75 days of elapsed real runtime on a personal computer with only a single, $600 Intel processor. Finally, I demonstrate that this approach can be generalized to many different card types within the CNI, showing great promise for application to other archives.",
        "article_title": "Machine learning, template matching, and the International Tracing Service digital archive: Automating the retrieval of death certificate reference cards from 40 million document scans",
        "authors": [
            {
                "given": "Benjamin Charles Germain",
                "family": "Lee"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T15:54:51.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/Supplement_1/i36/5187942",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy061",
            "id_scheme": "DOI"
        },
        "abstract": "In the late evening of 18 March 2014, students and activists stormed into and occupied the main chamber of Taiwan's Legislature. The event set off the Sunflower Movement, signifying a turning point in Taiwan's recent history. Researchers at Academia Sinica arranged to acquire all the supporting artifacts and documentary materials in the chamber before the protest came to a peaceful end. In this article, we discuss the issues in archiving and making available to the public a large collection of artifacts created by thousands of participants during a contemporary event. We demonstrate systems designed to encourage people to identify objects of their own in the archive. We show how an accessible catalog to the archive can help people tell their stories, hence collectively may strengthen the public's recollections about the movement.",
        "article_title": "Remembrance of contemporary events: On setting up the Sunflower Movement Archive",
        "authors": [
            {
                "given": "Tyng-Ruey",
                "family": "Chuang"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T16:15:55.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/4/752/5214346",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy050",
            "id_scheme": "DOI"
        },
        "abstract": "Statistical approaches have become the mainstream in machine translation (MT), for their potential in producing less rigid and more natural translations than rule-based approaches. However, on closer examination, the uses of function words between statistical machine-translated Chinese and the original Chinese are different, and such differences may be associated with translationese as discussed in translation studies. This article examines the distribution of Chinese function words in a comparable corpus consisting of MTs and the original Chinese texts extracted from Wikipedia. An attribute selection technique is used to investigate which types of function words are significant in discriminating between statistical machine-translated Chinese and the original texts. The results show that statistical MT overuses the most frequent function words, even when alternatives exist. To improve the quality of the end product, developers of MT should pay close attention to modelling Chinese conjunctions and adverbial function words. The results also suggest that machine-translated Chinese shares some characteristics with human-translated texts, including normalization and being influenced by the source language; however, machine-translated texts do not exhibit other characteristics of translationese such as explicitation.",
        "article_title": "Function words in statistical machine-translated Chinese and original Chinese: A study into the translationese of machine translation systems",
        "authors": [
            {
                "given": "Chen-li",
                "family": "Kuo"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T15:51:19.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/3/661/5224800",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy067",
            "id_scheme": "DOI"
        },
        "abstract": "We describe the first wide results of the linguistic profiling of the Common European Framework of Reference (CEFR)-levelled English Corpus (CLEC), a corpus built up for Natural Language Processing purposes. The CLEC is a proficiency-levelled English corpus that covers A1, A2, B1, B2, and C1 CEFR levels and that has been built up to train statistic models for automatic proficiency assessment. We describe not only the main aspects of the corpus development but also display the linguistic features and the statistic results for levels A2, B1, and B2 written examples, carried out automatically. We show how raw text, lexical, morphosyntactic, or syntactic statistic outcomes can help to identify levels of proficiency, to test teaching materials accurate proficiency classification, to provide computable support to new text proficiency validation, and to specify level boundaries. In fact, upper levels strengthen proficiency by showing higher outcomes of lexical and syntactic complexity. This analysis validates the use of automatic tools for proficiency level identification based on lexical and syntactic data, whereas morphosyntactic features strengthen competence-level distinctions. Finally, we suggest that these results are a first step onto the CEFR-levelled automatic assessment of new texts.",
        "article_title": "Automatic profiling of L2-simplified texts: Identifying discriminate features of linguistic proficiency",
        "authors": [
            {
                "given": "Maria Angeles",
                "family": "Zarco-Tejada"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T15:53:38.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/advance-article/doi/10.1093/llc/fqy071/5248221",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy071",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "A world of difference: Myths and misconceptions about the TEI",
        "authors": [
            {
                "given": "James",
                "family": "Cummings"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T15:12:48.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/Supplement_1/i123/5259046",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy078",
            "id_scheme": "DOI"
        },
        "abstract": "The question of why Pablo Picasso dedicated a considerable amount of his time to writing around 1935 is open to speculation. Many have cited, among possible causes: the Spanish artist’s emotional crisis, the political turmoil in Europe in the period between the two wars, and the menace of a confrontation in Spain. All of these views are predicated on an assumed irreducible conflict between visual composition and verbal expression. However, we cannot forget that Picasso’s interest in alternative methods of expression might have started with his fascination for linguistic structure as a whole during his cubist period. In this article, we explore the possibility that the transition into poetry that we observe in Picasso is simply one more manifestation of his pursuit of alternative approaches to language as a means of representation. In this sense, one thing that remained to be determined was how concrete concepts in both languages cluster into representative semantic categories and how these categories interact with each other in semantic networks.",
        "article_title": "Semantic domains in Picasso’s poetry",
        "authors": [
            {
                "given": "Luis",
                "family": "Meneses"
            },
            {
                "given": "Enrique",
                "family": "Mallen"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T16:00:59.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/4/730/5259047",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy072",
            "id_scheme": "DOI"
        },
        "abstract": "The article proposes, justifies, and tests a new methodological framework to measure museum ‘soft power’ by employing geo-visualization as a new method empowered by the rapid development of digital humanities. This research not only demystifies the buzz term of ‘soft power’ that is frequently applied in relation to contemporary museums and their international cultural engagements but also develops an evaluation framework to assess museum capacities to exert global impacts. Specifically, the article draws on the academic scholarship outlining a plethora of approaches for ‘soft power’ evaluation, including Resources, Outputs, Perceptions, and Networks evaluation models. It argues for a new integrative approach that can comprehensively combine different methods to construct a more advanced tool to measure museum ‘soft power’. The article draws on preliminary results of developing a digital mapping system to assess museum soft power. It shares findings from the pilot project, Australian Center of the Moving Image (ACMI) on the Global Map, designed in collaboration with the ACMI in Melbourne.",
        "article_title": "Mapping museum ‘Soft Power’: Adding geo-visualization to the methodological framework",
        "authors": [
            {
                "given": "Natalia",
                "family": "Grincheva"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T15:54:18.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/4/716/5258951",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy070",
            "id_scheme": "DOI"
        },
        "abstract": "Identifying the stylistic signatures characteristic of different genres is of central importance to literary theory and criticism. In this article we report a large-scale computational analysis of Latin prose and verse using a combination of quantitative stylistics and supervised machine learning. We train a set of classifiers to differentiate prose and poetry with high accuracy (&gt;97%) based on a set of twenty-six text-based, primarily syntactic features and rank the relative importance of these features to identify a low-dimensional set still sufficient to achieve excellent classifier performance. This analysis demonstrates that Latin prose and verse can be classified effectively using just three top features. From examination of the highly ranked features, we observe that measures of the hypotactic style favored in Latin prose (i.e. subordinating constructions in complex sentences, such as relative clauses) are especially useful for classification.",
        "article_title": "A small set of stylometric features differentiates Latin prose and verse",
        "authors": [
            {
                "given": "Pramit",
                "family": "Chaudhuri"
            },
            {
                "given": "Tathagata",
                "family": "Dasgupta"
            },
            {
                "given": "Joseph P",
                "family": "Dexter"
            },
            {
                "given": "Krithika",
                "family": "Iyer"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T16:12:57.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/4/707/5258907",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy073",
            "id_scheme": "DOI"
        },
        "abstract": "While the challenge of historical reconstruction of past musical performances is not a fully solved problem, not all the elements are equally unknown, or of equal magnitude. Despite some uncertainty about the interpretation of individual performers on specific dates, scholarship can still inform other factors of greater perceptual importance, leading to a good approximation of historical performances. In addition to performance style and period instruments, computer simulations make it possible to also account for the acoustics of the period performance space. In addition, the most accurate reconstruction should simulate the room’s acoustics in real time for the performers, thus retaining the feedback mechanisms of room response on performance practice.",
        "article_title": "Computational acoustic musicology",
        "authors": [
            {
                "given": "Braxton B",
                "family": "Boren"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T15:54:30.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/Supplement_1/i129/5270841",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy079",
            "id_scheme": "DOI"
        },
        "abstract": "A large portion of the research carried out in the digital humanities has an online digital object (usually referred as a project) as one of its components. In turn, these online digital objects can be catalogued as distributed resources, which implies that the administrative control of information related to a topic may be spread across online resources and/or collections maintained by multiple scholars in different institutions. This administrative decentralization can lead to changes in content that are often unexpected by a researcher, which can be caused by different factors or circumstances. This reasoning led us to formulate the following question: When can online digital humanities projects be considered abandoned? In this article, we carry out a study on the persistence and average life span of online projects in the digital humanities. More specifically, we will elaborate on their reliance on distributed resources and methods for measuring their shelf life: the average length of time that a digital project can endure without updates until it can ultimately be considered abandoned by its researcher.",
        "article_title": "Shelf life: Identifying the abandonment of online digital humanities projects",
        "authors": [
            {
                "given": "Luis",
                "family": "Meneses"
            },
            {
                "given": "Richard",
                "family": "Furuta"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T16:00:31.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/2/233/5094949",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy043",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Towards a new approach in the study of Ancient Greek music: Virtual reconstruction of an ancient musical instrument from Greek Sicily",
        "authors": [
            {
                "given": "Angela",
                "family": "Bellia"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T07:11:15.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/2/290/5113152",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy049",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Exploring the linguistic landscape of geotagged social media content in urban environments",
        "authors": [
            {
                "given": "Tuomo",
                "family": "Hiippala"
            },
            {
                "given": "Anna",
                "family": "Hausmann"
            },
            {
                "given": "Henrikki",
                "family": "Tenkanen"
            },
            {
                "given": "Tuuli",
                "family": "Toivonen"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T14:59:37.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/2/310/5127749",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy044",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Text-world annotation and visualization for crime narrative reconstruction",
        "authors": [
            {
                "given": "Yu-Fang",
                "family": "Ho"
            },
            {
                "given": "Jane",
                "family": "Lugea"
            },
            {
                "given": "Dan",
                "family": "McIntyre"
            },
            {
                "given": "Zhijie",
                "family": "Xu"
            },
            {
                "given": "Jing",
                "family": "Wang"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T15:21:30.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/2/368/5127711",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy048",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Toward a model for digital tool criticism: Reflection as integrative practice",
        "authors": [
            {
                "given": "Marijn",
                "family": "Koolen"
            },
            {
                "given": "Jasmijn",
                "family": "van Gorp"
            },
            {
                "given": "Jacco",
                "family": "van Ossenbruggen"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T14:59:56.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/3/582/5140082",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy055",
            "id_scheme": "DOI"
        },
        "abstract": "During World War I (WWI), between 1916 and 1917, Robert Musil was the chief editor of the Tiroler Soldaten-Zeitung in Bozen. This activity probably also involved authorship of articles and has posed a philological problem to scholars, who have not been able to attribute with certainty a range of relatively short texts to Musil. With this article, we present a new approach that combines philological research with stylometric methods. Exploration of WWI archives and digitization of historical documents were paired with application of authorship attribution techniques, following extensive evaluation. To build the training set, we adapted the ‘impostors method’ by grouping three ‘distractor authors’ (similar to Musil in terms of style) and three actual candidates for authorship. In the test set, we developed two designs for tackling the issue of text length: a combinatory design, where longer chunks were composed by the juxtaposition of short texts; a simplified design, where the texts for attribution were merged with already attributed texts. Results of our experiment suggest that Musil attribution may be disproved with a high level of confidence for ten texts that were more probably written by a less well-known author, Albert Ritter. We carried out a keyness analysis on the specific words preferred or avoided by the two authors, which not only corroborated the results of the quantitative analysis but also findings from Musil philology. Our study showcases the potentialities of using mixed methods in stylometry.",
        "article_title": "Robert Musil, a war journal, and stylometry: Tackling the issue of short texts in authorship attribution",
        "authors": [
            {
                "given": "Simone",
                "family": "Rebora"
            },
            {
                "given": "J Berenike",
                "family": "Herrmann"
            },
            {
                "given": "Gerhard",
                "family": "Lauer"
            },
            {
                "given": "Massimo",
                "family": "Salgaro"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T14:59:54.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/3/542/5145026",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy054",
            "id_scheme": "DOI"
        },
        "abstract": "To understand an author’s developmental trajectory, the static traits and properties of author reconstruction and profiling are not sufficient. Instead, it is necessary to focus on high-level indicators of the complex set of variables that underlie the author’s transient mental states during his or her creative production. We propose a method that combines information theory with random fractal theory to study the mental dynamics of an author as indicated by text complexity. To illustrate its application, we analyze the developmental trajectory of the culturally influential and ‘graphomanic’ 19th-century Danish pastor N. F. S. Grundtvig. This approach can detect an age-related trend (entropic decay), a significant Kehre (turning point), and multiple event-related change points in his production. We argue that the approach is applicable beyond the specific case and can be extended to comparative analysis within and between authors, and, finally, to dynamic analysis of cultural information systems.",
        "article_title": "A curious case of entropic decay: Persistent complexity in textual cultural heritage",
        "authors": [
            {
                "given": "Kristoffer L",
                "family": "Nielbo"
            },
            {
                "given": "Katrine F",
                "family": "Baunvig"
            },
            {
                "given": "Bin",
                "family": "Liu"
            },
            {
                "given": "Jianbo",
                "family": "Gao"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T16:01:17.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/3/493/5145759",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy042",
            "id_scheme": "DOI"
        },
        "abstract": "There is a long-standing debate about the authorship of the Bixby Letter, one of the most famous pieces of correspondence in American history. Despite being signed by President Abraham Lincoln, some historians have claimed that its true author was John Hay, Lincoln’s personal secretary. Analyses of the letter have been inconclusive in part because the text totals only 139 words and is thus far too short to be attributed using standard methods. To test whether Lincoln or Hay wrote this letter, we therefore introduce and apply a new technique for attributing short texts called ‘n-gram tracing’. After demonstrating that our method can distinguish between the known writings of Lincoln and Hay with a very high degree of accuracy, we use it to attribute the Bixby Letter. We conclude that the text was authored by John Hay—rewriting this one episode in the history of the USA, while offering a solution to one of the most persistent problems in authorship attribution.",
        "article_title": "Attributing the Bixby Letter using n-gram tracing",
        "authors": [
            {
                "given": "Jack",
                "family": "Grieve"
            },
            {
                "given": "Isobelle",
                "family": "Clarke"
            },
            {
                "given": "Emily",
                "family": "Chiang"
            },
            {
                "given": "Hannah",
                "family": "Gideon"
            },
            {
                "given": "Annina",
                "family": "Heini"
            },
            {
                "given": "Andrea",
                "family": "Nini"
            },
            {
                "given": "Emily",
                "family": "Waibel"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T02:06:13.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/Supplement_1/i80/5146726",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy051",
            "id_scheme": "DOI"
        },
        "abstract": "Although recent research acknowledges the potential of visualization methods in digital humanities (DH), the predominant terminology used to describe visualizations (prototypes and tools) focuses on their use as a means to an end and, more importantly, as an instrument in the service of humanities research. We introduce the sandcastle as a metaphorical lens and provocative term to highlight visualization as a research process in its own right. We argue that building visualization sandcastles provides a holistic approach to cross-disciplinary knowledge generation that embraces visualization as (1) an aesthetic provocation to elicit critical insights, interpretation, speculation, and discussions within and beyond scholarly audiences, (2) a dynamic process wherein speculation and re-interpretation advance knowledge within all disciplines involved, and (3) a mediator of ideas and theories within and across disciplines. Our argument is grounded in critical theory, DH, design, human–computer interaction, and visualization, and based on our own research on an exceptional literary collection. We argue that considering visualizations as sandcastles foregrounds valuable insights into the roles of visualization as a mindset, methodology, and praxis within humanities research and beyond.",
        "article_title": "In defense of sandcastles: Research thinking through visualization in digital humanities",
        "authors": [
            {
                "given": "Uta",
                "family": "Hinrichs"
            },
            {
                "given": "Stefania",
                "family": "Forlini"
            },
            {
                "given": "Bridget",
                "family": "Moynihan"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T16:18:38.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/1/174/5060702",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy027",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Paul Robeson’s place in YouTube: A social spatial network analysis of digital heritage",
        "authors": [
            {
                "given": "Mark Alan",
                "family": "Rhodes II"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T14:59:38.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/34/2/386/5067348",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy032",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Information infrastructure of contemporary humanities and the digital humanities development as a cause of creating new information barriers. A Polish case",
        "authors": [
            {
                "given": "Zbigniew",
                "family": "Osiński"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T04:09:37.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/33/3/621/4824843",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqx065",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "An authorship analysis of the Jack the Ripper letters",
        "authors": [
            {
                "given": "Andrea",
                "family": "Nini"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T15:29:51.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/33/4/894/4994800",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqy014",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "A novel approach towards deriving vocabulary quotient",
        "authors": [
            {
                "given": "Nikhil Kumar",
                "family": "Rajput"
            },
            {
                "given": "Bhavya",
                "family": "Ahuja"
            },
            {
                "given": "Manoj Kumar",
                "family": "Riyal"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T02:32:45.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/33/2/456/3789810",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqx020",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Enabling complex analysis of large-scale digital collections: humanities research, high-performance computing, and transforming access to British Library digital collections",
        "authors": [
            {
                "given": "Melissa",
                "family": "Terras"
            },
            {
                "given": "James",
                "family": "Baker"
            },
            {
                "given": "James",
                "family": "Hetherington"
            },
            {
                "given": "David",
                "family": "Beavan"
            },
            {
                "given": "Martin",
                "family": "Zaltz Austwick"
            },
            {
                "given": "Anne",
                "family": "Welsh"
            },
            {
                "given": "Helen",
                "family": "O'Neill"
            },
            {
                "given": "Will",
                "family": "Finley"
            },
            {
                "given": "Oliver",
                "family": "Duke-Williams"
            },
            {
                "given": "Adam",
                "family": "Farquhar"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T21:06:34.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "http://academic.oup.com/dsh/article/32/suppl_2/ii4/3865676",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqx023",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Understanding and explaining Delta measures for authorship attribution",
        "authors": [
            {
                "given": "Stefan",
                "family": "Evert"
            },
            {
                "given": "Thomas",
                "family": "Proisl"
            },
            {
                "given": "Fotis",
                "family": "Jannidis"
            },
            {
                "given": "Isabella",
                "family": "Reger"
            },
            {
                "given": "Steffen",
                "family": "Pielström"
            },
            {
                "given": "Christof",
                "family": "Schöch"
            },
            {
                "given": "Thorsten",
                "family": "Vitt"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T12:02:50.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/33/2/279/3870409",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqx029",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Measuring syntactical variation in Germanic texts",
        "authors": [
            {
                "given": "Wilbert",
                "family": "Heeringa"
            },
            {
                "given": "Femke",
                "family": "Swarte"
            },
            {
                "given": "Anja",
                "family": "Schüppert"
            },
            {
                "given": "Charlotte",
                "family": "Gooskens"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T07:24:30.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "http://academic.oup.com/dsh/article/32/suppl_2/ii158/3897539/Analysing-and-understanding-news-consumption",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqx030",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Analysing and understanding news consumption patterns by tracking online user behaviour with a multimodal research design",
        "authors": [
            {
                "given": "Martijn",
                "family": "Kleppe"
            },
            {
                "given": "Marco",
                "family": "Otte"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T14:54:03.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/33/1/143/2993886",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqx007",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Analysis of the style and the rhetoric of the 2016 US presidential primaries",
        "authors": [
            {
                "given": "Jacques",
                "family": "Savoy"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T00:05:39.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/33/1/96/2996316",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqx004",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "The semantic poles of Old English: Toward the 3D representation of complex polysemy",
        "authors": [
            {
                "given": "Javier",
                "family": "Martín Arista"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T16:52:30.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/33/1/203/3077008",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqx003",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "‘Proper’ pro-nun-ʃha-ʃhun1 in Eighteenth-Century English: ECEP as a New Tool for the Study of Historical Phonology and Dialectology",
        "authors": [
            {
                "given": "Nuria",
                "family": "Yáñez-Bouza"
            },
            {
                "given": "Joan C",
                "family": "Beal"
            },
            {
                "given": "Ranjan",
                "family": "Sen"
            },
            {
                "given": "Christine",
                "family": "Wallis"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T01:45:03.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article/33/1/72/3077165",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqx011",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Detecting pseudepigraphic texts using novel similarity measures",
        "authors": [
            {
                "given": "Moshe",
                "family": "Koppel"
            },
            {
                "given": "Shachar",
                "family": "Seidman"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T17:41:35.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqx006",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqx006",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Code, scholarship, and criticism: When is code scholarship and when is it not?",
        "authors": [
            {
                "given": "Joris J.",
                "family": "van Zundert"
            },
            {
                "given": "Ronald",
                "family": "Haentjens Dekker"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T06:25:22.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqw043",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqw043",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "The reader-oriented scholarly edition",
        "authors": [
            {
                "given": "Paul",
                "family": "Eggert"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T04:25:10.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqw003",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqw003",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "The Grub Street Project: A digital social edition of London in the long 18th century",
        "authors": [
            {
                "given": "Allison",
                "family": "Muri"
            },
            {
                "given": "Catherine",
                "family": "Nygren"
            },
            {
                "given": "Benjamin",
                "family": "Neudorf"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T11:25:20.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqv046",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqv046",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Trading Consequences: A Case Study of Combining Text Mining and Visualization to Facilitate Document Exploration",
        "authors": [
            {
                "given": "Uta",
                "family": "Hinrichs"
            },
            {
                "given": "Beatrice",
                "family": "Alex"
            },
            {
                "given": "Jim",
                "family": "Clifford"
            },
            {
                "given": "Andrew",
                "family": "Watson"
            },
            {
                "given": "Aaron",
                "family": "Quigley"
            },
            {
                "given": "Ewan",
                "family": "Klein"
            },
            {
                "given": "Colin M.",
                "family": "Coates"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T23:41:08.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqv061",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqv061",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Visualization in stylometry: Cluster analysis using networks",
        "authors": [
            {
                "given": "Maciej",
                "family": "Eder"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T12:02:53.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqv052",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqv052",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Exploratory Thematic Analysis for Digitized Archival Collections",
        "authors": [
            {
                "given": "L. F.",
                "family": "Klein"
            },
            {
                "given": "J.",
                "family": "Eisenstein"
            },
            {
                "given": "I.",
                "family": "Sun"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T18:46:15.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqv010",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqv010",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Rolling stylometry",
        "authors": [
            {
                "given": "Maciej",
                "family": "Eder"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T12:02:52.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqv013",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqv013",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "An Integrated Approach to the Procedural Modeling of Ancient Cities and Buildings",
        "authors": [
            {
                "given": "M.",
                "family": "Saldana"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T23:46:37.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqu031",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqu031",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Mapping Homer's Catalogue of Ships",
        "authors": [
            {
                "given": "C.",
                "family": "Evans"
            },
            {
                "given": "B.",
                "family": "Jasnow"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T03:57:26.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqu028",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqu028",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Web-based discovery and integration of archaeological historic properties inventory data: The Digital Index of North American Archaeology (DINAA)",
        "authors": [
            {
                "given": "J. J.",
                "family": "Wells"
            },
            {
                "given": "E. C.",
                "family": "Kansa"
            },
            {
                "given": "S. W.",
                "family": "Kansa"
            },
            {
                "given": "S. J.",
                "family": "Yerka"
            },
            {
                "given": "D. G.",
                "family": "Anderson"
            },
            {
                "given": "T. G.",
                "family": "Bissett"
            },
            {
                "given": "K. N.",
                "family": "Myers"
            },
            {
                "given": "R.",
                "family": "Carl DeMuth"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T04:32:50.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqu026",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqu026",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "What Ever Happened to Project Bamboo?",
        "authors": [
            {
                "given": "Q.",
                "family": "Dombrowski"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T00:35:53.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqt067",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqt067",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Exploring entity recognition and disambiguation for cultural heritage collections",
        "authors": [
            {
                "given": "S.",
                "family": "van Hooland"
            },
            {
                "given": "M.",
                "family": "De Wilde"
            },
            {
                "given": "R.",
                "family": "Verborgh"
            },
            {
                "given": "T.",
                "family": "Steiner"
            },
            {
                "given": "R.",
                "family": "Van de Walle"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T20:34:10.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "http://academic.oup.com/dsh/article/30/2/167/390738/Does-size-matter-Authorship-attribution-small",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqt066",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Does size matter? Authorship attribution, small samples, big problem",
        "authors": [
            {
                "given": "Maciej",
                "family": "Eder"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T02:21:13.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqt059",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqt059",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "The MayaArch3D project: A 3D WebGIS for analyzing ancient architecture and landscapes",
        "authors": [
            {
                "given": "J.",
                "family": "von Schwerin"
            },
            {
                "given": "H.",
                "family": "Richards-Rissetto"
            },
            {
                "given": "F.",
                "family": "Remondino"
            },
            {
                "given": "G.",
                "family": "Agugiaro"
            },
            {
                "given": "G.",
                "family": "Girardi"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T00:16:18.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqt040",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqt040",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Distant Listening to Gertrude Stein's 'Melanctha': Using Similarity Analysis in a Discovery Paradigm to Analyze Prosody and Author Influence",
        "authors": [
            {
                "given": "T.",
                "family": "Clement"
            },
            {
                "given": "D.",
                "family": "Tcheng"
            },
            {
                "given": "L.",
                "family": "Auvil"
            },
            {
                "given": "B.",
                "family": "Capitanu"
            },
            {
                "given": "J.",
                "family": "Barbosa"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T18:46:12.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqt031",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqt031",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "On the features of translationese",
        "authors": [
            {
                "given": "V.",
                "family": "Volansky"
            },
            {
                "given": "N.",
                "family": "Ordan"
            },
            {
                "given": "S.",
                "family": "Wintner"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T12:44:21.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "http://academic.oup.com/dsh/article/30/1/86/352888/Factoidbased-prosopography-and-computer-ontologies",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqt037",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Factoid-based prosopography and computer ontologies: towards an integrated approach",
        "authors": [
            {
                "given": "Michele",
                "family": "Pasin"
            },
            {
                "given": "John",
                "family": "Bradley"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T20:27:34.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqt017",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqt017",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Using the Google N-Gram corpus to measure cultural complexity",
        "authors": [
            {
                "given": "P.",
                "family": "Juola"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T13:03:20.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqs059",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqs059",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Detecting structures in linguistic maps--Fuzzy clustering for pattern recognition in geostatistical dialectometry",
        "authors": [
            {
                "given": "S.",
                "family": "Proll"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T21:28:27.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqs053",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqs053",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Variation of verbal constructions in Estonian dialects",
        "authors": [
            {
                "given": "K.",
                "family": "Uiboaed"
            },
            {
                "given": "C.",
                "family": "Hasselblatt"
            },
            {
                "given": "L.",
                "family": "Lindstrom"
            },
            {
                "given": "K.",
                "family": "Muischnek"
            },
            {
                "given": "J.",
                "family": "Nerbonne"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T21:28:47.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqs070",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqs070",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Psychological profiling through textual analysis",
        "authors": [
            {
                "given": "J.",
                "family": "Noecker"
            },
            {
                "given": "M.",
                "family": "Ryan"
            },
            {
                "given": "P.",
                "family": "Juola"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T23:00:10.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqs049",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqs049",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "'DiaTech': A new tool for dialectology",
        "authors": [
            {
                "given": "G.",
                "family": "Aurrekoetxea"
            },
            {
                "given": "K.",
                "family": "Fernandez-Aguirre"
            },
            {
                "given": "J.",
                "family": "Rubio"
            },
            {
                "given": "B.",
                "family": "Ruiz"
            },
            {
                "given": "J.",
                "family": "Sanchez"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T21:01:57.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqs054",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqs054",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Mass digitization and the garbage dump: The conflicting needs of quantitative and qualitative methods",
        "authors": [
            {
                "given": "P.",
                "family": "Gooding"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T13:04:05.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqs063",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqs063",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Discovering land transaction relations from land deeds of Taiwan",
        "authors": [
            {
                "given": "S.-P.",
                "family": "Chen"
            },
            {
                "given": "Y.-M.",
                "family": "Huang"
            },
            {
                "given": "J.",
                "family": "Hsiang"
            },
            {
                "given": "H.-C.",
                "family": "Tu"
            },
            {
                "given": "H.-I.",
                "family": "Ho"
            },
            {
                "given": "P.-Y.",
                "family": "Chen"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T22:39:18.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqs003",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqs003",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Detecting authorship deception: a supervised machine learning approach using author writeprints",
        "authors": [
            {
                "given": "L.",
                "family": "Pearl"
            },
            {
                "given": "M.",
                "family": "Steyvers"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T21:57:51.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqs007",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqs007",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Names in novels: An experiment in computational stylistics",
        "authors": [
            {
                "given": "K.",
                "family": "van Dalen-Oskam"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T05:38:52.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqr049",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqr049",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Retrieving relatives from historical data",
        "authors": [
            {
                "given": "M.",
                "family": "Hundt"
            },
            {
                "given": "D.",
                "family": "Denison"
            },
            {
                "given": "G.",
                "family": "Schneider"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T01:44:46.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqr034",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqr034",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Comparing methods for the syntactic simplification of sentences in information extraction",
        "authors": [
            {
                "given": "R. J.",
                "family": "Evans"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T20:36:49.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqr028",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqr028",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "A tale of two cities: implications of the similarities and differences in collaborative approaches within the digital libraries and digital humanities communities",
        "authors": [
            {
                "given": "L.",
                "family": "Siemens"
            },
            {
                "given": "R.",
                "family": "Cunningham"
            },
            {
                "given": "W.",
                "family": "Duff"
            },
            {
                "given": "C.",
                "family": "Warwick"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T00:35:58.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqr022",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqr022",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Visual GISting: bringing together corpus linguistics and Geographical Information Systems",
        "authors": [
            {
                "given": "I. N.",
                "family": "Gregory"
            },
            {
                "given": "A.",
                "family": "Hardie"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T01:28:08.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqr020",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqr020",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Social network visualization from TEI data",
        "authors": [
            {
                "given": "M.",
                "family": "Bingenheimer"
            },
            {
                "given": "J.-J.",
                "family": "Hung"
            },
            {
                "given": "S.",
                "family": "Wiles"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T00:18:02.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqq018",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqq018",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "The Corpus of Contemporary American English as the first reliable monitor corpus of English",
        "authors": [
            {
                "given": "M.",
                "family": "Davies"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T09:14:02.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqq021",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqq021",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "How a prototype argues",
        "authors": [
            {
                "given": "A.",
                "family": "Galey"
            },
            {
                "given": "S.",
                "family": "Ruecker"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T22:33:10.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqq022",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqq022",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Library collaboration with large digital humanities projects",
        "authors": [
            {
                "given": "W. A.",
                "family": "Kretzschmar"
            },
            {
                "given": "W.",
                "family": "Gray Potter"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T01:05:29.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqq013",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqq013",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "The effect of author set size and data size in authorship attribution",
        "authors": [
            {
                "given": "K.",
                "family": "Luyckx"
            },
            {
                "given": "W.",
                "family": "Daelemans"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T02:21:28.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqq001",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqq001",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "A comparative study of machine learning methods for authorship attribution",
        "authors": [
            {
                "given": "M. L.",
                "family": "Jockers"
            },
            {
                "given": "D. M.",
                "family": "Witten"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T11:37:47.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqn040",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqn040",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Reassessing authorship of the Book of Mormon using delta and nearest shrunken centroid classification",
        "authors": [
            {
                "given": "M. L.",
                "family": "Jockers"
            },
            {
                "given": "D. M.",
                "family": "Witten"
            },
            {
                "given": "C. S.",
                "family": "Criddle"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T02:19:43.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqn012",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqn012",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Assessing frequency changes in multistage diachronic corpora: Applications for historical corpus linguistics and the study of language acquisition",
        "authors": [
            {
                "given": "M.",
                "family": "Hilpert"
            },
            {
                "given": "S. Th.",
                "family": "Gries"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T19:52:13.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqn015",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqn015",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "An evaluation of text classification methods for literary study",
        "authors": [
            {
                "given": "B.",
                "family": "Yu"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T21:46:52.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqm029",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqm029",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Stylochronometry: Stylistic Development, Sequence of Composition, and Relative Dating",
        "authors": [
            {
                "given": "C.",
                "family": "Stamou"
            }
        ],
        "publisher": "",
        "date": "2020-08-21T15:57:00.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqm020",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqm020",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Quantitative Authorship Attribution: An Evaluation of Techniques",
        "authors": [
            {
                "given": "J.",
                "family": "Grieve"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T08:02:02.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fql042",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fql042",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Recent Advances in Salzburg Dialectometry",
        "authors": [
            {
                "given": "H.",
                "family": "Goebl"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T02:44:51.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fql043",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fql043",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Measuring Syntactic Variation in Dutch Dialects",
        "authors": [
            {
                "given": "M. R.",
                "family": "Spruit"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T21:28:23.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fql041",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fql041",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Identifying Linguistic Structure in Aggregate Comparison",
        "authors": [
            {
                "given": "J.",
                "family": "Nerbonne"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T21:28:27.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fql040",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fql040",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "To What Extent are Surnames Words? Comparing Geographic Patterns of Surname and Dialect Variation in the Netherlands",
        "authors": [
            {
                "given": "F.",
                "family": "Manni"
            },
            {
                "given": "W.",
                "family": "Heeringa"
            },
            {
                "given": "J.",
                "family": "Nerbonne"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T05:39:18.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/fqi039",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/fqi039",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "A New Approach to the Study of Translationese: Machine-learning the Difference between Original and Translated Text",
        "authors": [
            {
                "given": "M.",
                "family": "Baroni"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T12:44:15.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/19.4.509",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/19.4.509",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Corpus Linguistics and South Asian Languages: Corpus Creation and Tool Development",
        "authors": [
            {
                "given": "P.",
                "family": "Baker"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T16:21:45.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/19.3.289",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/19.3.289",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Modelling Features of Characters: Some Digital Ways to Look at Names in Literary Texts",
        "authors": [
            {
                "given": "K.",
                "family": "van-Oskam"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T05:38:52.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/18.4.361",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/18.4.361",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Aspect Marking in English and Chinese: Using the Lancaster Corpus of Mandarin Chinese for Contrastive Language Study",
        "authors": [
            {
                "given": "A.",
                "family": "McEnery"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T12:28:51.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/18.3.287",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/18.3.287",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Validating the Logistic Model of Article Usage Preceding Multi-word Organization Names with the Aid of Computer Corpora",
        "authors": [
            {
                "given": "G. Y. W.",
                "family": "Tse"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T05:38:51.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/17.4.401",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/17.4.401",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Automatically Categorizing Written Texts by Author Gender",
        "authors": [
            {
                "given": "M.",
                "family": "Koppel"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T02:06:48.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/17.3.267",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/17.3.267",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "'Delta': a Measure of Stylistic Difference and a Guide to Likely Authorship",
        "authors": [
            {
                "given": "J.",
                "family": "Burrows"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T02:23:44.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/17.1.37",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/17.1.37",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Pause Patterns in Shakespeare's Verse: Canon and Chronology",
        "authors": [
            {
                "given": "MacD. P.",
                "family": "Jackson"
            }
        ],
        "publisher": "",
        "date": "2020-08-01T17:40:15.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/16.4.403",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/16.4.403",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "A Widow and her Soldier: Stylometry and the American Civil War",
        "authors": [
            {
                "given": "D. I.",
                "family": "Holmes"
            },
            {
                "given": "L. J.",
                "family": "Gordon"
            },
            {
                "given": "C.",
                "family": "Wilson"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T02:22:02.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/16.1.77",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/16.1.77",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Shouting and screaming: manner and noise verbs in communication",
        "authors": [
            {
                "given": "M",
                "family": "Urban"
            }
        ],
        "publisher": "",
        "date": "2020-07-31T17:47:48.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    },
    {
        "url": "https://academic.oup.com/dsh/article-lookup/doi/10.1093/llc/15.2.157",
        "identifier": {
            "string_id": "https://doi.org/10.1093/llc/15.2.157",
            "id_scheme": "DOI"
        },
        "abstract": null,
        "article_title": "Edward III",
        "authors": [
            {
                "given": "T",
                "family": "Merriam"
            }
        ],
        "publisher": "",
        "date": "2020-08-22T04:02:17.000Z",
        "keywords": [],
        "journal_title": "",
        "volume": "",
        "issue": "",
        "ISSN": []
    }
]