[
    {
        "url": "http://dx.doi.org/10.5399/uo/hsda.3.1.1626",
        "identifier": {
            "string_id": "10.5399/uo/hsda.3.1.1626",
            "id_scheme": "DOI"
        },
        "abstract": "<div>The aim of this paper is to present the activities and research methodologies of CTL (Centro di Elaborazione Informatica di Testi e Immagini nella Tradizione Letteraria), a laboratory of the Scuola Normale Superiore of Pisa, founded and directed by Lina Bolzoni. CTL’s objective is to investigate the complex structure of relationships between the linguistic and the figurative code in literary tradition, paying particular attention to the XVth, XVIth and XVIIth centuries and using information technologies both as an auxiliary research tool and as a medium for scientific dissemination. Here I shall be discussing the Centre’s digitalization projects, and in particular the project concerned with the Orlando Furioso and its remediation into images. This project, active since 2007, is, I believe, particularly representative of the progressive implementation within CTL of both traditional and computer-related methodologies in the planning of digital collections dedicated to words and images.</div>",
        "article_title": "The digital collections of words and images of the CTL - Scuola Normale Superiore: the case of Orlando Furioso",
        "authors": [
            {
                "given": "Serena",
                "family": "Pezzini",
                "sequence": "first",
                "affiliation": []
            }
        ],
        "publisher": "Oregon State University",
        "date": "2013-08-12T17:04:59Z",
        "keywords": [],
        "journal_title": "Humanist Studies & the Digital Age",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "2158-3846",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.5399/uo/hsda.3.1.3086",
        "identifier": {
            "string_id": "10.5399/uo/hsda.3.1.3086",
            "id_scheme": "DOI"
        },
        "abstract": "<div>Working from transcriptions generated through the T-PEN program at St. Louis University, the collaborators of the project \"Petrarch’s Early Manuscripts and Incunabula in the Oregon Petrarch Open Book\" are presently digitizing and encoding in TEI P5 2 key interpretative copies of Petrarch’s Rvf: the late 14th-century manuscript copy from the Queriniana Library in Brescia, D II 21, the Queriniana Library’s copy of the first printed edition (editio princeps) of the Rvf edited by Cristoforo [Berardi?] and published by Vindelin de Speier (Spira) in Venice in 1470. The first part of the article traces a brief history of the Oregon Petrarch Open Book (OPOB), the last section introduces a future project, “Texts, Images and Interpretation in the OPOB”.</div>",
        "article_title": "Petrarch’s Early Manuscripts and Incunabula in the Oregon Petrarch Open Book",
        "authors": [
            {
                "given": "Massimo",
                "family": "Lollini",
                "sequence": "first",
                "affiliation": []
            }
        ],
        "publisher": "Oregon State University",
        "date": "2013-08-12T17:04:59Z",
        "keywords": [],
        "journal_title": "Humanist Studies & the Digital Age",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "2158-3846",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.5399/uo/hsda.3.1.1836",
        "identifier": {
            "string_id": "10.5399/uo/hsda.3.1.1836",
            "id_scheme": "DOI"
        },
        "abstract": "<div>Griseldaonline è un portale online di letteratura afferente al Dipartimento di Filologia Classica e Italianistica dell'Università di Bologna. L'articolo presenta il portale nella sua genesi e nelle sue possibili evoluzioni.<br>\n<br>\nThis article presents the Italian literary magazine Griseldaonline that was created in 2002 by a group of young scholars from the University of Bologna. The magazine has encouraged the production of new forms of critical literary writing conceived specifically for the web.</div>",
        "article_title": "\"Griseldaonline\". Una sfida al labirinto letterario",
        "authors": [
            {
                "given": "Nicola",
                "family": "Bonazzi",
                "sequence": "first",
                "affiliation": []
            },
            {
                "given": "Andrea",
                "family": "Campana",
                "sequence": "additional",
                "affiliation": []
            }
        ],
        "publisher": "Oregon State University",
        "date": "2013-08-12T17:04:59Z",
        "keywords": [],
        "journal_title": "Humanist Studies & the Digital Age",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "2158-3846",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.5399/uo/hsda.4.1.3682",
        "identifier": {
            "string_id": "10.5399/uo/hsda.4.1.3682",
            "id_scheme": "DOI"
        },
        "abstract": "<div>As part of the seminar Re-reading Petrarch in the Digital Age –taught at the University of Oregon in Winter 2014– a digital close reading of Francesco Petrarca’s Rerum Vulgarium Fragmenta (Rvf) led to a series of parallel and entwined activities and projects. Deeply integrated with the Oregon Petrarch Open Book Project (OPOB), the course was oriented towards the encoding of Petrarca’s masterpiece based on the implementation of a network of different themes (Poet, Laura, Metaphysics Nature Metamorphoses and Urban Culture). The various occurrences and data obtained from the encoding were collected into an online database that is still operating and updatable. The results of this qualitative data collection were also compared with a quantitative computer-based research of selected keywords extracted from the various themes. From the beginning of the seminar, the class was divided into groups and each of them read the Rvf focusing on one of themes chosen while at the same time paying attention to the others. The different groups considered these themes as interrelated and interdependent. The poet is the sphere in which all the topics emerge in their specific connotations. However, his sphere is related to, dependent on and intersected with the other four spheres. The encoding allowed measuring the different manifestations, levels and meanings of the intersecting relationships. The study of the visual interpretation of the Rvf in the Inc. Queriniano G V 15 paralleled the close reading and encoding activity and helped students to develop a visual rendering of their themes and a pointed and original and creative interpretation of Petrarca’s masterpiece.</div>",
        "article_title": "Re-Reading Petrarca in the Digital Era",
        "authors": [
            {
                "given": "Massimo",
                "family": "Lollini",
                "sequence": "first",
                "affiliation": []
            },
            {
                "given": "Pierpaolo",
                "family": "Spagnolo",
                "sequence": "additional",
                "affiliation": []
            }
        ],
        "publisher": "Oregon State University",
        "date": "2015-09-23T18:02:54Z",
        "keywords": [],
        "journal_title": "Humanist Studies & the Digital Age",
        "volume": "4",
        "issue": "1",
        "ISSN": [
            {
                "value": "2158-3846",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.5399/uo/hsda.4.1.3584",
        "identifier": {
            "string_id": "10.5399/uo/hsda.4.1.3584",
            "id_scheme": "DOI"
        },
        "abstract": "<div>This essay introduces the notion of a digital concordance as a reading and research tool to explore intertextual passages online, and illustrates how a digital concordance of highly allusive texts can change how we read and research such texts. I take as example the digital concordance on Intertextual Dante, a project on Digital Dante (digitaldante.columbia.edu) developed in collaboration with the Center for Digital Research and Scholarship at Columbia University, which in the first phase highlights the Ovidian intertextuality in Dante’s Divina Commedia. The essay traces the history of the scholarship on Dante’s Ovid, identifying its strengths and limitations, especially of the concordances in print. Since the intertextual passages in the Commedia require a reading not restricted to the obviously corresponding verses, but attentive to the broader textual contexts, I show how the digital concordance on Intertextual Dante greatly facilitates such a contextualized reading. The visualization of the corresponding passages (side by side, highlighted, within context) and the search options (by category of text reuse or by canto/book/poem) help the study of (Ovidian) intertextuality in the Commedia, as illustrated with examples from the site.</div>",
        "article_title": "Digital Readers of Allusive Texts: Ovidian Intertextuality in the 'Commedia' and the Digital Concordance on 'Intertextual Dante'",
        "authors": [
            {
                "given": "Julie",
                "family": "Van Peteghem",
                "sequence": "first",
                "affiliation": []
            }
        ],
        "publisher": "Oregon State University",
        "date": "2015-09-23T22:02:54Z",
        "keywords": [],
        "journal_title": "Humanist Studies & the Digital Age",
        "volume": "4",
        "issue": "1",
        "ISSN": [
            {
                "value": "2158-3846",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.5399/uo/hsda.6.1.3",
        "identifier": {
            "string_id": "10.5399/uo/hsda.6.1.3",
            "id_scheme": "DOI"
        },
        "abstract": "<div>At its beginnings Humanities Computing was characterized by a primary interest in methodological issues and their epistemological background. Subsequently, Humanities Computing practice has been prevailingly driven by technological developments and the main concern has shifted from content processing to the representation in digital form of documentary sources. The Digital Humanities turn has brought more to the fore artistic and literary practice in direct digital form, as opposed to a supposedly commonplace application of computational methods to scholarly research. As an example of a way back to the original motivations of applied computation in the humanities, a formal model of the interpretive process is here proposed, whose implementation may be contrived through the application of data processing procedures typical of the so called artificial adaptive systems.</div>",
        "article_title": "The Origins of Humanities Computing and the Digital Humanities Turn",
        "authors": [
            {
                "given": "Dino",
                "family": "Buzzetti",
                "sequence": "first",
                "affiliation": [
                    {
                        "name": "University of Bologna"
                    }
                ]
            }
        ],
        "publisher": "Oregon State University",
        "date": "2019-12-31T22:52:41Z",
        "keywords": [],
        "journal_title": "Semantic Metadata, Humanist Computing, and Digital Humanities",
        "volume": "6",
        "issue": "1",
        "ISSN": [
            {
                "value": "2158-3846",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.5399/uo/hsda.3.1.3196",
        "identifier": {
            "string_id": "10.5399/uo/hsda.3.1.3196",
            "id_scheme": "DOI"
        },
        "abstract": "<div>In this presentation, Dr. Stanley Fish provides a lively and insightful critique of the digital humanities and its methods, goals, and claims.  He does this using the framework of approaches to interpretation, i.e., how we decide what a given text means. Looking to constitutional law, Dr. Fish outlines three approaches to interpretation and discusses how digital technologies relate to them.</div>",
        "article_title": "If You Count It, They Will Come",
        "authors": [
            {
                "given": "Stanley",
                "family": "Fish",
                "sequence": "first",
                "affiliation": []
            }
        ],
        "publisher": "Oregon State University",
        "date": "2013-08-12T17:04:59Z",
        "keywords": [],
        "journal_title": "Humanist Studies & the Digital Age",
        "volume": "3",
        "issue": "1",
        "ISSN": [
            {
                "value": "2158-3846",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.5399/uo/hsda.4.1.3470",
        "identifier": {
            "string_id": "10.5399/uo/hsda.4.1.3470",
            "id_scheme": "DOI"
        },
        "abstract": "<div>The title does not refer to the application of knowledge through faculty engagement in community-based research, teaching and service – something that is usually understood as community-engaged scholarship. The change of paradigm referred to in the title should be understood within the broader framework of the general transformation of our participatory or convergence culture in the age of social and “spreadable” media (to use a terminology made current by Richard Jenkins). As the Web 2.0 evolves toward the Web 3.0, or the semantic web, community-engaged scholarship remains one of the most crucial components of this larger and more pervasive phenomenon and this also refers to the \"academic community\" at large. What is at stake is not only the transformation of the procedures of scholarly research and learning but also and more importantly the transformation of its goals: traditionally based (at least in the humanities) on the individual researcher and author, knowledge work, or the scholarly mode of production, is increasingly overhauled into a collective, collaborative enterprise, on a much larger scale. Moreover, the general move from discursive to graphic-algorithmic forms of data visualization and interpretation (including textual data), has eventful consequences for critical thinking: as humanists engaged with a potentially radical transformation of the community we belong to, our most daunting task is how to transpose traditional scholarly practices onto the new platform, envisioning new goals and outputs for our traditional tasks.</div>",
        "article_title": "Change of Paradigm: From Individual to Community-Based Scholarship",
        "authors": [
            {
                "given": "Massimo",
                "family": "Riva",
                "sequence": "first",
                "affiliation": []
            }
        ],
        "publisher": "Oregon State University",
        "date": "2015-09-23T22:02:54Z",
        "keywords": [],
        "journal_title": "Humanist Studies & the Digital Age",
        "volume": "4",
        "issue": "1",
        "ISSN": [
            {
                "value": "2158-3846",
                "type": "electronic"
            }
        ]
    },
    {
        "url": "http://dx.doi.org/10.5399/uo/hsda.6.1.2",
        "identifier": {
            "string_id": "10.5399/uo/hsda.6.1.2",
            "id_scheme": "DOI"
        },
        "abstract": "<div>Collective Intelligence, the book in French, that Pierre Levy wrote before the existence of the worldwide web, when only the Internet existed, it's a philosophical vision of the future, a philosophical vision of what could be a global civilization based on the digital and the general interconnection of all the computers. In the interview, Levy addresses the creation o the WWW by Tim Berners Lee as a form of collective intelligence. He then discusses Berners Lee's proposal for a reform of the WWW to avoid its confiscation by the big platforms, such as Google, Facebook, and Amazon. Then, he introduces his most recent project the IELM as a tool for semantic metadata and a code between the natural languages and the algorithms, and all the apparatus of computations.</div>",
        "article_title": "Collective Intelligence, the Future of Internet and the IEML: Interview to Pierre Lévy by Art Farley and Massimo Lollini",
        "authors": [
            {
                "given": "Pierre",
                "family": "Lévy",
                "sequence": "first",
                "affiliation": [
                    {
                        "name": "University of Ottawa"
                    }
                ]
            },
            {
                "given": "Art",
                "family": "Farley",
                "sequence": "additional",
                "affiliation": [
                    {
                        "name": "University of Oregon"
                    }
                ]
            },
            {
                "given": "Massimo",
                "family": "Lollini",
                "sequence": "additional",
                "affiliation": [
                    {
                        "name": "University of Oregon"
                    }
                ]
            }
        ],
        "publisher": "Oregon State University",
        "date": "2019-12-31T22:52:38Z",
        "keywords": [],
        "journal_title": "Semantic Metadata, Humanist Computing, and Digital Humanities",
        "volume": "6",
        "issue": "1",
        "ISSN": [
            {
                "value": "2158-3846",
                "type": "electronic"
            }
        ]
    }
]