[{"url": "http://dx.doi.org/10.6853/DADH.201804_1.0002", "identifier": {"string_id": "10.6853/DADH.201804_1.0002", "id_scheme": "DOI"}, "abstract": "The field and influences of Digital Humanities are expanding significantly in recent years. This paper discusses and reviews many of the influential ideas and representative achievements that were reported in the Series on Digital Humanities and the International Conference on Digital Archives and Digital Humanities. Existing accomplishments have provided not only substantial proofs for the far-reaching promises of Digital Humanities but also further guidance for advancing the field in coming years. The increasing availability of research material and the strengthening power of computing facilities are leading us to a new era of humanistic research. In an open data environment, researchers may access information that are potentially relevant to their research targets from diverse sources with the help of information retrieval and extraction techniques. Digital tools for relating and disambiguating relevant information from abundant raw material can assist researchers to sift through documents that offer insights of varying relevancy. With the solid foundations of the availability of research data and the strength of computing supports, researchers can dig deeply into a research topic. In addition, digital tools may provide explorative search, offering opportunities of discovering new issues that are contextually related to the original research topic. With an appropriate expert-in-the- loop search mechanism, experts may uncover new research topics and may even link relationships between topics that were not previously known, perhaps forming a topic network among research topics. A truly open data environment also allows us to make results of humanistic research verifiable. Readers of a published paper may find and study both the cited papers and the researched material via information curators or data providers so that readers may acquire a deeper understanding of the viewpoints and thoughts of the paper authors. This would be hard to achieve if any part of the data is privately secured.", "article_title": "Toward Linking Open Data, Synchronizing Digital Tools, and Mapping Relevant Topics: A Survey of the Series on Digital Humanities", "authors": [{"given": "Chao-Lin", "family": "Liu", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018-04-01", "keywords": [" humanistic research ", " computational linguistics ", " digital tools ", " open data ", " topic networks"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "1", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201804_1.0003", "identifier": {"string_id": "10.6853/DADH.201804_1.0003", "id_scheme": "DOI"}, "abstract": "Computational thinking is a cognitive framework of logical deduction and problem solving. Digital humanities has been rooted on the intersection and fusion of digital technology and humanity study. Based on accumulated experiences in interdisciplinary research, this paper depicts computational thinking and attempts to characterize research implications of data computation on humanities study. The abstract implications are manifested by actual research contexts of several domestic case studies, so as to provide reference and contemplation for the collective growth of digital humanities. Essential characteristics of digital humanities research paradigm inferred by the data computation model include: scale, dimension, intelligence, visualization, contextualization, independent validation, and common grounding. These characterization may help establish transdisciplinary pathways for younger generation scholars and provide further consideration with the research community. Transdisciplinary digital humanities research entails both physical changes of collaborative interaction and chemical changes of creative fusion. It is hoped that more will join the endeavor and begin a great journey of new adventure.", "article_title": "Computational Thinking and Implications for Digital Humanities Research", "authors": [{"given": "Jyi-Shane", "family": "Liu", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018-04-01", "keywords": ["  computational thinking ", " data computation ", " digital humanities ", " research implications"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "1", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201804_1.0004", "identifier": {"string_id": "10.6853/DADH.201804_1.0004", "id_scheme": "DOI"}, "abstract": "This paper introduces a semi-automatic text tagging interface to help historians efficiently garner posting records from the Chinese Local Gazetteers (difangzhi 地方志) with the format of ＂who, when, which posting.＂ By turning texts into tabular data forms, this interface aims to lay the basis for analyzing Chinese local gazetteers on a large scale. Although local gazetteers from various locations all follow a general pattern when recording posting data, they still differ in details due to their substantial amount. Therefore, it is unfeasible to ask programmers to extract the posting data using a onesize- fits-all computer program. This tagging interface, on the other hand, provides a simple user interface with built-in patterns to extract the subjects' names, posting titles, dynasties, posting times, basic addresses and entry methods. This allows users to tag most of data in the text quickly, which can then be proofread by them themselves in order to check the tagging result and to correct mistakes. The interface also enables users to adjust the extraction patterns according to each text in order to accurately extract posting data from local gazetteers with distinct patterns.", "article_title": "From Text to Data: Extracting Posting Data from Chinese Local Gazetteers", "authors": [{"given": "Wai-Him", "family": "Pang", "affiliation": null}, {"given": "Hui", "family": "Cheng", "affiliation": null}, {"given": "Shih-Pei", "family": "Che", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018-04-01", "keywords": ["  computational thinking ", " data computation ", " digital humanities ", " research implications"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "1", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201804_1.0005", "identifier": {"string_id": "10.6853/DADH.201804_1.0005", "id_scheme": "DOI"}, "abstract": "In total, there are over 1,200 hanging and hand scroll landscape paintings from five dynasties period to North Song dynasty which have been recorded in various painting histories, treatises, and historical records. In this study, we selected more than 120 paintings as experimental samples and another 240 paintings from South Song dynasty as supporting materials. The selected paintings represent over 30 categories of motifs, such as Snowy Scene, Wintry Forests, Dwellings in Autumnal Mountains, the Mountain and Stream, etc. The image capture technology is used on paintings with two easily recognizable motifs 'fish-boat' and 'fisherman,' of which, 22 out of 132 document recorded paintings were selected. The experiment was carried out in several steps: the first step is to establish a descriptive and statistical model to analyze the formative evolution and character identification of fish-boat and fisherman in different time periods; the second step will construct a semantic network with feature words extracted from the motif information, thematic content and scenario settings of the paintings; finally, based on the cross-references of the image analysis and text mining, it attempts to establish a Full Image Information Retrieval Database for landscape paintings and related descriptions. At last, by studying ＂Fisherman-Hermit＂ Theme pattern in painting and its semantics, We test a validity of method of picture-text data model and digital humanity used in Chinese classic painting.", "article_title": "The Digital Humanities Research of the Landscape Painting of the Five Dynasties and Northern Song Dynasty (2): A Study of the ＂Fisherman-Hermit＂ Theme in Painting", "authors": [{"given": "Ping", "family": "Wang", "affiliation": null}, {"given": "Liang", "family": "Niu", "affiliation": null}, {"given": "Guan-Tao", "family": "Jin", "affiliation": null}, {"given": "Qing-Feng", "family": "Liu", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018-04-01", "keywords": ["digital humanities ", " landscape painting ", " Fisherman image ", " Northern Song dynasty ", " Neo-Confucianism"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "1", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201804_1.0006", "identifier": {"string_id": "10.6853/DADH.201804_1.0006", "id_scheme": "DOI"}, "abstract": "In recent years, with the rapid development of information technology, a substantial number of Chinese Buddhist scriptures have been converted to digital format and made available to the public. The Chinese Buddhist Electronic Text Association (CBETA) has made the Chinese Electronic Tripiṭaka Collection widely available for many years and provided a resourceful platform for the Chinese Buddhist texts studies. As of the 2016 version, more than 210 million Chinese characters are freely and publicly available in digital form through the efforts of the CBETA. With the rapid emergence of digital tools, the employment of digital resources for the extraction of implicit information in the texts is a promising methodology. Owing to the privation of high-level computer programming skills and advanced statistical knowledge, the quantitative analysis of digital texts still under-perform. Therefore, there is a barrier for humanities scholars to navigate these digital tools, not to mention the application of such research concept in the field of Chinese Buddhist texts studies. It is inevitable to create a platform that assists humanities scholars in overcoming the mentioned hindrances so that the computational linguistic resources and information technology could aid in their research effort. Hence, the establishment of ＂CBETA Research Platform＂ started. This research platform provides high-quality digital content from the CBETA corpus, combining relevant references based on the latest research findings.", "article_title": "CBETA Research Platform: A Digital Tool for Studying Chinese Buddhist Texts in the New Era", "authors": [{"given": "Jen-Jou", "family": "Hung", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018-04-01", "keywords": ["Digital Buddhist Canon ", " Chinese Buddhist Electronic Text Association (CBETA) ", " database ", " buddhist studies ", " digital research platform"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "1", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201810_2.0001", "identifier": {"string_id": "10.6853/DADH.201810_2.0001", "id_scheme": "DOI"}, "abstract": "This paper proposes an alternative take to critique in the digital humanities (DH). As it further expands, the DH needs to critically engage with digital technologies by shifting the balance between the thinking and methods of the humanities. Taking the standpoint of a humanist enterprise, the DH ought to examine materiality as the essence of the digital. In so doing it should engage with the subjective experience as a starting point of analysis about how the digital impacts the nature of who we are, and in turn the way in which it affects culture and digital practices.", "article_title": "A Critical Approach to Digital Humanities: Examining the Subjective Sphere", "authors": [{"given": "Paolo", "family": "Casani", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018-10-01", "keywords": ["critical digital humanities ", " subjective perspective ", " materiality ", " humanistic approach"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "2", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201810_2.0002", "identifier": {"string_id": "10.6853/DADH.201810_2.0002", "id_scheme": "DOI"}, "abstract": "Digital Humanities allows researchers to question traditionally-held theories based on ＂close＂ readings by extending research to ＂distant＂ reading. In this paper, the Ubiqu + Ity tool provided by the Visualizing English Print (VEP) Website is used to analyze the spoken text of all major characters within Shakespeare's As You Like It. The Ubiqu+Ity tool provides several language action types (LATs), which are then classified as relational versus selfish, and active versus reflective. These classifications produce a method (called the character path walk) that visualizes the paths the characters ＂walk＂ through the play, leaving their ＂trails＂ behind that can then be visually analyzed. Upon initial analysis, using the play As You Like It as an example, minor characters such as Phoebe and Silvius revealed dramatic arcs in their speeches. Rosalind's roles as Catalyst (early in the play) and Conciliator (of Phoebe and Silvius) are also identified by applying the method. Some areas for further analysis and method development are suggested.", "article_title": "Navigating the Forest Through the Trees: Visualizing Character Paths Through Shakespeare’s As You Like It", "authors": [{"given": "Brian J.", "family": "Kokensparger", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018-10-01", "keywords": ["corpus linguistics ", " textual analysis ", " data visualization ", " early modern English drama "], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "2", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201810_2.0003", "identifier": {"string_id": "10.6853/DADH.201810_2.0003", "id_scheme": "DOI"}, "abstract": "The author of Shiji (史記) is Sima Qian, but part of it was rewritten according to the old manuscript of his father Sima Tan. In addition to Sima Qian and Sima Tan, Chu Shaosun is also one of the authors of Shiji. This study used term frequency statistics tool on DocuSky to count 30 chapters of Shiji. Frist, I used virtual words in Shiji as the subject matter doing statistical analysis. And then used the writing of Chu Shaosun as a control group to compare the differences in the word frequency of the three people. And we can use digital methods to prove the similarities and differences between the authors of the Shiji.", "article_title": "Digital Humanities for Authorship Attribution Problem of Shiji: Based on Frequency of Function Words Within the Hereditary Houses Section", "authors": [{"given": "Shih-Wen", "family": "Chyu", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018-10-01", "keywords": ["corpus linguistics ", " textual analysis ", " data visualization ", " early modern English drama "], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "2", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201810_2.0004", "identifier": {"string_id": "10.6853/DADH.201810_2.0004", "id_scheme": "DOI"}, "abstract": "The main, and usually the only, purpose of most traditional digital libraries and archiving systems is to provide good contents with a retrieval system that helps one find desirable documents. This is often not sufficient for humanists who want to employ digital tools to explore properties from interesting subsets of the library or system. Humanists usually do not merely rely on the libraries or systems. They keep interesting texts in hard disks accessible for themselves. It can be hard with conventional systems to analyze properties of texts stored in personal computers. To fix this problem, it is desirable to have a platform that allows one to build personal databases that support not only common retrieval functions but also text-analytic ones. In this paper, we propose DocuSky to solve this problem. DocuSky allows a user to upload text contents to build his or her personal databass. It supports fulltext retrieval, post-classification over a search result, as well as analysis on tagged terms. Fulltext retrieval is common for searching desirable documents in a database. For any search result, post-classification groups its metadata and shows the resulting distribution. Analysis on tagged terms, on the other hand, returns a list of tagged terms occurring in that search result. They are the three major functions offered by the well-known Taiwan History Digital Library (THDL) system. In addition to these elementary functions, it also provides a couple of tools to help users analyze the contents in a database. The advance of digital humanities requires closely cooperation of computer engineers and digital humanists. DocuSky encourages tool developers and humanists to re-think about the roles of texts and content-analytics tools. In order to reduce the effort of tool development, we design a set of DocuSky APIs and widgets to ease the access to the content of a personal database.", "article_title": "DocuSky: A Platform for Constructing and Analyzing Personal Text Databases", "authors": [{"given": "Hsieh-Chang", "family": "Tu", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018-10-01", "keywords": [" DocuSky ", " personal text databases ", " system architecture ", " text analytic tools ", " platform for digital humanities"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "2", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201810_2.0005", "identifier": {"string_id": "10.6853/DADH.201810_2.0005", "id_scheme": "DOI"}, "abstract": "The idea of developing Taiwan Biographical Database (TBDB) was inspired by China Biographical Database (CBDB) project, and aims to provide digital tools, such as text mining, social network analysis, and other related tools, for analyzing complex social networks and broaden research visions in the study of Taiwanese history. Considering the participants' knowledge of texts and the ability to acquire copyright, the team chooses the ＂Treatise of Historical Figures＂ of the New Edition of Changhua Local Gazetteer, compiled by four of the team members, as the base text. There are several advantages of this choice. First, the biographies in the Treatise are written according to the same format; second, the biographies are rigorously verified; third, they include people from all periods and all walks of life. Therefore, they should be a good starting point for the TBDB project. Besides learning from CBDB's model, the emphasis in developing TBDB is to build attributes for historical figures that are suited for Taiwan's historical contexts. Currently, we have built initial versions of basic search functions, a map which shows the geographical distribution of historical figures, and social network analysis tools. They are now open to the public in order to optimize and debug. In the future, we will continue to increase both the quality and quantity of the database and also develop new analysis tools.", "article_title": "From CBDB to TBDB: The ＂Treatise of Historical Figures＂ of the New Edition of Changhua Local Gazetteer as a Starting Point", "authors": [{"given": "Su-bing", "family": "Chang", "affiliation": null}, {"given": "Tsong-han", "family": "Lee", "affiliation": null}, {"given": "Yu-lan", "family": "Lee", "affiliation": null}, {"given": "Chao-jung", "family": "Li", "affiliation": null}, {"given": "Ya-wen", "family": "Ku", "affiliation": null}, {"given": "Hao-Ren", "family": "Ke", "affiliation": null}, {"given": "Shun-Hong", "family": "Sie", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2018-10-01", "keywords": ["digital humanities ", " treatise of historical figures ", " Taiwan Biographical Database (TBDB) ", " text mining ", " social networks analysis (SNA)"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "2", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201904_3.0004", "identifier": {"string_id": "10.6853/DADH.201904_3.0004", "id_scheme": "DOI"}, "abstract": "The study aims to demonstrate how the International Image Interoperability Framework (IIIF) can be used and enhanced the use and interoperability of Buddhist art images during digital humanities research. First, it sketches out the requirements of the given field with a particular attention to the spatial structure of image and the analytical research of image. Second, it presents the image platform to drive visual-oriented research in digital humanities by drawing on four sets of the application programming interface (API) provided by the IIIF, including Image, Presentation, Content Search, and Authentication. The result are as follows: (1) the Image API provides scholars closer look at every detail of the images, which are the basis of iconography. (2) A structural display of visual data, in terms of their spatial distribution and the relative location among a group of artworks belonging to the same locale, such that the contextual information remains un-fragmented. (3) A model for annotation and categorization is developed to enable study focusing on a specific subject. (4) Inter-exchangeability of research materials among archives and institutes from different countries. (5) An authentication mechanism is set up to manage the access to materials owned by different teams.", "article_title": "The International Image Interoperability Framework (IIIF) Approach to Digital Representation, View and Annotation of Buddhist Caves and Images", "authors": [{"given": "Shu-Jiun", "family": "Chen", "affiliation": null}, {"given": "Hsiang-An", "family": "Wang", "affiliation": null}, {"given": "Yu-Chien", "family": "Ling", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2019-04-01", "keywords": ["International Image Interoperability Framework (IIIF) ", " Buddhist art ", " Buddhist caves and images ", " digital humanities"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "3", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201904_3.0003", "identifier": {"string_id": "10.6853/DADH.201904_3.0003", "id_scheme": "DOI"}, "abstract": "A study was conducted to analyze the collaboration network of popular music production in Taiwan, using artists who took part in the works by the Best Male/ Female Mandarin Singer Award nominees of 18th to 29th Golden Melody as the study population. Overall, the best Mandarin singer music worker community network is quite large (diameter = 7), and the community members are highly connected (average path length = 2.156). However, unlike the small world network model, the whole the network average clustering coefficient value is relatively low (average clustering coefficient = 0.02), showing that the artists have a wide range of collaborators. In addition, a high modularity was observed (# of modules = 22, modularity score = 0.72), suggesting collaboration tend to be more cohesive around certain music styles. We also examined the relationship between an artists' network position and the diversity of the roles she/he played in the creative process such as lyricists, composers, producers, or arrangers. The diversity of an artist's creative role was calculated by Herfindahl-Hirschman Index. A significant correlation was found between a nominee's role diversity and his/her centrality.", "article_title": "Creative Role Analysis of the Best Male/Female Mandarin Singer Nominees in Taiwan Golden Melody Awards (2007-2018)", "authors": [{"given": "Wei-Min", "family": "Fan", "affiliation": null}, {"given": "Muh-Chyun", "family": "Tang", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2019-04-01", "keywords": ["Golden Melody Awards ", " best male/female mandarin singers ", " music workers ", " social network analysis ", " centrality"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "3", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201904_3.0001", "identifier": {"string_id": "10.6853/DADH.201904_3.0001", "id_scheme": "DOI"}, "abstract": "Ancient Chinese scriptures usually have no punctuation marks, which makes it difficult for modern people to read and understand. Adding modern punctuation to ancient scriptures is the basis for the collation and research of ancient scriptures, however, it is a very tedious process. Therefore, it is of practical significance to realize automatic punctuation of ancient scriptures by means of artificial intelligence (AI). We apply the latest tool of deep learning (DL) in the field of natural language processing (NLP) to train the two models of long short-term memory (LSTM) and convolution neural network (CNN) on a training set of more than 50 million Chinese characters and approximately 10 million punctuations. Then, on the test set of Buddhist texts from six different dynasties, the highest punctuation accuracy of 94.3% was achieved. At present, the system can mark seven kinds of modern punctuations (comma, period, question mark, exclamation mark, dunhao, semicolon, colon) for ancient texts.", "article_title": "A Method and Implementation of Automatic Punctuation", "authors": [{"given": "Xianchao", "family": "Shi", "affiliation": null}, {"given": "Kaiqi", "family": "Fang", "affiliation": null}, {"given": "Xianjiong", "family": "Shi", "affiliation": null}, {"given": "Xianju", "family": "Shi", "affiliation": null}, {"given": "Xiandiao", "family": "Shi", "affiliation": null}, {"given": "Xianji", "family": "Shi", "affiliation": null}, {"given": "Xianda", "family": "Shi", "affiliation": null}, {"given": "Xianfeng", "family": "Shi", "affiliation": null}, {"given": "Yanchun", "family": "Song", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2019-04-01", "keywords": ["automatic punctuation ", " ancient scriptures ", " long short-term memory (LSTM) ", " deep learning ", " natural language processing"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "3", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201904_3.0002", "identifier": {"string_id": "10.6853/DADH.201904_3.0002", "id_scheme": "DOI"}, "abstract": "In this paper, A Yorkshire Tragedy (AYT) is used as a focus for development of an agent-based modeling application, using a Java swarm-type modeling library called Mason. This paper utilizes data generated by stylometric algorithms within the modeling application to visualize interactions and affinities, employing plays, playwrights, and theaters all as agents against a simple backdrop of Early Modern London. During whole-play analysis (WPA), though the title page of A Yorkshire Tragedy attributes authorship to Shakespeare, and first performance to the Globe, this model suggests that it certainly was not written by Shakespeare. Scene analysis (SA) of the play, employing scenes as independent agents, suggests that none of the scenes appear to be written by Shakespeare. In a Stylo© analysis of the plays reported to be first performed at the Globe theater, A Yorkshire Tragedy appears to be stylometrically similar to another anonymous play, The Merry Devil of Edmonton, and plays written by John Ford and John Webster. Further analysis with different stylometric dimensions may provide more clarity in answering this question.", "article_title": "A Yorkshire Tragedy: Using Agent-Based Modeling to Suggest Authorship", "authors": [{"given": "Brian J.", "family": "Kokensparger", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2019-04-01", "keywords": ["corpus linguistics ", " textual analysis ", " stylometry ", " author attribution ", " Early Modern English drama "], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "3", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201910_(4).0003", "identifier": {"string_id": "10.6853/DADH.201910_(4).0003", "id_scheme": "DOI"}, "abstract": "This present work seeks to shed a new light on the language style of the Book of Odes (Shījīng 詩經) from a quantitative perspective. For reading poems written with the so-called incentive process (xīng 興), this work is based on the Mao version (Máoshī 毛詩) as a reference corpus and adopted his sentence segmentation. Almost all the poems written with the incentive process are composed of two couplets: the first, called initiative lines (qǐjù 起句), evokes an affective image; and the second, called envoi lines (yìngjù 應句), expresses one's feeling. Nevertheless, the semantic correlation between two couplets is often ambiguous. In the Mao version, the use of the incentive process is marked with two Chinese characters xīng yě 興也 where one couplet ends and the following begins. Without this mark, it is difficult to recognize this literary form. To interpret the semantic correlation between these lines in macrostructure, traditional commentaries proceed by analogical comparison, causal reasoning, or arrangement of events in sequence. Some recent studies suggest focusing on the microstructure of the incentive process, for example, rhyme schemes, syntactical relations, reiterated formulas, or alternation between function words and content words. The criteria for identifying the incentive process is problematic since his first appearance in the history of Chinese literary theory. However, this process has been considered as the archetypal form in Chinese lyric tradition for a long period. Based on the internal textual data retrieved from the corpus, this work discovers by combinatorial analysis all underlying patterns in all verses and determines representatives patterns as rhythmic patterns according to the frequency of occurrence. Finally, by linking defined rhythmic patterns between lines, this work re-describes stylistic devices of poems written with the incentive process.", "article_title": "A Quantitative Research of the Book of Odes (Shījīng 詩經): The Discovery of the Underlying Rhythm in the Incentive Process", "authors": [{"given": "Shueh-Ying", "family": "Liao", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2019-10-01", "keywords": ["digital humanities ", " quantitative analysis ", " rhythmic analysis ", " Book of Odes(Shījīng 詩經) ", " incentive process(xīng 興)"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "4", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201910_(4).0002", "identifier": {"string_id": "10.6853/DADH.201910_(4).0002", "id_scheme": "DOI"}, "abstract": "Topic modeling is a digital method to discover hidden thematic structure in large collections of unlabeled texts. It is now widely used to analyze massive modern Chinese texts from internet pages, new media and social net, like document classification and clustering, hot event detection and tracking, opinion mining and so on. This paper uses topic modeling in the analysis of the top-three classical works of pre-Qin Confucianism to discuss their ideological inheritance and development. The aim is to cast a new light on ＂close and direct reading＂ of classical Chinese texts through ＂distant and machine reading＂ and encourage some more creative usage of digital methods in the research of Chinese classical works.", "article_title": "An Application of Topic Modeling in the Analysis of Ancient Chinese Classical Works", "authors": [{"given": "Jiajia", "family": "Hu", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2019-10-01", "keywords": ["machine reading ", " text analysis ", " topic modeling ", " MALLET"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "4", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.201910_(4).0001", "identifier": {"string_id": "10.6853/DADH.201910_(4).0001", "id_scheme": "DOI"}, "abstract": "Applying natural language processing techniques to the analysis of digital historical texts has become an important topic in digital human studies. Considering the actual needs of historical event research, this study starts with the needs of individual researchers and designs a set of tools for historical text event analysis, and the effectiveness of the method is further evaluated by applying it to study pirate events in the Ming Dynasty. Since pirates continued to invade China's coastal areas almost throughout the Ming Dynasty, the Maritime Prohibition Policy and coastal defense arrangements in the Ming Dynasty closely related to the growth and decline of pirates' scourge. Based on some research papers and historical document text on the theme of Chinese coastal pirates, we identify and derive event groups through the individual-use text-based historical event analysis tool, and establish a data structure that links historical events, people and place names. By analyzing the type of each pirate event group, we found that it includes war cases and coastal defense affairs, and we can further track their spatiotemporal transition characteristics by name entities in each event group. This study aims to develop an individual-use text-based historical event analysis tool, and integrate geographic information system with digital humanities applications, to facilitate the possibility of digital humanities methods to historical research.", "article_title": "Digital Humanities and Integrated Spatio-Temporal Information Analysis: An Individual-Use Text-Based Historical Event Analysis Tool and Its Application in Studying Ming Pirates Events", "authors": [{"given": "Pi-ling", "family": "Pai", "affiliation": null}, {"given": "Cheng-han", "family": "Wu", "affiliation": null}, {"given": "Jung-yi", "family": "Tsai", "affiliation": null}, {"given": "Richard Tzong-han", "family": "Tsai", "affiliation": null}, {"given": "I-chun", "family": "Fan", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2019-10-01", "keywords": ["personalized research tool for historical text analysis ", " event clustering ", " automatic text markup ", " natural language processing ", " geographic information system (GIS)"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "4", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.202004_(5).0001", "identifier": {"string_id": "10.6853/DADH.202004_(5).0001", "id_scheme": "DOI"}, "abstract": "This paper investigates the issue of ＂paradigm shift＂ in humanities research in the digital era, mainly from the perspective of ＂evidential research＂-meaning textual criticism based on the investigation of both internal and external evidence. All humanities research, whether from the traditional or digital era, must be based on a foundation of ＂data＂ and ＂evidential research.＂ But the forms of data, the challenges one might encounter while using these data, as well the as the methods and tools of ＂evidential research,＂ are constantly changing. Thus, our ＂paradigm＂ for humanities research in the digital era must also necessarily be constantly shifting. Consequently, in this digital era dominated by data and robots, humanities scholars need to study both digital technology and the humanities so that they can combine both humanistic erudition and ＂computational thinking.＂ However, the combination of these two does not guarantee that we can then soar unimpeded through the cosmos of the digital world. After all, this combination constitutes mere ＂literacy,＂ not ＂skill.＂ This new type of literacy may be called ＂digital textual criticism.＂", "article_title": "Digital Textual Criticism: The New Literacy for Humanities Scholars", "authors": [{"given": "Fu-shih", "family": "Lin", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2020-04-01", "keywords": ["digital humanities ", " digital textual criticism ", " big data ", " crowdsourcing ", " artificial intelligence"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "5", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.202004_(5).0004", "identifier": {"string_id": "10.6853/DADH.202004_(5).0004", "id_scheme": "DOI"}, "abstract": "This paper deals with the functionality that DocuSky offers to enhance the design and application of metadata when the studies of humanities are being researched within this platform. It concerns not only technical protocols but also the utilization during the procedure of humantic studies. More importantly, this paper would like to demonstrate the approach to compose a metadata and construct a personal database correspondent to scholars' needs basing on their raw materials. As a demonstration, Buddhist inscriptions are employed to elaborate the usage of tools offered by DocuSky. This demonstration further reveals the integration of academic events and the practice of composing metadata. By means of these tools, scholars may be easier to research within diverse perspectives and contexts. DocuSky provides the digital approaches and concepts for the study of humanities as digital humanities. Metadata in this platform is no longer a professional concept attributed to information organization or secondary information for data retrieving, but the intellectual property resulted from the procedure of research as well as the meaning endued by researchers.", "article_title": "Design and Application of Metadata in Digital Humanities Basing on DocuSky: A Case Study of Buddhist Inscriptions", "authors": [{"given": "I-Mei", "family": "Hung", "affiliation": null}, {"given": "Te-Chi", "family": "Tsao", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2020-04-01", "keywords": ["DocuSky Collaboration Platform ", " metadata ", " digital humanities"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "5", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.202004_(5).0003", "identifier": {"string_id": "10.6853/DADH.202004_(5).0003", "id_scheme": "DOI"}, "abstract": "The National Chengchi University Library began to develop a digital humanities research platform for Mr. Lo Chia-Lun's writings since 2018. This platform provides several basic functions, including a convenient and user-friendly reading interface with the support of an automatic text annotation tool based on Chinese word segmentation and linked data, metadata search, full-text search, single and double words search, post-query classification, and information visualization analysis tool, to support digital humanities research. It aims to assist digital humanists to efficiently read or analyze the contents of Mr. Lo Chia-Lun's Writings through distant reading and close reading. Moreover, the texts of Mr. Lo Chia-Lun's Writings were aligned with time. This characteristic inspired us to develop an advanced function called Observation Tool of Viewpoint Migration and Age Division (OTVMAD) that can assist digital humanists to observe the concept change or migration with time based on dividing the texts into appropriate periods on this digital humanities platform. In addition to optimizing the functions and user interface of this platform, our future work will keep on developing more new functions, such as personal resource archives, character social network analysis, name entity recognition as well as try to apply this digital humanities research platform to assist digital humanities' instruction.", "article_title": "Development and Application of Digital Humanities Research Platform for Mr. Lo Chia-Lun's Writings", "authors": [{"given": "Chih-Ming", "family": "Chen", "affiliation": null}, {"given": "Chung", "family": "Chang", "affiliation": null}, {"given": "Chih Fan", "family": "Hsu", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2020-04-01", "keywords": ["digital humanities ", " text mining ", " information visualization ", " Mr. Lo Chia-Lun's Writings ", " conceptual history"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "5", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}, {"url": "http://dx.doi.org/10.6853/DADH.202004_(5).0002", "identifier": {"string_id": "10.6853/DADH.202004_(5).0002", "id_scheme": "DOI"}, "abstract": "Epigraphy in Chinese Singaporean Temples preserves local documentation of social connections in pre-modern Singapore. However, this valuable historical source has not yet been comprehensively analysed, in part due to the large amount of documents to be catalogued. The present study aims at the development of a frequency analysis of sponsors appearing in epigraphic texts in the pre-modern Chinese Singaporean Temples. This research examines the influence of donors by assessing their frequency, highlights the connections among sponsors, and their active areas, i.e., the links of sponsors to specific temples. The study applies a digital humanities approach, by utilizing Text Encoding Initiative (TEI), Python, DocuSky, and Palladio. TEI is used to mark up the texts of Chinese Epigraphy in Singapore, 1819-1911. The information under various labels can be extracted by Python programming. DocuSky is applied to produce graphic presentations that analyze the frequency of sponsors, assessing terms elicited from TEI files and terms from other sources as well. Palladio and Gephi provide graphic presentations of network among sponsors through the temples. This digital humanities work allows us to map specific aspects of Singapore in history.", "article_title": "Chinese Singaporean Temples: Digital Humanities Approaches to Frequency Lists of Sponsors", "authors": [{"given": "Xu", "family": "Duoduo", "affiliation": null}, {"given": "Kenneth", "family": "Dean", "affiliation": null}, {"given": "Marcus", "family": "Bingenheimer", "affiliation": null}, {"given": "Francis", "family": "Bond", "affiliation": null}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2020-04-01", "keywords": ["Chinese temple ", " frequency analysis of sponsors ", " digital humanities ", " Text Encoding Initiative (TEI) "], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "5", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}]