{"url": "http://dx.doi.org/10.1093/llc/fqx026", "identifier": {"string_id": "10.1093/llc/fqx026", "id_scheme": "DOI"}, "abstract": "Through the prism of the comparison, this study examines the dialogism characterizing the discourse of French literary critics in the second half of the 19th century. Using an automatic method, a set of comparisons relying on terms belonging to eleven predetermined hard sciences (anatomy, biology, physics, chemistry, botany, zoology, astronomy, surgery, medicine, geology, and mathematics) was extracted in a corpus of 249 French critical texts as well as in novels, philosophical texts, scientific texts, and texts from the social and human sciences. Apart from confirming the separation of literary critics into two tendencies, one which distances itself from sciences, and the other which wants to emulate it, the retrieved comparative constructions show that despite this division, some sciences such as mathematics are mostly depicted negatively in relation to literature. Furthermore, the comparison plays a crucial role in conferring a scientific dimension to literary criticism, especially because it enables to create an analogical system around some scientific concepts such as ‘espèce’ and therefore, to classify, discuss, and scrutinize literary forms more rigorously. In this literary discourse, the comparison does not merely borrow terms from scientific disciplines but also imbue them with new meaning, so that literary criticism can acquire the same legitimacy as sciences without losing its intrinsic features.", "article_title": "At the crossroads between the scientific and the literary discourse: Comparison as a figure of dialogism", "authors": [{"given": " Marine", "family": "Riguet", "affiliation": [{"original_name": "Université Paris-Sorbonne, France", "normalized_name": "University of Paris-Sud", "country": "France", "identifiers": {"ror": "https://ror.org/028rypz17", "GRID": "grid.5842.b"}}]}, {"given": " Suzanne", "family": "Mpouli", "affiliation": [{"original_name": "Université Pierre et Marie Curie, France", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-01-21", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "32", "issue": "suppl_2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}