{"url": "http://dx.doi.org/10.1093/llc/fqy029", "identifier": {"string_id": "10.1093/llc/fqy029", "id_scheme": "DOI"}, "abstract": "MOOC appearance has produced, in a first phase, more discussions than contributions. Despite pessimistic opinions or those catastrophic foreseeing the end of the classic education by accepting MOOC, the authors consider that, as it is happening in all situations when a field is reformed, instead of criticism or catastrophic predictions, an assessment should be simply made. MOOC will not be better or worse if it is discussed and dissected but can be tested in action, perfected by results, or abandoned if it has no prospects. Without testing, no decision is valid. A similarity between the MOOC appearance and the appearance of the idea of flying machines heavier than air can be made. In the flight case, the first reaction was a strong negation (including at Academies level) and only performing the first independent flight with an apparatus heavier than air has shifted orientation from denial to contributions. So, practical tests clarified the battle between ideas. The authors of this article encourage the idea of testing–assessment and, therefore, imagined and proposed one software for quickly assess whether MOOC produces changes in knowledge, by simply transferring courses from ‘face-to-face’ environment into the virtual one. Among the methods of statistical analysis for student behavioral changes was chosen the Keppel method. It underpins the assessment method of this work being approached using both the version with one variable and also with three variables. It is intended that this attempts to pave the way for other series of rapid assessment regarding MOOC effects (using other statistical methods). We believe, that this is the only approach that can lead either to improve the system or to renunciation.", "article_title": "Evaluation software for effects produced by MOOC in mediums with different linguistically levels", "authors": [{"given": " Cornel", "family": "Samoilă", "affiliation": [{"original_name": " Department of Materials Engineering, University of Braşov, Romania", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Doru", "family": "Ursuţiu", "affiliation": [{"original_name": " Department of Electronics and Computers, University of Braşov, Romania", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Vlad", "family": "Jinga", "affiliation": [{"original_name": " Department of Electronics and Computers, University of Braşov, Romania", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-11-02", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}