{"url": "http://dx.doi.org/10.1093/llc/fqy067", "identifier": {"string_id": "10.1093/llc/fqy067", "id_scheme": "DOI"}, "abstract": "We describe the first wide results of the linguistic profiling of the Common European Framework of Reference (CEFR)-levelled English Corpus (CLEC), a corpus built up for Natural Language Processing purposes. The CLEC is a proficiency-levelled English corpus that covers A1, A2, B1, B2, and C1 CEFR levels and that has been built up to train statistic models for automatic proficiency assessment. We describe not only the main aspects of the corpus development but also display the linguistic features and the statistic results for levels A2, B1, and B2 written examples, carried out automatically. We show how raw text, lexical, morphosyntactic, or syntactic statistic outcomes can help to identify levels of proficiency, to test teaching materials accurate proficiency classification, to provide computable support to new text proficiency validation, and to specify level boundaries. In fact, upper levels strengthen proficiency by showing higher outcomes of lexical and syntactic complexity. This analysis validates the use of automatic tools for proficiency level identification based on lexical and syntactic data, whereas morphosyntactic features strengthen competence-level distinctions. Finally, we suggest that these results are a first step onto the CEFR-levelled automatic assessment of new texts.", "article_title": "Automatic profiling of L2-simplified texts: Identifying discriminate features of linguistic proficiency", "authors": [{"given": " Maria Angeles", "family": "Zarco-Tejada", "affiliation": [{"original_name": "Department of French and English Philology, University of C치diz", "normalized_name": "University of C치diz", "country": "Spain", "identifiers": {"ror": "https://ror.org/04mxxkb11", "GRID": "grid.7759.c"}}, {"original_name": "Applied Linguistics Institute, University of C치diz", "normalized_name": "University of C치diz", "country": "Spain", "identifiers": {"ror": "https://ror.org/04mxxkb11", "GRID": "grid.7759.c"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-10-24", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}