{"url": "http://dx.doi.org/10.1093/llc/fqy015", "identifier": {"string_id": "10.1093/llc/fqy015", "id_scheme": "DOI"}, "abstract": "The widespread use of English in science and scholarship has stressed the increasing need for reference tools which provide non-native, especially junior, researchers with useful information about the collocational patterns as well as conventionalized phraseology of non-technical words prototypical of specialized discourses. Within this lexicographic trend, the GRELIC research group research (GRELIC) has developed SciE-Lex, a lexicographic tool which includes morphosyntactic and contextual information about the combinatory potential of general words commonly used in biomedical discourse. This article serves the purpose of checking the validity of SciE-Lex by means of a qualitative survey distributed among a group of experts who were asked to explore and rate the dictionary by highlighting its weaknesses and strengths. The analysis of their reports have revealed interesting findings with respect to the adequacy of SciE-Lex as a lexicographic tool addressed to the biomedical community as well as to the appropriateness of the inclusion of contextual information of non-specialized terms prototypical of biomedical discourse. This pre-evaluation has informed the revision process of the dictionary and thus has greatly contributed to verifying its usefulness.", "article_title": "Research report on the adequacy of SciE-Lex as a lexicographic tool for the writing of biomedical papers in English", "authors": [{"given": " Natalia Judith", "family": "Laso", "affiliation": [{"original_name": "Department of Modern Languages and Literatures and of English Studies, University of Barcelona, Spain", "normalized_name": "University of Barcelona", "country": "Spain", "identifiers": {"ror": "https://ror.org/021018s57", "GRID": "grid.5841.8"}}]}, {"given": " Elisabet", "family": "Comelles", "affiliation": [{"original_name": "Department of Modern Languages and Literatures and of English Studies, University of Barcelona, Spain", "normalized_name": "University of Barcelona", "country": "Spain", "identifiers": {"ror": "https://ror.org/021018s57", "GRID": "grid.5841.8"}}]}, {"given": " Isabel", "family": "Verdaguer", "affiliation": [{"original_name": "Department of Modern Languages and Literatures and of English Studies, University of Barcelona, Spain", "normalized_name": "University of Barcelona", "country": "Spain", "identifiers": {"ror": "https://ror.org/021018s57", "GRID": "grid.5841.8"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-11-12", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}