{"url": "https://journals.ub.uni-heidelberg.de/index.php/dah/article/view/49913", "identifier": {"string_id": "10.11588/dah.2018.3.49913", "id_scheme": "DOI"}, "abstract": "As data storage, computational processing power, and retrieval costs diminish, many traditional technologies of data-compression are becoming obsolete. This unprecedented state of data opulence, where more and more data are expected to be always more easily available at ever decreasing costs, is bringing about significant changes in contemporary computation, and fostering a revival of Artificial Intelligence technologies that were seen until recently as of limited practical use. A similar techno-cultural disruption is already conspicuously affecting architectural design. Informational models in three dimensions are replacing the basic tools of the designer’s trade since the Renaissance – scaled drawings in plans, elevations, and sections. Furthermore, Big Data and computation allow digital designers to compose and engage with the messiness of some natural processes without going through the traditional mediation of abstract and general mathematical theories and patterns. Just like computation is replacing the causal laws of modern science with the brute force of data-driven simulation and optimization, blunt information retrieval is increasingly, albeit often subliminally, replacing causality-driven, teleological historiography, and demoting all modern and traditional tools of story-building and story-telling. This major anthropological upheaval challenges our ancestral dependance on shared master-narratives of our cultures and histories.", "article_title": "Big Data and the End of History", "authors": [{"given": "Mario", "family": "Carpo", "affiliation": [{"original_name": "University College London", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}], "publisher": null, "date": "2018-07-31", "keywords": null, "journal_title": "International Journal for Digital Art History", "volume": null, "issue": null, "ISSN": [{"value": "2363-5401", "type": "electronic"}, {"value": "2363-5398", "type": "print"}]}