{"url": "http://dx.doi.org/10.1093/llc/fqx001", "identifier": {"string_id": "10.1093/llc/fqx001", "id_scheme": "DOI"}, "abstract": "Translating poetry is a very complex process. The paradoxical nature of untranslatability and translatability of poetry has been noticed by Hai An (The translation of poetry by the translator-cum-poet. Chinese Translator Journals 2005; 6: 27–30), citing two famous scholars who are holding totally different opinions toward poetry translation. Robert Frost purports that ‘poetry is what gets lost in translation’, and Susan Bassnet advocates ‘poetry is what we gain in translation’. However, the common ground between these two drastic opinions is that poetry translation is no more a repetition of the original works than a reproduction. There are both similarities and discrepancies between the translated works and the original pieces, or in another word: ‘harmony in diversity’. This study aims to testify the above-mentioned proposal in a clear and objective manner, by comparing the original poetry texts (twenty randomly selected poems from Shakespearean sonnets) with their translated versions (the corresponding Chinese-translated versions by four different translators) from the perspective of vocabulary, word frequency distribution and part-of-speech (POS) frequency distribution. The results have corroborated the previous proposal: first, there is no significant difference in terms of vocabulary size and the text management styles between the translated poems and the original ones. Second, there is a significant difference in the word frequency distribution and POS frequency distribution between translated poems and the original ones. Third, there are also differences in the POS frequency distribution in poems translated by different authors. Furthermore, the translation style could distinguish professional translators from professional poets.", "article_title": "Harmony in diversity: The language codes in English–Chinese poetry translation", "authors": [{"given": " Xiaxing", "family": "Pan", "affiliation": [{"original_name": "Chinese Language and Culture College, National Huaqiao University, China", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Xinying", "family": "Chen", "affiliation": [{"original_name": "School of Foreign Studies, Xi’an Jiaotong University, China", "normalized_name": "Xi'an Jiaotong University", "country": "China", "identifiers": {"ror": "https://ror.org/017zhmm22", "GRID": "grid.43169.39"}}]}, {"given": " Haitao", "family": "Liu", "affiliation": [{"original_name": "Department of Linguistics, Zhejiang University, China", "normalized_name": "Zhejiang University", "country": "China", "identifiers": {"ror": "https://ror.org/00a2xv884", "GRID": "grid.13402.34"}}, {"original_name": "Centre for Linguistics and Applied Linguistics, Guangdong University of Foreign Studies, Guangzhou, China", "normalized_name": "Guangdong University of Foreign Studies", "country": "China", "identifiers": {"ror": "https://ror.org/00fhc9y79", "GRID": "grid.440718.e"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-03-20", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}