{"url": "http://dx.doi.org/10.1093/llc/fqy003", "identifier": {"string_id": "10.1093/llc/fqy003", "id_scheme": "DOI"}, "abstract": "This article presents Parsa as an open information extraction (OIE) system for Persian. Comparing with advanced English approaches, OIE has just started to develop in other languages. Existing systems apply information about the grammar and syntactic structures of the target language to gain domain independence (which is a key goal in OIE). To improve modeling these complex structures, Parsa introduces a novel set of Patterns based on tree format. The patterns also enable Parsa to define POS tags, and lexical constraints to reduce incorrect matches. Each Tree Pattern is placed inside a Package based on its type and priority. The Packages help Parsa to alleviate some challenges in processing Persian like null-subject problem and uninformative extraction. To make the extraction process simple and coherent, we separate matching template from extraction template. An efficient algorithm for matching patterns inside dependency parse of a sentence is presented as well. Our experiments showed that Parsa achieves better performance than the state of the art systems in Persian, and highly comparable with the existing approaches in English.", "article_title": "Parsa: An open information extraction system for Persian", "authors": [{"given": " Mahmoud", "family": "Rahat", "affiliation": [{"original_name": "Faculty of Computer Science and Engineering, Shahid Beheshti University, Iran", "normalized_name": "Shahid Beheshti University", "country": "Iran", "identifiers": {"ror": "https://ror.org/0091vmj44", "GRID": "grid.412502.0"}}]}, {"given": " Alireza", "family": "Talebpour", "affiliation": [{"original_name": "Faculty of Computer Science and Engineering, Shahid Beheshti University, Iran", "normalized_name": "Shahid Beheshti University", "country": "Iran", "identifiers": {"ror": "https://ror.org/0091vmj44", "GRID": "grid.412502.0"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-10-11", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "4", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}