{"url": "http://dx.doi.org/10.1093/llc/fqx015", "identifier": {"string_id": "10.1093/llc/fqx015", "id_scheme": "DOI"}, "abstract": "As society continues to embrace advances in digital technologies, a major question that arises is the impact which such technologies have on the concept of an ‘author’ under copyright law. Prior to the advent of the user-generated content (UGC) technology, creative works on the Internet were produced by one or several identifiable authors. The advent of the UGC technology has enabled the active authorial participation of Internet users. This has made it possible for massively collaborative works on the Internet to mushroom where numerous authors’ contributions are incrementally merged into an extensive single work. The concept of an ‘author’ under copyright law is premised on the basis that a work has one or several finite authors. Many UGC works defy this traditional mode of creating works. Taking Malaysian copyright law as the focal point of this study, the research examines whether the concept of an ‘author’ as defined in the Malaysian Copyright Act 1987 is sufficient to address the authorship issue in the light of the UGC technology. It concludes that the current concept of an ‘author’ in the Act is ill-equipped to accommodate Internet-based collaborations. It recommends the introduction of the concept of a ‘deemed author’ in copyright law and suggests that the status of a ‘deemed author’ be conferred on the entity who controls and determines the configuration of the resulting work.", "article_title": "Rethinking the concept of an ‘Author’ in the face of digital technology advances: A perspective from the copyright law of a commonwealth country", "authors": [{"given": " Pek San", "family": "Tay", "affiliation": [{"original_name": "Faculty of Law, University of Malaya, Malaysia", "normalized_name": "University of Malaya", "country": "Malaysia", "identifiers": {"ror": "https://ror.org/00rzspn62", "GRID": "grid.10347.31"}}]}, {"given": " Cheng Peng", "family": "Sik", "affiliation": [{"original_name": "Faculty of Law, University of Malaya, Malaysia", "normalized_name": "University of Malaya", "country": "Malaysia", "identifiers": {"ror": "https://ror.org/00rzspn62", "GRID": "grid.10347.31"}}]}, {"given": " Wai Meng", "family": "Chan", "affiliation": [{"original_name": "Department of Business Strategy and Policy, Faculty of Business and Accountancy, University of Malaya, Malaysia", "normalized_name": "University of Malaya", "country": "Malaysia", "identifiers": {"ror": "https://ror.org/00rzspn62", "GRID": "grid.10347.31"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-03-20", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "33", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}