{"url": "http://www.zfdg.de/sb003_004", "identifier": {"string_id": "10.17175/sb003_004", "id_scheme": "DOI"}, "abstract": "This paper is written based on workshop discussions and on my research paper presented at the University of Bayreuth’s DFG funded conference, entitled: »Wie Digitalität die Geisteswissenschaften verändert. Neue Forschungsgegenstände und Methoden« March 23–24, 2017. The paper aims to investigate the state of the art, issues, advantages and drawbacks of the use of digital technology for the research of Islamic Art and Architecture. Rather than being conclusive, this paper aspires to discuss research methodology of the History of Islamic Art and Architecture. This is of importance given the lack of such discussions in the given field. The paper is based on my ongoing PhD research of Aesthetics of Ilkhanid Architectural Revetment in Central Iran c. 1300 at the Otto-Friedrich-Universität Bamberg. It discusses the question of the use of digital technology for the benefit of the research. Its particular focus is an inquiry of use of digital technology for the research of stucco revetments and monumental architectural stucco inscriptions (Figures 1 and 2, 3) from 13-14th centuries in Central Iran. The paper argues that the use of digital technology is of key importance for the advancement of Islamic Art studies and for researchers to overcome the traditional approach of stylistic comparison. The paper also explains why Digitality cannot entirely substitute key primary sources stemming from research of museum collections and objects handling or field research of monuments, on which studies of Islamic Material Culture are based.", "article_title": "Islamic Stuccos made Digital. Digitality and Studies of Islamic Art and Architecture", "authors": [{"given": "Ana Marija", "family": "Grbanovic", "affiliation": [{"original_name": "Otto-Friedrich-Universität Bamberg", "normalized_name": "University of Bamberg", "country": "Germany", "identifiers": {"ror": "https://ror.org/01c1w6d29", "GRID": "grid.7359.8"}}]}], "publisher": null, "date": "2018-06-27", "keywords": null, "journal_title": "Zeitschrift für digitale Geisteswissenschaften", "volume": "Sonderband 3", "issue": null, "ISSN": [{"value": "2510-1366", "type": "electronic"}]}