{"url": "http://dx.doi.org/10.1093/llc/fqy037", "identifier": {"string_id": "10.1093/llc/fqy037", "id_scheme": "DOI"}, "abstract": "In this article, an innovative approach to perform the sentiment analysis (SA) has been presented. The proposed system handles the issues of Romanized or abbreviated text and spelling variations in the text to perform the sentiment analysis. The training data set of 3,000 movie reviews and tweets has been manually labeled by native speakers of Hindi in three classes, i.e. positive, negative, and neutral. The system uses WEKA (Waikato Environment for Knowledge Analysis) tool to convert these string data into numerical matrices and applies three machine learning techniques, i.e. Naive Bayes (NB), J48, and support vector machine (SVM). The proposed system has been tested on 100 movie reviews and tweets, and it has been observed that SVM has performed best in comparison to other classifiers, and it has an accuracy of 68% for movie reviews and 82% in case of tweets. The results of the proposed system are very promising and can be used in emerging applications like SA of product reviews and social media analysis. Additionally, the proposed system can be used in other cultural/social benefits like predicting/fighting human riots.", "article_title": "A sentiment analysis system for social media using machine learning techniques: Social enablement", "authors": [{"given": " Sujata", "family": "Rani", "affiliation": [{"original_name": "TIET, CSED, India", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Parteek", "family": "Kumar", "affiliation": [{"original_name": "TIET, India", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-10-30", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}