{"url": "http://dx.doi.org/10.1093/llc/fqy021", "identifier": {"string_id": "10.1093/llc/fqy021", "id_scheme": "DOI"}, "abstract": "Academic writing training in various forms has been developed to enhance writing knowledge and skills for graduate students at universities. However, few studies have targeted comparative learning analysis of the Introduction and Method sections in terms of genre structure and language use with the support of technology in the humanities and social sciences contexts. The present study designed a 13-week blended English genre-based writing instruction (GBWI) workshop with an online writing tutorial system—EJP-Write, in conjunction with the peer review and discovery-based learning approaches. This GBWI workshop was designed to help twenty-five graduate students from nine fields of the humanities and social sciences disciplines enhance their genre structure and language use of the Introduction and Method sections in academic writing. The results showed that although the participants benefited from GBWI, their improvements were not significant. The students further reported that the EJP-Write coupled with the peer review and discovery-based learning activities did not completely meet their requirements and anticipations. Overall, this study contributes to aid scholars and educators in better understanding how English as a foreign language (EFL) graduate students respond to GBWI with an integrated system for developing the knowledge and skills of academic writing. Moreover, these preliminary results can be used as guidance to further strengthen the effectiveness and efficiency of future GBWI research.", "article_title": "Genre-based writing instruction blended with an online writing tutorial system for the development of academic writing", "authors": [{"given": " Wei-Chen", "family": "Hsu", "affiliation": [{"original_name": "Department of Foreign Languages and Literature, National Cheng Kung University, Taiwan, Republic of China", "normalized_name": "National Cheng Kung University", "country": "Taiwan", "identifiers": {"ror": "https://ror.org/01b8kcc49", "GRID": "grid.64523.36"}}]}, {"given": " Gi-Zen", "family": "Liu", "affiliation": [{"original_name": "Department of Foreign Languages and Literature, National Cheng Kung University, Taiwan, Republic of China", "normalized_name": "National Cheng Kung University", "country": "Taiwan", "identifiers": {"ror": "https://ror.org/01b8kcc49", "GRID": "grid.64523.36"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-11-12", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "1", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}