{"url": "http://dx.doi.org/10.1093/llc/fqy031", "identifier": {"string_id": "10.1093/llc/fqy031", "id_scheme": "DOI"}, "abstract": "Recent research has demonstrated the potential of corpus linguistics as a solid aid in children’s understanding of how language works. However, the availability of data from the UK is still somewhat limited. Most corpora are either based on a small number of schools, synchronic in nature, or focused on the post-National Curriculum era (cf. Lancaster Corpus of Children’s Project Writing, the Oxford Children’s Corpus, the Growth in Grammar Corpus); on the other hand, historical corpora are, unfortunately, not publicly available in electronic format (cf. the Child Language Survey or the Aspects of Writing in 16+ English Examinations, Cambridge Assessment). This article introduces the APU Writing and Reading Corpus 1979–1988, a new large electronic data set of historical materials which are linguistically annotated. The aim is two-fold. First, to describe the contents of the corpus and its compilation procedure. Second, to illustrate its potential as a research and pedagogical tool by presenting a number of research case studies and teaching materials that are currently being developed based on the corpus data. All in all, the Assessment Performance Unit (APU) Corpus contributes to both Corpus Linguistics and Educational Linguistics by presenting itself as a new resource tool with replicable methodology and objective empirical evidence, which will be of interest to academics and school teachers as well as to school material developers and policymakers.", "article_title": "‘he liked to read, write, and whatch televishon’—The APU Writing and Reading Corpus (1979–1988)", "authors": [{"given": " Nuria", "family": "Yáñez-Bouza", "affiliation": [{"original_name": "Universidade de Vigo, Facultade de Filoloxía e Tradución, Filoloxía Inglesa, Francesa e Alemá, Spain", "normalized_name": "Universidade de Vigo", "country": "Spain", "identifiers": {"ror": "https://ror.org/05rdf8595", "GRID": "grid.6312.6"}}]}, {"given": " Victorina", "family": "González-Díaz", "affiliation": [{"original_name": "University of Liverpool, Department of English, School of The Arts, UK", "normalized_name": "University of Liverpool", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04xs57h96", "GRID": "grid.10025.36"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-09-10", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "2", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}