{"url": "http://dx.doi.org/10.1093/llc/fqy055", "identifier": {"string_id": "10.1093/llc/fqy055", "id_scheme": "DOI"}, "abstract": "During World War I (WWI), between 1916 and 1917, Robert Musil was the chief editor of the Tiroler Soldaten-Zeitung in Bozen. This activity probably also involved authorship of articles and has posed a philological problem to scholars, who have not been able to attribute with certainty a range of relatively short texts to Musil. With this article, we present a new approach that combines philological research with stylometric methods. Exploration of WWI archives and digitization of historical documents were paired with application of authorship attribution techniques, following extensive evaluation. To build the training set, we adapted the ‘impostors method’ by grouping three ‘distractor authors’ (similar to Musil in terms of style) and three actual candidates for authorship. In the test set, we developed two designs for tackling the issue of text length: a combinatory design, where longer chunks were composed by the juxtaposition of short texts; a simplified design, where the texts for attribution were merged with already attributed texts. Results of our experiment suggest that Musil attribution may be disproved with a high level of confidence for ten texts that were more probably written by a less well-known author, Albert Ritter. We carried out a keyness analysis on the specific words preferred or avoided by the two authors, which not only corroborated the results of the quantitative analysis but also findings from Musil philology. Our study showcases the potentialities of using mixed methods in stylometry.", "article_title": "Robert Musil, a war journal, and stylometry: Tackling the issue of short texts in authorship attribution", "authors": [{"given": " Simone", "family": "Rebora", "affiliation": [{"original_name": "Foreign Languages and Literatures, University of Verona, Italy", "normalized_name": "University of Verona", "country": "Italy", "identifiers": {"ror": "https://ror.org/039bp8j42", "GRID": "grid.5611.3"}}]}, {"given": " J Berenike", "family": "Herrmann", "affiliation": [{"original_name": "University of Basel, Switzerland", "normalized_name": "University of Basel", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02s6k3f65", "GRID": "grid.6612.3"}}]}, {"given": " Gerhard", "family": "Lauer", "affiliation": [{"original_name": "University of Basel, Switzerland", "normalized_name": "University of Basel", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/02s6k3f65", "GRID": "grid.6612.3"}}]}, {"given": " Massimo", "family": "Salgaro", "affiliation": [{"original_name": "Foreign Languages and Literatures, University of Verona, Italy", "normalized_name": "University of Verona", "country": "Italy", "identifiers": {"ror": "https://ror.org/039bp8j42", "GRID": "grid.5611.3"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2018-11-12", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "34", "issue": "3", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}