{"url": "http://dx.doi.org/10.3389/fdigh.2018.00010", "identifier": {"string_id": "10.3389/fdigh.2018.00010", "id_scheme": "DOI"}, "abstract": "Rhetorical figures are valuable linguistic data for literary analysis. In this article, we target the detection of three rhetorical figures that belong to the family of repetitive figures: chiasmus (I go where I please, and I please where I go.), epanaphora also called anaphora (“Poor old European Commission! Poor old European Council.”) and epiphora (“This house is mine. This car is mine. You are mine.”). Detecting repetition of words is easy for a computer but detecting only the ones provoking a rhetorical effect is difficult because of many accidental and irrelevant repetitions. For all figures, we train a log-linear classifier on a corpus of political debates. The corpus is only very partially annotated, but we nevertheless obtain good results, with more than 50% precision for all figures. We then apply our models to totally different genres and perform a comparative analysis, by comparing corpora of fiction, science and quotes. Thanks to the automatic detection of rhetorical figures, we discover that chiasmus is more likely to appear in the scientific context whereas epanaphora and epiphora are more common in fiction.", "article_title": "Rhetorical Figure Detection: Chiasmus, Epanaphora, Epiphora", "authors": [{"given": "Marie", "family": "Dubremetz", "affiliation": [{"original_name": "Department of Linguistics and Philology, Uppsala University, Sweden", "normalized_name": "Uppsala University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/048a87296", "GRID": "grid.8993.b"}}]}, {"given": "Joakim", "family": "Nivre", "affiliation": [{"original_name": "Department of Linguistics and Philology, Uppsala University, Sweden", "normalized_name": "Uppsala University", "country": "Sweden", "identifiers": {"ror": "https://ror.org/048a87296", "GRID": "grid.8993.b"}}]}], "publisher": "Frontiers Media SA", "date": "2018-05-22", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "5", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}