{"url": "https://umanisticadigitale.unibo.it/article/view/7257", "identifier": {"string_id": "10.6092/issn.2532-8816/7257", "id_scheme": "DOI"}, "abstract": "L’articolo presenta l’edizione di una corrispondenza diplomatica francese del XVII secolo. Dopo un breve excursus sull’autore delle lettere, verrà presentata l’edizione critica tradizionale a stampa e saranno esplicitati gli interventi realizzati sul testo. Ci si interrogherà sulla questione della modernizzazione del testo, per privilegiare la comprensione del contenuto, a scapito però dell’autenticità della lingua. Verranno analizzate le edizioni digitali di corrispondenze attualmente pubblicate. Sarà quindi presentata l’edizione digitale della corrispondenza oggetto di questo articolo, mettendo in luce i vantaggi offerti dall’edizione digitale, realizzata usando il software EVT e visualizzatore Oxygen. Verrà mostrato un esempio di marcatura linguistica con software Treetagger, saranno messe in evidenza alcune problematicità legate alle etichette oggi utilizzate dal sistema sia per quanto riguarda il francese moderno che quello antico. Saranno presentati alcuni gruppi di ricerca europei che stanno affinando delle etichette più specifiche, in particolare il gruppo PRESTO. Saranno analizzate alcune difficoltà riscontrate realizzando l’edizione digitale, come l’assenza delle conoscenze informatiche necessarie e la necessità di un lavoro di équipe tra filologo e informatico, ma verrà anche proposta una riflessione sulla figura dell’umanista digitale e sulle competenze necessarie per poter dialogare con chi praticamente realizzerà l’edizione. Si affronteranno alcune questioni legate alla necessità di associare all’edizione digitale un codice ISBN, un codice DOI e eventualmente una registrazione alla SIAE. Verranno presentati alcuni esempi di conservazione di documenti digitali da parte delle Biblioteche dell’Università degli studi di Torino, in particolare i progetti: SIRIO@UNITO e TUTTO.", "article_title": "Corrispondenze diplomatiche francesi del Seicento: le possibilità offerte dall’edizione digitale", "authors": [{"given": "Cecilia", "family": "Russo", "affiliation": [{"original_name": "Università degli Studi di Torino", "normalized_name": "University of Turin", "country": "Italy", "identifiers": {"ror": "https://ror.org/048tbm396", "GRID": "grid.7605.4"}}]}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}