{"url": "https://umanisticadigitale.unibo.it/article/view/8144", "identifier": {"string_id": "10.6092/issn.2532-8816/8144", "id_scheme": "DOI"}, "abstract": "Il paper descrive un processo di pattern recognition, che utilizza un algoritmo di graphic matching basato sulla funzione shape contour recognition senza necessità di applicare funzioni di segmentazione. Il processo si avvia partendo dall’individuazione di una Region of Interest (ROI) all’interno dell’immagine. La ROI è quindi gestita per la creazione del shape model poi utilizzato per eseguire le ricerche di modelli simili in una o più immagini target. Il sistema è stato sviluppato e testato con l'obiettivo di proporre un approccio innovativo nella ricerca e recupero di informazioni in digital libraries relative a documentazione antica manoscritta e a stampa. Questo approccio si basa sull'applicazione ai data humanities del quarto paradigma della conoscenza che è alla base dei data science. Seguendo questo approccio, l'algoritmo si utilizza per dedurre nuove ipotesi di ricerca attraverso la scoperta di modelli direttamente derivati da digital libraries di grandi dimensioni.", "article_title": "Un innovativo Graphic Matching System per la ricerca in database di manoscritti antichi", "authors": [{"given": "Nicola", "family": "Barbuti", "affiliation": [{"original_name": "Università degli Studi di Bari Aldo Moro", "normalized_name": "University of Bari Aldo Moro", "country": "Italy", "identifiers": {"ror": "https://ror.org/027ynra39", "GRID": "grid.7644.1"}}]}, {"given": "Stefano", "family": "Ferilli", "affiliation": [{"original_name": "Università degli Studi di Bari Aldo Moro", "normalized_name": "University of Bari Aldo Moro", "country": "Italy", "identifiers": {"ror": "https://ror.org/027ynra39", "GRID": "grid.7644.1"}}]}, {"given": "Tommaso", "family": "Caldarola", "affiliation": [{"original_name": "D.A.BI.MUS S.r.l.", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Bologna: AlmaDL", "date": "2018-11-30", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}