{"url": "https://umanisticadigitale.unibo.it/article/view/7262", "identifier": {"string_id": "10.6092/issn.2532-8816/7262", "id_scheme": "DOI"}, "abstract": "L'articolo delinea gli obiettivi del progetto di edizione digitale del manoscritto Napoli, Biblioteca Nazionale, MS XIII.B.29. Il codice, preziosissimo in quanto unico esempio di letteratura inglese tardomedievale conservato in Italia, contiene romanzi cavallereschi e un poema agiografico che conobbero ampia circolazione nell’Inghilterra del quattordicesimo e quindicesimo secolo, oltre a ricette mediche finora inedite. A parte la sua rilevanza filologica e letteraria (la maggior parte dei testimoni delle opere ivi contenuti si differenzia talvolta anche in modo marcato rispetto al resto delle rispettive tradizioni testuali), la presenza di note in italiano e, soprattutto, di un’illustrazione che testimonierebbe la sua appartenenza a Tommaso Campanella pone il codice in una posizione di sicuro interesse storico e contestualizza in modo peculiare la sua fruizione nell’ambiente culturale napoletano del sedicesimo e diciassettesimo secolo. L’obiettivo principale del progetto consiste, dunque, nel fornire uno strumento che permetta la più ampia fruizione di un manoscritto finora praticamente sconosciuto ma unico nel suo genere, al fine di preservarne l’integrità materiale. Oltre a dettagliare le modalità di marcatura dei testi e di codifica degli elementi paratestuali, si fornirà un piano preliminare di edizione, che verrà realizzato attraverso l'interfaccia open source EVT.", "article_title": "Un progetto di edizione digitale del codice Napoli, Biblioteca Nazionale, MS XIII.B.29.", "authors": [{"given": "Omar", "family": "Khalaf", "affiliation": [{"original_name": "Dipartimento di Diritto, Economia e Culture, Università  degli Studi dell'Insubria, Como", "normalized_name": "University of Insubria", "country": "Italy", "identifiers": {"ror": "https://ror.org/00s409261", "GRID": "grid.18147.3b"}}]}, {"given": "Raffaele", "family": "Cioffi", "affiliation": [{"original_name": "Dipartimento di Studi Umanistici, Università  degli Studi di Torino", "normalized_name": "University of Turin", "country": "Italy", "identifiers": {"ror": "https://ror.org/048tbm396", "GRID": "grid.7605.4"}}]}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}