{"url": "https://umanisticadigitale.unibo.it/article/view/7298", "identifier": {"string_id": "10.6092/issn.2532-8816/7298", "id_scheme": "DOI"}, "abstract": "Questo contributo illustra un’efficace esperienza di collaborazione tra diverse istituzioni, quali enti di ricerca, di tutela e formazione, e differenti professionalitá, coinvolte nell’ambito dell’alternanza scuola-lavoro, ai fini della digitalizzazione e valorizzazione del patrimonio epigrafico del Museo Civico Castello Ursino del Comune di Catania. Il Museo possiede una rilevante collezione epigrafica, costituita da due raccolte settecentesche catanesi. Alcune iscrizioni sono esposte secondo i vecchi criteri di fruizione museale; la maggior parte é custodita in deposito. Uno degli obiettivi dell’esperienza é dunque far conoscere al pubblico fruitore ed alla comunitá degli studiosi l’ingente patrimonio epigrafico del Castello attualmente non esposto al pubblico. Il progetto di durata triennale é stato caratterizzato in un primo momento da una attivitá di digitalizzazione di schede catalografiche e di documentazione grafica e fotografica di parte delle epigrafi; durante il secondo anno di attivit. é stata realizzata una esposizione presso il Castello Ursino di un gruppo selezionato di epigrafi di provenienza catanese, che sono state sottoposte a un primo restauro conservativo ed inserite nel catalogo digitale con la relativa documentazione. Le epigrafi sono codificate secondo standard e vocabolari controllati internazionali (formatto EpiDoc TEI XML, Pleiades per posizioni geografiche e lessici controllati di EAGLE per i tipi di iscrizioni, i materiali e i supporti) al fine di consentire la creazione di Linked Open Data. La mostra presenta, tra l’altro, la realizzazione di due video e l’inserimento di un chiosco digitale multimediale per accedere a contenuti di approfondimento e immagini 3D. Durante il terzo anno é programmata la prosecuzione dell’attivit. di digitalizzazione e documentazione ed un approfondimento della disseminazione dei risultati sul web.", "article_title": "Una collaborazione tra museo, enti di ricerca e scuola: l'epigrafia digitale e l'alternanza scuola lavoro", "authors": [{"given": "Serena", "family": "Agodi", "affiliation": [{"original_name": "Liceo Artistico \"M.M. Lazzaro\"", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Salvatore", "family": "Cristofaro", "affiliation": [{"original_name": "Consiglio Nazionale delle Ricerche", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}]}, {"given": "Valentina", "family": "Noto", "affiliation": [{"original_name": "Comune di Catania", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Jonathan R.W.", "family": "Prag", "affiliation": [{"original_name": "University of Oxford", "normalized_name": "University of Oxford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/052gg0110", "GRID": "grid.4991.5"}}]}, {"given": "Daria", "family": "Spampinato", "affiliation": [{"original_name": "Consiglio Nazionale delle Ricerche", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}]}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}