{"url": "https://umanisticadigitale.unibo.it/article/view/8135", "identifier": {"string_id": "10.6092/issn.2532-8816/8135", "id_scheme": "DOI"}, "abstract": "L’assenza di edizioni native digitali di testi classici a tradizione complessa ha indotto molti ad interrogarsi sulle ragioni di questa lacuna nelle DH. A fronte di alcune risposte e possibili soluzioni, questo articolo presenta un caso di applicazione di tecnologie esistenti alla tradizione manoscritta di Catullo, che si compone di circa 130 codici e presenta notevoli problemi paleografici, filologici e genetici. Il lavoro di collazione e spoglio di tutti i testimoni, portato avanti da un gruppo di ricerca afferente al CSC, ha permesso di individuare alcune delle cruces che l’editore classico si trova ad affrontare in ambiente digitale e ha altresì mostrato la distanza che separa l’edizione critica di un testo classico, così come si è canonicamente definita in seno alla filologia novecentesca, e l’edizione critica digitale di un testo classico: se da un lato infatti l’edizione critica cartacea ha una concretezza e un’uniformità che mancano a quella digitale, ma talvolta non consente la piena verificabilità dei dati, l’edizione digitale potrebbe consentire un controllo più puntuale e garantire un più alto grado di scientificità del lavoro dell’editore, permettendo di rinnovare profondamente il contesto di studi; tuttavia, gli strumenti attualmente esistenti talvolta si dimostrano inadeguati. Questo articolo offre qualche esempio e spera di stimolare una discussione proficua.", "article_title": "Verso il trattamento automatico della tradizione manoscritta del liber di Catullo", "authors": [{"given": "Susanna", "family": "Bertone", "affiliation": [{"original_name": "Università di Parma", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Giovanni", "family": "Grandi", "affiliation": [{"original_name": "Università di Parma", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Alessandro", "family": "Bettoni", "affiliation": [{"original_name": "Università di Parma", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Francesco", "family": "Cavalli", "affiliation": [{"original_name": "Università di Parma", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Bologna: AlmaDL", "date": "2018-11-30", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}