{"url": "https://umanisticadigitale.unibo.it/article/view/7288", "identifier": {"string_id": "10.6092/issn.2532-8816/7288", "id_scheme": "DOI"}, "abstract": "La Ricerca, finalizzata alla costruzione di una bibliografia italiana delle scritture fuori dal canone del Novecento, consta di un sistema di tabelle che ricostruiscono un quadro di presenze atipiche nel panorama letterario del Novecento. Le fonti utilizzate per la ricerca sono molteplici: SBN, InternetCulturale, AIB, risorse di Istituti di Ricerca internazionali, oltre a Google-books per rintracciare informazioni o disambiguare dati controversi. La costruzione della bibliografia in formato elettronico ha dunque condotto a ripensare la strutturazione dei dati bibliografici al fine di ottenere il massimo grado di leggibilità e di chiarezza della cospicua mole di dati catalogata, ma anche la massima permeabilità ed adattamento dei dati grezzi immessi nel database. Seguendo lo schema della “scheda di autorità” proposto da SBN, per ogni autore/autrice il data base bibliografico contiene di prassi la dichiarazione delle fonti utilizzate sotto forma di link attivi, strumento essenziale per validare l'attendibilità delle fonti. La ricostruzione della bibliografia delle opere ha implicato inoltre la selezione non solamente della prima attestazione a stampa di ogni opera, ma delle nuove edizioni successive. Con tale ricerca è stato ripensato il concetto stesso di bio-bibliografia delle opere del Novecento, attualizzandone scopi e architettura, riflettendo infine sulle specificità introdotte dalle Digital Humanities.", "article_title": "Un secolo di scritture fuori dal canone: la bibliografia come modello informatico per la ricerca", "authors": [{"given": "Alessia", "family": "Scacchi", "affiliation": [{"original_name": "Università di Roma \"La Sapienza\"", "normalized_name": "Sapienza University of Rome", "country": "Italy", "identifiers": {"ror": "https://ror.org/02be6w209", "GRID": "grid.7841.a"}}]}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}