{"url": null, "identifier": {"string_id": null, "id_scheme": null}, "abstract": " Data visualization has rapidly become a standard approach to interrogating and understanding the world around us in domains that extend beyond the technical and scientific to arts, communications and services. In business settings the Data Scientist has become a recognized and valued role . Journalism has re-oriented itself around data-driven storytelling as a potential saviour for an industry in peril . Governments are moving to more data-driven decision making, publishing open data portals and pondering visualization as an opportunity for citizen participation . This journal itself has numerous examples that use visualization tools and techniques within the digital humanities as a tool for exploration  . This boom in attention has led large new populations of learners into the field. Formal educational settings have rushed to create new approaches and introductions to this content, but often they fall back on traditional approaches to things such as scientific charting and graphing  . Many view data visualization as a new technology, which runs the risks of replicating old approaches without acknowledging the unique affordances and domains that data visualization relies upon. Data visualization is not simply another technology to integrate into education. It is visual argument and persuasion, far more closely associated with rhetoric and writing than spreadsheets . In this paper we present novel approaches to learning technologies and activities, focused on novice learners entering the field of data driven storytelling. We begin with a deeper dive into the problems we see with introducing new learners into a field characterized by inequality, continue with a discussion of approaches for introducing technologies to education, and summarize the inspirational pedagogies we build on. We then offer some design principles and three activities as examples of the concept of creative data literacy. We assert that creative approaches grounded in constructionist educational theories are necessary to empower non-technical learners to be able to tell stories and argue for change with data. ", "article_title": "Creative Data Literacy: A Constructionist Approach to Teaching Information Visualization ", "date": "2018-01-01", "volume": "012", "issue": "4", "authors": [{"given": "Catherine", "family": "D'Ignazio", "affiliation": [{"original_name": "Emerson College", "normalized_name": "Emerson College", "country": "United States", "identifiers": {"ror": "https://ror.org/011xz5b94", "GRID": "grid.418810.4"}}]}, {"given": "Rahul", "family": "Bhargava", "affiliation": [{"original_name": "Massachusetts Institute of Technology", "normalized_name": "Massachusetts Institute of Technology", "country": "United States", "identifiers": {"ror": "https://ror.org/042nb2s44", "GRID": "grid.116068.8"}}]}], "keywords": ["data literacy", "constructionism", "constructivism", "big data", "pedagogy", "data visualization"], "journal_title": "Digital Humanities Quarterly", "ISSN": [{"value": "1938-4122", "type": "electronic"}]}