{"url": "http://www.jstor.org/stable/30204841", "identifier": {"string_id": "10.2307/30204841", "id_scheme": "DOI"}, "abstract": "Classification in music analysis involves the segmentation of a music piece and the categorisation of the segments depending on similarity-based criteria. In this paper we investigate, based on a formal approach, how variations in the representation of the musical segments and in the categorisation algorithm influence the outcome of the classification. More specifically, we vary the choice of features describing each segment, the way these features are represented, and the categorisation algorithm. At the same time, we keep the other parameters, that is the overall model architecture, the music pieces, and the segmentation, fixed. We show that the choice and representation of the features, but not the specific categorisation algorithm, have a strong impact on the obtained analysis. We introduce a distance function to compare the results of algorithmic and human classification, and we show that an appropriate choice of features can yield results that are very similar to a human classification. These results allow an objective evaluation of different approaches to music classification in a uniform setting.", "article_title": "Investigating the Influence of Representations and Algorithms in Music Classification", "authors": [{"given": "Karin", "family": "Höthker", "affiliation": [{"original_name": "Institutfiir Logik, Komplexitit und Deduktionssysteme, Universitit Karlsruhe", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Dominik", "family": "Hörnel", "affiliation": [{"original_name": "Institutfiir Logik, Komplexitit und Deduktionssysteme, Universitit Karlsruhe", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Christina", "family": "Anagnostopoulou", "affiliation": [{"original_name": "Faculty of Music, University of Edinburgh", "normalized_name": "University of Edinburgh", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01nrxwf90", "GRID": "grid.4305.2"}}]}], "publisher": "Springer", "date": "2001-01-01", "keywords": null, "journal_title": "Computers and the Humanities", "volume": "35", "issue": "1", "ISSN": [{"value": "00104817", "type": "print"}]}