{"url": "http://computerphilologie.digital-humanities.de/jg00/richter/richter.html", "identifier": {"string_id": null, "id_scheme": null}, "abstract": "The project of a new, historical-critical edition of the entire corpus of letters written by Goethe has been a desideratum of German Studies research for decades. A total of more than 14.700 letters by Goethe to more than 1400 different correspondents, excluding official correspondence, have survived. Various particulars in part four of the Weimar Edition (which appeared between 1887 and 1912 and contains the only thorough academic edition of Goethe letters to date) have to be revised. More than 2.000 letters were published incompletely, while about 300 letters are not yet available in print. Besides a full presentation of the letters, there are two other strong arguments in favour of a revised and enlarged edition: improving both the chronology and the annotation of the letters in the Weimar Edition. As an essential preparatory work transmissions of manuscripts and prints of all Goethe letters were brought together in a database. In this complete index are noted all manuscripts, drafts, and contemporary copies of Goethe letters which have survived. It comprises over 15.200 records. In addition to the Goethe and Schiller Archives, where about 20.000 manuscripts of Goethe letters, including drafts and copies, are held, about 200 other libraries, archives, and private owners all over the world were contacted for materials. The database for the electronic index of transmissions of all Goethe letters is published on the internet now and is accessible to all users.", "article_title": "ZUR INTERNETVERÖFFENTLICHUNG. DER DATENBANK: JOHANN WOLFGANG GOETHE. REPERTORIUM SÄMTLICHER BRIEFE 1764-1832. HG. V. DER STIFTUNG WEIMARER KLASSIK/GOETHE- UND SCHILLER-ARCHIV", "authors": [{"given": "Elke", "family": "Richter", "affiliation": [{"original_name": "Stiftung Weimarer Klassik/Goethe- und Schiller-Archiv, Weimar", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": null, "date": "2000-10-01", "keywords": null, "journal_title": "Jahrbuch für Computerphilologie", "volume": null, "issue": null, "ISSN": [{"value": null, "type": null}]}