[
    {
        "title": "Finding and Interpreting Arguments: An Important Challenge for Humanities Computing and Scholarly Practice",
        "authors-affiliation": "Andrew Ravenscroft, Cass School of Education and Communities, University of East London, UK; Colin Allen, History and Philosophy of Science, University of Pittsburgh, USA; Philosophy, Xi’an Jiaotong University, Xi’an, China",
        "abstract": " Skillful identification and interpretation of arguments is a cornerstone of learning, scholarly activity and thoughtful civic engagement. These are difficult skills for people to learn, and they are beyond the reach of current computational methods from artificial intelligence and machine learning, despite hype suggesting the contrary. In previous work, we have attempted to build systems that scaffold these skills in people. In this paper we reflect on the difficulties posed by this work, and we argue that it is a serious challenge which ought to be taken up within the digital humanities and related efforts to computationally support scholarly practice. Network analysis, bibliometrics, and stylometrics, essentially leave out the fundamental humanistic skill of charitable argument interpretation because they touch very little on the     meanings embedded in texts. We present a problematisation of the design space for potential tool development, as a result of insights about the nature and form of arguments in historical texts gained from our attempt to locate and map the arguments in one corner of the Hathi Trust digital library. "
    },
    {
        "title": "Reading the ",
        "authors-affiliation": "Peter Broadwell, Center for Interdisciplinary Research, Stanford University; Jack W. Chen, University of Virginia; David Shepard, Scholarly Innovation Lab, UCLA",
        "abstract": "  The present paper addresses the problem of literary history as a problem of data comprehensiveness and selection, seeking not to resolve the impossibility of literary historical narrative, but to reframe it through a computational perspective. Our focus is on the "
    },
    {
        "title": "Decoupling Quality Control and Publication: The Digital Latin Library and the Traveling Imprimatur.",
        "authors-affiliation": "Samuel J. Huskey, University of Oklahoma; Jeffrey C. Witt, Loyola University Maryland",
        "abstract": " With "
    },
    {
        "title": "Changes in Lyrical and Hit Diversity of Popular U.S. Songs 1956-2016",
        "authors-affiliation": "Peter Meindertsma, Department of Language Technology - Computational Linguistics, University of Groningen, Netherlands",
        "abstract": "  To examine changes in the diversity of popular songs over time, I have analyzed the lyrics of 99% of all songs sung in English that have appeared on the U.S. Billboard Hot 100 chart from 1956 up to and including 2016 (n=27.108). I have found the number of songs that reached the Hot 100 per year more than halved between 1966 and 2002, which indicates a loss in diversity. I have also found that the variation of valence (or level of pleasantness) in the songs’ lyrics and the variation of a sampled Type Token ratio (an indicator for lexical complexity) decreases over time. This indicates that lyrics of popular songs become more similar and again signify a loss of diversity. "
    },
    {
        "title": "Digital Collaborations: A Survey Analysis of Digital Humanities Partnerships Between Librarians and Other Academics",
        "authors-affiliation": "Jessica Wagner Webster, Baruch College, City University of New York",
        "abstract": "  The present study will investigate the perceptions of information professionals about their role in the work of digital humanities scholars, as well as the perceptions of digital humanities scholars on the role of information professionals in their research. While other scholarly literature has considered collaborations between these groups via surveys or interviews with small project teams, the present study will provide a large-scale analysis of collaborations using survey responses from more than 500 scholars, librarians, and archivists. Questions sought to determine the extent to which these groups collaborate with one another on project teams; how these collaborations unfold and who initiates them; whether IPs have begun to adjust and adapt their work to support specific DH projects, or to make their content more appealing and easy for potential future DH projects; and what administrative hurdles are faced during the collaboration. The survey also address how information professionals and DH scholars view the success of the collaboration after completing their work, and whether they intend to collaborate in future. To conclude, the article will consider what these responses tell us about how best to support all members of these collaborations. "
    }
]