[
    {
        "title": "Developing a Process-Oriented, Inclusive Pedagogy: At the Intersection of Digital Humanities, Second Language Acquisition, and New Literacies",
        "authors-affiliation": "Melinda A. Cro, Kansas State University; Sara K. Kearns, Kansas State University",
        "abstract": "  This article describes a collaboration between two tenured faculty members (one in the library and one in a department of modern languages) at a large, land-grant institution who sought to introduce a mixed undergraduate and graduate seminar in French literature to DH methods in the second-language classroom culminating in a digital mapping project. Lacking explicit previous training in DH, faculty drew on second language (L2) pedagogy, new literacies, and DH pedagogy to develop an inclusive approach to course design and implementation. The approach focused on students’ development of agency and authority as rising scholars while underscoring conceptions of labor and professional development in the humanities. There is limited scholarship addressing implementing DH in a L2 classroom. However, implementing a combined approach where one pedagogy influenced the other afforded the opportunity to critically consider the role of multilingualism and multiculturalism in a global, open DH context. We adopted this approach in concert with lessons drawn from theories of information literacy and new literacies. This transdisciplinary method encouraged careful consideration of design and implementation given that how information is processed, acquired, and communicated are key concerns in both L2 classrooms and new literacies. "
    },
    {
        "title": "Episodic Theater and the Digital Text: Editing the Traveling Players’ ",
        "authors-affiliation": "Kevin Chovanec, Christian Brothers University",
        "abstract": " This essay discusses the process of editing a rather simple playtext, the English traveling players' "
    },
    {
        "title": "Erasure, Misrepresentation and Confusion: Investigating JSTOR Topics on Women’s and Race Histories",
        "authors-affiliation": "Sharon Block, UC-Irvine",
        "abstract": "  This article investigates the topic labeling system of a widely used full-text academic publication database, JSTOR, particularly in reference to colonial North American history scholarship. Using insights developed by critical algorithm and critical archival studies, it analyzes how JSTOR’s topics repeatedly misrepresent and erase work in women’s, African diasporic/African American, and Native American and settler colonial histories. The article discusses concerns over the power of metadata, the need for transparent and domain-expert-involved indexing processes, and digital providers’ responsibilities to accurately categorize scholars’ work. It particularly focuses on the potentially disproportionate harm done to traditionally marginalized fields of study through seemingly racist or sexist topical labeling that impedes knowledge discovery. "
    },
    {
        "title": "The Push and Pull of Digital Humanities: Topic Modeling the     “What is digital humanities?” Genre",
        "authors-affiliation": "Elizabeth Callaway, University of Utah; Jeffrey Turner, University of Utah; Heather Stone, TETON Sports; Adam Halstrom, University of Utah",
        "abstract": "  In this paper we run a topic model on over 300 article-length pieces from the extended bibliography of Melissa Terras, Juliette Nyhan, and Edward Vanhoutte’s edited collection "
    },
    {
        "title": "Editorializing the Greek Anthology: The palatin manuscript as a collective imaginary",
        "authors-affiliation": "Marcello Vitali-Rosati, University of Montreal; Servanne Monjour, University of Montreal; Joana Casenave, University of Montreal; Elsa Bouchard, University of Montreal; Margot Mellet, University of Montreal",
        "abstract": "  The Palatine Anthology (PA) Project, coordinated by the Canada Research Chair on digital textualities directed by Marcello Vitali-Rosati, collaborates with several international partners, including Italian and French schools, in order to establish a collaborative critical digital edition and a multilingual translation of all the PA's epigrams. In particular, our project aims to further develop this edition of the PA, thereby demonstrating the philological, editorial and pedagogic challenges involved in compiling the diverse fragments of this collection of Greek epigrams. Since its discovery in 1606 by Claude Saumaise in the Palatina Library of Heidelberg in Germany , the PA manuscript (Codex Palatinus 23) has considerably influenced literature and art. As we know it today, the Anthology is the result of successive compilations, modifications, additions, and rearrangements by the compilers. Meleager's collection is a collection of epigrams compiled in the first century B.C., which represents the original source of what is known today as the Greek Anthology . This collection, called "
    },
    {
        "title": "A multi-dimensional ontology-based analysis of the Censorship of Hebrew Manuscripts",
        "authors-affiliation": "Gila Prebor, Department of Information Science Bar-Ilan University, Ramat Gan, 52900, Israel; Maayan Zhitomirsky-Geffet, Department of Information Science Bar-Ilan University, Ramat Gan, 52900, Israel; Isaac Miller, Department of Information Science Bar-Ilan University, Ramat Gan, 52900, Israel",
        "abstract": "  In this study, we present the first large-scale quantitative analysis of a corpus of censored historical Hebrew manuscripts that have survived through the ages. A new multi-dimensional ontology-based approach was applied to explore the geographic, temporal, actor- and subject-based distribution of censorship events. We adopted an ontology-based approach to apply statistical analysis on the metadata of censored Hebrew manuscripts for estimating the scope and quantifying the extent of the known facts on the censorship activity and its various characteristics over the years. In addition, we revealed some previously unknown phenomena and trends. Particularly, we analysed the relationship of censorship on other types of events in manuscripts’ lifecycle and compared the distribution of censored vs. non-censored manuscripts in different dimensions. We also devised a set of rules to complete the missing locations of over 50% of censorship events, which has substantially changed the big picture of spatial distribution of censorship activity. From the temporal perspective our findings demonstrate that censorship was conducted in “waves” and there was a decrease in the creation of new manuscripts in periods of high censorship activity. Certain subjects, such as Kabbalah and Philosophy were censored significantly more than others, and the locations and script types’ distribution in censored manuscripts differs from the non-censored manuscripts. "
    },
    {
        "title": "Medieval manuscript descriptions and the Semantic Web: analysing the impact of ",
        "authors-affiliation": "Anna Bellotto, University of Vienna",
        "abstract": "  Semantic Web technologies provide the ability to more effectively connect and integrate structured data by disclosing their intended meaning and therefore making explicit their description, context and provenance. Thanks to their nature, Semantic Web technologies have produced insights into the challenges associated with standardizing metadata for manuscripts. Scholars depend on highly specific catalogue records in order to understand a manuscript and raise research questions which take into account either its physicality or its nature of “evidence for all aspects of         life in the medieval period”. However, the heterogeneity of codicological-paleographical records in terms of metadata and terminology is weakening the integration and interoperability within the community. Ontologies in particular have been evaluated as a clever approach towards a better communication. The employment of knowledge representation in the field of medieval manuscript descriptions is still narrow, though. Against the state of the art, this paper attempts to add some evidence: it analyses the impact of a top-level ontology designed for modelling cultural objects, namely "
    }
]