[
    {
        "year": "2004",
        "num_of_journals": 3,
        "list_of_journals": [
            "Literary and Linguistic Computing",
            "Computers and the Humanities",
            "Jahrbuch für Computerphilologie"
        ],
        "num_of_articles": 60,
        "list_of_articles": [
            "Medieval Manuscripts, Hypertext and Reading. Visions of Digital Editions",
            "Editorial Theory and Practice in Flanders and the Centre for Scholarly Editing and Document Studies",
            "How Reproductive is a Scholarly Edition?",
            "Monkey Business--or What is an Edition?",
            "Presentational and Representational Issues in Correspondence Reconstruction and Sorting",
            "Philology Meets Text Encoding in the New Scholarly Edition of Henrik Ibsen's Writings",
            "Parallel Views: Multi-level Encoding of Medieval Nordic Primary Sources",
            "An Introduction to the TEI and the TEI Consortium",
            "Computing Medieval Primary Sources from the Vadstena Monastery: Arguments for the Primary Source Text",
            "Frequency and Function of Characters Used in the Bangla Text Corpus",
            "As It Almost Was: Historiography of Recent Things",
            "King John Divided",
            "Discriminating the Registers and Styles in the Modern Greek Language-Part 1: Diglossia in Stylistic Analysis",
            "Discriminating the Registers and Styles in the Modern Greek Language-Part 2: Extending the Feature Vector to Optimize Author Discrimination",
            "Turning It All Upside Down . . . Imagining a distributed digital audiovisual archive",
            "Modelling Features of Characters: Some Digital Ways to Look at Names in Literary Texts",
            "The Cultural Shaping of ICTs within Academic Fields: Corpus-based Linguistics as a Case Study",
            "Enhancing Visual Resources for Searching and Retrieval--Is Content-based Image Retrieval a Solution?",
            "The Visualization of Spatial Data in the Humanities",
            "City Histories Revealed",
            "Reading Room(s): Building a National Archive in Digital Spaces and Physical Places",
            "The Elements of Drawing",
            "Downs and Acrosses: Textual Markup on a Stroke Level",
            "Digital Resources for Practice-based Research: The New Comedy Masks Project",
            "Morphological Analysis of the Qur'an",
            "Testing Burrows's Delta",
            "Delta Prime?",
            "Sentence-length and Authorship Attribution: the Case of Oliver Goldsmith",
            "Corpus Linguistics and South Asian Languages: Corpus Creation and Tool Development",
            "Representing Multiple Pathways of Textual Flow in the Greek Manuscripts of the Letter of James Using Reduced Median Networks",
            "Detecting Collaborations in Text: Comparing the Authors' Rhetorical Language Choices in the Federalist Papers",
            "An Analysis of Verb Subcategorization Frames in Three Special Language Corpora with a View towards Automatic Term Recognition",
            "Change of Writing Style with Time",
            "Hypertext Writing Profiles and Visualisation",
            "On the Ownership of Text",
            "Semantic Roles as Slots in OIL Ontologies",
            "The Development of Early Computer-Assisted Writing Instruction (1960-1978): The Double Logic of Media and Tools",
            "Extracting Multilingual Lexicons from Parallel Corpora",
            "Intertextual Encoding in the Writing of Women's Literary History",
            "Semantic Variation in Idiolect and Sociolect: Corpus Linguistic Evidence from Literary Texts",
            "Bitext Generation through Rich Markup",
            "Article: Collating Texts Using Progressive Multiple Alignment",
            "Uncovering Text-Music Connections with a Relational Database: Towards an Objective Measurement of Melodic Pitch Diversity in Relation to Literary Themes in Bach's Church Cantata Recitatives",
            "Networked Collaborative Learning in the Study of Modern History and Literature",
            "Film as \"Explicador\" for Hypertext",
            "Pitfalls in Corpus Research",
            "Automatic Acquisition and Expansion of Hypernym Links",
            "Experimenting with a Question Answering System for the Arabic Language",
            "Evaluation of Linguistic Features for Word Sense Disambiguation with Self-Organized Document Maps",
            "Multiple Heuristics and Their Combination for Automatic WordNet Mapping",
            "LITERARISCHES LEBEN. DATENBANK ZU DEN DEUTSCHSPRACHIGEN LäNDERN 1945-2000. Projektbericht http://www.literarischesleben.uni-goettingen.de",
            "AUTOREN ALS VERLEGER. DIE ZUKUNFT DER WISSENSCHAFTLICHEN KOMMUNIKATION?",
            "GOTTFRIED KELLERS STUDIENBÜCHER - ELEKTRONISCH EDIERT",
            "DOCUMENT TYPE DEFINITIONS ZUR ERSCHLIEßUNG VON GATTUNGEN DES BAROCK IM INTERNET. EIN PROJEKT AN DER HERZOG AUGUST BIBLIOTHEK WOLFENBÜTTEL",
            "»INSELN IM MEER DES BELIEBIGEN«. ARCHITEKTUR UND IMPLEMENTIERUNG EINES INTERNETPORTALS DEUTSCH-JÜDISCHE PERIODIKA",
            "PSEUDO-DOKUMENTATIONEN: ZUM VERSCHWIMMEN DER GRENZE ZWISCHEN REALITÄT UND FIKTION IN DEN MEDIEN",
            "ERFAHRUNGEN MIT DER VIRTUELLEN WISSENSCHAFT. VOM SERVER FRÜHE NEUZEIT ZUM HISTORICUM.NET",
            "DAS GOETHEZEITPORTAL – EIN WERKSTATTBERICHT",
            "TEXTSTATISTISCHE UNTERSUCHUNGEN AN MITTELHOCHDEUTSCHEN TEXTEN",
            "»WEM DER GROSSE WURF GELUNGEN«... ANSÄTZE EINER HYPERNARRATOLOGIE. DARGESTELLT ANHAND VON SUSANNE BERKENHEGERS HYPERTEXT HILFE!"
        ],
        "articles_journals_ratio": 20
    },
    {
        "year": "2007",
        "num_of_journals": 4,
        "list_of_journals": [
            "Literary and Linguistic Computing",
            "Digital Medievalist",
            "Digital Humanities Quarterly",
            "Jahrbuch für Computerphilologie"
        ],
        "num_of_articles": 41,
        "list_of_articles": [
            "Multivariate Analysis of Finnish Dialect Data An Overview of Lexical Variation",
            "Discovery of Language Resources on the Web: Information Extraction from Heterogeneous Documents",
            "A Statistical Analysis of Editorial Influence and Author Character Similarities in 1990s New Yorker Fiction",
            "Delta for Middle Dutch Author and Copyist Distinction in Walewein",
            "Syntactic Positions of Prepositional Phrases in the History of Chinese: Using the Developing Sheffield Corpus of Chinese for Diachronic Linguistic Studies",
            "Metamorphosis: Remediation in Early English Books Online (EEBO)",
            "Goldsmith's Contributions to the Weekly Magazine",
            "Quantitative Authorship Attribution: An Evaluation of Techniques",
            "Tools for Searching, Annotation and Analysis of Speech, Music, Film and Video A Survey",
            "Language Change Quantification Using Time-separated Parallel Translations",
            "Goldsmith and the Busy Body",
            "Digital Humanities 2006: When Two Became Many",
            "Developing Integrated Editions of Minority Language Dictionaries: The Irish Example",
            "Cross-collection Searching: A Pandora's Box or the Holy Grail?",
            "The Exhibition Problem. A Real-life Example with a Suggested Solution",
            "The Inhibition of Geographical Information in Digital Humanities Scholarship",
            "Killer Applications in Digital Humanities",
            "BE and HAVE: Qualities and Shortcomings",
            "The Identification of Spelling Variants in English and German Historical Texts: Manual or Automatic?",
            "If You Build It Will They Come? The LAIRAH Study: Quantifying the Use of Online Resources in the Arts and Humanities through Statistical Analysis of User Log Data",
            "Zitate per Mausklick? Das Textkorpus zum WORTERBUCH DER BAIRISCHEN MUNDARTEN IN OSTERREICH (WBO) als leistungsstarkes Werkzeug fur die lexikographische Praxis",
            "Interpreting Burrows's Delta: Geometric and Probabilistic Foundations",
            "Corpus Tools and Methods, Today and Tomorrow: Incorporating Linguists' Manual Annotations",
            "Working Papers, Open Access, and Cyber-infrastructure in Classical Studies",
            "Palaeography and Image-Processing: Some Solutions and Problems",
            "Interpretative Quests in Theory and Pedagogy",
            " Webs of Significance: The Abraham Lincoln Historical Digitization Project, New Technology, and the Democratization of History",
            "Encoding for Endangered Tibetan Texts",
            "Reading Potential: The Oulipo and the Meaning of Algorithms",
            "Somewhere Nearby is Colossal Cave: Examining Will Crowther's Original Adventure in Code and in Kentucky ",
            "All Hope Abandon: Biblical Text and Interactive Fiction",
            "Aporias of the Digital Avant-Garde",
            "A SANE approach to annotation in the digital edition",
            "Die Klagenfurter Ausgabe Robert Musil Historisch-kritisches Edieren am Computer",
            "»A collection, an enormous accumulation of movements and ideas«. Research documentation for the digital edition of the Volledige Werken (Complete Works) of Willem Frederik Hermans",
            "Herstellen von Verknüpfungen – Zur elektronischen Edition und zum elektronischen Edieren von Immanuel Kants Schriften und Vorlesungen",
            "Mehr XML – Die digitalen Projekte an der Berlin-Brandenburgischen Akademie der Wissenschaften.",
            "Homo Deludens – Cheating als methodisches Werkzeug in der Computerspielforschung",
            "The End of the Irrelevant Text: Electronic Texts, Linguistics, and Literary Theory",
            "KUWALU – Motivation und Grundzüge einer computergestützten Umgebung für die literatur- und kulturwissenschaftliche Recherche- und Analysearbeit",
            "Zur Bedeutung der Computertechnik für die Begriffsgeschichte"
        ],
        "articles_journals_ratio": 10.25
    },
    {
        "year": "2008",
        "num_of_journals": 7,
        "list_of_journals": [
            "Literary and Linguistic Computing",
            "Journal on Computing and Cultural Heritage",
            "Digital Medievalist",
            "International Journal of Digital Curation",
            "CH Working Papers",
            "Jahrbuch für Computerphilologie",
            "Digital Humanities Quarterly"
        ],
        "num_of_articles": 70,
        "list_of_articles": [
            "Mining millions of metaphors",
            "More statistical observations on speech lengths in Shakespeare's plays",
            "Assessing frequency changes in multistage diachronic corpora: Applications for historical corpus linguistics and the study of language acquisition",
            "What is transcription?",
            "What's going on?",
            "An evaluation of text classification methods for literary study",
            "Digital visualization as a scholarly activity",
            "The master builders: LAIRAH research on good practice in the construction of digital humanities projects",
            "Expressing complex associations in medieval historical documents: the Henry III Fine Rolls Project",
            "Meaning and mining: the impact of implicit assumptions in data mining for the humanities",
            "'A thing not beginning and not ending': using digital tools to distant-read Gertrude Stein's The Making of Americans",
            "Thinking about interpretation: Pliny and scholarship in the humanities",
            "An algorithm for automated authorship attribution using neural networks",
            "Dante's Monarchia as a test case for the use of phylogenetic methods in stemmatic analysis",
            "Reassessing authorship of the Book of Mormon using delta and nearest shrunken centroid classification",
            "Sampled 3D models for CH applications",
            "Research between natural and cultural history information",
            "The dream of a global knowledge network—A new approach",
            "The preservation, emulation, migration, and virtualization of live electronics for performing arts",
            "Using survival analysis on conservation metadata to benchmark treatment frequency",
            "Islamic geometrical patterns indexing and classification using discrete symmetry groups",
            "Exploring cultural heritage sites through space and time",
            "Semantic fitting and reconstruction",
            "Digital Image Archive of Medieval Music: The evolution of a digital resource",
            "The Inscriptions of Aphrodisias as electronic publication: A user's perspective and a proposed paradigm",
            "The application of network analysis to ancient transport geography: A case study of Roman Baetica",
            "Towards a digital model to edit the different paratextuality levels within a textual tradition",
            "VLMA: A tool for creating, annotating and sharing virtual museum collections",
            "Digital Curation for Science, Digital Libraries, and Individuals",
            "Digital Curation, Copyright, and Academic Research",
            "Scientific Publication Packages – A Selective Approach to the Communication and Archival of Scientific Output",
            "Developing Practical Approaches to Active Preservation",
            "The world is all grown digital.... How shall a man persuade management what to do in such times?",
            "UK Research Funders’ Policies for the Management of Information Outputs",
            "“The Naming of Cats”: Automated Genre Classification",
            "Modelling OAIS Compliance for Disaggregated Preservation Services",
            "Data Curation Standards and Social Science Occupational Information Resources",
            "Digital Archive Policies and Trusted Digital Repositories",
            "PRONOM-ROAR: Adding Format Profiles to a Repository Registry to Inform Preservation Services",
            "Digital Data Preservation for Scholarly Publications in Astronomy",
            "Graduate Curriculum for Biological Information Specialists: A Key to Integration of Scale in Biology",
            "Digital Preservation Theory and Application: Transcontinental Persistent Archives Testbed Activity",
            "Evolving a Network of Networks: The Experience of Partnerships in the National Digital Information Infrastructure and Preservation Program",
            "Toward Distributed Infrastructures for Digital Preservation: The Roles of Collaboration and Trust",
            "Dataset Preservation for the Long Term: Results of the DareLux Project",
            "Curation of Laboratory Experimental Data as Part of the Overall Data Lifecycle",
            "Towards a Theory of Digital Preservation",
            "Challenges and Issues Relating to the Use of Representation Information for the Digital Curation of Crystallography and Engineering Data",
            "Defining File Format Obsolescence: A Risky Journey",
            "Data Documentation Initiative: Toward a Standard for the Social Sciences",
            "Moving Archival Practices Upstream: An Exploration of the Life Cycle of Ecological Sensing Data in Collaborative Field Research",
            "SCOPE: A Scientific Compound Object Publishing and Editing System",
            "‘Grand Theft Archive’: A Quantitative Analysis of the State of Computer Game Preservation",
            "Digital Data Practices and the Long Term Ecological Research Program Growing Global",
            "Sustaining Engineering Informatics: Toward Methods and Metrics for Digital Curation",
            "Migration Performance for Legacy Data Access",
            "The Shakespeare Apocrypha in the Time of Google",
            "A Relational Database Model for Text Encoding",
            "Putting Humpty Together Again: Otto Ege's Scattered Leaves",
            "Toward an Electronic Edition of an Early Modern Assembled Book",
            "Dis-Covering the Early Modern Book: An Experiment in Humanities Computing",
            "Das Projekt Annotierte Bibliographie zur Literaturtheorie – Vorstellung der Datenbank",
            "XML-Technologien als Grundlage dynamischer Textpräsentation. Die digitale Quellenedition Der Zürcher Sommer 1968",
            "Barthes Revisited: Perspectives on Emotion Strategies in Computer Games",
            "Three Views on Corpora: Corpus Linguistics, Literary Computing, and Computational Linguistics",
            "Entwicklung und Einsatz einer TEI-konformen Arbeitsumgebung für die Edition der Dramen von Karl Ferdinand Gutzkow",
            "The Technical Evolution of Vannevar Bush’s Memex ",
            "The Humanities HyperMedia Centre @ Acadia University: An Invitation to Think About Higher Education",
            "As You Can See: Applying Visual Collaborative Filtering to Works of Art",
            "Visualizing Repetition in Text"
        ],
        "articles_journals_ratio": 10
    },
    {
        "year": "2010",
        "num_of_journals": 7,
        "list_of_journals": [
            "Literary and Linguistic Computing",
            "Journal on Computing and Cultural Heritage",
            "Digital Studies/Le champ numérique",
            "International Journal of Digital Curation",
            "International Journal of Humanities and Arts Computing",
            "Journal of Data Mining & Digital Humanities",
            "Digital Humanities Quarterly"
        ],
        "num_of_articles": 71,
        "list_of_articles": [
            "k dixez? A corpus study of Spanish Internet orthography",
            "A comparative study of machine learning methods for authorship attribution",
            "A corpus-based study of lexical periodization in historical Chinese",
            "A 'key to all quotations'? A corpus-based parameter model of intertextuality",
            "Holy smoke: vocalic precursors of phrase breaks in Milton's Paradise Lost",
            "The diary of a public man: a case study in traditional and non-traditional authorship attribution",
            "Developing ODIN: A Multilingual Repository of Annotated Language Data for Hundreds of the World's Languages",
            "The inadequacy of embedded markup for cultural heritage texts",
            "Digital documentation of oral discourse genres",
            "Weigh your words--memory-based lemmatization for Middle Dutch",
            "The effect of author set size and data size in authorship attribution",
            "Lexical bundles and German bibles",
            "Computerized Scansion of Ancient Greek Hexameter",
            "Comparing nearly identical treaty texts: a note on the Treaty of Fort Laramie with Sioux, etc., 1851 and Levenshtein's edit distance metric",
            "Automatically Extracting Typical Syntactic Differences from Corpora",
            "The Corpus of Contemporary American English as the first reliable monitor corpus of English",
            "Digital curiosities: resource creation via amateur digitization",
            "Towards a decision support system for reading ancient documents",
            "How a prototype argues",
            "Library collaboration with large digital humanities projects",
            "Testing NINES",
            "Appropriate Use Case modeling for humanities documents",
            "Visualization as a research tool for dialect geography using a geo-browser",
            "The Regressive Imagery Dictionary: A test of its concurrent validity in English, German, Latin, and Portuguese",
            "Improved color acquisition and mapping on 3D models via flash-based photography",
            "A taxonomy of visualization strategies for cultural heritage applications",
            "PEVIAR",
            "Image and pattern analysis for the determination of the method of drawing celebrated thera wall-paintings circa 1650 B.C.",
            "ArcheoTUI—Driving virtual reassemblies with tangible 3D interaction",
            "Ancient Chinese zither (guqin) music recovery with support vector machine",
            "Dynamic shading enhancement for reflectance transformation imaging",
            "Modeling visitors' profiles",
            "Prospero and Plagiarism: Early Modern Studies and the rise of Wikipedia",
            "Designing Digital Preservation Solutions: A Risk Management-Based Approach",
            "Understanding the Information Requirements of Arts and Humanities Scholarship",
            "Towards Interoperable Preservation Repositories: TIPR",
            "The Use of Quality Management Standards in Trustworthy Digital Archives",
            "Keeping the Game Alive: Evaluating Strategies for the Preservation of Console Video Games",
            "A Framework for Software Preservation",
            "Using a Core Scientific Metadata Model in Large-Scale Facilities",
            "Chronopolis Digital Preservation Network",
            "Bit Preservation: A Solved Problem?",
            "Grammar-Based Recognition of Documentary Forms and Extraction of Metadata",
            "Assisted Emulation for Legacy Executables",
            "Reconstruction of Kyoto of the Edo era based on arts and historical documents: 3D urban model based on historical GIS data",
            "Unfolding the landscape drawing method of Rakuchū Rakugai Zu screen paintings in a GIS environment",
            "Thomas Gray, Samuel Taylor Coleridge and geographical information systems: A literary GIS of two Lake District tours",
            "Prehistoric resource procurement in the central Mesa Verde region: A study of human mobility and social interactions using GIS",
            "Visualisation in archaeology: An assessment of modelling archaeological landscapes using scientific and gaming software",
            "Digitising the Middle Ages: The experience of the ‘Lands of the Normans’ project",
            "National Historical Geographical Information System as a tool for historical research: Population and railways in Wales, 1841–1911",
            "Visible Past: A location and attention aware learning and discovery environment for digital humanities",
            "Exploring informed virtual sites through Michel Foucault's heterotopias",
            "The British lsles Network of Expert Centres: A collaborative approach to the digital arts and humanities",
            "Node similarity as a basic principle behind connectivity in complex networks",
            "Ontologies and Logic Reasoning as Tools in Humanities?",
            "Conjectural Criticism: Computing Past and Future Texts",
            "The Potential and Problems in using High Performance Computing in the Arts and Humanities: the Researching e-Science Analysis of Census Holdings (ReACH) Project.",
            "e-Science for Medievalists: Options, Challenges, Solutions and Opportunities",
            "Service-Oriented Software in the Humanities: A Software Engineering Perspective",
            "The e Prefix: e-Science, e-Art & the New Creativity",
            " It May Change My Understanding of the Field: Understanding Reading Tools for Scholars and Professional Readers",
            "Locating Grid Technologies: Performativity, Place, Space: Challenging the Institutionalized Spaces of e-Science",
            "The Digital Future is Now: A Call to Action for the Humanities",
            "Grid-enabling Humanities Datasets",
            "The Landscape of Digital Humanities",
            "Crafting the User-Centered Document Interface: The Hypertext Editing System (HES) and the File Retrieval and Editing System (FRESS)",
            "Digital Encoding as a Hermeneutic and Semiotic Act: The Case of Valerio Magrelli",
            "Determining Value for Digital Humanities Tools: Report on a Survey of Tool Developers ",
            "History, People, and Informatics: A Conversation between Sharon Irish and Wendy Plotkin",
            "Twisty Little Passages Almost All Alike: Applying the FRBR Model to a Classic Computer Game"
        ],
        "articles_journals_ratio": 10.142857142857142
    },
    {
        "year": "2000",
        "num_of_journals": 4,
        "list_of_journals": [
            "Literary and Linguistic Computing",
            "Computers and the Humanities",
            "CH Working Papers",
            "Jahrbuch für Computerphilologie"
        ],
        "num_of_articles": 64,
        "list_of_articles": [
            "Pour une lecture ouverte du texte electronique",
            "Towards an electronic edition of James Joyce's Ulysses",
            "The Perseus Project: a digital library for the humanities",
            "The text of the New Testament and computers: The International Greek New Testament Project",
            "Editing the Greek New Testament on the threshold of the twenty-first century",
            "The one text and the many texts",
            "Editing and genealogical studies: the New Testament",
            "Some bits of good news: computer collation of the old Slavic New Testament and Tatian's gospel harmony",
            "Scholarly editing in The Netherlands",
            "Progetti relativi a testi elettronici a Roma, accademia dei lincei e Universita La Sapienza",
            "Encoding old Norse/Icelandic primary sources using TEI-conformant SGML",
            "Strategies and tools for textual scholarship: the Tubingen system of text processing programs (TUSTEP)",
            "Co-occurrence patterns and lexical acquisition in ancient Greek texts",
            "Morphological representation in PC-based text processing systems",
            "Edward III",
            "Computational stylistics using artificial neural networks",
            "Bringing computing into the Middle Ages: the making of sybils!, a multimedia CD-ROM",
            "Out-of-vocabulary rate reduction through dispersion-based lexicon acquisition",
            "A PC-PATR-Based syntactic description of modern Greek",
            "A multi-level approach to the detection of second language learners errors",
            "Measuring vocabulary diversity using dedicated software",
            "Exploiting fuzzy tree fragment queries in the investigation of parsed corpora",
            "A new agenda for corpus linguistics - working with all of the world's languages",
            "The construction of a corpus of spoken Sylheti",
            "Bangla pronouns - a corpus based study",
            "A practical method for deriving phonetic and linguistic data for minority languages",
            "ORCHID: building linguistic resources in Thai",
            "Framework and Results for English SENSEVAL",
            "Senseval/Romanseval: The Framework for Italian",
            "Tagger Evaluation Given Hierarchical Tag Sets",
            "Peeling an Onion: The Lexicographer's Experience of Manual Sense-Tagging",
            "Combining Supervised and Unsupervised Lexical Knowledge Methods for Word Sense Disambiguation",
            "Word Sense Disambiguation Using Automatically Acquired Verbal Preferences",
            "A Topical/Local Classifier for Word Sense Identification",
            "Word Sense Disambiguation by Information Filtering and Extraction",
            "Large Scale WSD Using Learning Applied to SENSEVAL",
            "Word Sense Disambiguation Using the Classification Information Model: Experimental Results on the SENSEVAL Workshop",
            "Senseval: The CL Research Experience",
            "Selecting Decomposable Models for Word-Sense Disambiguation: The \"Grling-Sdm\" System",
            "Simple Word Sense Discrimination: Towards Reduced Complexity",
            "Memory-Based Word Sense Disambiguation",
            "Hierarchical Decision Lists for Word Sense Disambiguation",
            "Using Semantic Classification Trees for WSD",
            "ROMANSEVAL: Results for Italian by SENSE",
            "Consistent Criteria for Sense Distinctions",
            "Cross-Lingual Sense Determination: Can It Work?",
            "Is Word Sense Disambiguation Just One More NLP Task?",
            "Tailor-Made or Off-the-Peg? Virtual Courses in the Humanities",
            "From Concordances to Subject Portals: Supporting the Text-Centred Humanities Community",
            "Electrifying the Canon: The Impact of Computing on Classical Studies",
            "Wag the Dog? Online Conferencing and Teaching",
            "Computers and Resource-Based History Teaching: A UK Perspective",
            "Spatial Distribution of Rural Social Strata: Using Digitised Maps in Historical Research",
            "Using Constraint Logic Programming to Analyze the Chronology in \"A Rose for Emily\"",
            "An Architecture and Query Language for a Federation of Heterogeneous Dictionary Databases",
            "Pedagogy in the Electronic English Classroom: A Cluster",
            "The \"Anna Jameson and her Friends Database\": Mapping Anna Jameson's Associative Links with the Victorian Intellectual Community",
            "Chrétien de Troyes sur le Web: présentation, analyse et interprétation des manuscrits d'Yvain ou le Chevalier au Lion",
            "Legitimizing Electronic Scholarly Publication: A Discursive Proposal",
            "Sexism And Language : What Can The Web Teach Us ?",
            "EIN »HAUSBUCH«[1] FÜR ALLE? - DAS DEUTSCHE WÖRTERBUCH DER BRÜDER GRIMM AUF CD-ROM UND IM INTERNET",
            "HYPERTEXT, MULTIMEDIA, HYPERMEDIA: ERGONOMISCHE ASPEKTE",
            "FASELEI ONLINE. VORÜBERLEGUNGEN ZU EINER INTERNET-PUBLIKATION VON BETTINE VON ARNIMS WERK",
            "ZUR INTERNETVERÖFFENTLICHUNG. DER DATENBANK: JOHANN WOLFGANG GOETHE. REPERTORIUM SÄMTLICHER BRIEFE 1764-1832. HG. V. DER STIFTUNG WEIMARER KLASSIK/GOETHE- UND SCHILLER-ARCHIV"
        ],
        "articles_journals_ratio": 16
    },
    {
        "year": "2018",
        "num_of_journals": 17,
        "list_of_journals": [
            "Digital Scholarship in the Humanities",
            "Journal on Computing and Cultural Heritage",
            "International Journal for Digital Art History",
            "Digital Philology: A Journal of Medieval Cultures",
            "Digital Medievalist",
            "Digital Studies/Le champ numérique",
            "Zeitschrift für digitale Geisteswissenschaften",
            "Journal of the Japanese Association for Digital Humanities",
            "Journal of Cultural Analytics",
            "International Journal of Digital Curation",
            "Digitális Bölcsészet",
            "International Journal of Humanities and Arts Computing",
            "Frontiers in Digital Humanities",
            "Umanistica Digitale",
            "Journal of Digital Archives and Digital Humanities",
            "Journal of Data Mining & Digital Humanities",
            "Digital Humanities Quarterly"
        ],
        "num_of_articles": 252,
        "list_of_articles": [
            "‘Making such bargain’: Transcribe Bentham and the quality and cost-effectiveness of crowdsourced transcription1",
            "An authorship analysis of the Jack the Ripper letters",
            "What is Elena Ferrante? A comparative analysis of a secretive bestselling Italian writer",
            "Christopher Marlowe: Hype and Hoax",
            "A web application for exploring primary sources: The DanteSources case study",
            "Parsa: An open information extraction system for Persian",
            "Rho-grams and rho-sets: Significant links in the web of words",
            "Uncovering gender bias in newspaper coverage of Irish politicians using machine learning",
            "Attesting similarity: Supporting the organization and study of art image collections with computer vision",
            "Quantitative methods for the analysis of medieval calendars",
            "Digital Humanities in Poland from the Perspective of the Historical Linguist of the Polish Language: Achievements, Needs, Demands",
            "Visualizing the knowledge domain of embodied language cognition: A bibliometric review",
            "From a distance ‘You might mistake her for a man’: A closer reading of gender and character action in Jane Eyre, The Law and the Lady, and A Brilliant Woman1",
            "Vernacularization in Medieval Chinese: A quantitative study on classifiers, demonstratives, and copulae in the Chinese Buddhist Canon",
            "Evaluation of text representation schemes and distance measures for authorship linking",
            "Research report on the adequacy of SciE-Lex as a lexicographic tool for the writing of biomedical papers in English",
            "Is Starnone really the author behind Ferrante?",
            "Development of technological ecosystems for cultural analysis: The case of Expofinder system and art exhibitions",
            "Needs analysis for an ESP case study developed for the context-aware ubiquitous learning environment",
            "Literary intelligence analysis of novel protagonists’ personality traits and development",
            "Genre-based writing instruction blended with an online writing tutorial system for the development of academic writing",
            "Forensic stylometry",
            "On comparing and clustering the alternatives of love in Saadi's lyric poems (Ghazals)",
            "Discourse lexicon induction for multiple languages and its use for gender profiling",
            "Autonomous learning of productive vocabulary in the EFL context: An action research approach",
            "Distinguishing properties of SMS and Twitter in Indonesian: A contrastive study",
            "Evaluation software for effects produced by MOOC in mediums with different linguistically levels",
            "Statistical analysis about the order of Quran’s revelation",
            "‘he liked to read, write, and whatch televishon’—The APU Writing and Reading Corpus (1979–1988)",
            "Information infrastructure of contemporary humanities and the digital humanities development as a cause of creating new information barriers. A Polish case",
            "Digital tools in the humanities: Some fundamental provocations?",
            "Katibeh: A Persian news summarizer using the novel semi-supervised approach",
            "Accessing Russian culture online: The scope of digitization in museums across Russia",
            "Authorship verification of disputed Hadiths in Sahih al-Bukhari and Muslim",
            "A sentiment analysis system for social media using machine learning techniques: Social enablement",
            "The interpretation of Zeta test results",
            "An improvement to Zeta",
            "Marlowe and overreaching: A misuse of stylometry",
            "Attributing the Bixby Letter using n-gram tracing",
            "Towards a new approach in the study of Ancient Greek music: Virtual reconstruction of an ancient musical instrument from Greek Sicily",
            "Text-world annotation and visualization for crime narrative reconstruction",
            "Johnson, ‘Misargyrus’, and Richard Bathurst",
            "Toward a model for digital tool criticism: Reflection as integrative practice",
            "Exploring the linguistic landscape of geotagged social media content in urban environments",
            "Function words in statistical machine-translated Chinese and original Chinese: A study into the translationese of machine translation systems",
            "In defense of sandcastles: Research thinking through visualization in digital humanities",
            "Informing library-based digital publishing: Selected findings from a survey of scholars' needs in a contemporary publishing environment",
            "Generation, implementation, and appraisal of an N-gram-based stemming algorithm",
            "Robert Musil, a war journal, and stylometry: Tackling the issue of short texts in authorship attribution",
            "An ontology and a memory island to give access to digital literature works",
            "Deciphering Latin sentences using traditional linguistic resources",
            "Remembrance of contemporary events: On setting up the Sunflower Movement Archive",
            "Representing stories as interdependent dynamics of character activities and plots: A two-mode network relational event model",
            "Machine learning, template matching, and the International Tracing Service digital archive: Automating the retrieval of death certificate reference cards from 40 million document scans",
            "An introduction to the functioning process of embedded paratext of digital literature: Technoeikon of digital poetry",
            "SageBook: Toward a cross-generational social network for the Jewish sages’ prosopography",
            "The problem of microattribution",
            "Automatic profiling of L2-simplified texts: Identifying discriminate features of linguistic proficiency",
            "Music and cremation rituals in The Netherlands: A fine-grained analysis of a crematorium’s playlist",
            "How statistics and text mining can be applied to literary studies?",
            "A small set of stylometric features differentiates Latin prose and verse",
            "A world of difference: Myths and misconceptions about the TEI",
            "Mapping museum ‘Soft Power’: Adding geo-visualization to the methodological framework",
            "Computational acoustic musicology",
            "Semantic domains in Picasso’s poetry",
            "Digital humanities and new directions in South Korea",
            "An Interoperable Spatio-Temporal Model for Archaeological Data Based on ISO Standard 19100",
            "A Framework to Design, Develop, and Evaluate Immersive and Collaborative Serious Games in Cultural Heritage",
            "Mass Digitization of Early Modern Texts With Optical Character Recognition",
            "Wall Painting Reconstruction Using a Genetic Algorithm",
            "The CENDARI Infrastructure",
            "Data-Driven Analysis of Virtual 3D Exploration of a Large Sculpture Collection in Real-World Museum Exhibitions",
            "A Conceptual Framework for Designing Virtual Heritage Environment for Cultural Learning",
            "Generating Islamic Quasi-Periodic Patterns",
            "A Natural User Interface for Gestural Expression and Emotional Elicitation to Access the Musical Intangible Cultural Heritage",
            "A Probabilistic, Ontological Framework for Safeguarding the Intangible Cultural Heritage",
            "Region of Interest-Based 3D Inpainting of Cultural Heritage Artifacts",
            "Finding Parallel Passages in Cultural Heritage Archives",
            "Munsell Color Specification using ARCA (Automatic Recognition of Color for Archaeology)",
            "How to Tell Ancient Signs Apart? Recognizing and Visualizing Maya Glyphs with CNNs",
            "Computer-Assisted Orientation and Drawing of Archaeological Pottery",
            "CHER-Ob",
            "Exploring RGB-D Cameras for 3D Reconstruction of Cultural Heritage",
            "Augmented Experiences in Cultural Spaces through Social Participation",
            "3D Reconstruction Techniques as a Cultural Shift in Art History?",
            "(Re-)Creating the past: 10 years of digital historical reconstructions using BIM",
            "Ubiquitous uncertainty: From a discomforting awareness towards a versatile potential.",
            "A Role-Based Model for Successful Collaboration in Digital Art History",
            "Computational Imagination and Digital Art History",
            "Big Data and the End of History",
            "In Conversation with CyArk: Digital Heritage in the 21st Century",
            "Against Digital Art History",
            "Big Bang Art History",
            "Digital versus Analogue Textual Scholarship or The Revolution is Just in the Title",
            "On Digital-Medieval Manuscript Culture: A Tentative Manifesto",
            "The Practicalities of Collaboratively Digitally Editing Medieval Prose: The Estoria de Espanna Digital Project as a Case Study",
            "The Estoria de Espanna Digital: Collating Medieval Prose-Challenges… and More Challenges",
            "Invisible Translator, Visible Author: Medieval Authorship Verification Through Modern Translation",
            "The French Translation of the Llibre de l'orde de cavalleria: The Diffusion, Translation, and Adaptation of Ramon Llull's Text",
            "The Dream Program in Paris et Vienne and Its Relation with the Roman de la Rose",
            "Alain Chartier's Livre de l'Espérance: A Remodeling of Dante's Commedia?",
            "Traveling Images: The Illustrations of Guillaume de Deguileville's Livre du Pelerin de vie humaine (Mathis Husz edition, Lyon, 1485) and its Castilian Translation by Vincente de Mazuelo (Heinrich Mayer edition, Toulouse, 1490)",
            "Nicole Oresme's Cultural Translatio in Question",
            "Jean Juvénal des Ursins, Linguist and Translator? Policies and Memory of Language in Late Medieval France",
            "Guillaume de Machaut at the Court of Aragon, 1380–1430",
            "Reconstructing the Text: The Fourteenth-Century Catalan Translation of Livy",
            "Spatial Reading: Digital Literary Maps of the Icelandic Outlaw Sagas",
            "Automatic Scribe Attribution for Medieval Manuscripts",
            "Omeka and Other Digital Platforms for Undergraduate Research Projects on the Middle Ages",
            "On the Classification of the Slavic Menaia Manuscripts",
            "How did East Sussex Really Appear in 1066? The Cartographic Evidence",
            "4D Modelling of Built Heritage: A System Offering an Alternative to Using BIM",
            "On the Value of Narratives in a Reflexive Digital Humanities",
            "Introduction: Digital Humanities as Dissonant",
            "Measuring Joycean Influences on Flann O’Brien",
            "How to Discover Textual Groups",
            "Community Engagement and Quality Knowledge with Stackoverflow’s Reputation System: Applications to Bullipedia",
            "Is Falstaff Falstaff? Is Prince Hal Henry V?: Topic Modeling Shakespeare’s Plays",
            "Everything is Illuminated. Zur Numerischen Analyse von Farbigkeit in Filmen",
            "Die Digitalisierung des goldenen Zeitalters – Editionsproblematik und stilometrische Autorschaftsattribution am Beispiel des Quijote",
            "Der ›edierte‹ Text: Grundpfeiler der Edition oder ›Zugeständnis‹ an den Leser?",
            "International/global networking against the backdrop of nondigital and digital editorial ventures",
            "Von der Raupe zum Schmetterling oder Wie fliegen lernen – Editionsphilologie zwischen Infrastruktur und Semantic Web",
            "Selbstzeugnisse digital – Erschließung, Präsentation und Benutzbarkeit",
            "Reviewing von digitalen Editionen im Kontext der Evaluation digitaler Forschungsergebnisse",
            "Der nächste Schritt? Semantic Web und digitale Editionen.",
            "(Be)Ständige digitale Metamorphosen?! – »perhaps there will always be something more«",
            "»Newe landte« in der historischen Sprachwissenschaft: Ein Beitrag zur Druckersprache der Nürnberger Offizin Georg Stüchs auf Grundlage der Digitaledition Paesi novamente retrovati - Newe unbekanthe landte.",
            "Vom Livre irréalisé zum Texte hyperréalisé?",
            "Wissenschaftsgeschichte zwischen Digitalität und Digitalisierung",
            "Digital Humanities – Eine Herausforderung an die Informatik und an die Geisteswissenschaften",
            "Literaturwissenschaft als Hackathon. Zur Praxeologie der Digital Literary Studies und ihren epistemischen Dingen",
            "Islamic Stuccos made Digital. Digitality and Studies of Islamic Art and Architecture",
            "›Kleine Archive‹ in den Digital Humanities – Überlegungen zum Forschungsobjekt ›Zeitschrift‹",
            "»Virtualisierung von Skulptur«. Ein kurzer Erfahrungsbericht",
            "Objektumgangsnormen in der Literaturwissenschaft",
            "Kunstgeschichte der digitalen Bilder",
            "The Long Arc of History: Neural Network Approaches to Diachronic Linguistic Change",
            "Data Mining in the Works of the Shingon Monk Monkan (1278–1357): Using Digital Methods to Assess the Contested Authorship of Three Religious Texts from Medieval Japan",
            "Investigating the Relationships between Scholars and Politicians in Ancient China: Taking the Yuanyou Era as an Example",
            "Quantitative Evaluation Method for a Literary Structure Hypothesis within the Bible",
            "Algorithmic Determination of Japanese Ethnic Identity Based on Name",
            "Migrating People, Migrating Data: Digital Approaches to Migrant Heritage",
            "Linked Reading: Digital Historicism and Early Modern Discourses of Race around Shakespeare’s Othello",
            "The Transformation of Gender in English-Language Fiction",
            "The Identity Issue: An Introduction",
            "Crossing Over: Gendered Reading Formations at the Muncie Public Library, 1891-1902",
            "Beyond Poet Voice: Sampling the (Non-) Performance Styles of 100 American Poets",
            "Nation, Ethnicity, and the Geography of British Fiction, 1880-1940",
            "Stable random projection: lightweight, general-purpose dimensionality reduction for digitized libraries",
            "Measuring Modernist Novelty",
            "Historiography’s Two Voices: Data Infrastructure and History at Scale in the Oxford Dictionary of National Biography (ODNB)",
            "Critical Search: A Procedure for Guided Reading in Large-Scale Textual Corpora",
            "Modelling the Research Data Lifecycle",
            "A Data-Driven Approach to Appraisal and Selection at a Domain Data Repository",
            "Media Digitization and Preservation Initiative: A Case Study",
            "Participatory Prototype Design: Developing a Sustainable Metadata Curation Workflow for Maternal Child Health Research",
            "Measuring FAIR Principles to Inform Fitness for Use",
            "Complexities of Digital Preservation in a Virtual Reality Environment, the Case of Virtual Bethel",
            "Giving datasets context: a comparison study of institutional repositories that apply varying degrees of curation",
            "The Reading Machine",
            "Web Archiving and Historical Research",
            "Network Analysis of Album Amicorums in the 16th–17th Centuries",
            "Digital Museum – in the Light of the Projects of MOME TechLab",
            "The Digital Critical Edition of the Correspondence of Zsigmond Móricz (1892–1913)",
            "Discussions and visions of the digital humanities",
            "Budapest Time Machine",
            "Digitisation and Network Research",
            "Digital Humanities in the Virtual National Library",
            "#BREW: Influencer Experiment in the Third Wave Coffee Community of Instagram",
            "Metadata",
            "Collaborative Mapping to Enhance Local Engagement and Interdisciplinary Dialogue in a Short-term Study Abroad Program",
            "Watching and Mapping The Wire : Taking the Spatial Turn in Political Science",
            "Emplacing Berlin: Digital Itineraries and Short-term Study Abroad in the City",
            "‘Books are not absolutely dead things’: English Literature, Material Culture and Mapping Text",
            "Critical Chorography: A Pedagogical Approach",
            "Story Maps and Disability Studies: A Digital Blueprint for Teaching Community Engagement",
            "Mapping as Orientation, Support, and Aide-mémoire in Short-term Travel Courses",
            "Pilgrimage, Place, Pedagogy: How Mapping Tools can Enhance First Year Experience Abroad",
            "STREAM (Spatiotemporal Research Infrastructure for Early Modern Brabant and Flanders): Sources, Data and Methods",
            "Deepening Historical GIS: An Integrated Database Solution for Linking People, Place and Events through Unstructured Text",
            "‘The Empire Strikes Back’ ?: HGIS de las Indias and the Postcolonial Death Star",
            "Combining Close and Distant Reading: A Multiscalar Analysis of the English Lake District's Historical Soundscape",
            "The Use of GIS to Draw Literary Maps of Compostela. Applications in the Educational Field",
            "Space and Time in 100 Million Words: Health and Disease in a Nineteenth-century Newspaper",
            "Ensemble Named Entity Recognition (NER): Evaluating NER Tools in the Identification of Place Names in Historical Corpora",
            "The Gutenberg English Poetry Corpus: Exemplary Quantitative Narrative Analyses",
            "Development and Testing of a Small-Size Olfactometer for the Perception of Food and Beverages in Humans",
            "Post-editing Effort of a Novel With Statistical and Neural Machine Translation",
            "Rhetorical Figure Detection: Chiasmus, Epanaphora, Epiphora",
            "Principal Component Approximation and Interpretation in Health Survey and Biobank Data",
            "A Social Cognition Perspective on Human–Computer Trust: The Effect of Perceived Warmth and Competence on Trust in Decision-Making With Computers",
            "On Poetic Topic Modeling: Extracting Themes and Motifs From a Corpus of Spanish Poetry",
            "A Metrical Analysis of Medieval German Poetry Using Supervised Learning",
            "Design to Robotic Assembly: An Exploration in Stacking",
            "VICOGLOSSIA: Annotatable and Commentable Library as a Bridge between Reader and Scholar (a proof of concept study: Early Soviet Philological Culture)",
            "Conceptual Analysis in a computer-assisted framework: mind in Peirce",
            "Mapping Visions of Rome and Digital Roman Heritage Connectivity between Literary and Artistic Heritage in a Digital Age",
            "Syntax and Semantics of Italian Poetry in the First Half of the 20th Century",
            "Rethinking Rome as an Anthology: The Poeti der Trullo’s Street Poetry",
            "A Formal Ontology for the Text Encoding Initiative",
            "Toward Linking Open Data, Synchronizing Digital Tools, and Mapping Relevant Topics: A Survey of the Series on Digital Humanities",
            "Computational Thinking and Implications for Digital Humanities Research",
            "From Text to Data: Extracting Posting Data from Chinese Local Gazetteers",
            "The Digital Humanities Research of the Landscape Painting of the Five Dynasties and Northern Song Dynasty (2): A Study of the ＂Fisherman-Hermit＂ Theme in Painting",
            "CBETA Research Platform: A Digital Tool for Studying Chinese Buddhist Texts in the New Era",
            "A Critical Approach to Digital Humanities: Examining the Subjective Sphere",
            "Navigating the Forest Through the Trees: Visualizing Character Paths Through Shakespeare’s As You Like It",
            "Digital Humanities for Authorship Attribution Problem of Shiji: Based on Frequency of Function Words Within the Hereditary Houses Section",
            "DocuSky: A Platform for Constructing and Analyzing Personal Text Databases",
            "From CBDB to TBDB: The ＂Treatise of Historical Figures＂ of the New Edition of Changhua Local Gazetteer as a Starting Point",
            "How the Taiwanese Do China Studies: Applications of Text Mining",
            "Computer Analysis of Architecture Using Automatic Image Understanding",
            "Extracting Keywords from Open-Ended Business Survey Questions",
            "A Hackathon for Classical Tibetan",
            "Visualizing linguistic variation in a network of Latin documents and scribes",
            "Prosopographical data analysis. Application to the Angevin officers (XIII–XV centuries)",
            "Supporting the Exploration of Online Cultural Heritage Collections: The Case of the Dutch Folktale Database",
            "Semantic Enrichment of a Multilingual Archive with Linked Open Data",
            "Coca-Cola: An Icon of the American Way of Life. An Iterative Text Mining Workflow for Analyzing Advertisements in Dutch Twentieth-Century Newspapers",
            "In a test bed with Kafka. Introducing a mixed-method approach to digital stylistics",
            "Unraveling reported dreams with text analytics",
            "Mining Embodied Emotions: A Comparative Analysis of Sentiment and Emotion in Dutch Texts, 1600-1800.",
            "Continuous Integration and Unit Testing of Digital Editions",
            "Collaboration in Digital Humanities Research – Persisting Silences",
            "Scaffolding and Play Approaches to Digital Humanities Pedagogy: Assessment and Iteration in Topically-Driven Courses",
            "Computational Models for Analyzing Data Collected from Reconstructed Cuneiform Syllabaries",
            "The Writeprints of Man: a Stylometric Study of Lafayette's Hand in Paine's 'Rights of Man'",
            "All Relate to Art: The William Blake Archive and Its Web of Relations",
            "SpotiBot — Turing Testing Spotify",
            "Manuscript Study in Digital Spaces: The State of the Field and New Ways Forward",
            "BigDIVA and Networked Browsing: A Case for Generous Interfacing and Joyous Searching",
            "Predicting the Past",
            "Reconstructing Brandon (1998-1999): A Cross-disciplinary Digital Humanities Study of Shu Lea Cheang’s Early Web Artwork",
            "Reverse Engineering the First Humanities Computing Center",
            "Stealing a Corpus: Appropriating Aesop’s Body in the Early Age of Print ",
            "To tree, or not to tree? On the Empirical Basis for Having Past Landscapes to Experience.",
            "Recording invisible proofs to compose stone narratives. Applications of Near Infrared Spectroscopy in provenance studies.",
            "Reviving Classical Drama: virtual reality and experiential learning in a traditional classroom",
            "From Distracted to Distributed Attention: Expanded Learning through Social Media, Augmented Reality, Remixing, and Activist Geocaching",
            "From Distracted to Recursive Reading: Facilitating Knowledge Transfer through Annotation Software",
            "How Scholars Read Now: When the Signal Is the Noise",
            "The Imaginary Museum: Teaching Art History with Mobile Digital Technology",
            "Laptop Policy: Notes on Boredom",
            "Using structured text corpora in Parliamentary Metadata Language for the analysis of legislative proceedings",
            "Reading, Making, and Metacognition: Teaching Digital Humanities for Transfer",
            "Ghosts in the Machine: a motion-capture experiment in distributed reception",
            "Machine-aided close listening: Prosthetic synaesthesia and the 3D phonotext",
            "How Technology Means: Texts, History, and Their Associated Technologies",
            "Researcher as Bricoleur: Contextualizing humanists’ digital workflows",
            "Defining scholarly practices, methods and tools in the Lithuanian digital humanities research community",
            "Creative Data Literacy: A Constructionist Approach to Teaching Information Visualization "
        ],
        "articles_journals_ratio": 14.823529411764707
    },
    {
        "year": "2015",
        "num_of_journals": 14,
        "list_of_journals": [
            "Digital Scholarship in the Humanities",
            "Journal on Computing and Cultural Heritage",
            "International Journal for Digital Art History",
            "Digital Philology: A Journal of Medieval Cultures",
            "Digital Medievalist",
            "Digital Studies/Le champ numérique",
            "Zeitschrift für digitale Geisteswissenschaften",
            "Journal of the Japanese Association for Digital Humanities",
            "International Journal of Digital Curation",
            "International Journal of Humanities and Arts Computing",
            "Frontiers in Digital Humanities",
            "Humanist Studies & the Digital Age",
            "Journal of Data Mining & Digital Humanities",
            "Digital Humanities Quarterly"
        ],
        "num_of_articles": 181,
        "list_of_articles": [
            "Tensions and tenets of socialized scholarship",
            "The apocalypse on Twitter",
            "A methodology for the semiautomatic annotation of EPEC-RolSem, a Basque corpus labeled at predicate level following the PropBank-VerbNet model",
            "Thesilva portentosaof stemmatology: Bifurcation in the recension of Old Norse manuscripts",
            "Lines of succession in an English ballad tradition: The publishing history and textual descent ofThe Wandering Jew’s Chronicle",
            "Computer-assisted stemmatology in studying Paulus Juusten's 16th-century chronicleCatalogus et ordinaria successio Episcoporum Finlandensium",
            "Phonetic-based Sindhi spellchecker system using a hybrid model",
            "Towards an intellectual history of digitization: Myths, dystopias, and discursive shifts in museum computing",
            "Latin word stemming using Wiktionary:",
            "Translation as an aid to ELT: Using an English–Spanish parallel corpus (P-ACTRES) to study Englishbothand its Spanish counterparts",
            "Rolling stylometry",
            "Politics and the German language: Testing Orwell’s hypothesis using the Google N-Gram corpus",
            "IMPACT: A tool for transcribing and commenting on oral data, for teaching, learning, and research",
            "An Integrated Approach to the Procedural Modeling of Ancient Cities and Buildings",
            "The Arabic Papyrology Database",
            "Digital Humanities in the Anthropocene",
            "Oral fairy tale or literary fake? Investigating the origins ofLittle Red Riding Hoodusing phylogenetic network analysis",
            "Developing a framework for an advisory message board for female victims after disasters: A case study after east Japan great earthquake",
            "Words, words. They’re all we have to go on: Image finding without the pictures",
            "Profile-based authorship analysis",
            "Deaf sentences1over Ukraine: Mysticism versus ethics",
            "Zonal text processing",
            "Stylometry and collaborative authorship: Eddy, Lovecraft, and ‘The Loved Dead’",
            "Towards sentiment analysis for historical texts",
            "Polysemy and Synonymy in Syntactic Dependency Networks",
            "Why the quantitative analysis of diachronic corpora that does not consider the temporal aspect of time-series can lead to wrong conclusions",
            "Semantic Enrichment for Recommendation of Primary Studies in a Systematic Literature Review",
            "Improving Statistical Machine Translation using Syntax-based Learning-to-Rank System",
            "Visual Linguistic Analysis of Political Discussions: Measuring Deliberative Quality",
            "Whole Genre Sequencing",
            "Exploring Cutting Structure in Film, with Applications to the Films of D. W. Griffith, Mack Sennett, and Charlie Chaplin",
            "The value of critical destruction: Evaluating multispectral image processing methods for the analysis of primary historical texts",
            "The Impact of Lacking Metadata for the Measurement of Cultural and Linguistic Change Using the Google Ngram Data Sets—Reconstructing the Composition of the German Corpus in Times of WWII",
            "The genealogy of texts: Manuscript traditions and textual traditions",
            "Realizing the Democratic Potential of Online Sources in the Classroom",
            "The Rowling Case: A Proposed Standard Analytic Protocol for Authorship Questions",
            "Exploring the Intersection of Personal and Public Authorial Voice in the Works of Willa Cather",
            "Programming in the Digital Humanities",
            "Computational Methods for Coptic: Developing and Using Part-of-Speech Tagging for Digital Scholarship in the Humanities",
            "Metaphor, Popular Science, and Semantic Tagging: Distant reading with theHistorical Thesaurus of English",
            "Trading Consequences: A Case Study of Combining Text Mining and Visualization to Facilitate Document Exploration",
            "Semantic Blumenbach: Exploration of Text–Object Relationships with Semantic Web Technology in the History of Science",
            "TRAViz: A Visualization for Variant Graphs",
            "Digital Learning in an Undergraduate Context: Promoting Long-Term Student–Faculty Place-Based Collaboration",
            "DASCH: Data and Service Center for the Humanities",
            "Exploratory Thematic Analysis for Digitized Archival Collections",
            "A New Hybrid Stemming Method for Persian Language",
            "The Adventures of Huckleberry Finn and Jim in China: A Case of what Corpus Pragmatics can do for the Translation of Dialect",
            "Visualization in stylometry: Cluster analysis using networks",
            "Navigating the Storm: IMPACT, eMOP, and Agile Steering Standards",
            "Four rules for the application of phylogenetics in the analysis of textual traditions",
            "Operationalizing the Colloquial Style: Repetition in 19th-Century American Fiction",
            "ProppLearner: Deeply Annotating a Corpus of Russian Folktales to Enable the Machine Learning of a Russian Formalist Theory",
            "3D Digital Microscopy for Characterizing Punchworks on Medieval Panel Paintings",
            "Optical Detection of Dust and Scratches on Photographic Film",
            "A Virtual Experience on the Very First Italian Computer",
            "Discovering Novelty Patterns from the Ancient Christian Inscriptions of Rome",
            "Using a Combination of Micro--Computed Tomography, CAD and 3D Printing Techniques to Reconstruct Incomplete 19th-Century Cantonese Chess Pieces",
            "Fully Automatic, Omnidirectional Acquisition of Geometry and Appearance in the Context of Cultural Heritage Preservation",
            "A Holistic User-Centered Approach to Immersive Digital Cultural Heritage Installations",
            "The Natural History Production Line",
            "Mont’e Scan",
            "ATHENA",
            "Factors Facilitating Cultural Learning in Virtual Architectural Heritage Environments",
            "Visualizing and Assessing Hypotheses for Marine Archaeology in a VR CAVE Environment",
            "Conducting Visitor Studies Using Smartphone-Based Location Sensing",
            "The Dream and the Cross",
            "Information Reliability Evaluation",
            "Automatic Extraction of Petrographic Features from Pottery of Archaeological Interest",
            "What Do Thirty-One Columns Say about a “Theoretical” Thirty-Second?",
            "An Ontological Approach to Creating an Andean Weaving Knowledge Base",
            "Mixed-Reality World Exploration Using Image-Based Rendering",
            "Automatic Production of Tailored Packaging for Fragile Archaeological Artifacts",
            "Integrating a Location-Based Mobile Game in the Museum Visit",
            "Ancient Polychromy",
            "Data Science and Digital Art History",
            "Forgotten Genealogies: Brief Reflections on the History of Digital Art History",
            "Debating Digital Art History",
            "Reframing Art History",
            "Distant Viewing in Art History. A Case Study of Artistic Productivity",
            "A Quantitative Approach to Beauty. Perceived Attractiveness of Human Faces in World Painting",
            "Spanish Philology and the Arab Past: A Case Study",
            "Materialities of the Manuscript: Codex and Court Culture in Fourteenth–Century Paris",
            "What is a Narrator?: Narrator Theory and Medieval Narratives",
            "Constructing and Representing Reality: Hegel and the Making of Erich Auerbach’s Mimesis",
            "Beyond the Sun’s Setting: Webs of Unknowing in Old English",
            "Filling the Silence: Shared Content in Four Related Manuscripts of Ælfric’s Catholic Homilies",
            "Richard Frampton and Two Manuscripts in the Parker Library",
            "A Digital Re-examination of the Scribal Hands in the Parker Chronicle",
            "The advantages and disadvantages of digital reconstruction and Anglo-Saxon manuscripts",
            "From \"anhelitus\" to \"hanellissement:\" Cross-referencing in the Anglo-Norman dictionary",
            "Alliteration and character focus in the York Plays",
            "Easy tools to get to grips with linguistic variation in the manuscripts of Njáls saga.",
            "Alternate Reality Game and Culural Heritage: The “Aequilibrium” Project",
            "Don't make a scene: Game studies for an uncertain world",
            "Digital Humanities at Siberian Federal University",
            "Language documentation and division: Bridging the digital divide",
            "What about the Humanists? Digital Humanities as an answer to contemporary perceptions of the Humanities on the Polish language Internet",
            "A co z humanistami? – Cyfrowa humanistyka jako odpowiedź na obecny stan postrzegania humanistyki w polskojęzycznym internecie",
            "La littérature numérique, existe-t-elle?",
            "Inner Margins of the Literary Digital Text: From Allusion to Rewriting",
            "Segmental Analysis-Based Authorship Discrimination between the Holy Quran and Prophet’s Statements",
            "What People Said: The Theoretical Foundations of a Minimal Doxographical Ontology and Its Use in the History of Philosophy",
            "Vom Bild zum Bild – Digital Humanities jenseits des Textes",
            "Die Informatik als Geisteswissenschaft",
            "Digital Humanities? Gibt’s doch gar nicht!",
            "Informatik und Hermeneutik. Zum Mehrwert interdisziplinärer Textanalyse",
            "Warum werden mittelalterliche und frühneuzeitliche Rechnungsbücher eigentlich nicht digital ediert?",
            "Vom Zeichen zur Schrift: Mit Mustererkennung zur automatisierten Schreiberhanderkennung in mittelalterlichen und frühneuzeitlichen Handschriften ",
            "Historische Stilometrie? Methodische Vorschläge für eine Annäherung textanalytischer Zugänge an die mediävistische Textualitätsdebatte.",
            "Kontroverse Kommunikation im Umkreis der ersten Frauenbewegung. Wie können digitale Ressourcen die sprachliche Untersuchung und die Ergebnisdokumentation verbessern? ",
            "Computerlinguistische Werkzeuge zur Erschließung und Exploration großer Textsammlungen aus der Perspektive fachspezifischer Theorie",
            "Neue Perspektiven für die Erziehungswissenschaften – Das Potenzial von Mixed Reality für Lehr- und Lernprozesse",
            "Semantisch angereicherte 3D-Messdaten von Kirchenräumen als Quellen für die geschichtswissenschaftliche Forschung",
            "MUSICI und MusMig. Kontinuitäten und Diskontinuitäten",
            "»Losing My Religion« – Einsatz der Videoannotationsdatenbank Pan.do/ra in der kunstgeschichtlichen Analyse von Musikvideos",
            "AAC-Fackel. Das Beispiel einer digitalen Musteredition",
            "Heterogene Daten in den Digital Humanities: Eine Architektur zur forschungsorientierten Föderation von Kollektionen",
            "Vom Urheber zur Crowd, vom Werk zur Version, vom Schutz zur Öffnung? Kollaboratives Schreiben und Bewerten in den Digital Humanities",
            "Analyzing the Content and Text of Tweets by Japanese Academic Researchers",
            "Open Principles, Open Data: The Design Principles and Architecture of the UC CEISMIC Canterbury Earthquakes Digital Archive",
            "The Taste of “Data Soup” and the Creation of a Pipeline for Transnational Historical Research",
            "Revealing the Modern History of Japanese Philosophy Using Digitization, Natural Language Processing, and Visualization",
            "Database System for Archiving the Literary Structure of the Bible",
            "A Nordic Tradition for Digital Scholarly Editions?",
            "Corpus Sharing Strategy for Descriptive Linguistics",
            "Multiple-policy Character Annotation based on CHISE",
            "What Factors Influence Where Researchers Deposit their Data? A Survey of Researchers Submitting to Data Repositories",
            "The long decade of digital preservation in heritage institutions in the Czech Republic: 2002–2014",
            "Digital Curation and Doctoral Research",
            "User-Defined Metadata: Using Cues and Changing Perspectives",
            "Assessing Perceived Usability of the Data Curation Profile Toolkit Using the Technology Acceptance Model",
            "Mapping Methods Metadata for Research Data",
            "“Designated Communities”: Through the Lens of the Web",
            "Towards the Preservation of the Scientific Memory",
            "Intellectual Capital at Risk: Data Management Practices and Data Loss by Faculty Members at Five American Universities",
            "Research Data Management Practices: A Snapshot in Time",
            "Adapting the Edinburgh Geoparser for Historical Georeferencing",
            "Digital Partnership: Combining Text Mining and GIS in a Spatial History of Sea Fishing in the United Kingdom, 1860 to 1900",
            "Exploring Literary Landscapes: From Texts to Spatiotemporal Analysis through Collaborative Work and GIS",
            "From Space to Place: Place-Based Explorations of Text",
            "Mapping Knowledge Exchange in Early Modern Europe: Intellectual and Technological Geographies and Network Representations",
            "Homer's Iliad – A Social Network Analytic Approach",
            "Conceptualizing and Mapping Geocultural Space",
            "Petal Diagrams: A New Technique for Mapping Historical Change in the Film Industry",
            "Remote Locations: Early Scottish Scenic Films and Geo-databases",
            "Where is France in French Cinema, 1976–2013?",
            "Towards a GIS Analysis of Literary Cultures: The Making of the Slovenian Ethnoscape Through Literature",
            "Acts of Perception: Samuel Becket, Time, Space and the Digital Literary Atlas of Ireland, 1922–1949",
            "Maps and Mobilities: On the Possibilities and Limits of Spatial Technologies for Humanities Research",
            "Envisioning the Urban Past: GIS Reconstruction of a Lost Denver District",
            "Change of Paradigm: From Individual to Community-Based Scholarship",
            "Digital Readers of Allusive Texts: Ovidian Intertextuality in the 'Commedia' and the Digital Concordance on 'Intertextual Dante'",
            "Re-Reading Petrarca in the Digital Era",
            "Deception in Speeches of Candidates for Public Office",
            "An Information Science Question in DH Feminism",
            "Humanities Unbound: Supporting Careers and Scholarship Beyond the Tenure Track",
            "Textual Artifacts and their Digital Representations: Teaching Graduate Students to Build Online Archives",
            "What can the digital humanities learn from feminist game studies?",
            "The Shock of the Familiar: Three Timelines about Gender and Technology in the Library",
            "Enlisting Vertues Noble & Excelent: Behavior, Credit, and Knowledge Organization in the Social Edition",
            "Deconstructing Bricolage: Interactive Online Analysis of Compiled Texts with Factotum",
            "By the People, For the People: Assessing the Value of Crowdsourced, User-Generated Metadata",
            "Generous Interfaces for Digital Cultural Collections",
            "Beyond the Margins: Intersectionality and the Digital Humanities",
            "#transform(ing)DH Writing and Research: An Autoethnography of Digital Humanities and Feminist Ethics ",
            "Orientation: Man and His Tool, Again?",
            "Materiality Comics",
            "The Arrival Fallacy: Collaborative Research Relationships in the Digital Humanities",
            "Multimodal Authoring and Authority in Educational Comics: Introducing Derrida and Foucault for Beginners",
            "Data Assemblages: A Call to Conceptualize Materiality in the Academic Ecosystem",
            "Man and His Tool, Again? Queer and Feminist Notes on Practices in the Digital Humanities and Object Orientations Everywhere",
            "Graphic Images of YHWH: Exploring and Exploding the Bounds of Sexual Objectification in Ezekiel 16",
            "The Data Sprint Approach: Exploring the field of Digital Humanities through Amazon’s Application Programming Interface",
            "Jane, John … Leslie? A Historical Method for Algorithmic Gender Prediction",
            "A Textual History of Mozilla: Using Topic Modeling to Trace Sociocultural Influences on Software Development",
            "Sequential Rhetoric: Using Freire and Quintilian to Teach Students to Read and Create Comics ",
            "Archival Liveness: Designing with Collections Before and During Cataloguing and Digitization",
            "Is this Article a Comic?",
            "Behind the Scenes of a Dissertation in Comics Form",
            "Comparative rates of text reuse in classical Latin hexameter poetry"
        ],
        "articles_journals_ratio": 12.928571428571429
    },
    {
        "year": "2016",
        "num_of_journals": 17,
        "list_of_journals": [
            "Digital Scholarship in the Humanities",
            "Literary and Linguistic Computing",
            "Journal on Computing and Cultural Heritage",
            "International Journal for Digital Art History",
            "Digital Philology: A Journal of Medieval Cultures",
            "Digital Medievalist",
            "Digital Studies/Le champ numérique",
            "Zeitschrift für digitale Geisteswissenschaften",
            "Digital Literary Studies",
            "Journal of Cultural Analytics",
            "International Journal of Digital Curation",
            "International Journal of Humanities and Arts Computing",
            "Frontiers in Digital Humanities",
            "Journal of Open Humanities Data",
            "Journal of Data Mining & Digital Humanities",
            "Jahrbuch für Computerphilologie",
            "Digital Humanities Quarterly"
        ],
        "num_of_articles": 211,
        "list_of_articles": [
            "Other Worlds, Other DHs: Notes towards a DH Accent",
            "Reconciling the Dynamics of Language with a Grammar Handbook: The Ongoing Pedalion Grammar Project",
            "Using Social Network Analysis to Reveal Unseen Relationships in Medieval Scotland",
            "Modeling and Representing Dramatic Situations as Paradoxical Structures",
            "Using Models of Lexical Style to Quantify Free Indirect Discourse in Modernist Fiction",
            "An Application of a Profile-Based Method for Authorship Verification: Investigating the Authenticity of Pliny the Younger’s Letter to Trajan Concerning the Christians",
            "Mapping the Geography of Karl Marx’s Capital",
            "The Grub Street Project: A digital social edition of London in the long 18th century",
            "Visualizing Computational, Transversal Narratives from the World Trade Towers",
            "The Small-World of ‘Le Petit Prince’: Revisiting the Word Frequency Distribution",
            "What Remains to be Done—Exposing Invisible Collections in the other 7,000 Languages and Why it is a DH Enterprise",
            "The Character in the Letter: Epistolary Attribution in Samuel Richardson’sClarissa",
            "Entropy in Different Text Types",
            "Documentation for the public: Social editing inThe Walt Whitman Archive",
            "Digital scholarly editing within the boundaries of copyright restrictions",
            "The case of the bold button: Social shaping of technology and the digital scholarly edition",
            "Archiving, editing, and reading on the AustESE Workbench: Assembling and theorizing an ontology-based electronic scholarly edition of Joseph Furphy’sSuch is Life",
            "Open versus closed recensions (Pasquali): Pros and cons of some methods for computer-assisted stemmatology",
            "Perspell: A New Persian Semantic-Based Spelling Correction System",
            "On the Path to a Methodology for the Critique of Digital Literature",
            "FarsiTag: A Part-of-Speech Tagging System for Persian",
            "Is It Time to Re-thinkKing John?",
            "Poe or Not Poe? A Stylometric Analysis of Edgar Allan Poe’s Disputed Writings",
            "A Text Structure Indicator and two Topological Methods: New Ways for Studying Latin Historic Narratives",
            "A Multilingual Cross-Domain Client Application Prototype for UNL-ization and NL-ization for NLP Applications",
            "Search, Reading, and the Rise of Database: Table 1",
            "An Open Multilevel Classification Scheme for the Visual Layout of Comics and Graphic Novels: Motivation and Design",
            "Design and construction of the Greek grammar checker",
            "Multi-Retranslation Corpora: Visibility, Variation, Value, and Virtue",
            "Computer experiments on the Khirbet Qeiyafa ostracon",
            "Exploring the prominence ofRomeo and Juliet’s characters using weighted centrality measures",
            "An All-Words Sense Tagging Method for Resource-Deficient Languages",
            "An effective named entity similarity metric for comparing data from multiple sources with varying syntax",
            "The preliminaries project: Geography, networks, and publication in the Spanish Golden Age",
            "‘Why don’t we do it in the road?’: The case for scholarly editing as a public intellectual activity",
            "Thematic Section on Studia Stemmatologica",
            "The Two Oldcastles of London",
            "Engaging the museum space: Mobilizing visitor engagement with digital content creation",
            "Guiding automatic MT evaluation by means of linguistic features",
            "The reader-oriented scholarly edition",
            "Reliable social scholarly editing",
            "Modelling in digital humanities: Signs in context",
            "Pow law in random symbolic sequences",
            "Accidental discovery, intentional inquiry: Leveraging linked data to uncover the women of jazz",
            "Whatever happened to interchange?",
            "A digital corpus resource of authentic anonymized French text messages: 88milSMS—What about transcoding and linguistic annotation?",
            "Palimpsest: Improving assisted curation of loco-specific literature",
            "DivaServices—A RESTful web service for Document Image Analysis methods",
            "Text miningWar and Peace: Automatic extraction of character traits from literary pieces",
            "Digital humanities is text heavy, visualization light, and simulation poor",
            "Traduco: A collaborative web-based CAT environment for the interpretation and translation of texts",
            "The Walt Whitman Archiveand the prospects for social editing",
            "Digitally reconstructing the Great Parchment Book: 3D recovery of fire-damaged historical documents",
            "Afterword",
            "Digitizing Lefebvre’s Spatial Triad",
            "Low-Cost Real-Time 3D Reconstruction of Large-Scale Excavation Sites",
            "Developing 3D Imaging Programmes--Workflow and Quality Control",
            "Alternative Representations of 3D-Reconstructed Heritage Data",
            "Sentence Shortening via Morpho-Syntactic Annotated Data in Historical Language Learning",
            "Safeguarding and Accessing Drama as Intangible Cultural Heritage",
            "Handheld Visual Representation of a Castle Chapel Ruin",
            "Methodological Framework for the Design and Development of Applications for Reactivation of Cultural Heritage",
            "Rule-Based Generation of Ancient Chinese Architecture from the Song Dynasty",
            "Corpus COFLA",
            "Families and Mobile Devices in Museums",
            "Pattern Matching and the Analysis of Damaged Ancient Objects",
            "Evaluating Shape Representations for Maya Glyph Classification",
            "Digital Mont’e Prama",
            "Using n-Grams to Identify Time Periods of Cultural Influence",
            "Analyzing the Decorative Style of 3D Heritage Collections Based on Shape Saliency",
            "Classification and Retrieval of Archaeological Potsherds Using Histograms of Spherical Orientations",
            "Visual Recognition of Ancient Inscriptions Using Convolutional Neural Network and Fisher Vector",
            "Close-Range Photogrammetric Tools for Epigraphic Surveys",
            "Semiautomatic Construction of Cross-Period Thesaurus",
            "Gugelmann Galaxy: An Unexpected Journey through a collection of Schweizer Kleinmeister",
            "Large-scale Classification of Fine-Art Paintings: Learning The Right Metric on The Right Feature",
            "Images as Data: Cultural Analytics and Aby Warburg’s Mnemosyne",
            "Graduate Workshop on Digital Tools for Art Historians: The Visualizing Venice Summer Program “The Biennale and the City” (2015)",
            "Figuring out Art History",
            "Social Network Centralization Dynamics in Print Production in the Low Countries, 1550-1750",
            "Big Image Data within the Big Picture of Art History",
            "Direct visualization techniques for the analysis of image data: the slice histogram and the growing entourage plot",
            "Linking structure, texture and context in a visualization of historical drawings by Frederick William IV (1795-1861)",
            "Textual Bodies, the Digital Surrogate, and Desire: Guillaume de Machaut’s Judgment Cycle and his Protean Corpus",
            "Picturing Narrative Voice: Communication and Displacement",
            "[I]ntroitus: Untexted Beginnings and Scribal Confusion in the Machaut and Ivrea Manuscripts",
            "Why Size Matters: Music Layout and Order in the Machaut Manuscripts",
            "Devotional and Political Consolation in Paris, BnF, fr. 994",
            "‘Anonymous’ Machaut: Guillaume de Machaut in Paris, BnF, NAF 6221",
            "Cataloging Medieval Manuscripts, from Beasts to Bytes",
            "Nicole de Bretaigne and a Fifteenth-Century Collection of Religious Texts in French: Paris, Bibliothèque de l’Arsenal, MS 5366",
            "Digital Representations and the Pivotal Instability of “Donna mi venne spesso ne la mente” in the Study of the Fragmenta",
            "A Contextual Analysis of Two Huon d’Auvergne Manuscripts",
            "The Book as a Gift of Wisdom: The Chemin de lonc estude in the Queen’s Manuscript, London, British Library, Harley 4431",
            "Clustering of medieval scripts through computer image analysis: Towards an evaluation protocol",
            "Chapter 3ModLabs",
            "Chapter 14Beyond GIS: On mapping early modern narratives and the chronotope",
            "Chapter 12Evaluating digital remediations of women's manuscripts",
            "Chapter 2At the crossroads: Book history meets digital humanities",
            "Scholarly editions in print and on the screen: A theoretical comparison",
            "Software development & trans-disciplinary training at the interface of digital humanities and computer science",
            "The great WARC adventure: Using SIPS, AIPS, and DIPS to document SLAPPs",
            "A Window Toward the Medium: A Media Specific Analysis of Chemical Landscapes Digital Tales",
            "\"It’s Creativity, Jim, but not as we know it\": Authorship in the Age of the Remix.",
            "Transproperty: Intellectual property and the ideal property form",
            "Chapter 4Will our children have the chance to do research on today’s digital books?",
            "Chapter 5Digital editing as autopoietic process",
            "La stratégie du sauna finlandais: Les frontières des Digital Humanities",
            "Chapter 6 Beyond the Great Divide: New explorations in editing the Complete Works of Dutch Novelist Willem Frederik Hermans",
            "Chapter 7Social editions, social editing, social texts",
            "Chapter 11Designed for the digital reader: The textual traditions in, of, and behind NewRadial, the dynamic table of contexts and Bubblelines",
            "Chapter 10The textual habitat: The development of new knowledge environments",
            "Chapter 8Appeal to the public: Lessons from the early history of the Oxford English Dictionary",
            "Automatic Writer Identification in Historical Documents: A Case Study",
            "Angebotsgenese für ein geisteswissenschaftliches Forschungsdatenzentrum",
            "Auf der Suche nach dem »goldnen Baum« – Digitale Annotation des Metaphernbegriffs in Poetiken: Erkenntnisprozess, diskursive Praktik und ›tertium comparationis‹",
            "Mapping the Words. Experimentelle Visualisierungen von Übersetzungsstrukturen zwischen Altgriechisch und Hocharabisch",
            "Was bedeutet die Digitalisierung für den Gegenstand der Literaturwissenschaft? ",
            "Neue Erkenntnisse durch digitalisierte Geschichtswissenschaft(en)? Zur hermeneutischen Reichweite aktueller digitaler Methoden in informationszentrierten Fächern",
            "Mehr als nur Karten. Das Virtuelle Kartenlabor (GlobMapLab) als Zugang zur Sammlung Perthes",
            "Rot rechnen",
            "The Biopolitics of Electronic Literature: On the Writings of Mez Breeze",
            "Gaming the Edition: Modelling Scholarly Editions through Videogame Frameworks",
            "Encoding the Edge: Manuscript Marginalia and the TEI",
            "Digital Humanities Masterplots",
            "Measured Applause: Toward a Cultural Analysis of Audio Collections",
            "The Science of Culture? Social Computing, Digital Humanities and Cultural Analytics",
            "The Life Cycles of Genres",
            "There Will Be Numbers",
            "Linguistic Markers of Status in Food Culture: Bourdieu’s Distinction in a Menu Corpus",
            "Genre Theory and Historicism",
            "Genre, Computation, and the Varieties of Twentieth-Century U.S. Fiction",
            "Understanding Gender and Character Agency in the 19th Century Novel",
            "Fictionality",
            "Revisiting the Data Lifecycle with Big Data Curation",
            "Scientific Knowledge Mobilization: Co-evolution of Data Products and Designated Communities",
            "Research Data Sharing and Reuse Practices of Academic Faculty Researchers: A Study of the Virginia Tech Data Landscape",
            "State of Data Guidance in Journal Policies: A Case Study in Oncology",
            "Enrolling Heterogeneous Partners in Video Game Preservation",
            "Recognizing the Diversity of Contributions: A Case Study for Framing Attribution and Acknowledgement for Scientific Data",
            "The Digitized Archival Document Trustworthiness Scale",
            "Data Management Education from the Perspective of Science Educators",
            "Factors Influencing Research Data Reuse in the Social Sciences: An Exploratory Study",
            "Data trajectories: tracking reuse of published data for transitive credit attribution",
            "Data Management in the Long Tail: Science, Software, and Service",
            "Mindset and Guidelines: Insights to Enhance Collaborative, Campus-wide, Cross-sectoral Digital Humanities Initiatives",
            "Towards Interoperable Network Ontologies for the Digital Humanities",
            "Medieval Music in Linked Open Data: A Case Study on Linking Medieval Motets",
            "Modeling the Humanities: Data Lessons from the World of Education",
            "Semi-supervised Textual Analysis and Historical Research Helping Each Other: Some Thoughts and Observations",
            "Lost in the Infinite Archive: The Promise and Pitfalls of Web Archives",
            "The World Wide Web as Complex Data Set: Expanding the Digital Humanities into the Twentieth Century and Beyond through Internet Research",
            "Mechanized Margin to Digitized Center: Black Feminism's Contributions to Combatting Erasure within the Digital Humanities",
            "Modelling East Asian Calendars in an Open Source Authority Database",
            "Modelling Complex Non-Rectilinear Textile Structures",
            "Smallholding Travel in the Agrarian Revolution: Using a Farmer Diary to Map Spatio-temporal Patterns in Late Nineteenth Century Sweden",
            "Don't Just Build It, They Probably Won't Come: Data Sharing and the Social Life of Data in the Historical Quantitative Social Sciences",
            "Discourses and Disciplines in the Enlightenment: Topic Modeling the French Encyclopédie",
            "Toward an Ontopedia for Historical Hebrew Manuscripts",
            "Testing the Robustness of Local Network Metrics in Research on Archeological Local Transport Networks",
            "Active Congruency-Based Reranking",
            "Gender, Discrimination, and Housing in Turn of the Century Montréal: What Mapping the Census Returns of Immigrants Can Tell Us",
            "The Use of Digital Tools for Spatial Analysis in Population Geography",
            "The HathiTrust Research Center Workset Ontology: A Descriptive Framework for Non-Consumptive Research Collections",
            "QuotationFinder - Searching for Quotations and Allusions in Greek and Latin Texts and Establishing the Degree to Which a Quotation or Allusion Matches Its Source",
            "Identification of Parallel Passages Across a Large Hebrew/Aramaic Corpus",
            "Bioinformatics and Classical Literary Study",
            "From manuscript catalogues to a handbook of Syriac literature: Modeling an infrastructure for Syriaca.org",
            "Integrated Sequence Tagging for Medieval Latin Using Deep Representation Learning",
            "Physische vs. gedeutete Räumlichkeit. Zur Auszeichnung spatialer Informationen in der historisch-kritischen Ausgabe C.F. Meyers Briefwechsel",
            "The Stuff of Science Fiction: An Experiment in Literary History",
            "Textual Reuse in the Eighteenth Century: Mining Eliza Haywood’s Quotations",
            "The Sentences Commentary Text Archive: Laying the Foundation for the Analysis, Use, and Reuse of a Tradition",
            "Student Labour and Training in Digital Humanities",
            "TaDiRAH: a Case Study in Pragmatic Classification",
            "From Stone to Screen: Digital Revitalization of Ancient Epigraphy",
            "Word Processor Art: How User-friendly Inhibits Creativity",
            "Sound and Digital Humanities: reflecting on a DHSI course",
            "The Almanac Archive: Theorizing Marginalia and Duplicate Copies in the Digital Realm",
            "Six Degrees of Francis Bacon: A Statistical Method for Reconstructing Large Historical Social Networks ",
            "The Leipzig Open Fragmentary Texts Series (LOFTS)",
            "Experiential Analogies: A Sonic Digital Ekphrasis as a Digital Humanities Project",
            "Raiders of the Lost Corpus",
            "The Why and How of Middleware",
            "Toward an Open Digital Tutorial for Ancient Greek v. 2.0",
            "The Ancient World in Nineteenth-Century Fiction; or, Correlating Theme, Geography, and Sentiment in the Nineteenth Century Literary Imagination",
            "Treebanking in the world of Thucydides. Linguistic annotation for the Hellespont Project",
            "Teaching Spatial Literacy in the Classical Studies Curriculum",
            "Towards a Rationale of Audio-Text",
            "Exploring Citation Networks to Study Intertextuality in Classics",
            "Digital Humanities in the 21st Century: Digital Material as a Driving Force ",
            "Covers and Corpus wanted! Some Digital Humanities Fragments ",
            "Circling around texts and language: towards pragmatic modelling in Digital Humanities",
            "Language DNA: Visualizing a Language Decomposition ",
            "How do we get to the Humanitarium from here?",
            "Explaining Events to Computers: Critical Quantification, Multiplicity and Narratives in Cultural Heritage",
            "Mining Public Discourse for Emerging Dutch Nationalism",
            "The Printing Press as Metaphor",
            "Information access in the art history domain: Evaluating a federated search engine for Rembrandt research ",
            "The App-Maker Model: An Embodied Expansion of Mobile Cyberinfrastructure",
            "Machine Reading the Primeros Libros",
            "The Archive as Repertoire: Transience and Sustainability in Digital Archives ",
            "Digital library search preferences amongst historians and genealogists: British History Online user survey",
            "Attention Ecology: Trend Circulation and the Virality Threshold",
            "A Macroscope for Global History: Seshat Global History Databank, a methodological overview",
            "Racial Proxies in Daily News: A Case Study of the Use of Directional Euphemisms",
            "Digital Surrealism: Visualizing Walt Disney Animation Studios",
            "Obama’s Sixth Annual Address: Image, Affordance, Flow",
            "A Culture of non-citation: Assessing the digital impact of British History Online and the Early English Books Online Text Creation Partnership",
            "GIS and Literary History: Advancing Digital Humanities research through the Spatial Analysis of historical travel writing and topographical literature",
            "Physische vs. gedeutete Räumlichkeit. Zur Auszeichnung spatialer Informationen in der historisch-kritischen Ausgabe C.F. Meyers Briefwechsel"
        ],
        "articles_journals_ratio": 12.411764705882353
    },
    {
        "year": "2011",
        "num_of_journals": 8,
        "list_of_journals": [
            "Literary and Linguistic Computing",
            "Journal on Computing and Cultural Heritage",
            "Digital Medievalist",
            "Digital Studies/Le champ numérique",
            "International Journal of Digital Curation",
            "International Journal of Humanities and Arts Computing",
            "Digital Humanities Quarterly",
            "Jahrbuch für Computerphilologie"
        ],
        "num_of_articles": 107,
        "list_of_articles": [
            "Extended nearest shrunken centroid classification: A new method for open-set authorship attribution of texts of varying sizes",
            "Translation Style and Ideology: a Corpus-assisted Analysis of two English Translations of Hongloumeng",
            "Variation in noun and pronoun frequencies in a sociohistorical corpus of English",
            "Longitudinal detection of dementia through lexical and syntactic changes in writing: a case study of three British novelists",
            "Digitizing the act of papyrological interpretation: negotiating spurious exactitude and genuine uncertainty",
            "Present, not voting: Digital Humanities in the Panopticon: closing plenary speech, Digital Humanities 2010",
            "Finding stories in the archive through paragraph alignment",
            "Techniques for transcribers: assessing and improving consistency in transcripts of spoken language",
            "The concept of evolution in the Origin of Species: a computer-assisted analysis",
            "Social network visualization from TEI data",
            "Text encoding and ontology--enlarging an ontology by semi-automatic generated instances",
            "Visual GISting: bringing together corpus linguistics and Geographical Information Systems",
            "Non-traditional prosodic features for automated phrase break prediction",
            "The benefits and limits of computerization in conflict simulation",
            "Linguistic steganography with knowledge-poor paraphrase generation",
            "A tale of two cities: implications of the similarities and differences in collaborative approaches within the digital libraries and digital humanities communities",
            "Deeper Delta across genres and languages: do we really need the most frequent words?",
            "Comparing methods for the syntactic simplification of sentences in information extraction",
            "The liberty of invention: alchemical discourse and information technology standardization",
            "Looking for translator's fingerprints: a corpus-based study on Chinese translations of Ulysses",
            "The Potosi principle: religious prosociality fosters self-organization of larger communities under extreme natural and economic conditions",
            "A Naive Bayes classifier for Shakespeare's second-person pronoun",
            "Retrieving relatives from historical data",
            "Natural language processing and early-modern dirty data: applying IBM Languageware to the 1641 depositions",
            "Factual argumentation—a core model for assertions making",
            "Handwriting input system of chinese guqin notation",
            "Using ontological and document similarity to estimate museum exhibit relatedness",
            "A visitor's guide in an active museum",
            "ImaNote",
            "Multiscale acquisition and presentation of very large artifacts",
            "Digital reconstruction of pavilions described in an ancient Indian architectural treatise",
            "A system for embodied social active listening to sound and music content",
            "Artistic line-drawings retrieval based on the pictorial content",
            "High-quality tactile paintings",
            "Fast low-memory seamless photo blending on massive point clouds using a streaming framework",
            "Learning how to match fresco fragments",
            "Digital smartpen technology and revitalization of the Myaamia language",
            "Last House on the Hill",
            "Spherical photogrammetry for cultural heritage—San Galgano Abbey and the Roman Theater, Sabratha",
            "Gradual transition detection in historic film material—a systematic study",
            "Nrityakosha",
            "Image Acquisition & Processing Routines for Damaged Manuscripts",
            "Research communities and open collaboration: the example of the Digital Classicist wik",
            "Reading with the Mandala Browser: A Case Study in Algorithmic Criticism via Experimental Visualization",
            "Something Borrowed: Sequence Alignment and the Identification of Similar Passages in Large Text Collections",
            "The Balance between On-line and In-person Interactions: Methods for the Development of Digital Humanities Collaboration",
            "Born Broken: Fonts and Information Loss in Legacy Digital Documents",
            "Use and Impact of UK Research Data Centres",
            "The Milieu and the MESSAGE: Talking to Researchers about Data Curation Issues in a Large and Diverse e-Science Project",
            "Assessing the Preservation Condition of Large and Heterogeneous Electronic Records Collections with Visualization",
            "Beyond the Data Deluge: A Research Agenda for Large-Scale Data Sharing and Reuse",
            "Use of Ontologies for Data Integration and Curation",
            "Migrating Home Computer Audio Waveforms to Digital Objects: A Case Study on Digital Archaeology",
            "Dependency Analysis of Legacy Digital Materials to Support Emulation Based Preservation",
            "Towards a Holistic Approach to Policy Interoperability in Digital Libraries and Digital Repositories",
            "Education for eScience Professionals: Integrating Data Curation and Cyberinfrastructure",
            "Making Digital Curation a Systematic Institutional Function",
            "What Constitutes Successful Format Conversion? Towards a Formalization of 'Intellectual Content'",
            "Where the Semantic Web and Web 2.0 Meet Format Risk Management: P2 Registry",
            "Automation of Flexible Migration Workflows",
            "Open Science in Practice: Researcher Perspectives and Participation",
            "Linking to Scientific Data: Identity Problems of Unruly and Poorly Bounded Digital Objects",
            "“You made it, you take care of it”: Data Management as Personal Information Management",
            "Digital Curation: The Emergence of a New Discipline",
            "Saving Second Life: Issues in Archiving a Complex, Multi-User Virtual World",
            "Curating Scientific Research Data for the Long Term: A Preservation Analysis Method in Context",
            "Citation and Peer Review of Data: Moving Towards Formal Data Publication",
            "(Not) Playing Games: Player-Produced Walkthroughs as Archival Documents of Digital Gameplay",
            "Curating Complex, Dynamic and Distributed Data: Telehealth as a Laboratory for Strategy",
            "Drawing on the digital: Analysis and modelling in architecture and music",
            "Abstract Machine – Geographical Information Systems (GIS) for literary and cultural studies: ‘Mapping Kavanagh’",
            "The Holinshed Project: Comparing and linking two editions of Holinshed's Chronicle",
            "Big digitisation: Origins, progress and prospects",
            "Words of power: Emerge, a language for the dynamic control of live performance",
            "The Eton Myers collection virtual museum",
            "Revisioning sculpture: A cultural heritage case study from Toureen Peacaun, County Tipperary, Ireland",
            "Archives 2.0 for endangered languages: From disk space to MySpace",
            "The usability of digital documents – A barrier to digital scholarship",
            "Providing next-generation tools for scholars: JSTOR's Advanced Technology Research group",
            "Too much information: Why facilitate information and media literacy?",
            "Lost in space, or confessions of an accidental geographer",
            "A place in Europe: enhancing European collaboration in historical GIS",
            "Historical land use databases: a new layer of information for geographical research",
            "Do not make snap decisions about what you are seeing: how digital analysis of the images from the Canadian Shield highlights the difficulties in classifying shapes",
            "E-learning platforms and humanities education: an African case study",
            "Mapping the Moment: a spatio-temporal interface for studying performance culture, Nottingham, 1857–1867",
            "On historical gazetteers",
            "Old habits, new dynamics: a case study of Web 2.0 in collaborative humanities and arts research",
            "The assimilation and use of GIS by historians: a sociotechnical interaction networks (STIN) analysis",
            "Missed Connections: The Collective Novel and the Metropolis",
            "Winesburg, Ohio: A Modernist Kluge",
            "Network Narration in John Dos Passos’s U.S.A. Trilogy",
            " The Globe is All One: Wars I Have Seen as Proto-Network Narrative",
            "Forward to the Past: Nostalgia for Handwriting in Scribblenauts and The World Ends with You ",
            "Digital Literature and the Modernist Problem",
            "Avatar Emergency",
            "Because It's Not There: Ekphrasis and the Threat of Graphics in Interactive Fiction",
            "New Media in the Academy: Labor and the Production of Knowledge in Scholarly Multimedia",
            "The New Place of Reading: Locative Media and the Future of Narrative",
            "Writing to be Found and Writing Readers",
            "Nodalism",
            "Readies Online",
            "Das Konzept einer polysemischer Datenbank und seine Konkretisierung im Personendaten-Repositorium der BBAW",
            "Vincent Van Gogh - The Letters",
            "Zur Immortalität elektronischer Korpora am Beispiel der Musil-Edition",
            "From Optical Fiber To Conceptual Cyberinfrastructure",
            "Humanities Approaches to Graphical Display"
        ],
        "articles_journals_ratio": 13.375
    },
    {
        "year": "2012",
        "num_of_journals": 10,
        "list_of_journals": [
            "Literary and Linguistic Computing",
            "Digital Scholarship in the Humanities",
            "Journal on Computing and Cultural Heritage",
            "Digital Philology: A Journal of Medieval Cultures",
            "Digital Medievalist",
            "Digital Studies/Le champ numérique",
            "International Journal of Digital Curation",
            "Journal of the Text Encoding Initiative",
            "Digital Humanities Quarterly",
            "Jahrbuch für Computerphilologie"
        ],
        "num_of_articles": 120,
        "list_of_articles": [
            "Graph model of Old Chinese phonological system and computing",
            "Design and implementation of an electronic lexicon for Modern Greek",
            "Detecting authorship deception: a supervised machine learning approach using author writeprints",
            "Transcription maximized; expense minimized? Crowdsourcing and editing The Collected Works of Jeremy Bentham*",
            "Names in novels: An experiment in computational stylistics",
            "Advancing aesthetic literary experience through a multimedia project",
            "Automatic prediction of gender, political affiliation, and age in Swedish politicians from the wording of their speeches--A comparative study of classifiability",
            "Toward modeling the social edition: An approach to understanding the electronic scholarly edition in the context of new and emerging social media",
            "Author discrimination between the Holy Quran and Prophet's statements",
            "Experiments in 17th century English: manual versus automatic conceptual history",
            "A trip around the world: Accommodating geographical, linguistic and cultural diversity in academic research teams",
            "Who wrote Bacon? Assessing the respective roles of Francis Bacon and his secretaries in the production of his English works",
            "Goldsmith's contributions to the 'Critical Review': a supplement",
            "Signs and apparatus in digital poetry: The example of Jean-Marie Dutey's le mange-texte",
            "Animation and manipulation figures in digital literature and the poetics of (de-)coherence: As exemplified by Gregory Chatonsky's The Subnetwork",
            "Improving record matching in imprecise and uncertain datasets",
            "Poetics of crisis or crisis of poetics in digital reading/writing?: The case of Spanish digital literature*",
            "Allusive inter-textuality in computer games",
            "Retard of progress",
            "The Tesserae Project: intertextual analysis of Latin poetry",
            "The secret life of scribes. Exploring fifteen manuscripts of Jacob van Maerlant's Scolastica (1271)",
            "Narrative rules? Story logic and the structures of games",
            "Do birds of a feather really flock together, or how to choose training samples for authorship attribution",
            "Literary reading rituals and practices on new interfaces",
            "Documenting horizons of interpretation in philosophy",
            "Supporting exploratory text analysis in literature study",
            "Layer on layer. 'Computational archaeology' in 15th-century Middle Dutch historiography",
            "A statistical comparison of regional phonetic and lexical variation in American English",
            "Mass digitization and the garbage dump: The conflicting needs of quantitative and qualitative methods",
            "Including the power of interpretation through a simulation of Peirce's process of inquiry",
            "Dynamic cartography with diachronic data: Dialectal stratigraphy",
            "Discovering land transaction relations from land deeds of Taiwan",
            "The interface between rhetoric and layout in multimodal artefacts",
            "Using latent semantic analysis to grade brief summaries: A study exploring texts at different academic levels",
            "The log-normal distribution is not an appropriate parametric model for shot length distributions of Hollywood films",
            "Extracting two thousand years of latin from a million book library",
            "Computational historiography",
            "Measuring and coding language change",
            "Annotating traditional Chinese paintings for immersive virtual exhibition",
            "Computer analysis of art",
            "Qualitative evaluation of cultural heritage information modeling techniques",
            "Imaging buddhist art with a digital large-format camera",
            "A folksonomy-based recommender system for personalized access to digital artworks",
            "Excavation-parallel laser scanning of a medieval cesspit in the archaeological zone cologne, germany",
            "Combining X-ray micro-CT technology and 3D printing for the digital preservation and study of a 19th century cantonese chess piece with intricate internal structure",
            "Interactive multimedia ethnography",
            "Automatic classification of archaeological pottery sherds",
            "Computing similarity between items in a digital library of cultural heritage",
            "A serious game model for cultural heritage",
            "The Most Delectable of Languages",
            "Stylometry for Medieval Authorship Studies: An Application to Rhyme Words",
            "Global Language or Universal Language?: From Babel to the Illustrious Vernacular",
            "“The Foot on Which He Limps”: Jean Gerson and the Rehabilitation of Jean de Meun in Arsenal 3339",
            "Readers and Compilators of Ausiàs March’s Poetry in Barcelona (BNE, MS 2985)",
            "Feuding, Factionalism and Fictions of National Identity: Reconsidering Charles VII’s Armagnacs",
            "Variance Uncovered and Errors Explained: An Analysis of Nítíða saga in the Seventeenth-Century Icelandic Manuscript js 166 FOL.",
            "Sensitive Spirits: Changing Depictions of Demonic Emotions in the Twelfth and Thirteenth Centuries",
            "Devotion and Emotion: Creating the Devout Body in Late Medieval Bruges",
            "Thomas Aquinas and Catherine of Siena: Emotion, Devotion and Mendicant Spiritualities in the Late Fourteenth Century",
            "Gardens as “Emotional Communities”: Three Medieval French Examples",
            "Anger and the “Cour amoureuse” of Charles VI: Medieval and Modern Perspectives",
            "Digital Devotion from Carolingian Reichenau and St. Gall",
            "Bytes, Words, Texts: The Anglo-Norman Dictionary and its Text-Base",
            "Building a Digital Research Community in Medieval and Early Modern Studies: The Australian Network for Early European Research",
            "The ARQUIBANC Project: Location, Recovery, Arrangement, and Dissemination of Catalan Private Archives and Documents",
            "Developing Digital Mappaemundi: An Agile Mode for Annotating Medieval Maps",
            "New Textual Traditions from Community Transcription",
            "TEI - Keeping It Simple",
            "Developing an Online Database on a Shoestring: Growing Pains at the Online Medieval Sources Bibliography",
            "The Cantus Database: Mining for Medieval Chant Traditions",
            "The Janus Intertextuality Search Engine: A Research Tool of (and for) the Electronic Manipulus florum Project",
            "New Tools for Exploring, Analysing and Categorising Medieval Scripts",
            "CARCAT: Computer-Assisted Reading and Conceptual Analysis of Texts: An experiment applied to the concept of evolution in the work of Henri Bergson",
            "Electronic Scholarly Editing in the University Classroom: an Approach to Project-based Learning",
            "Modular Design, Lateral Project Development, and the Sharing of Work: Lessons from the Edward Winslow Family Papers and the Atlantic Canada Virtual Archives",
            "Managing Risks in the Preservation of Research Data with Preservation Networks",
            "Towards the Development of a Test Corpus of Digital Objects for the Evaluation of File Format Identification Tools and Signatures",
            "Assessing Migration Risk for Scientific Data Formats",
            "Requirements for Provenance on the Web",
            "Freedom of Information in the UK and its Implications for Research in the Higher Education Sector",
            "A Short Story about XML Schemas, Digital Preservation and Format Libraries",
            "Understanding the ‘Intensive’ in ‘Data Intensive Research’: Data Flows in Next Generation Sequencing and Environmental Networked Sensors",
            "Grammar-Based Specification and Parsing of Binary File Formats",
            "Developing Virtual CD-ROM Collections: The Voyager Company Publications",
            "Digital Forensics Formats: Seeking a Digital Preservation Storage Container Format for Web Archiving",
            "The Forensic Curator: Digital Forensics as a Solution to Addressing the Curatorial Challenges Posed by Personal Digital Archives",
            "A TEI Schema for the Representation of Computer-mediated Communication",
            "Building and Maintaining the TEI LingSIG Bibliography",
            "A TEI P5 Document Grammar for the IDS Text Model",
            "Creating Lexical Resources in TEI P5",
            "The TEI and Current Standards for Structuring Linguistic Data",
            "Consistent Modeling of Heterogeneous Lexical Structures",
            "A Life Lived in Media",
            "Pertinent Discussions Toward Modeling the Social Edition: Annotated Bibliographies",
            "Envisioning the Digital Humanities",
            "The Materialities of Close Reading: 1942, 1959, 2009",
            "Comic Book Markup Language: An Introduction and Rationale",
            "Beyond Representation: Embodied Expression and Social Me-dia",
            "The Sound of Many Hands Clapping: Teaching the Digital Humanities through Virtual Research Environment (VREs)",
            "Web 2.0 and the Ontology of the Digital",
            "Towards a Richer Sense of Digital Annotation: Moving Beyond a \"Media\" Orientation of the Annotation of Digital Objects",
            "Stretched Skulls: Anamorphic Games and the memento mortem mortis ",
            "The Design of an International Social Media Event: A Day in the Life of the Digital Humanities",
            "From the Personal to the Proprietary: Conceptual Writing's Critique of Metadata",
            "Building A Volunteer Community: Results and Findings from Transcribe Bentham ",
            "Webbots and Machinic Agency",
            "Towards a Conceptual Framework for the Digital Humanities",
            "Machine Enhanced (Re)minding: the Development of Storyspace",
            " Do You Want to Save Your Progress?: The Role of Professional and Player Communities in Preserving Virtual Worlds",
            " Video-gaming, Paradise Lost and TCP/IP: an Oral History Conversation between Ray Siemens and Anne Welsh ",
            " Postmodern Culture and More: an Oral History Conversation between John Unsworth and Anne Welsh ",
            " Collaboration Must Be Fundamental or It's Not Going to Work: an Oral History Conversation between Harold Short and Julianne Nyhan ",
            " Questioning, Asking and Enduring Curiosity: an Oral History Conversation between Julianne Nyhan and Willard McCarty ",
            " Trading Stories: an Oral History Conversation between Geoffrey Rockwell and Julianne Nyhan ",
            "Building Better Digital Humanities Tools: Toward broader audiences and user-centered designs",
            "Old Ways for Linking Texts in the Digital Reading Environment: The Case of the Thompson Chain Reference Bible",
            "In One's Own Hand: Seeing Manuscripts in a Digital Age",
            "Graphic Sublime: On the Art and Designwriting of Kate Armstrong and Michael Tippett",
            "The Underside of the Digital Field",
            "TEI und Textkorpora: Fehlerklassifikation und Qualitätskontrolle vor, während und nach der Texterfassung im Deutschen Textarchiv"
        ],
        "articles_journals_ratio": 12
    },
    {
        "year": "2005",
        "num_of_journals": 5,
        "list_of_journals": [
            "Digital Scholarship in the Humanities",
            "Literary and Linguistic Computing",
            "Digital Medievalist",
            "CH Working Papers",
            "Jahrbuch für Computerphilologie"
        ],
        "num_of_articles": 67,
        "list_of_articles": [
            "The Computational Modern Greek Morphological Lexicon—An Efficient and Comprehensive System for Morphological Analysis and Synthesis",
            "Computational Contributions to the Humanities",
            "Reading the Readers: Modelling Complex Humanities Processes to Build Cognitive Systems",
            "What's in a Name? Contextualizing the Document Concept1",
            "The Application of a Geographical Information System to the Creation of a Cultural Heritage Digital Resource",
            "Named Entity Recognition for the Mainland Scandinavian Languages",
            "Unification of XML Documents with Concurrent Markup",
            "<teiPublisher>: A Repository Management System for TEI Documents",
            "Documents and Data: Modelling Materials for Humanities Research in XML and Relational Databases",
            "The HyperLearning Project: Towards a Distributed and Semantically Structured e-research and e-learning Platform",
            "Digitizing a Dictionary of Medieval Irish: the eDIL Project",
            "Burrowing into Translation: Character Idiolects in Henryk Sienkiewicz's Trilogy and its Two English Translations",
            "The Identification of Exemplar Change in the Wife of Bath's Prologue Using the Maximum Chi-Squared Method",
            "Ordering Chaos: An Integrated Guide and Online Archive of Walt Whitman's Poetry Manuscripts",
            "Development and Application of a Content Analysis Dictionary for Body Boundary Research",
            "Talking About Violence: Clustered Participles in the Speeches of Lysias",
            "A Study of Register Variation in the British National Corpus",
            "Word Sense Disambiguation Using Target Language Corpus in a Machine Translation System",
            "Optimal Strategies for Accurate Transcription",
            "Towards a Standard of Encoding Medieval Charters with XML",
            "‘VR “Montmartre in the Jazz Age” ’: The Problematics of Virtual Reality in Researching and Teaching Multicultural History",
            "E-Journal Proliferation in Emerging Economies: The Case of Latin America",
            "Sheffield Corpus of Chinese for Diachronic Linguistic Study1",
            "Teaching, Learning and Research in Final Year Humanities Computing Student Projects",
            "The Role of the Professional Intermediary in Expanding the Humanities Computing Base",
            "Applying the Semantic Web: The VICODI Experience in Creating Visual Contextualization for History",
            "A New Approach to the Study of Translationese: Machine-learning the Difference between Original and Translated Text",
            "Graphical Editor for Manuscripts",
            "The Evolution of Order in the Chapter Lengths of Trollope's Novels",
            "A Small-Corpus-Based Approach to Alice's Roles",
            "Computing Error: Reassessing Austin's Study of Groatsworth of Wit",
            "Systematic Approaches to Long Term Digital Collection Management",
            "Original, Authentic, Copy: Conceptual Issues in Digital Texts",
            "A New Technique for Authenticating Content in Evolving Marked-up Documents",
            "Communities of Interest: Issues in Establishing a Digital Resource on Murrinh-patha song at Wadeye (Port Keats), NT",
            "Who wrote Shamela? Verifying the Authorship of a Parodic Text",
            "Text-encoding, Theories of the Text, and the ‘Work-Site’",
            "Planning an Online Encyclopedia of a Nation: The Example of Te Ara, the Encyclopedia of New Zealand",
            "Computerized Restoration of Historical Dictionaries: Uniformization and Date-assigning in Dictionary Quotations of the Woordenboek der Nederlandsche Taal",
            "A Tool for Literary Studies: Intertextual Distance and Tree Classification",
            "Cryogenics and Creativity: The Frankenstein Factor in Cultural Preservation",
            "Towards the electronic Esposizioni: the challenges of the online commentary",
            "Digital palaeography: using the digital representation of medieval script to support palaeographic analysis",
            "Opening the Illustrated Incunable Short Title Catalog on CD-ROM: an end-user’s approach to an essential database",
            "Why Universal Accessibility Should Matter to the Digital Medievalist",
            "The World Wide Web as a Linguistic Corpus",
            "Pedagogy in the Electronic English Classroom: A Cluster",
            "The Nameless Shakespeare",
            "Statistical Analysis of Digital Paleographic Data: What Can It Tell Us?",
            "NUMEXCO: A Text Mining Approach to Thematic Analysis of a Philosophical Corpus",
            "Phonetic Structure and Acquisition of Laryngeal and Pharyngeal Articulations: Text-Analysis Considerations",
            "Toward Next Generation Text Analysis Tools: The Text Analysis Markup Language (TAML)",
            "Drawing Knowledge from Information: Early Modern Texts and Images on the TAPoR Platform",
            "'Is this a vision? is this a dream?': Finding New Dimensions in Shakespeare's Texts",
            "IASLONLINE – ZUM MEDIENWECHSEL. IN DER FACHKOMMUNIKATION",
            "DER DIGITALE HEINE – EIN INTERNETPORTAL. ALS INTEGRIERTES INFORMATIONSSYSTEM",
            "DIE VIRTUELLE FACHBIBLIOTHEK GERMANISTIK – EINE PROJEKTSKIZZE",
            "DEUTSCHDIACHRONDIGITAL – EIN DIACHRONES KORPUS DES DEUTSCHEN",
            "Das Aktionsbündnis Urheberrecht für Bildung und Wissenschaft und seine Ziele",
            "DIE ALTE UND DIE NEUE FREIBURGER ANTHOLOGIE – EINE ANTHOLOGISCHE LYRIKDATENBANK",
            "Computergestützte Suchverfahren in der Musikwissenschaft",
            "Musikwissenschaft und Computerphilologie – eine schwierige Liaison?",
            "Explorations in game ecology, part 1",
            "COMUTERPHILOLOGIE IN HAMBURG. THEMATISCHE MODULE EINER COMPUTERPHILOLOGISCHEN GRUNDVORLESUNG",
            "The Inclusion of Paralipomena in Genetic Editions",
            "Text Analysis and the Dynamic Edition? A Working Paper, Briefly Articulating Some Concerns with an Algorithmic Approach to the Electronic Scholarly Edition",
            "MIMes and MeRMAids: On the Possibility of Computer-aided Interpretation"
        ],
        "articles_journals_ratio": 13.4
    },
    {
        "year": "2003",
        "num_of_journals": 3,
        "list_of_journals": [
            "Literary and Linguistic Computing",
            "Computers and the Humanities",
            "CH Working Papers"
        ],
        "num_of_articles": 53,
        "list_of_articles": [
            "The Versioning Machine",
            "Towards the User: The Digital Edition of the Deutsche Worterbuch by Jacob and Wilhelm Grimm",
            "The Scottish Corpus of Texts and Speech: Problems of Corpus Design",
            "A Logic Programming Environment for Document Semantics and Inference",
            "Forensic Linguistics: its Contribution to Humanities Computing",
            "The Publication of Archaeological Excavation Reports Using XML",
            "METAe--Automated Encoding of Digitized Texts",
            "Testing Structural Properties in Textual Data: Beyond Document Grammars",
            "The Open Language Archives Community: An Infrastructure for Distributed Archiving of Language Resources",
            "Charles Brockden Brown: Quantitative Analysis and Literary Interpretation",
            "New Philology and New Phylogeny: Aspects of a Critical Electronic Edition of Wolfram's Parzival",
            "Witnessing Dickinson's Witnesses",
            "Special Section: Reconceiving Text Analysis: Toward an Algorithmic Criticism",
            "Computer-Assisted Reading: Reconceiving Text Analysis",
            "Finding a Middle Ground between 'Determinism' and 'Aesthetic Indeterminacy': a Model for Text Analysis Tools",
            "What is Text Analysis, Really?",
            "Two Styles in the New Testament Epistles",
            "Towards Automatic Retrieval of Idioms in French Newspaper Corpora",
            "Frequent Collocations and Authorial Style",
            "Validating the Logistic Model of Article Usage Preceding Multi-word Organization Names with the Aid of Computer Corpora",
            "The Role of Corpora in the Study of Paradigmatic Relations; the Cases of COBUILD's Bank of English and CREA (Reference Corpus of Contemporary Spanish)",
            "Multivariate Analysis and the Study of Style Variation",
            "Aspect Marking in English and Chinese: Using the Lancaster Corpus of Mandarin Chinese for Contrastive Language Study",
            "Intertextual Distances, Three Authors",
            "Genre-specific Features of Translationese? Linguistic Differences between Translated and Non-translated Finnish Children's Literature",
            "How Reliable is a Stemma? An Analysis of Chaucer's Miller's Tale",
            "Ngram and Bayesian Classification of Documents for Topic and Authorship",
            "Another Perspective on Vocabulary Richness",
            "Vocabulary in Interviews as Related to Respondent Characteristics",
            "Locating the Eureka Stockade: Use of a Geographical Information System (GIS) in a Historiographical Research Context",
            "Chronological Distribution of Information in Historical Texts",
            "Introducing Computational Techniques in Dialectometry",
            "The Use of the Almeida-Braun System in the Measurement of Dutch Dialect Distances",
            "Phonetic Alignment and Similarity",
            "Norwegian Dialects Examined Perceptually and Acoustically",
            "Profile-Based Linguistic Uniformity as a Generic Method for Comparing Language Varieties",
            "Lexical Distance in LAMSAS",
            "Neighbours or Enemies? Competing Variants Causing Differences in Transitional Dialects",
            "Extending Dublin Core Metadata to Support the Description and Discovery of Language Resources",
            "C-rater: Automated Scoring of Short-Answer Questions",
            "Authorship Attribution and Pastiche",
            "Modeling Task-Oriented Dialogue",
            "A Machine Learning Approach for Identification of Thesis and Conclusion Statements in Student Essays",
            "Talking about Meter in SGML",
            "Puttenham rehabilitated: the significance of ‘tune’ in The Arte of English Poesie",
            "Depth, Markup and Modelling",
            "‘Knowing true things by what their mockeries be’: Modelling in the Humanities",
            "The Lexicons of Early Modern English",
            "What you C is What You Get: Formalizing Computer Game Criticism",
            "Teaching Scholastic Courses Requiring Discussion On Line",
            "The Oral Tradition in 3D: Harold Innis, Information Visualisation and the 3D Historical Cities Project",
            "SAToRBase: A Database of Topoi for French Literature",
            "Validating choices: Texts in the Trésor de la Langue Française"
        ],
        "articles_journals_ratio": 17.666666666666668
    },
    {
        "year": "1970",
        "num_of_journals": 1,
        "list_of_journals": [
            "International Journal of Digital Curation"
        ],
        "num_of_articles": 3,
        "list_of_articles": [
            "Issues of Privacy in Qualitative Video Data Reuse",
            "Challenges and Directions in 3D and VR Data Curation",
            "Making Meaning of Historical Papua New Guinea Recordings"
        ],
        "articles_journals_ratio": 3
    },
    {
        "year": "2002",
        "num_of_journals": 3,
        "list_of_journals": [
            "Literary and Linguistic Computing",
            "Computers and the Humanities",
            "Jahrbuch für Computerphilologie"
        ],
        "num_of_articles": 49,
        "list_of_articles": [
            "Stemming of Amharic Words for Information Retrieval",
            "Humanities Computing: Essential Problems, Experimental Practice",
            "Language Independent and Practical Ontology in Korean-Japanese Machine Translation Systems",
            "Is There Life Beyond the Web?",
            "Some Reflections on Studies in Humanities Computing",
            "Experimental Poetic Practices in Spain",
            "Frequent Word Sequences and Statistical Stylistics",
            "Linguistic Computing in the Shadow of Postmodernism",
            "Genealogical Classification of Saddharmapundarika Manuscripts Based on Many-Variable Analysis",
            "Word Alignment in English-Chinese Parallel Corpora",
            "Keyword Extraction from Ancient Greek Literary Texts",
            "The Czech National Corpus: Principles, Design, and Results",
            "'Delta': a Measure of Stylistic Difference and a Guide to Likely Authorship",
            "The Pascal Digital Archive",
            "How Accurate Were Scribes? A Mathematical Model",
            "Computer-Assisted Teaching of Translation Methods",
            "Encoding Medieval Abbreviations for Computer Analysis (from Latin-Portuguese and Portuguese Non-literary Sources)",
            "A Complete and Comprehensive System for Modern Greek Language Processing Proposed as a Modern Greek Language Call Method Developer",
            "Automatically Categorizing Written Texts by Author Gender",
            "Developing Conceptual Glossaries for the Latin Vulgate Bible",
            "Web-based Dictionaries for Languages of the South-west USA",
            "Interpolations, Pseudographs, and the New Testament Epistles",
            "An SDRT Approach to the Temporal Structure of Modern Greek Narrative Texts",
            "Modelling a Morpheme-based Lexicon for Modern Greek",
            "A New Computer-Assisted Literary Criticism?",
            "The Text of Performance and the Performance of Text in the Electronic Edition",
            "Computer-Mediated Texts and Textuality: Theory and Practice",
            "Industrial Text and French Neo-Structuralism",
            "The Question concerning Theory: Humanism, Subjectivity, and Computing",
            "Animating the Language Machine: Computers and Performance",
            "Gore Galore: Literary Theory and Computer Games",
            "Mutability, Medium, and Character",
            "Profil: An Iconographic Database for Modern Watermarked Papers",
            "On the Corpus Size Needed for Compiling a Comprehensive Computational Lexicon by Automatic Lexical Acquisition",
            "Extracting an Arabic Lexicon from Arabic Newspaper Text",
            "GATE, a General Architecture for Text Engineering",
            "Statistical Morphological Disambiguation for Agglutinative Languages",
            "Stylistic Constancy and Change across Literary Corpora: Using Measures of Lexical Richness to Date Works",
            "Korean Combinatory Categorial Grammar and Statistical Parsing",
            "Text-Image Coupling for Editing Literary Sources",
            "NEW SPLASHINGS IN THE OLD POND: THE COHESIBILITY OF HUMANITIES COMPUTING",
            "»THINK BIG»: DISZIPLINARITÄT ALS WISSENSCHAFTSTHEORETISCHE BENCHMARK DER COMPUTERPHILOLOGIE",
            "IS HUMANITIES COMPUTING A DISCIPLINE?",
            "MULTIMEDIA, IS IT A DISCIPLINE? THE LIBERAL AND SERVILE ARTS IN HUMANITIES COMPUTING",
            "WHAT IS HUMANITIES COMPUTING AND WHAT IS NOT?",
            "LESEN AM COMPUTER – MEHRWERT ODER MEHR VERWIRRUNG? UNTERSUCHUNGEN ZUR ›KONKURRENZ‹ ZWISCHEN BUCH UND HYPERTEXT",
            "HYPERMEDIA AND URBAN CULTURE: A PRESENTATION ON THE CD-ROM GEORGIAN CITIES",
            "NON-TRADITIONAL AUTHORSHIP ATTRIBUTION STUDIES IN EIGHTEENTH CENTURY LITERATURE. STYLISTICS STATISTICS AND THE COMPUTER",
            "DIE ELEKTRONISCHE EDITION VON JEAN PAULS EXZERPTHEFTEN"
        ],
        "articles_journals_ratio": 16.333333333333332
    },
    {
        "year": "2006",
        "num_of_journals": 4,
        "list_of_journals": [
            "Literary and Linguistic Computing",
            "Digital Scholarship in the Humanities",
            "Digital Medievalist",
            "Jahrbuch für Computerphilologie"
        ],
        "num_of_articles": 39,
        "list_of_articles": [
            "All the Way Through: Testing for Authorship in Different Frequency Strata",
            "Modelling Space and Time in Narratives about Restaurants",
            "Human Computing--Modelling with Meaning",
            "Functional Disambiguation Based on Syntactic Structures",
            "In the Philosophy Room: Australian Realism and Digital Content Development",
            "Using Ancillary Text to Index Web-based Multimedia Objects",
            "A Prototype for Authorship Attribution Studies",
            "Rule-based Search in Text Databases with Nonstandard Orthography",
            "Callimachus—Avoiding the Pitfalls of XML for Collaborative Text Analysis",
            "Disciplined: Using Educational Studies to Analyse ‘Humanities Computing’",
            "Visual Knowledge: Textual Iconography of the Quixote, a Hypertextual Archive",
            "Introduction",
            "Geographic Variation in Acadian French /r /: What Can Correspondence Analysis Contribute Toward Explanation?",
            "Art and Science in Computational Dialectology",
            "Progress in Dialectometry: Toward Explanation",
            "Mutual Comprehensibility of Written Afrikaans and Dutch: Symmetrical or Asymmetrical?",
            "Database Design and Technical Solutions for the Management, Calculation, and Visualization of Dialect Mass Data",
            "The Relative Contribution of Pronunciational, Lexical, and Prosodic Differences to the Perceived Distances between Norwegian Dialects",
            "North American English Vowels: A Factor-analytic Perspective",
            "To What Extent are Surnames Words? Comparing Geographic Patterns of Surname and Dialect Variation in the Netherlands",
            "Identifying Linguistic Structure in Aggregate Comparison",
            "Recent Advances in Salzburg Dialectometry",
            "Measuring Syntactic Variation in Dutch Dialects",
            "Use of the Chi-Squared Test to Examine Vocabulary Differences in English Language Corpora Representing Seven Different Countries",
            "Function Words in Authorship Attribution Studies",
            "Developing Web Databases for Aboriginal Language Preservation",
            "Supporting Annotation as a Scholarly Tool--Experiences From the Online Chopin Variorum Edition",
            "Processing Internet-derived Text--Creating a Corpus of Usenet Messages",
            "Employing Thematic Variables for Enhancing Classification Accuracy Within Author Discrimination Experiments",
            "A Default Inheritance Hierarchy for Computing Hebrew Verb Morphology",
            "How to Handle Small Samples: Bootstrap and Bayesian Methods in the Analysis of Linguistic Change",
            "Trees and After: The Concept of Text Topology. Some Applications to Verb-Form Distributions in Language Corpora",
            "Experimental markup in a TEI-conformant setting",
            "Liturgy, Drama, and the Archive: Three conversions from legacy formats to TEI XML",
            "Archivierung und virtuelle Edition – Arnold Schönbergs Nachlass als offenes Archiv",
            "Mensch-Maschine Computerspiel. Über eine notwendige Paartherapie in der Medienrealität",
            "Möglichkeiten der computergestützten Regionalsprachen- forschung am Beispiel des Digitalen Wenker-Atlas (DiWA)",
            "Texttechnologie an der Universität Bielefeld",
            "Formale Repräsentation und Beschreibung von literarischen Figuren"
        ],
        "articles_journals_ratio": 9.75
    },
    {
        "year": "2017",
        "num_of_journals": 14,
        "list_of_journals": [
            "Digital Scholarship in the Humanities",
            "Journal on Computing and Cultural Heritage",
            "Digital Philology: A Journal of Medieval Cultures",
            "Digital Medievalist",
            "Digital Studies/Le champ numérique",
            "Zeitschrift für digitale Geisteswissenschaften",
            "Journal of the Japanese Association for Digital Humanities",
            "Journal of Cultural Analytics",
            "International Journal of Digital Curation",
            "International Journal of Humanities and Arts Computing",
            "Frontiers in Digital Humanities",
            "Umanistica Digitale",
            "Journal of Data Mining & Digital Humanities",
            "Digital Humanities Quarterly"
        ],
        "num_of_articles": 213,
        "list_of_articles": [
            "Syntactic patterns in classical Chinese poems: A quantitative study",
            "‘Searching for My Lady’s Bonnet: discovering poetry in the National Library of Australia’s newspapers database’",
            "A public platform for developing language-independent applications",
            "Transcribing a 17th-century botanical manuscript: Longitudinal evaluation of document layout detection and interactive transcription",
            "Harmony in diversity: The language codes in English–Chinese poetry translation",
            "Crowd-authoring versus peer-reviewing: An epistemic clash in the field of educational technology",
            "‘Proper’ pro-nun-ʃha-ʃhun1 in Eighteenth-Century English: ECEP as a New Tool for the Study of Historical Phonology and Dialectology",
            "The semantic poles of Old English: Toward the 3D representation of complex polysemy",
            "Research through design and digital humanities in practice: What, how and who in an archive research project",
            "Code, scholarship, and criticism: When is code scholarship and when is it not?",
            "Analysis of the style and the rhetoric of the 2016 US presidential primaries",
            "Beyond humanities qua digital: Spatial and material development for digital research infrastructures in HumlabX1",
            "A metrical scansion system for fixed-metre Spanish poetry",
            "Renderings: Translating literary works in the digital age",
            "Detecting pseudepigraphic texts using novel similarity measures",
            "The use of Gabor features for semi-automatically generated polyon-based ground truth of historical document images",
            "More news on Sir Thomas More",
            "An iterative 3D GIS analysis of the role of visibility in ancient Maya landscapes: A case study from Copan, Honduras",
            "Rethinking the concept of an ‘Author’ in the face of digital technology advances: A perspective from the copyright law of a commonwealth country",
            "The limits of distinctive words: Re-evaluating literature’s gender marker debate",
            "Enabling complex analysis of large-scale digital collections: humanities research, high-performance computing, and transforming access to British Library digital collections",
            "Devising Rhesus: A strange ‘collaboration’ between Aeschylus and Euripides",
            "The microanalysis of style variation",
            "Understanding and explaining Delta measures for authorship attribution",
            "Unsupervised identification of text reuse in early Chinese literature",
            "At the crossroads between the scientific and the literary discourse: Comparison as a figure of dialogism",
            "First We Feel Then We Fall: James Joyce’s Finnegans Wake as an interactive video application",
            "Analyzing and visualizing ancient Maya hieroglyphics using shape: From computer vision to Digital Humanities",
            "Measuring syntactical variation in Germanic texts",
            "Analysing and understanding news consumption patterns by tracking online user behaviour with a multimodal research design",
            "Visualizing Mouvance: Toward a visual analysis of variant medieval text traditions",
            "Non-representational approaches to modeling interpretation in a graphical environment",
            "Beauty is truth: Multi-sensory input and the challenge of designing aesthetically pleasing digital resources",
            "A lexicographical model based on the predicative framework theory (functional grammar) for sense disambiguation. An application to Latin author dictionaries",
            "Qu’est-ce qu’un texte numérique?—A new rationale for the digital representation of text",
            "Revisiting the classification of Gallo-Italic: a dialectometric approach",
            "Digital palaeography: What is digital about it?",
            "Computer stylometry of C. S. Lewis’s The Dark Tower and related texts",
            "Authorship attribution, constructed languages, and the psycholinguistics of individual variation",
            "Distributed language representation for authorship attribution",
            "CorpusTracer: A CIDOC database for tracing knowledge networks",
            "The rationale of the born-digital dossier génétique: Digital forensics and the writing process: With examples from the Thomas Kling Archive",
            "A method for content analysis applied to newspaper coverage of Japanese personalities in Brazil and Portugal",
            "At the crossroads of digital humanities and historical lexicography: The Middle Dutch ‘seemly play (abel spel) of Winter and Summer’ as a research case",
            "Mining and discovery of hidden relationships between software source codes and related textual documents",
            "Visual meta-data in qualitative analysis",
            "Correcting real-word spelling errors: A new hybrid approach",
            "Topic modelling characterization of Mudejar art based on document titles",
            "Do language combinations affect translators’ stylistic visibility in translated texts?",
            "Evaluating multi-criteria Connection mechanisms: A new algorithm for browsing digital archives",
            "Stylometry approaching Parnassus",
            "Stylometric analysis of Early Modern period English plays",
            "Toward a computational history of universities: Evaluating text mining methods for interdisciplinarity detection from PhD dissertation abstracts",
            "Improving Archaeologists’ Online Archive Experiences Through User-Centred Design",
            "The Digital Music Lab",
            "Automatic Single Page-Based Algorithms for Medieval Manuscript Analysis",
            "Extracting Maya Glyphs from Degraded Ancient Documents via Image Segmentation",
            "Multi-View Feature Combination for Ancient Paintings Chronological Classification",
            "The European Holocaust Research Infrastructure Portal",
            "From Reassembly to Object Completion",
            "Ubiquitous Access to Digital Cultural Heritage",
            "Digging Wikipedia",
            "Big Data Meets Digital Cultural Heritage",
            "A Web-Based Infrastructure for the Assisted Annotation of Heritage Collections",
            "Innovation through Large-Scale Integration of Legacy Records",
            "A Knowledge Management Architecture for Digital Cultural Heritage",
            "Cultural Heritage Routing",
            "More than Meets the Eye",
            "Enhancing Semantic Expressivity in the Cultural Heritage Domain",
            "Parametric Shape Grammar Formalism for Moorish Geometric Design Analysis and Generation",
            "ARIADNE",
            "An Innovative Cloud-Based System for the Diachronic Analysis in Numismatics",
            "Handmade Narrations",
            "Warcbase",
            "Supporting Semantic Interoperability in Conservation-Restoration Domain",
            "Remembering Christine de Pizan in Paris, BnF, MS fr. 24392, A Manuscript Owned by Anne de France, Duchess of Bourbon",
            "Lady Nature in Word and Image in Jean de Meun's Roman de la Rose",
            "Codex as Critic: One Manuscript's Dialogue with the Romance of the Rose",
            "Patterns and Fingerprints in London, British Library, MS Harley 4431",
            "The Manuscripts of the Livre des fais d'armes et de chevalerie",
            "Transmission and Materiality: Philology, Old and New, in German Medieval Studies",
            "Automatic Layout Analysis and Storage of Digitized Medieval Books",
            "Digitization at the Heidelberg University Library: The Digital Bibliotheca Palatina Project",
            "manuscripta.at: A Portal for Medieval Manuscripts Held in Austrian Libraries",
            "e-codices–Virtual Manuscript Library of Switzerland: Great Achievements and Even Greater Challenges to Come",
            "Copying, Emergence, and Digital Reproduction: Transferring Medieval Manuscript Culture into an Electronic Edition",
            "Responsible Philology: Editing the Kaiserchronik in the Digital Age",
            "Two graphical models for the analysis and comparison of cartularies",
            "Chapter 1Feeding our reading machines: From the typographic page to the docuverse",
            "​Chapter 9Beyond accessibility: Using Shared Canvas in digital facsimile editions",
            "Enter the Digital: Emergent Materiality and the Digitization of Literary Texts: The Novel as a Case Study",
            "Digital Humanities and the Geopolitics of Knowledge",
            "Radio Nouspace: Sound, Radio, Digital Humanities",
            "Toward Sustainable Growth: Lessons Learned Through the Victorian Women Writers Project",
            "Founders Online: Early Access: Reflections on Open Access, Crowd Sourcing, and Metadata Standards",
            "What’s Under the Big Tent?: A Study of ADHO Conference Abstracts",
            "Towards an ethics of alternate reality games",
            "Die Vernetzung des Textes: Im Möglichkeitsraum digitaler Literaturanalyse",
            "Turing Test für das Topic Modeling. Von Menschen und Maschinen erstellte inhaltliche Analysen der Korrespondenz von Leo von Thun-Hohenstein im Vergleich",
            "Digitale Gattungsgeschichten. Minnesang zwischen generischer Konstanz und Wende",
            "Einsatz von Topic Modeling in den Geschichtswissenschaften: Wissensbestände des 19. Jahrhunderts",
            "»Delta« in der stilometrischen Autorschaftsattribution",
            "Stylometric Analysis of Chinese Buddhist texts - Do different Chinese translations of the Gaṇḍavyūha reflect stylistic features that are typical for their age?",
            "Automatic Extraction of Reversal-Type Punch Lines in Shin'ichi Hoshi's Flash Fictions",
            "This paper aims to demonstrate that variables relating to the independency of the string parts are useful for discriminating between symphonies and string quartets in terms of their orchestrations. More specifically, this paper targets the fast initial movements of thirty-nine symphonies and twenty string quartets by Mozart. Conducted analysis extracted three factors within the twelve observed variables and suggests that one of those factors, namely, the Lower part Pitch-Name and Duration factor (LPND), can account for the differences between Mozart’s symphonies and string quartets composed after 1782.",
            "Designing Research for Monitoring Humanities-based Interdisciplinary Studies: A Case of Cultural Resources Studies (Bunkashigengaku 文化資源学) in Japan",
            "WIScking Ideas",
            "Investigating the Chronological Variation of Popular Song Lyrics ThroughLexical Indices",
            "The Tell-Tale Hat: Surfacing the Uncertainty in Folklore Classification",
            "Topic Modeling, Epistemology, and the English and German Novel",
            "Scotland’s Poetics of Space: An Experiment in Geospatial Semantics",
            "Citations for Software: Providing Identification, Access and Recognition for Research Software",
            "The Perceived Value of Acquiring Data Seals of Approval",
            "Amplifying Data Curation Efforts to Improve the Quality of Life Science Data",
            "Research Transparency: A Preliminary Study of Disciplinary Conceptualisation, Drivers, Tools and Support Services",
            "Documentation and Visualisation of Workflows for Effective Communication, Collaboration and Publication @ Source",
            "Inhabiting the Line: A Digital Chronology of Suburban Expansion for San Antonio, Texas",
            "Peering Beyond the Imperial Gaze: Using Digital Tools to Construct a Spatial History of Conquest",
            "Practicing Spatial Epistemology with Immanuel Kant's ‘Physical’ Classification",
            "Green Dreams, Toxic Legacies: Toward a Digital Political Ecology of Silicon Valley",
            "A Deep Chart (the Aqua-Face of Deep Mapping)",
            "‘The Story of Us’: Place-Making through Public Interaction with Digital GeoHumanities in Colorado Springs",
            "‘Imagined San Francisco’: Unpacking Urban Regime Theory through Interactive Cartography",
            "The Value of Plurality in ‘The Network with a Thousand Entrances’",
            "Interpretation, Agency, Entropy: Annotating Pope's Dunciads",
            "Annotation Between Formation And Information",
            "Explanatory Annotation of Literary Texts and the Reader: Seven Types of Problems",
            "The Hermeneutic Profit of Annotation: On Preventing and Fostering Disagreement in Literary Analysis",
            "Challenges for Annotation Concepts in Music",
            "Practical Linguistic Annotation: The Hebrew Bible",
            "Co-presence Analysis and Economic Patterns: Mediterranean Imports in the Celtic World",
            "Deep Creations: Intellectual Property and the Automata",
            "Coordinated Decisions and Unbalanced Power. How Latin Cities Shaped Their Terrestrial Transportation Network",
            "Interlinking Large-scale Library Data with Authority Records",
            "Iberian Neolithic Networks: The Rise and Fall of the Cardial World",
            "Was Thebes Necessary? Contingency in Spatial Modeling",
            "Extracting Coarse Body Movements from Video in Music Performance: A Comparison of Automated Computer Vision Techniques with Motion Capture Data",
            "Visibility Network Patterns and Methods for Studying Visual Relational Phenomena in Archeology",
            "Aspects of Tempo and Rhythmic Elaboration in Hindustani Music: A Corpus Study",
            "#Halal Culture on Instagram",
            "Using Semantic Linking to Understand Persons’ Networks Extracted from Text",
            "Digital Humanities and Society: an impact requiring ‘intermediation’",
            "The Gra.fo project: from collection to dissemination",
            "DanteSources: a Digital Library for Studying Dante Alighieri’s Primary Sources",
            "Computer - Assisted Processing of Intertextuality in Ancient Languages",
            "Dealing with all types of quotations (and their parallels) in a closed corpus: The methodology of the Project The literary tradition in the third and fourth centuries CE: Grammarians, rhetoricians and sophists as sources of Graeco-Roman literature",
            "Preprocessing Greek Papyri for Linguistic Annotation",
            "Editing New Testament Arabic Manuscripts in a TEI-base: fostering close reading in Digital Humanities",
            "Encoding (inter)textual insertions in Latin \"grammatical commentary\"",
            "Measuring and Mapping Intergeneric Allusion in Latin Poetry using Tesserae",
            "Recurrent Pattern Modelling in a Corpus of Armenian Manuscript Colophons",
            "Interactive Tools and Tasks for the Hebrew Bible: From Language Learning to Textual Criticism",
            "Digital Greek Patristic Catena (DGPC). A brief presentation",
            "Text Alignment in Ancient Greek and Georgian: A Case-Study on the First Homily of Gregory of Nazianzus",
            "Smarter Round Robin Scheduling Algorithm for Cloud Computing and Big Data",
            "Applying ontologies to data integration systems for bank credit risk management",
            "Cursive Arabic Handwriting Recognition System Without Explicit Segmentation Based on Hidden Markov Models",
            "A Secured Data Processing Technique for Effective Utilization of Cloud Computing",
            "Intertextual Pointers in the Text Alignment Network",
            "Processing Tools for Greek and Other Languages of the Christian Middle East",
            "Version Variation Visualization (VVV): Case Studies on the Hebrew Haggadah in English",
            "TEI-encoding of text reuses in the BIBLINDEX Project",
            "A Classification of Manuscripts Based on A New Quantitative Method. The Old Latin Witnesses of John's Gospel as Text Case",
            "Fitting Personal Interpretation with the Semantic Web: lessons learned from Pliny",
            "A Hybrid Model for Managing DH Projects",
            "To Visualize Past Communities: A Solution from Contemporary Practices in the Industry for the Digital Humanities ",
            "Structure over Style: Collaborative Authorship and the Revival of Literary Capitalism",
            "Where’s the ML in DH? And Where’s the DH in ML? The Relationship between Modern Languages and Digital Humanities, and an Argument for a Critical DHML ",
            "OCR of historical printings with an application to building diachronic corpora: A case study using the RIDGES herbal corpus",
            "Shakespeare’s Tragic Social Network; or Why All the World’s a Stage",
            "Past Visions and Reconciling Views: Visualizing Time, Texture and Themes in Cultural Collections",
            "Topic Modeling Genre: An Exploration of French Classical and Enlightenment Drama",
            "Reconstructing a website’s lost past Methodological issues concerning the history of Unibo.it",
            "Some principles for making collaborative scholarly editions in digital form",
            "A Historical Geographic Information System (HGIS) of Nubia Based on the William J. Bankes Archive (1815-1822)",
            "Mining for characterising patterns in literature using correspondence analysis: an experiment on French novels",
            "Exploratory Search Through Visual Analysis of Topic Models",
            "Diachronic trends in Homeric translations",
            "Comparing Disciplinary Patterns: Exploring the Humanities through the Lens of Scholarly Communication",
            "An Enlightenment Utopia: The Network of Sociability in Corinne",
            "The MoEML Pedagogical Partnership Program",
            "Digital Humanities Pedagogy as Essential Liberal Education: A Framework for Curriculum Development",
            "The New Itinerancy: Digital Pedagogy and the Adjunct Instructor in the Modern Academy",
            "Undergraduate Students and Digital Humanities Belonging: Metaphors and Methods for Including Undergraduate Research in DH Communities",
            "Building a Student-Centered (Digital) Learning Community With Undergraduates",
            "Friedrich Kittler's Digital Legacy – PART I - Challenges, Insights and Problem-Solving Approaches in the Editing of Complex Digital Data Collections",
            "Friedrich Kittler's Digital Legacy – PART II - Friedrich Kittler and the Digital Humanities: Forerunner, Godfather, Object of Research. An Indexer Model Research ",
            "Automated Pattern Analysis in Gesture Research: Similarity Measuring in 3D Motion Capture Models of Communicative Action",
            "Building a Toolkit for Digital Pedagogy",
            "Starting From Scratch? Workshopping New Directions in Undergraduate Digital Humanities",
            "DH for History Students: A Case Study at the Facultad de Filosofía y Letras (National Autonomous University of Mexico) ",
            "Introducing DREaM (Distant Reading Early Modernity)",
            "Teaching Electronic Literature as Digital Humanities: A Proposal",
            "A Long-Belated Welcome: Accepting Digital Humanities Methods into Non-DH Classrooms",
            "An Ontology for Gendered Content Representation of Cultural Heritage Artefacts",
            "All and Each: A Socio-Technical Review of the Europeana Project",
            "A Tale of Two Internships: Developing Digital Skills through Engaged Scholarship",
            "Collaborative Knowledge Creation and Student-Led Assignment Design: Wikipedia in the University Literature Class",
            "Recovering the London Stage Information Bank: Lessons from an Early Humanities Computing Project",
            "Towards a Seamful Design of Networked Knowledge: Practical Pedagogies in Collaborative Teams",
            "A Pedagogy for Computer-Assisted Literary Analysis: Introducing GALGO (Golden Age Literature Glossary Online) ",
            "From Disclaimer to Critique: Race and the Digital Image Archivist",
            "Digital Oulipo: Programming Potential Literature",
            "Getting on the Map: A Case Study in Digital Pedagogy and Undergraduate Crowdsourcing",
            "Playing with Identities: Queering Digital Narratology and the Exploration of Gender and Sexual Identities",
            "Media Visualization of Book Cover Images: Exploring Differences among Bestsellers in Different Countries",
            "Old Content and Modern Tools – Searching Named Entities in a Finnish OCRed Historical Newspaper Collection 1771–1910",
            "The Digital Classicist: building a Digital Humanities Community",
            "Interdisciplinary Collaboration and Brokerage in the Digital Humanities",
            "Metaphors in Digital Hermeneutics: Zooming through Literary, Didactic and Historical Representations of Imaginary and Existing Cities",
            "Crafting in Games",
            "Open Access and the Theological Imagination",
            "Tracking the telepathic sublime as a phenomenon in a digital humanities archive"
        ],
        "articles_journals_ratio": 15.214285714285714
    },
    {
        "year": "2020",
        "num_of_journals": 15,
        "list_of_journals": [
            "Digital Scholarship in the Humanities",
            "Journal on Computing and Cultural Heritage",
            "International Journal for Digital Art History",
            "Digital Philology: A Journal of Medieval Cultures",
            "Digital Studies/Le champ numérique",
            "Zeitschrift für digitale Geisteswissenschaften",
            "Journal of Cultural Analytics",
            "International Journal of Digital Curation",
            "Digitális Bölcsészet",
            "International Journal of Humanities and Arts Computing",
            "Frontiers in Digital Humanities",
            "Journal of Open Humanities Data",
            "Journal of Digital Archives and Digital Humanities",
            "Journal of Data Mining & Digital Humanities",
            "Digital Humanities Quarterly"
        ],
        "num_of_articles": 131,
        "list_of_articles": [
            "Automatically extracted parallel corpora enriched with highly useful metadata? A Wikipedia case study combining machine learning and social technology",
            "The art of nerves: A quantitative and qualitative analysis of drama at the turn of nineteenth and twentieth century",
            "Statistical approaches in literature: An application of principal component analysis and factor analysis to analyze the different arrangements about the Quran’s Suras",
            "UDAT: Compound quantitative analysis of text using machine learning",
            "‘Attention, attention, exploring minds acknowledge digital structure!’ The shift to digital humanities has happened, so what should information scientists do in response?",
            "Implications of vocabulary density for poetry: Reading T. S. Eliot’s poetry through computational methods",
            "The Marlowe corpus revisited",
            "Citational politics: Quantifying the influence of gender on citation in Digital Scholarship in the Humanities",
            "Disentangling modal meanings with distributional semantics",
            "¿Existe correlación entre importancia y centralidad? Evaluación de personajes con redes sociales en obras teatrales de la Edad de Plata",
            "Interpretation of metaphors in Chinese poetry: Where did Li Bai place his emotions?",
            "Traceability mining between unit test and source code based on textual analysis applied to software systems",
            "Poetry in action: Networks of literary communication and the cultural leverage in the eighteenth-century Seoul",
            "Interconnecting music repositories with semantic web technologies—an RDF- and schema.org-based approach",
            "The integration of heterogeneous information from diverse disciplines regarding persons and goods",
            "From print to digital: A web edition of Giacomo Leopardi’s Idilli",
            "The promise of digital humanities pedagogy: Decolonizing a diverse classroom in Ghana",
            "Multimodality and media archaeology: Complementary optics for looking at digital stuff?",
            "Recovering and rendering silenced experiences of genocides: testimonial fragments of the Holocaust",
            "From collection resources to intelligent data: Construction of intelligent digital humanities platform for local historical documents of Shanghai Jiao Tong University",
            "On the use of XML markup language in comics criticism",
            "A syntactic dependency network approach to the study of translational language",
            "Open social scholarship in action",
            "Co-occurrence graph-based context adaptation: a new unsupervised approach to word sense disambiguation",
            "Stylistic palimpsests: Computational stylistic perspectives on precursory authorship in Aphra Behn’s drama",
            "Humanidades Digitales en Filipinas: proyectos, dificultades y oportunidades de la colaboración Norte-Sur",
            "A transdisciplinary protocol for digital scholarship",
            "The Grimm Brothers: A stylometric network analysis",
            "A conceptual model to increase the visibility and usage of cultural heritage objects: The case of UNESCO’s Memory of the World list1",
            "Dynamic evolution of sentiments in Never Let Me Go: Insights from multifractal theory and its implications for literary analysis",
            "Red or white? Color in Chinese folksongs",
            "Recurrent convolutional neural networks for poet identification",
            "Development of an Augmented Reality Tour Guide for a Cultural Heritage Site",
            "Mapping Medieval Christianity. CARE-GIS",
            "VISE",
            "Supporting the Cross-cultural Appreciation of Traditional Chinese Puppetry Through a Digital Gesture Library",
            "A Procedural Approach to Creating American Second Empire Houses",
            "Creating a Knowledge Base to Research the History of UK Museums through Rapid Application Development",
            "Digital Dance Ethnography",
            "Situated Tangible Gamification of Heritage for Supporting Collaborative Learning of Young Museum Visitors",
            "Data-Driven Modelling of Daylight Scattering by Roman Window Glass",
            "ShadowPlay2.5D",
            "The Effects of VR Environments on the Acceptance, Experience, and Expectations of Cultural Heritage Learning",
            "Adding Culture to UX",
            "Technology-Enhanced Interaction with Cultural Heritage",
            "Ambient Information Visualisation and Visitors’ Technology Acceptance of Mixed Reality in Museums",
            "Earthquake Simulation on Ancient Masonry Buildings",
            "Accurate Overlapping Method of Ultra-Long Interval Time-Lapse Images for World Heritage Site Investigation",
            "Damage Assessment of Earthen Sites of the Ming Great Wall in Qinghai Province",
            "A Data-driven Approach for Architectural History Knowledge. Capturing Buildings’ Construction Events for Historical Research Collaboration",
            "An Interactive Narrative to Improve Cultural Heritage Experience in Elementary School Children",
            "“Let Them Talk!”",
            "Detection of Disaster-Affected Cultural Heritage Sites from Social Media Images Using Deep Learning Techniques",
            "SIAT",
            "From the Engraved Tablet to the Digital Tablet, History of a 15th-Century Music Score",
            "Open Workflows for Polychromatic Reconstruction of Historical Sculptural Monuments in 3D",
            "Automatic Shape Feature Recognition for Ceramic Finds",
            "Building Semantic Metadata for Historical Archives through an Ontology-driven User Interface",
            "Art for Space",
            "Defining online resources typologies in art museums: online exhibitions and publications",
            "The impact of digitization and digital resource design on the scholarly workflow in art history",
            "Method in Interdisciplinary Research",
            "Navigating Context, Pathways and Relationships in Museum Collections using Formal Concept Analysis",
            "The problem of distance in digital art history",
            "Summary of the Roundtable “Setting up a DH Curriculum or Certificate” at the Annual Meeting of the Renaissance Society of America (Toronto, March 19, 2019)",
            "Digital Art Now",
            "The Politics of Precarious Grief in Thomas Hoccleve's Regiment of Princes",
            "Sociality at the Margins in Petrus Alfonsi's Disciplina Clericalis",
            "Able-Bodied Fragility",
            "Precarious Bodies in the Old French Ami et Amile",
            "How to Do Lexical Quality Estimation of a Large OCRed Historical Finnish Newspaper Collection with Scarce Resources",
            "Theme Enrichment Analysis: A Statistical Test for Identifying Significantly Enriched Themes in a List of Stories with an Application to the Star Trek Television Franchise",
            "GameSound, Quantitative Games Analysis, and the Digital Humanities",
            "Absorbing DiRT: Tool Directories in the Digital Age",
            "Digital Queer: Tracing the Digital Discourse around Section 377 of the Indian Penal Code",
            "The Poetics of Computer Code: Tracing Digital Inscription in Ada Lovelace’s England",
            "Digital methods in difficult ethnographic fields: studying knowledge flows as complex networks through a Facebook analysis",
            "Analyse von Begleittexten am Beispiel von 103 Ethnografien",
            "Fleshing Out Models of Gender in English-Language Novels (1850 – 2000)",
            "The Social Lives of Books: Reading Victorian Literature on Goodreads",
            "What’s in a Face? Gender representation of faces in Time, 1940s-1990s",
            "Dramatic Structure and Social Status in Shakespeare’s Plays",
            "Like Two Pis in a Pod: Author Similarity Across Time in the Ancient Greek Corpus",
            "Familial Places in Jim Crow Spaces: Kinship, Demography, and the Color Line in William Faulkner’s Yoknapatawpha County",
            "Towards Continuous Quality Control for Spoken Language Corpora",
            "Facilitating Access to Restricted Data",
            "The Red Queen in the Repository",
            "An Exploratory Analysis of Social Science Graduate Education in Data Management and Data Sharing",
            "Tool Selection Among Qualitative Data Reusers",
            "Automatic Analysis of Sound Devices in Attila József’s Poems",
            "Escalated Reading",
            "Construction and Management of a Geo-Historical Information System for an Interdisciplinary and Contributory Atlas: The Historical Atlas of Limousin",
            "Bridging the Gap between Pre-census and Census-era Historical Data: Devising a Geo-sampling Model to Analyse Agricultural Production in the Long Run for Southeast Europe, 1840–1897",
            "Integrative, Interdisciplinary Database Design for the Spatial Humanities: the Case of the Holocaust Ghettos Project",
            "Displaying Spatial Epistemologies on Web GIS: Using Visual Materials from the Chinese Local Gazetteers as an Example",
            "How Can Geographic Information in Text Documents be Visualized to Support Information Exploration in the Humanities?",
            "Letters from Spain in a Space-time Box: Historical GIS with Timestamped Itineraries for Understanding the Chronotopes of Nineteenth-century Travel Writing",
            "Historical and Imagined GIS Borderlandscapes of the American West: Larry McMurtry's Lonesome Dove Tetralogy and LA Noirscapes",
            "A Spatial Analysis of Selected Art: a GIScience-Humanities Interface",
            "Spatial Archaeology: Mapping the Ancient Past with the Humanities and the Sciences",
            "The Role of Precision in Spatial Narratives: Using a Modified Discourse Quality Index to Measure the Quality of Deliberative Spatial Data",
            "Representation in Geosocial Data: Grappling with Uncertainty in Digital Traces of Human Activity",
            "Being Human in an Algorithmically Controlled World",
            "Patterns of Etruscan Urbanism",
            "Urbanity as a Process and the Role of Relative Network Properties—A Case Study From the Early Iron Age",
            "Computer-Assisted Language Comparison: State of the Art",
            "Introducing the Historical Index of Ethnic Fractionalization (HIEF) Dataset: Accounting for Longitudinal Changes in Ethnic Diversity",
            "Digital Textual Criticism: The New Literacy for Humanities Scholars",
            "Chinese Singaporean Temples: Digital Humanities Approaches to Frequency Lists of Sponsors",
            "Development and Application of Digital Humanities Research Platform for Mr. Lo Chia-Lun's Writings",
            "Design and Application of Metadata in Digital Humanities Basing on DocuSky: A Case Study of Buddhist Inscriptions",
            "Text Complexity Classification Based on Linguistic Information: Application to Intelligent Tutoring of ESL",
            "Evaluating Deep Learning Methods for Word Segmentation of Scripta Continua Texts in Old French and Latin",
            "Deep Learning for Period Classification of Historical Hebrew Texts",
            "A Web Application for Watermark Recognition",
            "Optical Recognition Assisted Transcription with Transkribus: The Experiment concerning Eugène Wilhelm's Personal Diary (1885-1951)",
            "A multi-dimensional ontology-based analysis of the Censorship of Hebrew Manuscripts",
            "Developing a Process-Oriented, Inclusive Pedagogy: At the Intersection of Digital Humanities, Second Language Acquisition, and New Literacies",
            "Episodic Theater and the Digital Text: Editing the Traveling Players’ Fortunatus",
            "Tracking the Consumption Junction: Temporal Dependencies between Articles and Advertisements in Dutch Newspapers",
            "Editorializing the Greek Anthology: The palatin manuscript as a collective imaginary",
            "Erasure, Misrepresentation and Confusion: Investigating JSTOR Topics on Women’s and Race Histories",
            "Medieval manuscript descriptions and the Semantic Web: analysing the impact of CIDOC CRM on Italian codicological-paleographical data",
            "The Push and Pull of Digital Humanities: Topic Modeling the What is digital humanities? Genre",
            "Calamari − A High-Performance Tensorflow-based Deep Learning Package for Optical Character Recognition",
            "Digital Humanities and Natural Language Processing: Je t’aime... Moi non plus",
            "Digital Editions and Version Numbering",
            "Reading Chicago Reading: Quantitative Analysis of a Repeating Literary Program",
            "Open Data in Cultural Heritage Institutions: Can We Be Better Than Data Brokers?",
            "Crowdsourcing Image Extraction and Annotation: Software Development and Case Study",
            "A Prosopography as Linked Open Data: Some Implications from DPRR"
        ],
        "articles_journals_ratio": 8.733333333333333
    },
    {
        "year": "2019",
        "num_of_journals": 19,
        "list_of_journals": [
            "International Journal of Digital Humanities",
            "Digital Scholarship in the Humanities",
            "Journal on Computing and Cultural Heritage",
            "International Journal for Digital Art History",
            "Digital Philology: A Journal of Medieval Cultures",
            "Digital Medievalist",
            "Digital Studies/Le champ numérique",
            "Zeitschrift für digitale Geisteswissenschaften",
            "Journal of the Japanese Association for Digital Humanities",
            "Journal of Cultural Analytics",
            "International Journal of Digital Curation",
            "Digitális Bölcsészet",
            "International Journal of Humanities and Arts Computing",
            "Frontiers in Digital Humanities",
            "Semantic Metadata, Humanist Computing, and Digital Humanities",
            "Umanistica Digitale",
            "Journal of Digital Archives and Digital Humanities",
            "Journal of Data Mining & Digital Humanities",
            "Digital Humanities Quarterly"
        ],
        "num_of_articles": 245,
        "list_of_articles": [
            "From time theft to time stamps: mapping the development of digital forensics from law enforcement to archival authority",
            "The .txtual condition, .txtual criticism and .txtual scholarly editing in Spanish philology",
            "Anarchive as technique in the Media Archaeology Lab | building a one Laptop Per Child mesh network",
            "The invention and dissemination of the spacer gif: implications for the future of access and use of web archives",
            "Web archives as a data resource for digital scholars",
            "A landscape of data – working with digital resources within and beyond DARIAH",
            "Web 25. Histories from the first 25 years of the world wide web",
            "Born-digital archives",
            "From graveyard to graph",
            "Tracking the evolution of translated documents: revisions, languages and contaminations",
            "Editing social media: the case of online book discussion",
            "Charles Chesnutt and the case for hybrid editing",
            "Opening the book: data models and distractions in digital scholarly editing",
            "Copies and facsimiles",
            "On edited archives and archived editions",
            "What future for digital scholarly editions? From Haute Couture to Prêt-à-Porter",
            "Artificial imagination, imagine: new developments in digital scholarly editing",
            "The Charles Harpur Critical Archive",
            "Exercises in modelling: textual variants",
            "Textuality in 3D: three-dimensional (re)constructions as digital scholarly editions",
            "The ‘assertive edition’",
            "Distant viewing: analyzing large visual corpora",
            "Toward Kurdish language processing: Experiments in collecting and processing the AsoSoft text corpus",
            "Linguistic analysis of datasets for semantic textual similarity",
            "History playground: A tool for discovering temporal trends in massive textual corpora",
            "Shelf life: Identifying the abandonment of online digital humanities projects",
            "Understanding memories of the Holocaust—A new approach to neural networks in the digital humanities",
            "Digital dance scholarship: Biomechanics and culturally situated dance analysis",
            "PaperMiner—a real-time spatiotemporal visualization for newspaper articles",
            "The visual digital turn: Using neural networks to study historical images",
            "‘The Michael Jordan of greatness’—Extracting Vossian antonomasia from two decades ofThe New York Times, 1987–2007",
            "Epic social networks and Eve's centrality in Milton’sParadise Lost",
            "Comparing multiple categories of feature selection methods for text classification",
            "Creating a richly annotated corpus of papyrological Greek: The possibilities of natural language processing approaches to a highly inflected historical language",
            "Linguistic characteristics of Chinese register based on the Menzerath—Altmann law and text clustering",
            "A case study in text mining: Textual analysis of the Territorial Papers",
            "Towards an ontology-based iconography",
            "Beyond validation: Using programmed diagnostics to learn about, monitor, and successfully complete your DH project",
            "Digital nudges and dark patterns: The angels and the archfiends of digital communication",
            "Analysis of mystical concepts in Khaghani’s Divan",
            "Transcribear – Introducing a secure online transcription and annotation tool",
            "And Quiet Flows the Don: the Sholokhov-Kryukov authorship debate",
            "Digital studies and transcontextualization of the humanities: The case of organology",
            "Transnationalizing humour on social media: A linguistic analysis of ideology, identity and didactics in Robert Mugabe Quotes memes1",
            "The visual side of digital humanities: a survey on topics, researchers, and epistemic cultures",
            "Optical character recognition of typeset Coptic text with neural networks",
            "Aesthetic appreciation and Spanish art: insights from eye-tracking",
            "Judging style: The case of Bush versus Gore",
            "FAST: Fast and Accurate Synoptic Texts",
            "Technical and methodological foundations of digital indexing of medieval and early modern court books",
            "Dating medieval texts by classification with flexible time intervals",
            "Using syntax for improving phrase-based SMT in low-resource languages",
            "Techno-poetics in micro-stories of the digital age: The case of Alex Epstein",
            "A new analytic framework for prediction of migration patterns and locations of historical manuscripts based on their script types",
            "Gender ideology and identity in humorous social media memes",
            "Digital humanities in Sweden and its infrastructure: Status quo and the sine qua non",
            "3D GIS and ‘The Royaltie Of Sight’: Recreating ‘Prospects’ and ‘Perspectives’ within an English designed landscape c. 1550–1660",
            "Are you sure your tool does what it is supposed to do? Validating Arabic root extraction",
            "Chinese Text Project: a dynamic digital library of premodern Chinese",
            "The intelligence analysis of personal characters about ordinary world",
            "Statistical analysis about the God’s traits in Quran",
            "Author identification with feature transformation method",
            "Database thinking and deep description: designing a digital archive of the National Synchrotron Light Source",
            "Affine registration of multispectral images of historical documents for optimized feature recovery",
            "Italo Calvino’s Six Memos as ethical imperative in J.R. Carpenter’s The Gathering Cloud",
            "Ontology-based analysis of the large collection of historical Hebrew manuscripts",
            "Adversative versus concessive while-clauses in native and learner English texts: A corpus-based systemic functional description",
            "A posthumanist pedagogy using digital text analysis to enhance critical thinking in higher education",
            "Text mining letters from financial regulators to firms they supervise",
            "Author identification of short texts using dependency treebanks without vocabulary",
            "Visualising Voice: Analysing spoken recordings of nineteenth-century French poetry",
            "Analysing headlines as a way of downsizing news corpora: Evidence from an Arabic–English comparable corpus of newspaper articles",
            "A statistical view to study the aphorisms in Nahj al-Balaghah",
            "Alphabet usage pattern, word lengths, and sparsity in seven Indo-European languages",
            "Bridging the digital divide: Older adults’ engagement with online cinema heritage",
            "Interfaces, ephemera, and identity: A study of the historical presentation of digital humanities resources",
            "CBDR: An efficient storage repository for cultural big data",
            "Chinua Achebe’s There was a Country and the digital publics of African literature",
            "Digital Editions of Text",
            "From Point Cloud Data to Structural Analysis Through a Geometrical hBIM-Oriented Model",
            "A New Projection-based Exhibition System for a Museum",
            "Egocentric Visitors Localization in Cultural Sites",
            "Communicating Museum Collections Information Online",
            "Improved Hieroglyph Representation for Image Retrieval",
            "Wedge Cameras for Minimally Invasive Archaeology",
            "Evaluating Digital Cultural Heritage ‘In the Wild’",
            "Computer Algorithm for Archaeological Projectile Points Automatic Classification",
            "Virtual Inpainting for Dazu Rock Carvings Based on a Sample Dataset",
            "Cultural Heritage and the Intelligent Internet of Things",
            "The Museum Opens",
            "Queer criticalities",
            "Charles in al-Andalus",
            "Mary Saves the Man-Eater: Value in the Medieval Ethiopian Marian Miracle Tale of \"The Cannibal of Qəmər\"",
            "\"Nothing in this world is indifferent to us\": Laudato Si' as Global and Planetary Medievalism",
            "The Feudal Photograph of a Democratic Dhammaraja: Secularism and Sacrality in Thai Royal Imagery",
            "Revisioning the Global Middle Ages: Immersive Environments for Teaching Medieval Languages and Culture",
            "Oceanic Epic: The Translations of the Lusiads in the Global Renaissance",
            "Tawaddud/Teodor and the Stripping of Medieval Mastery",
            "Using N-gram Analysis to Map Intertextual Networks in Old English Verse",
            "The Books of the Kings of Aragon: From James II to Alfonso IV",
            "Books and Readers in Late-Fifteenth-Century Valencia: The Inventory of Joan Rix de Cura (1490)",
            "XML-TEI Stand-off Markup: One Step Beyond",
            "The Norman Sicily Project: A Digital Portal to Sicily’s Norman Past",
            "Querying Variants: Boccaccio’s ‘Commedia’ and Data-Models",
            "Data-Driven Syllabification for Middle Dutch",
            "A Computational Approach to Source Adaptation in Thomas Malory’s Morte Darthur",
            "Prototyping Across the Disciplines",
            "The Twittersphere as Political Engagement Space: A Study of Social Media Usage in Election Campaigns in Nigeria",
            "How to Extract Good Knowledge from Bad Data: An Experiment with Eighteenth Century French Texts",
            "Introduction to a Class-based Online Writing Environment: Gwrit (Game of Writing)",
            "Applying an Ethics of Care to Internet Research: Gamergate and Digital Humanities",
            "Tagging Time and Space: TEI and the Canadian Stratford Festival Promptbooks",
            "“Fearful Dreams” in Thomas Kyd’s Restored Canon",
            "GEMMS (Gateway to Early Modern Manuscript Sermons 1530–1715): Confronting the Challenges of Sermons Research",
            "Drones and Surveillance Cultures in a Global World",
            "Muséologie numérique: Action participative en réseau et canonisation selon l’intelligence artificielle",
            "Création littéraire et Web: un cas italien",
            "Le positionnement éditorial dans l’édition critique numérique",
            "La logométrie en histoire: une herméneutique numérique. Exploration d’un corpus de professions de foi électorales de député-e-s (1958–2007)",
            "Projet Bretez: une pincée de son dans l’Histoire",
            "Les archives sans repos: enjeux d’une édition électronique",
            "Histoire et SIG: vers une heuristique des cartes relationnelles",
            "Introduction: « Humanités numériques: identités, pratiques et théories »",
            "Narratologische Textauszeichnung in Märe und Novelle. Mit Annotationsbeispielen und exemplarischer Auswertung von Sperber und Häslein durch MTLD und Sozialer Netzwerkanalyse",
            "Nicht geeignet oder nur unzureichend gestaltet? Digitale Monographien in den Geisteswissenschaften",
            "Blockchain für die Geisteswissenschaften? Möglichkeiten des Einsatzes von Blockchain und verwandten Technologien für wissenschaftliche Publikationen",
            "Konzept für den digitalen Ausbau der typologisch-vergleichenden Märchenforschung",
            "A Survey on Sentiment and Emotion Analysis for Computational Literary Studies",
            "Referenzielle Varianz in Texten über Musik",
            "Modellierung von Entzifferungshypothesen in einem digitalen Zeichenkatalog für die Maya-Schrift",
            "Modellierung von Zweifel – Vorbild TEI im Graphen",
            "Academic Meta Tool. Ein Web-Tool zur Modellierung von Vagheit",
            "Quellenverluste (Deperdita) als methodologischer Unsicherheitsbereich für Editorik und Datenmodellierung am Beispiel von Anton Weberns George-Lied op. 4 Nr. 5",
            "Accepting and Modeling Uncertainty",
            "Ambiguität und Unsicherheit: Drei Ebenen eines Datenmodells",
            "The Codex – an Atlas of Relations",
            "Blockchain – die etwas andere Datenbank",
            "A Graph Database of Aegean Seals with Uncertain Attributes",
            "Graphbasierte Modellierung von Faktenprovenienz als Grundlage für die Dokumentation von Zweifel und die Auflösung von Widersprüchen",
            "Genau, wahrscheinlich, eher nicht: Beziehungsprobleme in einem Wissensgraph",
            "Playing with Pain",
            "Remixing Retro",
            "Wrong Warping, Sequence Breaking, and Running through Code",
            "Pachinko",
            "Towards a Poetics of Strangeness: Experiments in Classifying Language of Technological Novelty",
            "Race, Writing, and Computation: Racial Difference and the US Novel, 1880-2000",
            "Social Characters: The Hierarchy of Gender in Contemporary English-Language Fiction",
            "Could Fiction Have an Information History? Statistical Probability and the Rise of the Novel",
            "Data Cultures, Culture as Data",
            "Data Is the New What? Popular Metaphors & Professional Ethics in Emerging Data Culture",
            "De-Agentializing Data Practices: The Shifting Power of Metaphor in 1990s Discourses on Data Mining",
            "Towards A Queer Futurity of Data",
            "The Carceral Archive: Documentary Records, Narrative Construction, and Predictive Risk Assessment",
            "Archival Circulation on the Web: The Vine-Tweets Dataset",
            "Data Set Failures and Intersectional Data",
            "Visual Style in Two Network Era Sitcoms",
            "Performative Data: Cultures of Government Data Practice",
            "The Canon of Dutch Literature According to Google",
            "Getting to Beta",
            "Digital Curation Education at the Universities of Ibadan and Liverpool",
            "Identifying Topical Coverages of Curricula using Topic Modeling and Visualization Techniques: A Case of Digital and Data Curation",
            "Putting the Trust into Trusted Data Repositories: A Federated Solution for the Australian National Imaging Facility",
            "Progress in Research Data Services",
            "Updating the Data Curation Continuum",
            "Thoughts on the Relationship between Digital Humanities, Library and Information Science and Libraries",
            "The Potentials of Stylometry Analysis of Hungarian Historical Text Corpora",
            "A Design for Living in the Chinese Room I.",
            "Measuring completeness as metadata quality metric in Europeana",
            "Machine-readable Literature: ”Spoken Language” in Mikszáth’s Short Stories",
            "Exploring a Model for the Semantics of Medieval Legal Charters",
            "Konrad Zuse and his Plankalkül: The Hope to Emerge from the Sleep of Sleeping Beauty",
            "A Validation of England's Nineteenth Century Tithe Files, Using GIS as a Primary Tool",
            "Authorship Verification in Arabic Using Function Words: A Controversial Case Study of Imam Ali's Book Peak of Eloquence",
            "Qualitative Spatial Representation for the Humanities",
            "Qualitative Geographies in Digital Texts: Representing Historical Spatial Identities in The Lake District",
            "Geographies of the Holocaust: Experiments in GIS, QSR, and Graph Representations",
            "Spatial Humanities 3.0: Qualitative Spatial Representation and Semantic Triples as New Means of Exploration of Complex Indigenous Spatial Representations in Sixteenth Century Early Colonial Mexican Maps",
            "Locating Past Places in Britain: Creating and Evaluating the GB1900 Gazetteer",
            "A Qualified Assertion Database for the History of Places",
            "Repopulating Landscapes: Using Offence Data to Recreate Landscapes of Incarceration and Labour at the Port Arthur Penal Station, 1830–1877",
            "Brain-computer Interfaces and Art: Toward a Theoretical Framework",
            "A Framework for Interrogating Social Media Images to Reveal an Emergent Archive of War",
            "Topic Modeling of Everyday Sexism Project Entries",
            "Technology Enhanced Learning: The Role of Ontologies for Feedback in Music Performance",
            "Mapping by Observation: Building a User-Tailored Conducting System From Spontaneous Movements",
            "Index-Driven Digitization and Indexation of Historical Archives",
            "Socio-Material Archaeological Networks at Çatalhöyük a Community Detection Approach",
            "Understanding AWE: Can a Virtual Journey, Inspired by the Overview Effect, Lead to an Increased Sense of Interconnectedness?",
            "The Origins of Trypillia Megasites",
            "More Real Than Ideal: Household and Community Diversity at Metapontum, South Italy",
            "Trajectories to Low-Density Settlements Past and Present: Paradox and Outcomes",
            "Modeling the Rise of the City: Early Urban Networks in Southern Italy",
            "Quantitative Methods for the Comparative Analysis of Cities in History",
            "Ancient City, Universal Growth? Exploring Urban Expansion and Economic Development on Rome's Eastern Periphery",
            "Collective Intelligence, the Future of Internet and the IEML: Interview to Pierre Lévy by Art Farley and Massimo Lollini",
            "The Origins of Humanities Computing and the Digital Humanities Turn",
            "Can Machines Read (Literature)?",
            "An open problem in computational stemmatology - a model for contamination",
            "The Index Thomisticus as a Big Data Project",
            "Visualizing Gender Balance in Conferences",
            "Modeling genetic networks. Gustave Roud's œuvre, from diary to poetry collections",
            "Bellini’s Correspondence: a Digital Scholarly Edition for a Multimedia Museum",
            "A Method and Implementation of Automatic Punctuation",
            "A Yorkshire Tragedy: Using Agent-Based Modeling to Suggest Authorship",
            "Creative Role Analysis of the Best Male/Female Mandarin Singer Nominees in Taiwan Golden Melody Awards (2007-2018)",
            "The International Image Interoperability Framework (IIIF) Approach to Digital Representation, View and Annotation of Buddhist Caves and Images",
            "Digital Humanities and Integrated Spatio-Temporal Information Analysis: An Individual-Use Text-Based Historical Event Analysis Tool and Its Application in Studying Ming Pirates Events",
            "An Application of Topic Modeling in the Analysis of Ancient Chinese Classical Works",
            "A Quantitative Research of the Book of Odes (Shījīng 詩經): The Discovery of the Underlying Rhythm in the Incentive Process",
            "A Collaborative Ecosystem for Digital Coptic Studies",
            "Causal reasoning and symbolic relationships in Medieval Illuminations",
            "Transcribing Foucault’s handwriting with Transkribus",
            "Mapping the Bentham Corpus: Concept-based Navigation",
            "Leveraging Concepts in Open Access Publications",
            "The Artist Libraries Project in the Labex Les passés dans le présent",
            "Individual vs. Collaborative Methods of Crowdsourced Transcription",
            "Building Bridges: Collaboration between Computer Sciences and Media Studies in a Television Archive Project",
            "Distributed reading: Literary reading in diverse environments",
            "Critically engaging with data visualization through an information literacy framework",
            "Making and Breaking: Teaching Information Ethics through Curatorial Practice",
            "Best Practices: Teaching Typographic Principles to Digital Humanities Audiences",
            "Placing Graphic Design at the Intersection of Information Visualization Fields",
            "Visual Communication and the promotion of Health: an exploration of how they intersect in Italian education",
            "Managing 100 Digital Humanities Projects: Digital Scholarship & Archiving in King’s Digital Lab ",
            "Modelling Medieval Hands: Practical OCR for Caroline Minuscule",
            "Narrelations — Visualizing Narrative Levels and their Correlations with Temporal Phenomena",
            "Towards 3D Scholarly Editions: The Battle of Mount Street Bridge",
            "Interlude: Gaining Access, Gaming Access: Balancing Internal and External Support For Interactive Digital Projects ",
            "Manifesto: A Life on the Hyphen: Balancing Identities as Librarians, Scholars, and Digital Practitioners",
            "Building Pedagogy into Project Development: Making Data Construction Visible in Digital Projects",
            "Raising Visibility in the Digital Humanities Landscape: Academic Engagement and the Question of the Library’s Role",
            "The Invisible Work of the Digital Humanities Lab: Preparing Graduate Students for Emergent Intellectual and Professional Work",
            "Affective Absence: Risks in the Institutionalization of the FemTechNet Archive",
            "Dendrography and Art History: a computer-assisted analysis of Cézanne’s Bathers.",
            "The In/Visible, In/Audible Labor of Digitizing the Public Domain",
            "Textension: Digitally Augmenting Document Spaces in Analog Texts",
            "DH Moments, Caribbean Considerations: On Reaction, Response, and Relevance in the Digital Humanities",
            "Building the Women in Book History Bibliography, or Digital Enumerative Bibliography as Preservation of Feminist Labor.",
            "A Model of Versions and Layers",
            "Manual Annotation of Unsupervised Models: Close and Distant Reading of Politics on Reddit",
            "Reading the Quan Tang shi: Literary History, Topic Modeling, Divergence Measures",
            "Finding and Interpreting Arguments: An Important Challenge for Humanities Computing and Scholarly Practice",
            "Decoupling Quality Control and Publication: The Digital Latin Library and the Traveling Imprimatur.",
            "Changes in Lyrical and Hit Diversity of Popular U.S. Songs 1956-2016",
            "Digital Collaborations: A Survey Analysis of Digital Humanities Partnerships Between Librarians and Other Academics"
        ],
        "articles_journals_ratio": 12.894736842105264
    },
    {
        "year": "2013",
        "num_of_journals": 13,
        "list_of_journals": [
            "Literary and Linguistic Computing",
            "Digital Scholarship in the Humanities",
            "Journal on Computing and Cultural Heritage",
            "Digital Philology: A Journal of Medieval Cultures",
            "Digital Medievalist",
            "Digital Studies/Le champ numérique",
            "International Journal of Digital Curation",
            "International Journal of Humanities and Arts Computing",
            "Journal of the Text Encoding Initiative",
            "Humanist Studies & the Digital Age",
            "Journal of Data Mining & Digital Humanities",
            "Digital Humanities Quarterly",
            "Jahrbuch für Computerphilologie"
        ],
        "num_of_articles": 170,
        "list_of_articles": [
            "Visualization of relationships among historical persons from Japanese historical documents",
            "Analyzing phonetic variation in the traditional English dialects: Simultaneously clustering dialects and phonetic features",
            "Defining dialect regions with interpretations: Advancing the multidimensional scaling approach",
            "'DiaTech': A new tool for dialectology",
            "Lexical meaning and spatial distribution. Evidence from geostatistical dialectometry",
            "Linguistic advergence and divergence in north-western Catalan: A dialectometric investigation of dialect leveling and border effects",
            "Variation of verbal constructions in Estonian dialects",
            "The computer-assisted analysis of a medieval commonplace book and diary (MS Zibaldone Quaresimale by Giovanni Rucellai)",
            "Synchronic patterns of Tuscan phonetic variation and diachronic change: Evidence from a dialectometric study",
            "Scaled measurement of geographic and social speech data",
            "The text-image-link-editor: A tool for linking facsimiles and transcriptions, and image annotations",
            "Omeka in the classroom: The challenges of teaching material culture in a digital world",
            "Reading practices and digital experiences: An investigation into secondary students' reading practices and XML-markup experiences of fiction",
            "Psychological profiling through textual analysis",
            "Language and gender in Congressional speech",
            "An accurate word sense disambiguation system based on weighted lexical features",
            "Towards a digital research environment for Buddhist studies",
            "Interactive layout analysis, content extraction, and transcription of historical printed books using Pattern Redundancy Analysis",
            "On the term 'text' in digital humanities",
            "Document dissimilarity within and across languages: A benchmarking study",
            "FarsiSpell: A spell-checking system for Persian using a large monolingual corpus",
            "Analyzing the BBC Voices data: Contemporary English dialect areas and their characteristic lexical variants",
            "Transparent aggregation of variables with Individual Differences Scaling",
            "Under the Workbench: An analysis of the use and preservation of MONK text mining research software",
            "Textual fingerprints of risk of war",
            "Challenging new views on familiar plotlines: A discussion of the use of XML in the development of a scholarly tool for literary pedagogy",
            "Found in translation: To what extent is authorial discriminability preserved by translators?",
            "Calculating syllable count automatically from fixed-meter poetry in English and Welsh",
            "Inadequacy of the chi-squared test to examine vocabulary differences between corpora",
            "Patterns of local discourse coherence as a feature for authorship attribution",
            "A corpus-based study of nominalization in English translations of Chinese literary prose",
            "Assessing the inter-method reliability and correlational validity of the Body Type Dictionary",
            "Optimizing word segmentation tasks using ant colony metaheuristics",
            "The stylistics and stylometry of collaborative translation: Woolf's Night and Day in Polish",
            "Language chunking, data sparseness, and the value of a long marker list: explorations with word n-grams and authorial attribution",
            "Horseshoes, handgrenades, and model fitting: the lognormal distribution is a pretty good model for shot-length distribution of Hollywood films",
            "On the features of translationese",
            "Beyond the tree of texts: Building an empirical model of scribal variation through graph analysis of texts and stemmata",
            "Analysis of lexical ambiguity in Modern Greek using a computational lexicon",
            "Ranking contemporary American poems",
            "Factoid-based prosopography and computer ontologies: towards an integrated approach",
            "DeRiK: A German reference corpus of computer-mediated communication",
            "Mind your corpus: systematic errors in authorship attribution",
            "Distant Listening to Gertrude Stein's 'Melanctha': Using Similarity Analysis in a Discovery Paradigm to Analyze Prosody and Author Influence",
            "On the distributional regularity of shot lengths in film",
            "Oral History and the Hidden Histories project: towards histories of computing in the humanities",
            "Relational data modelling of textual corpora: The Skaldic Project and its extensions",
            "Developing a New Integrated Editing Platform for Source Documents in Classics",
            "Comparative evaluation of term selection functions for authorship attribution",
            "Sharing and debating Wittgenstein by using an ontology",
            "Towards a digital geography of Hispanic Baroque art",
            "Visual workflow interfaces for editorial processes",
            "Assessing and measuring impact of a digital collection in the humanities: An analysis of the SPHERE (Stormont Parliamentary Hansards: Embedded in Research and Education) Project",
            "Complex network perspective on graphic form system of Hanzi",
            "Linked data driven multilingual access to diverse Japanese Ukiyo-e databases by generating links dynamically",
            "The MayaArch3D project: A 3D WebGIS for analyzing ancient architecture and landscapes",
            "Pundit: augmenting web contents with semantics",
            "Investigating the relatedness of the endangered Dogon languages",
            "Collaborative authorship in the twelfth century: A stylometric study of Hildegard of Bingen and Guibert of Gembloux",
            "Towards human linguistic machine translation evaluation",
            "Does size matter? Authorship attribution, small samples, big problem",
            "Method as tautology in the digital humanities",
            "DirectorNotation",
            "Reconstruction of relief objects from archeological line drawings",
            "A camera flash projector-based reconstruction system for digital preservation of artifacts",
            "Art history concepts at play with ThIATRO",
            "MuseUs",
            "An annales school-based serious game creation framework for taiwanese indigenous cultural heritage",
            "An easy to author dialogue management system for serious games",
            "WebGL-based streaming and presentation of objects with bidirectional texture functions",
            "Gaming legacy? four approaches to the relation between cultural heritage and digital technology",
            "A web platform for the consultation of spatialized and semantically enriched iconographic sources on cultural heritage buildings",
            "Fast in-place binning of laser range-scanned point sets",
            "Using procedural modeling to explore alternative designs for the louvre",
            "Design of cultural heritage information systems based on information layers",
            "Experimental archaeology and games",
            "An approach for serious game development for cultural heritage",
            "Documenting and sharing comparative analyses of 3D digital museum artifacts through semantic web annotations",
            "The Fisher Antiphonary: A Gilded Window onto the Strozzi and Late Fifteenth-Century Florentine Politics",
            "Virtuous Circles of Authorship Attribution through Quantitative Analysis: Chrétien de Troyes's Lancelot",
            "Political Idiots and Ignorant Clients: Vernacular Legal Language in Thirteenth-Century Iberian Culture",
            "Old Light on New Media: Medieval Practices in the Digital Age",
            "The Metamorphoses of Aura in Ovid and Arnaut Daniel",
            "Saracens and Race in Roman de la Rose Iconography: The Case of Dangier in MS Douce 195",
            "The Rehabilitation of Patronage in Hoccleve’s Series",
            "Circuits of Power: A Model for Rereading Poet-Patron Relations in Late-Medieval Defences of Women",
            "Erich Auerbach’s Earthly (Counter-)Philology",
            "Work, Version, Text and Scriptum: High Medieval Manuscript Terminology in the Aftermath of the New Philology",
            "Introduction: Rethinking the Boundaries of Patronage",
            "Stolen Scriptures: The Bible Historiale and the Hundred Years’ War",
            "To Console and Control: Philippe de Mézières’s Epistre Lamentable",
            "Consultation of manuscripts online: a qualitative study of three potential user categories",
            "The digital edition of the medieval charters of the Abbey of Saint-Denis: first results and prospects",
            "Accuracy and quality in historical representation: Wikipedia, textbooks and the Investiture Controversy",
            "Making stemmas with small samples, and digital approaches to publishing them: testing the stemma of Konráðs saga keisarasonar",
            "Patterns of Sentimentality in Victorian Novels",
            "Distant Listening or Playing Visualisations Pleasantly with the Eyes and Ears",
            "After the Document Model for Scholarly Communication: Some Considerations for Authoring with Rich Media",
            "How to Read a Literary Visualisation: Network Effects in the Lake School of Romantic Poetry",
            "Ukrainian Folklore Audio Project",
            "Visualising Theatre Historiography: Judith Thompson's White Biting Dog (1984 and 2011) in the Simulated Environment for Theatre (SET)",
            "Before the Beginning: The Formation of Humanities Computing as a Discipline in Canada",
            "A Digital Archives Framework for the Preservation of Cultural Artifacts with Technological Components",
            "The Critical Role of Institutional Services in Open Access Advocacy",
            "Defining What Matters When Preserving Web-Based Personal Digital Collections: Listening to Bloggers",
            "Competencies Required for Digital Curation: An Analysis of Job Advertisements",
            "Prenormative Research into Standard Messaging Formats for Engineering Materials Data",
            "Can Persistent Identifiers Be Cool?",
            "Data Management and Preservation Planning for Big Science",
            "Distributed Digital Preservation in the Cloud",
            "Generation of a Skeleton Corpus of Digital Objects for the Validation and Evaluation of Format Identification Tools and Signatures",
            "Towards Emulation-as-a-Service: Cloud Services for Versatile Digital Object Access",
            "Trust in Digital Repositories",
            "Towards Standardization: A Participatory Framework for Scientific Standard-Making",
            "Informative Provenance for Repurposed Data: A Case Study using Clinical Research Data",
            "Disciplinary differences in faculty research data management practices and perspectives",
            "Evolving Persistent Archives and Digital Library Systems: Integrating iRods, Cheshire3 and Multivalent",
            "What are Research Infrastructures?",
            "E-Infrastructure in the Humanities",
            "Integrating Holocaust Research",
            "CENDARI's Grand Challenges: Building, Contextualising and Sustaining a New Knowledge Infrastructure",
            "ARIADNE: Advanced Research Infrastructures for Archaeological Dataset Networking in Europe",
            "The Role of CLARIN in Digital Transformations in the Humanities",
            "An Approach to Analyzing Working Practices of Research Communities in the Humanities",
            "The Missing Voice: Archivists and Infrastructures for Humanities Research",
            "Crowd-sourcing as a Component of Humanities Research Infrastructures",
            "Creating Deep Maps and Spatial Narratives through Design",
            "A Religious Centre with a Civic Circumference: Towards the Concept of a Deep Map of American Religion",
            "Envisioning Deep Maps: Exploring the Spatial Navigation Metaphor in Deep Mapping",
            "TextGrid, TEXTvre, and DARIAH: Sustainability of Infrastructures for Textual Scholarship",
            "TEI and Project Bamboo",
            "TAPAS: Building a TEI Publishing and Repository Service",
            "Islandora and TEI: Current and Emerging Applications/Approaches",
            "The Evolution of the Text Encoding Initiative: From Research Project to Research Infrastructure",
            "PhiloLogic4: An Abstract TEI Query System",
            "The digital collections of words and images of the CTL - Scuola Normale Superiore: the case of Orlando Furioso",
            "\"Griseldaonline\". Una sfida al labirinto letterario",
            "Petrarch’s Early Manuscripts and Incunabula in the Oregon Petrarch Open Book",
            "If You Count It, They Will Come",
            "Clustering and Relational Ambiguity: from Text Data to Natural Data",
            "A Survey of Data Mining Techniques for Social Media Analysis",
            "Exploring Regional Development of Digital Humanities Research: A Case Study for Taiwan",
            "Data Mining on Social Interaction Networks",
            "Developing Academic Capacity in Digital Humanities: Thoughts from the Canadian Community",
            "Kindling, Disappearing, Reading",
            "Traveling the Silk Road on a Virtual Globe: Pedagogy, Technology and Evaluation for Spatial History",
            "The Boundless Book: A Conversation between the Pre-modern and Posthuman",
            "An Agent-based Model for the Humanities",
            "Performative Materiality and Theoretical Approaches to Interface",
            " Taken Possession of: The Reprinting and Reauthorship of Hawthorne's Celestial Railroad in the Antebellum Religious Press",
            "Modeling Afro-Latin American Artistic Representations in Topic Maps: Cuba’s Prominence in Latin American Discourse",
            "Sounding for Meaning: Using Theories of Knowledge Representation to Analyze Aural Patterns in Texts",
            "Digital Humanities, Copyright Law, and the Literary",
            "Revenge of the Nerd: Junot Díaz and the Networks of American Literary Imagination",
            "cut to fit the toolspun course",
            "A Deep History of Electronic Textuality: The Case of English Reprints Jhon Milton Areopagitica",
            "The .txtual Condition: Digital Humanities, Born-Digital Archives, and the Future Literary",
            "The End of Literature: Machine Reading and Amitav Ghosh’s The Calcutta Chromosome ",
            "Criminal Code: Procedural Logic and Rhetorical Excess in Videogames",
            "The Idiocy of the Digital Literary (and what does it have to do with digital humanities)?",
            "Whence Feminism? Assessing Feminist Interventions in Digital Literary Archives",
            "Code as Ritualized Poetry: The Tactics of the Transborder Immigrant Tool",
            "Curating Digital Spaces, Making Visual Arguments: A Case Study in New Media Presentations of Ancient Objects",
            " A Visual Sense is Born in the Fingertips: Towards a Digital Ekphrasis",
            "Now is the Future Now? The Urgency of Digital Curation in the Digital Humanities",
            "Playing with Chance: On Random Generation in Playable Media and Electronic Literature",
            "Visualizing Theatrical Text: From Watching the Script to the Simulated Environment for Theatre (SET)",
            "Digital Humanities: On Finding the Proper Balance between Qualitative and Quantitative Ways of Doing Research in the Humanities",
            "Quantitativ-statistische Dramenanalyse: Welche Aussagekraft haben Häufigkeitsverteilungen der Replikenlängen?",
            "Standardisierung und proprietäre Annotation im Berner Parzival-Projekt."
        ],
        "articles_journals_ratio": 13.076923076923077
    },
    {
        "year": "2014",
        "num_of_journals": 11,
        "list_of_journals": [
            "Digital Scholarship in the Humanities",
            "Literary and Linguistic Computing",
            "Journal on Computing and Cultural Heritage",
            "Digital Philology: A Journal of Medieval Cultures",
            "Digital Medievalist",
            "Digital Studies/Le champ numérique",
            "International Journal of Digital Curation",
            "International Journal of Humanities and Arts Computing",
            "Journal of the Text Encoding Initiative",
            "Journal of Data Mining & Digital Humanities",
            "Digital Humanities Quarterly"
        ],
        "num_of_articles": 119,
        "list_of_articles": [
            "Parsing early and late modern English corpora",
            "Extracting structured data from publications in the Art Conservation Domain",
            "A model for a virtualLdoD",
            "Geographical and linguistic diversity in the Digital Humanities",
            "Computer-supported collation of modern manuscripts: CollateX and the Beckett Digital Manuscript Project",
            "Stylometric classification of different translations of the same text into the same language",
            "What grammar reveals about sex and death: interdisciplinary applications of corpus-based linguistics",
            "An analysis of the relationship between cohesion and clause combination in English discourse employing NLP and data mining approaches",
            "Modeling the scholars: Detecting intertextuality through enhanced word-level n-gram matching",
            "Simulation of the Complex System of Speech Interaction: Digital Visualizations",
            "Collaborative authorship: Conrad, Ford and Rolling Delta",
            "Visibility and meaning in topic models and 18th-century subject indexes",
            "Citations, contexts, and humanistic discourse: Toward automatic extraction and classification",
            "Automatic detection of reuses and citations in literary texts",
            "Getting there from here. Remembering the future of digital humanities: Roberto Busa Award lecture 2013",
            "Epistolary voices. The case of Elisabeth Wolff and Agatha Deken",
            "What Ever Happened to Project Bamboo?",
            "An optimized platform for capturing metadata of historical correspondence",
            "Mapping Homer's Catalogue of Ships",
            "Deconstructing arguments via digital mining of online comments",
            "The semantics of poetry: A distributional reading",
            "Judy Malloy's seat at the (database) table: A feminist reception history of early hypertext literature",
            "Teaching online courses in linguistics:",
            "Composing narrative discourse for stories of many characters: A case study over a chess game",
            "Towards modeling expressed emotions in oral history interviews: Using verbal and nonverbal signals to track personal narratives",
            "Can believable characters act unexpectedly?",
            "Narrative similarity as common summary: Evaluation of behavioral and computational aspects",
            "Verifying the authorship of Saikaku Ihara’s work in early modern Japanese literature; a quantitative approach",
            "Annotating with Propp’sMorphology of the Folktale: reproducibility and trainability",
            "The influence of language orthographic characteristics on digital word recognition",
            "Arguments as a new perspective on character motive in stories",
            "An NLP-based cross-document approach to narrative structure discovery",
            "Cognitive models of discourse comprehension for narrative generation",
            "Citation segmentation from sparse & noisy data: A joint inference approach with Markov logic networks",
            "Discriminative reranking for context-sensitive spell–checker",
            "Twitter corpus creation: The case of a Malay Chat-style-text Corpus (MCC)",
            "Vocabulary decay in category romance",
            "Analysis of variation significance in artificial traditions using Stemmaweb",
            "Interacting with the past",
            "Color-Based Algorithm for Automatic Merging of Multiview 3D Point Clouds",
            "Hyper3D",
            "Intangible cultural heritage preservation",
            "Reading the legends of Roman Republican coins",
            "A Discrete Approach for Pairwise Matching of Archaeological Fragments",
            "Automated Notation of Piano Recordings for Historic Performance Practice Study",
            "Interacting with Traditional Chinese Culture through Natural Language",
            "Interacting with the Andrea Palladio Works",
            "Interacting with Virtual Reconstructions in Museums",
            "Capture, Modeling, and Recognition of Expert Technical Gestures in Wheel-Throwing Art of Pottery",
            "The Sephardic Past in the Digital Future",
            "Return to Commentary: On the Tears of Moses in the Libro de buen amor",
            "An Electronic Corpus of Fifteenth-Century Castilian Cancionero Manuscripts",
            "Mossèn Avinyó, the Cancionero de Vindel and the Cançoner llemosí del siglo XV",
            "Cançoners DB: A New Research Tool for the Study of Medieval Catalan Songbooks",
            "Reflections on the Making of a Census of Medieval Catalan Translations",
            "A Brief History of the Llull DB and Its Derivatives",
            "Cracking the Code: Reflections on Manuscripts in the Age of Digital Books",
            "Making Histories: Locating the Belfast Fragment of the Middle English Prose Brut",
            "Deciphering the Brut: Lambeth Palace MS 6 and the Perils of Transmission",
            "Echoes in the Margins: Reading the Dartmouth Brut in Early Modern England",
            "“It is to harde for my lernyng”: Making Sense of Annotations in Brut Manuscripts",
            "The Dartmouth Brut: Conservation, Authenticity, Dissemination",
            "Encountering the Dartmouth Brut in the Midst of History",
            "“History Repeats itself”: The Dartmouth Brut and Fifteenth-Century Historiography",
            "Contextualizing the Dartmouth Brut: From Professional Manuscripts to “The Worst Little Scribbler in Surrey”",
            "Exploration of a Large Database of French Notarial Acts with Social Network Methods",
            "Semantic linking of the Pre-Christian Religions of the North",
            "Pornographers and Pirates: Intellectual Property and Netporn",
            "The Rise, Fall, and Rise of ACTA?",
            "Creating an Online Television Archive, 1987–2013",
            "Examining Disclosure Risk and Data Utility: An Administrative Data Case Study",
            "Managing the Public to Manage Data: Citizen Science and Astronomy",
            "Data Management in Metagenomics: A Risk Management Approach",
            "Publishing and Pushing: Mixing Models for Communicating Research Data in Archaeology",
            "eBird: Curating Citizen Science Data for Use by Diverse Communities",
            "Process Management Plans",
            "Data Producers Courting Data Reusers: Two Cases from Modeling Communities",
            "The Use of PDF/A in Digital Archives: A Case Study from Archaeology",
            "Appraisal and Selection for Digital Curation",
            "Video Game Preservation in the UK: A Survey of Records Management Practices",
            "Silk Purses and Sow's Ears: Can Structured Data Deal with Historical Sources?",
            "Geographic Information Systems and Historical Research: An Appraisal",
            "Crowdsourcing Bentham: Beyond the Traditional Boundaries of Academic History",
            "Manuscripts and Machines: The Automatic Replacement of Spelling Variants in a Portuguese Historical Corpus",
            "From the Scholarly Edition to Visualization: Re-using Encoded Data for Historical Research",
            "The Importance of Web Archives for Humanities",
            "Reconstructing Urbanization of a Pennine Fringe Township Through Computational Chaining of Land Tax Records: Mottram in Longdendale 1784–1830",
            "The 1846 Repeal of the Corn Laws: Insights from a Classification Tree Approach",
            "Automatic Record Linkage of Individuals and Households in Historical Census Data",
            "The New Apparatus of Influence: Material Modernism in the Digital Age",
            "Evaluating Digital Scholarship: Suggestions and Strategies for the Text Encoding Initiative",
            "Learning the TEI in a Digital Environment",
            "A Design Methodology for Exploring and Communicating System Values and Assumptions",
            "Towards an Interoperable Digital Scholarly Edition",
            "A New Approach to Reporting Archaeological Surveys: Connecting Rough Cilicia, Visible Past and Open Context through loose coupling and 3d codes",
            "Pattern Recognition in Narrative: Tracking Emotional Expression in Context",
            "ANALYSING JOURNALISTIC DISCOURSE AND FINDING OPINIONS SEMI-AUTOMATICALLY?: A CASE STUDY OF THE 2007 AND 2012 PRESIDENTIAL FRENCH CAMPAIGNS",
            "Mining for the Meanings of a Murder: The Impact of OCR Quality on the Use of Digitized Historical Newspapers",
            "Xpos’re: A Tool for Rich Internet Publications",
            "Computational Stylistic Analysis of Popular Songs of Japanese Female Singer-songwriters",
            "Digital Humanities, Postfoundationalism, Postindustrial Culture",
            "A Design Methodology for Web-based Sound Archives",
            "Managing an Established Digital Humanities Project: Principles and Practices from the Twentieth Year of the William Blake Archive",
            "Multimodal Editing and Archival Performance: A Diagrammatic Essay on Transcoding Experimental Literature",
            " War in Parliament: What a Digital Approach Can Add to the Study of Parliamentary History ",
            "A Digital Humanities Approach to Narrative Voice in The Secret Scripture: Proposing a New Research Method",
            "Burying Dead Projects: Depositing the Globalization Compendium",
            "Escaping the Shallows: Deep Reading’s Revival in the Digital Age",
            "Canonical References in Electronic Texts: Rationale and Best Practices",
            "Digital Caricature",
            "Social Networks and Archival Context Project: A Case Study of Emerging Cyberinfrastructure",
            "Computers, Comics and Cult Status: A Forensics of Digital Graphic Novels",
            "Adobe Photoshop and Eighteenth-Century Manuscripts: A New Approach to Digital Paleography",
            "J. M. Coetzee's Work in Stylostatistics",
            "Visualizing and Analyzing the Hollywood Screenplay with ScripThreads",
            "Versioning Loss: Jonathan Safran Foer’s Tree of Codes and the Materiality of Digital Publishing",
            "Curating Electronic Literature as Critical and Scholarly Practice",
            "Agent-Based Modeling and Historical Simulation",
            "Beyond Gutenberg: Transcending the Document Paradigm in Digital Humanities"
        ],
        "articles_journals_ratio": 10.818181818181818
    },
    {
        "year": "2009",
        "num_of_journals": 7,
        "list_of_journals": [
            "Literary and Linguistic Computing",
            "Journal on Computing and Cultural Heritage",
            "International Journal of Digital Curation",
            "International Journal of Humanities and Arts Computing",
            "CH Working Papers",
            "Jahrbuch für Computerphilologie",
            "Digital Humanities Quarterly"
        ],
        "num_of_articles": 143,
        "list_of_articles": [
            "What text really is not, and why editors have to learn to swim",
            "The dank cellar of electronic texts",
            "Editing Environments: The Architecture of Electronic Texts",
            "Material text, immaterial text, and the electronic environment",
            "How to teach your edition how to swim",
            "Describing, transcribing, encoding, and editing modern correspondence material: a textbase approach",
            "Data and Wisdom: Electronic Editing and the Quantification of Knowledge",
            "Access",
            "Back to the future: what digital editors can learn from print editorial practice",
            "A chronometric approach to Indian alchemical literature",
            "Lexical Diversity in a Literary Genre: A Corpus Study of the Rgveda",
            "The TEI as luminol: Forensic philology in a digital age",
            "Evaluating methods for computer-assisted stemmatology using artificial benchmark data sets",
            "Sustainability of annotated resources in linguistics: A web-platform for exploring, querying, and distributing linguistic corpora and other resources",
            "TEI Analytics: converting documents into a TEI format for cross-collection text analysis",
            "iTrench: A study of user reactions to the use of information technology in field archaeology",
            "Reflecting on a dual publication: Henry III Fine Rolls print and web",
            "Annotated Facsimile Editions: Defining macro-level structure for image-based electronic editions",
            "'It's a team if you use \"reply all\" ': An exploration of research teams in digital humanities environments",
            "TEI and cultural heritage ontologies: Exchange of information?",
            "Performance as digital text: Capturing signals and secret messages in a media-rich experience",
            "TEI in a crystal ball",
            "TEI documents in the grid",
            "The making of TEI P5",
            "Teaching TEI: The Need for TEI by Example",
            "Converting Saint Paul: A new TEI P5 edition of The Conversion of Saint Paul using stand-off methodology",
            "Reconstructing the textual evolution of a medieval manuscript",
            "The digital edition of the Statuta comunis Vicentie of 1264",
            "The TEIViewer: Facilitating the transition from XML to web display",
            "Towards a TEI-based encoding scheme for the annotation of parallel texts",
            "SusTEInability of linguistic resources through feature structures",
            "Dictionary generation for less-frequent language pairs using WordNet",
            "Untangling the derivatives: points for clarification in the findings of the Shakespeare Clinic",
            "An exercise in non-ideal authorship attribution: the mysterious Maria Ward",
            "Two tough nuts to crack: did Shakespeare write the 'Shakespeare' portions of Sir Thomas More and Edward III? Part II: Conclusion",
            "TreeForm: Explaining and exploring grammar through syntax trees",
            "Research portals in the arts and humanities",
            "Old spellings, new methods: automated procedures for indeterminate linguistic data",
            "Etymological trends in the Sanskrit vocabulary",
            "Mining a corpus of biographical texts using keywords",
            "Quantitative evidence for a hypothesis regarding the attribution of early Buddhist translations",
            "CETA in the Context of the Coruna Corpus",
            "Constructing a roadmap to more systematic and successful online reading and vocabulary acquisition",
            "Goldsmith and the 'British Magazine': A reconsideration",
            "Digital anastylosis of the Octagon in Ephesos",
            "3D modeling of complex and detailed cultural heritage using multi-resolution data",
            "High dynamic range—a gateway for predictive ancient lighting",
            "The arrigo showcase reloaded—towards a sustainable link between 3D and semantics",
            "The musical heritage of futurism",
            "Wind flow modeling and simulation over the Giza Plateau cultural heritage site in Egypt",
            "Research challenges for digital archives of 3D cultural heritage models",
            "Ottoman archives explorer",
            "Preservation Is Not a Place",
            "ARCHER – e-Research Tools for Research Data Management",
            "DCC&U: An Extended Digital Curation Lifecycle Model",
            "The Publication of Research Data: Researcher Attitudes and Behaviour",
            "Relay-supporting Archives: Requirements and Progress",
            "An Institutional Framework for Creating Authentic Digital Objects",
            "Strategies for the Curation of CAD Engineering Models",
            "Curating Architectural 3D CAD Models",
            "UK Government Web Continuity: Persisting Access through Aligning Infrastructures",
            "Design and Implementation of the Australian National Data Service",
            "Data Stewardship: Environmental Data Curation and a Web-of-Repositories",
            "A Compound Object Authoring and Publishing Tool for Literary Scholars based on the IFLA-FRBR",
            "Comparison of Strategies and Policies for Building Distributed Digital Preservation Infrastructure: Initial Findings from the MetaArchive Cooperative",
            "DCC DIFFUSE Standards Frameworks: A Standards Path through the Curation Lifecycle",
            "Data Curation in Climate and Weather: Transforming Our Ability to Improve Predictions through Global Knowledge Sharing",
            "One for Many: A Metadata Concept for Mixed Digital Content at a State Archive",
            "Embedding Metadata and Other Semantics in Word Processing Documents",
            "The eXtensible Access Method (XAM) Standard",
            "Enabling Product Design Reuse by Long-term Preservation of Engineering Knowledge",
            "Multi-scale Data Sharing in the Life Sciences: Some Lessons for Policy Makers",
            "Data Curation Program Development in U.S. Universities: The Georgia Institute of Technology Example",
            "Constructing Data Curation Profiles",
            "Using the DCC Lifecycle Model to Curate a Gene Expression Database: A Case Study",
            "Designing for Discovery and Re-Use: the ‘ANDS Data Sharing Verbs’ Approach to Service Decomposition",
            "The Significance of Storage in the “Cost of Risk” of Digital Preservation",
            "Curating the CIA World Factbook",
            "Long-term Preservation of Earth Observation Data and Knowledge in ESA through CASPAR",
            "Phonetic and Lexical Predictors of Intelligibility",
            "Linguistic Determinants of the Intelligibility of Swedish Words among Danes",
            "Mutual Intelligibility of Standard and Regional Dutch Language Varieties",
            "The Dutch–German Border: Relating Linguistic, Geographic and Social Distances",
            "The Space of Tuscan Dialectal Variation: A Correlation Study",
            "Recognising Groups among Dialects",
            "Comparison of Component Models in Analysing the Distribution of Dialectal Features",
            "Factor Analysis of Vowel Pronunciation in Swedish Dialects",
            "Representing Tone in Levenshtein Distance",
            "The Role of Concept Characteristics in Lexical Dialectometry",
            "What Role does Dialect Knowledge Play in the Perception of Linguistic Distances?",
            "Quantifying Dialect Similarity by Comparison of the Lexical Distribution of Phonemes",
            "Corpus-based Dialectometry: Aggregate Morphosyntactic Variability in British English Dialects",
            "The eastcree.org Web Databases: Participatory Action Research with Information Technology",
            "From Complicity to Interactivity: Theories of Feminist Game Play",
            "A Web of Possibilities: Faculty Sharing Ideas For Technology Integration In Teaching",
            "Coincidental Technologies: Moving Parts in Early Books and in Early Hypertext",
            "Computergestützte Literaturwissenschaft als Kulturwissenschaft. Eine Wunschliste",
            "Automatisches metrisches Markup deutschsprachiger Gedichte",
            "Textual Studies and the TEI: Encoding Thomas Moore’s Lalla Rookh",
            "Bridging the Gap ",
            "The transition from classical to digital thinking Reflections on Tim McLoughlin, James Barry and collaborative work",
            "Questions & Answers for TEI Newcomers ",
            "Editorial Teamwork in a Digital Environment: The Edition of the Correspondence of Giacomo Puccini",
            "The William Godwin’s Diaries Project: Customising and transforming TEI P5 XML for project work",
            "Irish glossaries and other digital resources for early Irish studies ",
            "The pluralistic approach – The first scholarly edition of William of Auxerre’s treatise on liturgy",
            "A Digital Edition of a Spanish 18th Century Account Book: User Driven Digitisation",
            "A Digital Edition of a Spanish 18th Century Account Book: Formalisation and Encoding",
            "Cyberinfrastructure for Classical Philology",
            "Tachypaedia Byzantina: The Suda On Line as Collaborative Encyclopedia",
            "The database as a vehicle for reconceiving place through the new media art interface",
            "Exploring Historical RDF with Heml",
            "Digitizing Latin Incunabula: Challenges, Methods, and Possibilities",
            "Citation in Classical Studies",
            "Digital Criticism: Editorial Standards for the Homer Multitext ",
            "Epigraphy in 2017",
            "Digital Geography and Classics",
            "What Your Teacher Told You is True: Latin Verbs Have Four Principal Parts ",
            "Computational Linguistics and Classical Lexicography",
            "Classics in the Million Book Library",
            "Conclusion: Cyberinfrastructure, the Scaife Digital Library and Classics in a Digital age",
            "Done: Finishing Projects in the Digital Humanities",
            "Large-Scale Humanities Computing Projects: Snakes Eating Tails, or Every End is a New Beginning? ",
            "It’s For Sale, So It Must Be Finished: Digital Projects in the Scholarly Publishing World",
            "Published Yet Never Done: The Tension Between Projection and Completion in Digital Humanities Research",
            "Words, Patterns and Documents: Experiments in Machine Learning and Text Analysis",
            "Vive la Différence! Text Mining Gender Difference in French Literature ",
            "Gender, Race, and Nationality in Black Drama, 1950-2006: Mining Differences in Language Use in Authors and their Characters",
            "Mining Eighteenth Century Ontologies: Machine Learning and Knowledge Classification in the Encyclopédie ",
            "Text Minding: A Response to Gender, Race, and Nationality in Black Drama, 1850-2000: Mining Differences in Language Use in Authors and their Characters ",
            "Communitizing Electronic Literature",
            "Teaching and Learning from the U.S. South in Global Contexts: A Case Study of Southern Spaces and Southcomb",
            "Designing Choreographies for the New Economy of Attention ",
            "The Ends of Editing",
            "Picture Problems: X-Editing Images 1992-2010",
            "Edition, Project, Database, Archive, Thematic Research Collection: What's in a Name?",
            "How Literary Works Exist: Convenient Scholarly Editions",
            "The Productive Unease of 21st-century Digital Scholarship",
            "The Radical Historicity of Everything: Exploring Shakespearean Identity with Web 2.0",
            "XML, Interoperability and the Social Construction of Markup Languages: The Library Example",
            "Humanities Computing as Digital Humanities",
            "Avatari: Disruption and Imago in Video Games",
            "Designing Data Mining Droplets: New Interface Objects for the Humanities Scholar"
        ],
        "articles_journals_ratio": 20.428571428571427
    },
    {
        "year": "2001",
        "num_of_journals": 3,
        "list_of_journals": [
            "Literary and Linguistic Computing",
            "Computers and the Humanities",
            "Jahrbuch für Computerphilologie"
        ],
        "num_of_articles": 56,
        "list_of_articles": [
            "An assistant tool for verse-making in Basque based on two-level morphology",
            "Applying machine learning toward an automatic classification of It",
            "Structured text corpora in the study of language variation and change",
            "On consensus between tree-representations of linguistic data",
            "Shouting and screaming: manner and noise verbs in communication",
            "New directions in middle high German lexicography: dictionaries interlinked electronically",
            "Books into bytes: Jacob and Wilhelm Grimm's Deutsches Worterbuch on CD-ROM and on the Internet",
            "Kirrkirr: software for browsing and visual exploration of a structured Warlpiri",
            "The Electronic Scottish National Dictionary (eSND): work in progress",
            "The Miguel de Cervantes Digital Library: the Hispanic voice on the web",
            "The FALMER Project: an electronic critical edition",
            "New models for electronic publishing",
            "A toolbox for the electronic classroom",
            "Smoking guns and silver bullets: could John Ford have written the Funeral Elegy?",
            "A computer model for the Pauline epistles",
            "A pilot study on gender differences in conversational speech on lexical in richness measures",
            "Efficient dependency analysis for Korean sentences based on lexical association and multi-layered chunking",
            "The World of Dante: a hypermedia archive for the study of the Inferno",
            "The Statistical Analysis of Style: Reflections on Form, Meaning, and Ideology in the 'Nausicaa' Episode of Ulysses",
            "Graphical Analysis of the Sentence Length Distribution Curve and Non-rational Components",
            "The Density of Latinate Words in the Speeches of Jane Austen's Characters",
            "A Widow and her Soldier: Stylometry and the American Civil War",
            "Statistical Stylistics and Authorship Attribution: an Empirical Investigation",
            "Automatic Corpora-based Stemming in Greek",
            "Estimating Distances between Manuscripts Based on Copying Errors",
            "Pattern Processing in Melodic Sequences: Challenges, Caveats and Prospects",
            "Perceptual Issues in Music Pattern Recognition: Complexity of Rhythm and Key Finding",
            "Representing Melodic Patterns as Networks of Elaborations",
            "Approximate Musical Evolution",
            "Investigating the Influence of Representations and Algorithms in Music Classification",
            "Finding Syntactic Structure in Unparsed Corpora: \"The Gsearch Corpus Query System\"",
            "The Challenge of Optical Music Recognition",
            "Archaeological Data Models and Web Publication Using XML",
            "Sentential Count Rules for Arabic Language",
            "Change-Point Analysis: Elision in Euripides' \"Orestes\"",
            "Computer-Based Authorship Attribution without Lexical Measures",
            "Integrating Linguistic Resources in TC through WSD",
            "Spanish Word Frequency: A Historical Surprise",
            "Computing Historical Consciousness. A Quantitative Inquiry into the Presence of the Past in Newspaper Texts",
            "The Times and the Man as Predictors of Emotion and Style in the Inaugural Addresses of U.S. Presidents",
            "Automatic Extraction of Collocations from Korean Text",
            "Data Mining and Serial Documents",
            "Stephen Crane and the \"New-York Tribune\": A Case Study in Traditional and Non-Traditional Authorship Attribution",
            "Identifying Syntactic Ambiguities in Single-Parse Arabic Sentence",
            "A Framework for Cross-Language Information Access: Application to English and Japanese",
            "Japanese/English Cross-Language Information Retrieval: Exploration of Query Translation and Transliteration",
            "A Method for Supporting Document Selection in Cross-Language Information Retrieval and Its Evaluation",
            "PC UND INTERNET IN ALTGERMANISTISCHER. FORSCHUNG UND LEHRE. ERFAHRUNGEN UND DESIDERATE",
            "XML-STANDARDS ALS MOTOR. FÜR DEN AUSBAU VIRTUELLER LEHRANGEBOTE",
            "EINLADUNG ZUR LITERATURWISSENSCHAFT[1]. DAS ESSENER INTERNET-VERTIEFUNGSPROGRAMM ZUM SELBSTSTUDIUM. EIN ERFAHRUNGSBERICHT",
            "LINKLISTE UND LESELUST. MÖGLICHKEITEN DER LITERATURVERMITTLUNG IM INTERNET",
            "RETRODIGITALISIERUNG IN BIBLIOTHEKEN UND WISSENSCHAFTLICHEN EINRICHTUNGEN",
            "ÜBER DEN ÄSTHETISCHEN BEGRIFF DES SPIELS ALS LINK ZWISCHEN TRADITIONELLER TEXTHERMENEUTIK, HYPERFICTION UND COMPUTERSPIELEN",
            "TEXT IM HYPERTEXT. EIN TEXTLINGUISTISCHER BLICK AUF DIE INFORMATIONSGESTALTUNG IM INTERNET",
            "EUROPA UND DIE NEUEN MEDIEN. ACO*HUM EVALUIERT DIE GEISTESWISSENSCHAFTEN",
            "WARUM NOCH DRUCKEN? ÜBER DIE NACHTEILE GEDRUCKTER EDITIONEN"
        ],
        "articles_journals_ratio": 18.666666666666668
    }
]