[{"url": "http://dx.doi.org/10.4000/jtei.974", "identifier": {"string_id": "10.4000/jtei.974", "id_scheme": "DOI"}, "abstract": "This paper attempts to make two contributions to discussions related to TEI: (1) an analysis of how tools used for working with TEI documents encourage certain values and make certain assumptions about the work of textual editing and (2) a report on a methodological framework from outside the humanities that suggests a unique way to study such systems. Borrowing models of design research from the fields of design and human-computer interaction, I argue that prototypes can be used to create new conceptual knowledge, to investigate the values and assumptions of sociotechnical systems, and to communicate alternative visions of those systems. I first analyze an existing tool, the Versioning Machine, as a way of focusing the design of a prototype that reimagines several aspects of that original—specifically, I argue that the Versioning Machine creates an environment that to some extent assumes that TEI documents are created by one editor and intended for one instantiation. The prototype presented experiments with an alternative vision of textual editing as bringing encoded texts and interpretations together in multiple and flexible instantiations. Rather than a technical problem with an optimal solution, I approach this design process as an opportunity to ask how prototypes can give designers access to conceptual issues and allow users to enact alternative values and imagine alternative futures. This research was supported by the Modernist Versions Project, which is funded by a Social Sciences and Humanities Research Council of Canada Partnership Development Grant.", "article_title": "A Design Methodology for Exploring and Communicating System Values and Assumptions", "authors": [{"given": "Daniel", "family": "Carter", "affiliation": {"original_name": "University of Texas at Austin", "normalized_name": "The University of Texas at Austin", "country": "United States", "identifiers": {"ror": "https://ror.org/00hj54h04", "GRID": "grid.89336.37"}}}], "publisher": "OpenEdition", "date": "2014-11-15", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 7", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.979", "identifier": {"string_id": "10.4000/jtei.979", "id_scheme": "DOI"}, "abstract": "Recent proposals for creating digital scholarly editions (DSEs) through the crowdsourcing of transcriptions and collaborative scholarship, for the establishment of national repositories of digital humanities data, and for the referencing, sharing, and storage of DSEs, have underlined the need for greater data interoperability. The TEI Guidelines have tried to establish standards for encoding transcriptions since 1988. However, because the choice of tags is guided by human interpretation, TEI-XML encoded files are in general not interoperable. One way to fix this problem may be to break down the current all-in-one approach to encoding so that DSEs can be specified instead by a bundle of separate resources that together offer greater interoperability: plain text versions, markup, annotations, and metadata. This would facilitate not only the development of more general software for handling DSEs, but also enable existing programs that already handle these kinds of data to function more efficiently.", "article_title": "Towards an Interoperable Digital Scholarly Edition", "authors": [{"given": "Desmond", "family": "Schmidt", "affiliation": {"original_name": "Queensland University of Technology", "normalized_name": "Queensland University of Technology", "country": "Australia", "identifiers": {"ror": "https://ror.org/03pnv4752", "GRID": "grid.1024.7"}}}], "publisher": "OpenEdition", "date": "2014-11-15", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 7", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.949", "identifier": {"string_id": "10.4000/jtei.949", "id_scheme": "DOI"}, "abstract": "As part of a larger pilot study on the evaluation of digital scholarship, we consider what role, if any, the TEI Consortium and user community might play in evaluating scholarship that utilize the TEI tag set. Our rationale for focusing on the role of the TEI Consortium in the discussion of evaluation is twofold. First, the TEI Guidelines represents an encoding standard for texts that is supported by a large community actively interested in the application and development of these standards. Second, feedback concerning evaluation criteria for digital scholarship has not been explicitly gathered from the TEI community and may provide additional understanding of the value, process, and assessment of text encoding. Determining what to evaluate and how to do so reveals the community’s definitions of scholarship in general. The clarification and articulation of evaluation criteria, therefore, remains a high priority as digital scholarship continues to develop.", "article_title": "Evaluating Digital Scholarship: Suggestions and Strategies for the Text Encoding Initiative", "authors": [{"given": "Sarah L.", "family": "Pfannenschmidt", "affiliation": {"original_name": "University of Texas at Austin School of Information", "normalized_name": "The University of Texas at Austin", "country": "United States", "identifiers": {"ror": "https://ror.org/00hj54h04", "GRID": "grid.89336.37"}}}, {"given": "Tanya E.", "family": "Clement", "affiliation": {"original_name": "University of Texas at Austin School of Information", "normalized_name": "The University of Texas at Austin", "country": "United States", "identifiers": {"ror": "https://ror.org/00hj54h04", "GRID": "grid.89336.37"}}}], "publisher": "OpenEdition", "date": "2014-11-15", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 7", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.968", "identifier": {"string_id": "10.4000/jtei.968", "id_scheme": "DOI"}, "abstract": "This article provides a brief overview of currently-available digital resources for learning to understand and use the TEI Guidelines. It reflects on and analyzes these resources and their audience through the results of a survey intended to inform future support from the TEI Consortium for novice users. Increasing numbers of students look online for self-directed and task-based tutorials, and increasing numbers of scholars in the humanities recognize the TEI Guidelines as a standard tool for publication and analysis. In this context, the author designed the survey presented in this paper to solicit qualitative feedback from both experienced and aspiring practitioners in the field concerning their skills, needs, and goals, pedagogical as well as technical. The article suggests revising and expanding TEI community resources, proposing possibilities for their new form and functionality.", "article_title": "Learning the TEI in a Digital Environment", "authors": [{"given": "Stella", "family": "Dee", "affiliation": {"original_name": "University of Leipzig", "normalized_name": "Leipzig University", "country": "Germany", "identifiers": {"ror": "https://ror.org/03s7gtk40", "GRID": "grid.9647.c"}}}], "publisher": "OpenEdition", "date": "2014-11-14", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 7", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.811", "identifier": {"string_id": "10.4000/jtei.811", "id_scheme": "DOI"}, "abstract": "It is twenty-five years since the Text Encoding Initiative was first launched as a research project following an international conference funded by the US National Endowment for the Humanities. This article describes some key stages in its subsequent evolution from research project into research infrastructure. The TEI's changing nature, we suggest, is partly a consequence of its close and highly responsive relation with an active user community, which may also explain both its longevity and its effectiveness as a part of the digital humanities research infrastructure.", "article_title": "The Evolution of the Text Encoding Initiative: From Research Project to Research Infrastructure", "authors": [{"given": "Lou", "family": "Burnard", "affiliation": {
                    "original_name": null,
                    "normalized_name": null,
                    "country": null,
                    "identifiers": {
                        "ror": null,
                        "GRID": null
                    }                    
                } }], "publisher": "OpenEdition", "date": "2013-06-27", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 5", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.774", "identifier": {"string_id": "10.4000/jtei.774", "id_scheme": "DOI"}, "abstract": "A variety of initiatives for developing virtual research environments, research infrastructures, and cyberinfrastructures have been funded in recent years. The systems produced vary considerably, but they all face the issue of sustainability, namely how to ensure the continued existence of a resource once the project that created it has finished. This paper addresses the sustainability issues faced by the TextGrid and TEXTvre virtual research environments for textual scholarship, examining the inter-project collaboration and cross-fertilization that took place, and investigating how the projects benefited from this exchange. It also examines how their sustainability is being facilitated by the more general-purpose DARIAH infrastructure, and conversely how their existing collaboration can serve as a model for future collaborations within the DARIAH community.", "article_title": "TextGrid, TEXTvre, and DARIAH: Sustainability of Infrastructures for Textual Scholarship", "authors": [{"given": "Mark", "family": "Hedges", "affiliation": {"original_name": "King's College London", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}}, {"given": "Heike", "family": "Neuroth", "affiliation": {"original_name": "Göttingen State and University Library (SUB) in Germany", "normalized_name": "State and University Library", "country": "Denmark", "identifiers": {"ror": "https://ror.org/019ryn279", "GRID": "grid.437933.9"}}}, {"given": "Kathleen M.", "family": "Smith", "affiliation": {"original_name": "Göttingen State and University Library", "normalized_name": "State and University Library", "country": "Denmark", "identifiers": {"ror": "https://ror.org/019ryn279", "GRID": "grid.437933.9"}}}, {"given": "Tobias", "family": "Blanke", "affiliation": {"original_name": "Centre for e-Research, Department of Digital Humanities, at King's College London", "normalized_name": "King's College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/0220mzb33", "GRID": "grid.13097.3c"}}}, {"given": "Laurent", "family": "Romary", "affiliation": {"original_name": "Humboldt University in Berlin, Germany", "normalized_name": "Humboldt University of Berlin", "country": "Germany", "identifiers": {"ror": "https://ror.org/01hcx6992", "GRID": "grid.7468.d"}}}, {"given": "Marc", "family": "Küster", "affiliation": {"original_name": "Fachhochschule Worms, Germany", "normalized_name": "University of Applied Sciences Worms", "country": "Germany", "identifiers": {"ror": "https://ror.org/031ph8d53", "GRID": "grid.440515.1"}}}, {"given": "Malcolm", "family": "Illingworth", "affiliation": {"original_name": "EPCC, University of Edinburgh", "normalized_name": "University of Edinburgh", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01nrxwf90", "GRID": "grid.4305.2"}}}], "publisher": "OpenEdition", "date": "2013-06-27", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 5", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.787", "identifier": {"string_id": "10.4000/jtei.787", "id_scheme": "DOI"}, "abstract": "Project Bamboo, a cyberinfrastructure initiative supported by the Andrew W. Mellon Foundation, takes as its core mission the enhancement of arts and humanities research through the development of shared technology services. Rather than developing new tools for curating or analyzing data, Project Bamboo aims to provide core infrastructure services including identity and access management, collection interoperability, and scholarly data management. The longer-term goal is for many organizations and projects to leverage those services so as to direct their own resources towards innovative tool or collection development. In addition, Bamboo seeks to model a paradigm for tool integration that focuses on tools as discrete services (such as a morphology annotation service and a geoparser service, instead of a web-based environment that does morphological annotation and geoparsing) that can be applied to texts, individually or in combination with other services, to enable complex curatorial and analytical workflows. This paper addresses points of intersection between Project Bamboo and TEI over the course of Bamboo's development, including the role of TEI in Bamboo's ongoing development work. The paper highlights the significant contributions of the TEI community to the early development of the project through active participation in the Bamboo Planning Project. The paper also addresses the influence of TEI on the Bamboo Technology Project's collection interoperability and corpus curation/analysis initiatives, as well as its role in current (as of October 2012) development work.", "article_title": "TEI and Project Bamboo", "authors": [{"given": "Quinn", "family": "Dombrowski", "affiliation": {"original_name": "UC Berkeley", "normalized_name": "University of California, Berkeley", "country": "United States", "identifiers": {"ror": "https://ror.org/01an7q238", "GRID": "grid.47840.3f"}}}, {"given": "Seth", "family": "Denbo", "affiliation": {"original_name": "Maryland Institute for Technology in the Humanities", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}], "publisher": "OpenEdition", "date": "2013-06-27", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 5", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.790", "identifier": {"string_id": "10.4000/jtei.790", "id_scheme": "DOI"}, "abstract": "Islandora is an open-source software framework developed since 2006 by the University of Prince Edward Island's Robertson Library. The Islandora framework is designed to ease the management of security and workflow for digital assets, and to help implementers create custom interfaces for display, search, and discovery. Turnkey options are provided via tools and modules (\"solution packs\") designed to support the work of a particular knowledge domain (such as chemistry), a particular content type (such as a digitized newspaper), or a particular task (such as TEI encoding). While it does not yet have native support for TEI, Islandora provides a promising basis on which digital humanities scholars could manage the creation, editing, validation, display, and comparison of TEI-encoded text. UPEI's IslandLives project, with its forthcoming solution pack, provides insight into how an Islandora version 6 installation can support OCR text extraction, automatic structural/semantic encoding of text, and web-based TEI editing and display functions for site administrators. This article introduces the Islandora framework and its suitability for TEI, describes the IslandLives approach in detail, and briefly discusses recent work and future directions for TEI work in Islandora. The authors hope that interested readers may help contribute to the expansion of TEI-related services and features available to be used with Islandora.", "article_title": "Islandora and TEI: Current and Emerging Applications/Approaches", "authors": [{"given": "Kirsta", "family": "Stapelfeldt", "affiliation": {"original_name": "University of Prince Edward Island's Robertson Library", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}, {"given": "Donald", "family": "Moses", "affiliation": {"original_name": "UPEI's Robertson Library", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}], "publisher": "OpenEdition", "date": "2013-06-27", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 5", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.788", "identifier": {"string_id": "10.4000/jtei.788", "id_scheme": "DOI"}, "abstract": "This project report details the goals and development of the TEI Archiving, Publishing, and Access Service (TAPAS). The project's mission centers on providing repository and publication services to individuals and small projects working with TEI data: a constituency that typically lacks access to institutional resources such as server space, XML expertise, and programming time. In developing this service, TAPAS addresses several important challenges: the creation of a publication ecology that operates gracefully at the level of the individual project and the TAPAS corpus; the problem of the vulnerability of TEI data in cases where projects cease their activity; and the variability and complexity of TEI data. When completed, the TAPAS service will enable its contributors to upload, manage, and publish their TEI data, and it will offer a publication interface through which both individual project collections and the TAPAS collection as a whole can be read, searched, and explored. It will also provide a range of related services such as technical consulting, data curation and conversion work, TEI workshops, tutorials, and community forums. This article discusses the philosophy and rationale behind the project's current development efforts, and examines some of the challenges the project faces. ", "article_title": "TAPAS: Building a TEI Publishing and Repository Service", "authors": [{"given": "Julia", "family": "Flanders", "affiliation": {"original_name": "Center for Digital Scholarship in the Brown University Library", "normalized_name": "Brown University", "country": "United States", "identifiers": {"ror": "https://ror.org/05gq02987", "GRID": "grid.40263.33"}}}, {"given": "Scott", "family": "Hamlin", "affiliation": {"original_name": "Wheaton College's Library and Information Services (Norton, MA)", "normalized_name": "EBSCO Industries (United States)", "country": "United States", "identifiers": {"ror": "https://ror.org/00dsy9f04", "GRID": "grid.431285.9"}}}], "publisher": "OpenEdition", "date": "2013-06-27", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 5", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.817", "identifier": {"string_id": "10.4000/jtei.817", "id_scheme": "DOI"}, "abstract": "A common problem for TEI software development is that projects develop their own custom software stack to address the semantic intricacies present in a deeply-encoded TEI corpus. This article describes the design of version 4 of the PhiloLogic corpus query engine, which is designed to handle heterogeneous TEI encoding through its redesigned abstract data model. We show that such an architecture has substantial benefits for software reuse, allowing for powerful TEI applications to be adapted to new corpora with a minimum of custom programming, and we discuss the more general and theoretical implications of abstraction as a TEI processing technique.", "article_title": "PhiloLogic4: An Abstract TEI Query System", "authors": [{"given": "Timothy", "family": "Allen", "affiliation": {"original_name": "University of Chicago", "normalized_name": "University of Chicago", "country": "United States", "identifiers": {"ror": "https://ror.org/024mw5h28", "GRID": "grid.170205.1"}}}, {"given": "Clovis", "family": "Gladstone", "affiliation": {"original_name": "University of Chicago", "normalized_name": "University of Chicago", "country": "United States", "identifiers": {"ror": "https://ror.org/024mw5h28", "GRID": "grid.170205.1"}}}, {"given": "Richard", "family": "Whaling", "affiliation": {"original_name": "University of Chicago", "normalized_name": "University of Chicago", "country": "United States", "identifiers": {"ror": "https://ror.org/024mw5h28", "GRID": "grid.170205.1"}}}], "publisher": "OpenEdition", "date": "2013-06-27", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 5", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.486", "identifier": {"string_id": "10.4000/jtei.486", "id_scheme": "DOI"}, "abstract": "The present contribution addresses an infrastructural issue of universal relevance, addressed in the specific context of the TEI. We describe a combination of open-source tools and an open-access approach to creating knowledge repositories that have been employed in building a bibliographic reference library for the “TEI for Linguists” special interest group (LingSIG). The authors argue that, for an initiative such as the TEI, it is important to choose open, freely available solutions. If these solutions have the advantage of attracting new users and promoting the initiative itself, so much the better, especially if it is done in a non-committal way: no one using the LingSIG bibliographic repository has to be a member of the LingSIG or a “TEI-er” in general.", "article_title": "Building and Maintaining the TEI LingSIG Bibliography", "authors": [{"given": "Piotr", "family": "Bański", "affiliation": {"original_name": "Institut für Deutsche Sprache in Mannheim", "normalized_name": "Institute for the German Language", "country": "Germany", "identifiers": {"ror": "https://ror.org/00hvwkt50", "GRID": "grid.443960.c"}}}, {"given": "Stefan", "family": "Majewski", "affiliation": {"original_name": "Göttingen State and University Library", "normalized_name": "State and University Library", "country": "Denmark", "identifiers": {"ror": "https://ror.org/019ryn279", "GRID": "grid.437933.9"}}}, {"given": "Maik", "family": "Stührenberg", "affiliation": {"original_name": "Institut für Deutsche Sprache (IDS, Institute for the German Language) in Mannheim", "normalized_name": "Institute for the German Language", "country": "Germany", "identifiers": {"ror": "https://ror.org/00hvwkt50", "GRID": "grid.443960.c"}}}, {"given": "Antonina", "family": "Werthmann", "affiliation": {"original_name": "Institut für Deutsche Sprache (IDS, Institute for the German Language) in Mannheim", "normalized_name": "Institute for the German Language", "country": "Germany", "identifiers": {"ror": "https://ror.org/00hvwkt50", "GRID": "grid.443960.c"}}}], "publisher": "OpenEdition", "date": "2012-11-05", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 3", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.476", "identifier": {"string_id": "10.4000/jtei.476", "id_scheme": "DOI"}, "abstract": "The paper presents an XML schema for the representation of genres of computer-mediated communication (CMC) that is compliant with the encoding framework defined by the TEI. It was designed for the annotation of CMC documents in the project Deutsches Referenzkorpus zur internetbasierten Kommunikation (DeRiK), which aims at building a corpus on language use in the most popular CMC genres on the German-speaking Internet. The focus of the schema is on those CMC genres which are written and dialogic―such as forums, bulletin boards, chats, instant messaging, wiki and weblog discussions, microblogging on Twitter, and conversation on “social network” sites.", "article_title": "A TEI Schema for the Representation of Computer-mediated Communication", "authors": [{"given": "Michael", "family": "Beißwenger", "affiliation": {"original_name": "TU Dortmund University", "normalized_name": "TU Dortmund University", "country": "Germany", "identifiers": {"ror": "https://ror.org/01k97gp34", "GRID": "grid.5675.1"}}}, {"given": "Maria", "family": "Ermakova", "affiliation": {"original_name": "Berlin-Brandenburg Academy of Sciences (BBAW)", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}}, {"given": "Alexander", "family": "Geyken", "affiliation": {"original_name": "Berlin-Brandenburg Academy of Sciences (BBAW)", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}}, {"given": "Lothar", "family": "Lemnitzer", "affiliation": {"original_name": "Berlin-Brandenburg Academy of Sciences (BBAW)", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}}, {"given": "Angelika", "family": "Storrer", "affiliation": {"original_name": "Berlin-Brandenburg Academy of Sciences (BBAW)", "normalized_name": "Berlin-Brandenburg Academy of Sciences and Humanities", "country": "Germany", "identifiers": {"ror": "https://ror.org/05jgq9443", "GRID": "grid.420264.6"}}}], "publisher": "OpenEdition", "date": "2012-11-05", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 3", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.540", "identifier": {"string_id": "10.4000/jtei.540", "id_scheme": "DOI"}, "abstract": "Our paper outlines a proposal for the consistent modeling of heterogeneous lexical structures in semasiological dictionaries, based on the element structures described in detail in chapter 9 (Dictionaries) of the TEI Guidelines. The core of our proposal describes a system of relatively autonomous lexical “crystals” that can, within the constraints of the relevant element’s definition, be combined to form complex structures for the description of morphological form, grammatical information, etymology, word-formation, and meaning for a lexical structure.", "article_title": "Consistent Modeling of Heterogeneous Lexical Structures", "authors": [{"given": "Laurent", "family": "Romary", "affiliation": {"original_name": "Humboldt University (Berlin, Germany)", "normalized_name": "Humboldt State University", "country": "United States", "identifiers": {"ror": "https://ror.org/02qt0xs84", "GRID": "grid.257157.3"}}}, {"given": "Werner", "family": "Wegstein", "affiliation": {
                    "original_name": null,
                    "normalized_name": null,
                    "country": null,
                    "identifiers": {
                        "ror": null,
                        "GRID": null
                    }                    
                } }], "publisher": "OpenEdition", "date": "2012-11-05", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 3", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.522", "identifier": {"string_id": "10.4000/jtei.522", "id_scheme": "DOI"}, "abstract": "Although most of the relevant dictionary productions of the recent past have relied on digital data and methods, there is little consensus on formats and standards. The Institute for Corpus Linguistics and Text Technology (ICLTT) of the Austrian Academy of Sciences has been conducting a number of varied lexicographic projects, both digitising print dictionaries and working on the creation of genuinely digital lexicographic data. This data was designed to serve varying purposes: machine-readability was only one. A second goal was interoperability with digital NLP tools. To achieve this end, a uniform encoding system applicable across all the projects was developed. The paper describes the constraints imposed on the content models of the various elements of the TEI dictionary module and provides arguments in favour of TEI P5 as an encoding system not only being used to represent digitised print dictionaries but also for NLP purposes.", "article_title": "Creating Lexical Resources in TEI P5", "authors": [{"given": "Gerhard", "family": "Budin", "affiliation": {"original_name": "Austrian Academy of Sciences", "normalized_name": "Austrian Academy of Sciences", "country": "Austria", "identifiers": {"ror": "https://ror.org/03anc3s24", "GRID": "grid.4299.6"}}}, {"given": "Stefan", "family": "Majewski", "affiliation": {"original_name": "Göttingen State and University Library", "normalized_name": "State and University Library", "country": "Denmark", "identifiers": {"ror": "https://ror.org/019ryn279", "GRID": "grid.437933.9"}}}, {"given": "Karlheinz", "family": "Mörth", "affiliation": {"original_name": "University of Vienna", "normalized_name": "University of Vienna", "country": "Austria", "identifiers": {"ror": "https://ror.org/03prydq77", "GRID": "grid.10420.37"}}}], "publisher": "OpenEdition", "date": "2012-11-06", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 3", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.508", "identifier": {"string_id": "10.4000/jtei.508", "id_scheme": "DOI"}, "abstract": "This paper describes work in progress on I5, a TEI-based document grammar for the corpus holdings of the Institut für Deutsche Sprache (IDS) in Mannheim and the text model used by IDS in its work.  The paper begins with background information on the nature and purposes of the corpora collected at IDS and the motivation for the I5 project (section 1).  It continues with a description of the origin and history of the IDS text model (section 2), and a description (section 3) of the techniques used to automate, as far as possible, the preparation of the ODD file documenting the IDS text model.  It ends with some concluding remarks (section 4). A survey of the additional features of the IDS-XCES realization of the IDS text model is given in an appendix.", "article_title": "A TEI P5 Document Grammar for the IDS Text Model", "authors": [{"given": "Harald", "family": "Lüngen", "affiliation": {"original_name": "Institut für Deutsche Sprache in Mannheim, Germany", "normalized_name": "Institute for the German Language", "country": "Germany", "identifiers": {"ror": "https://ror.org/00hvwkt50", "GRID": "grid.443960.c"}}}, {"given": "C. M.", "family": "Sperberg-McQueen", "affiliation": {"original_name": "Black Mesa Technologies LLC", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}], "publisher": "OpenEdition", "date": "2012-11-06", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 3", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}, {"url": "http://dx.doi.org/10.4000/jtei.523", "identifier": {"string_id": "10.4000/jtei.523", "id_scheme": "DOI"}, "abstract": "The TEI has served for many years as a mature annotation format for corpora of different types, including linguistically annotated data. Although it is based on the consensus of a large community, it does not have the legal status of a standard. During the last decade, efforts have been undertaken to develop definitive de jure standards for linguistic data that not only act as a normative basis for the exchange of language corpora but also address recent advancements in technology, such as web-based standards, and the use of large and multiply annotated corpora.", "article_title": "The TEI and Current Standards for Structuring Linguistic Data", "authors": [{"given": "Maik", "family": "Stührenberg", "affiliation": {"original_name": "Bielefeld University", "normalized_name": "Bielefeld University", "country": "Germany", "identifiers": {"ror": "https://ror.org/02hpadn98", "GRID": "grid.7491.b"}}}], "publisher": "OpenEdition", "date": "2012-11-06", "keywords": null, "journal_title": "Journal of the Text Encoding Initiative", "volume": null, "issue": "Issue 3", "ISSN": [{"value": "2162-5603", "type": "electronic"}]}]