[{"url": "https://umanisticadigitale.unibo.it/article/view/7250", "identifier": {"string_id": "10.6092/issn.2532-8816/7250", "id_scheme": "DOI"}, "abstract": "We present DanteSources, a focused Digital Library that aims at building innovative services supporting scholars in creating, evolving and consulting a digital encyclopaedia of Dante Alighieri’s works. DanteSources is endowed with Web services that allow extracting and visualizing data about Dante Alighieri’s primary sources, i.e. other authors’ works which Dante referred to in his own works. The heart of the digital library is a knowledge base built on an ontology that was developed in the RDF/S language, representing Dante’s works and the knowledge about them, extracted from some authoritative commentaries. Finally, on top of this graph, we developed DanteSources, which allows users to extract and display the knowledge stored in the knowledge base in the form of charts and tables. The methodology and the tool we developed are easily reusable to represent the knowledge about primary sources of other authors of the Italian or the international literature.", "article_title": "DanteSources: a Digital Library for Studying Dante Alighieri’s Primary Sources", "authors": [{"given": "Valentina", "family": "Bartalesi", "affiliation": {"original_name": "Istituto di Scienza e Tecnologie dell’Informazione “Alessandro Faedo”, Consiglio Nazionale delle Ricerche (CNR)", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}}, {"given": "Carlo", "family": "Meghini", "affiliation": {"original_name": "Istituto di Scienza e Tecnologie dell’Informazione “Alessandro Faedo”, Consiglio Nazionale delle Ricerche (CNR)", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}}, {"given": "Daniele", "family": "Metilli", "affiliation": {"original_name": "Istituto di Scienza e Tecnologie dell’Informazione “Alessandro Faedo”, Consiglio Nazionale delle Ricerche (CNR)", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}}, {"given": "Paola", "family": "Andriani", "affiliation": {"original_name": "Dipartimento di Filologia, Letteratura e Linguistica, Università di Pisa", "normalized_name": "University of Pisa", "country": "Italy", "identifiers": {"ror": "https://ror.org/03ad39j10", "GRID": "grid.5395.a"}}}, {"given": "Mirko", "family": "Tavoni", "affiliation": {"original_name": "Dipartimento di Filologia, Letteratura e Linguistica, Università di Pisa", "normalized_name": "University of Pisa", "country": "Italy", "identifiers": {"ror": "https://ror.org/03ad39j10", "GRID": "grid.5395.a"}}}], "publisher": "Bologna: AlmaDL", "date": "2017-10-13", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7232", "identifier": {"string_id": "10.6092/issn.2532-8816/7232", "id_scheme": "DOI"}, "abstract": "Il Progetto Codice Pelavicino Digitale ha come obiettivo la pubblicazione di un’edizione digitale, liberamente accessibile online, di questo importante manoscritto del XIII secolo. Nel presente articolo si intende da un lato evidenziare le caratteristiche dell’edizione ed i principali problemi che si sono dovuti affrontare, dall’altro presentare il modo in cui si è arrivati alla scelta del digitale all’interno di un ambiente, quello delle Accademie, degli Archivi ecclesiastici e degli storici locali, in genere molto restio ad accettare simili innovazioni. L’edizione è basata su uno standard internazionale per quanto riguarda la codifica dei testi, gli schemi e le linee guida offerte dal consorzio TEI, e fa uso del software EVT per generare il sito web che permette di consultare testo critico e immagini del manoscritto.", "article_title": "Il Codice Pelavicino tra edizione digitale e Public History", "authors": [{"given": "Enrica", "family": "Salvatori", "affiliation": {"original_name": "Università di Pisa", "normalized_name": "University of Pisa", "country": "Italy", "identifiers": {"ror": "https://ror.org/03ad39j10", "GRID": "grid.5395.a"}}}, {"given": "Roberto", "family": "Rosselli Del Turco", "affiliation": {"original_name": "Università di Torino", "normalized_name": "University of Turin", "country": "Italy", "identifiers": {"ror": "https://ror.org/048tbm396", "GRID": "grid.7605.4"}}}, {"given": "Chiara", "family": "Alzetta", "affiliation": {"original_name": "Università di Pisa", "normalized_name": "University of Pisa", "country": "Italy", "identifiers": {"ror": "https://ror.org/03ad39j10", "GRID": "grid.5395.a"}}}, {"given": "Chiara", "family": "Di Pietro", "affiliation": {"original_name": "Università di Pisa", "normalized_name": "University of Pisa", "country": "Italy", "identifiers": {"ror": "https://ror.org/03ad39j10", "GRID": "grid.5395.a"}}}, {"given": "Chiara", "family": "Mannari", "affiliation": {"original_name": "Università di Pisa", "normalized_name": "University of Pisa", "country": "Italy", "identifiers": {"ror": "https://ror.org/03ad39j10", "GRID": "grid.5395.a"}}}, {"given": "Alessio", "family": "Miaschi", "affiliation": {"original_name": "Università di Pisa", "normalized_name": "University of Pisa", "country": "Italy", "identifiers": {"ror": "https://ror.org/03ad39j10", "GRID": "grid.5395.a"}}}], "publisher": "Bologna: AlmaDL", "date": "2017-10-13", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7230", "identifier": {"string_id": "10.6092/issn.2532-8816/7230", "id_scheme": "DOI"}, "abstract": "Oral archives collected by professional scholars and ordinary people interested in dialects and ethnology are a precious resource for various fields of study (from linguistics to anthropology, from economy to history and politics, etc.) and may contain documents that could be labeled as products of intangible cultural heritage, thus deserving safeguard. Grammo-foni. Le soffitte della voce (Gra.fo), a two-year project jointly conducted by Scuola Normale Superiore and the University of Siena (Regione Toscana PAR FAS 2007-13), discovered, digitized, cataloged and disseminated via a web portal nearly 3000 hours of speech recordings stemming from around 30 oral archives collected by scholars and amateurs in the Tuscan territory. Having preserved such a significant collection of oral documents (e.g. oral biographies, ethno-texts, linguistic questionnaires, oral literature), Gra.fo constitutes a precious repository of Tuscan memory and provides a first-hand documentation of Tuscan language varieties from the early 1960s to the present day [7], [9]. In this article, the Gra.fo project will be described in all its stages, which involve: fostering the level of awareness on the importance of preserving this valuable cultural heritage product; contacting the oral recordings’ owners and co-signing legal agreements for the temporary borrowing of the recordings and accompanying materials; collecting and digitizing the recordings and the accompanying materials; cataloging (with the self-developed software Audiografo) and partially transcribing the oral documents; implementing the downloadable online catalog , an open-ended repository of oral texts which have hitherto been known to a very limited number of potential users. Some problematic issues related to the treatment of oral archives will also be discussed, together with the proposed solutions. These concern the carrier / document relation, the treatment of confidential information, and the cataloging of documents within other documents.", "article_title": "The Gra.fo project: from collection to dissemination", "authors": [{"given": "Silvia", "family": "Calamai", "affiliation": {"original_name": "Dipartimento di Scienze della Formazione, Scienze Umane e della Comunicazione Interculturale, Università di Siena", "normalized_name": "University of Siena", "country": "Italy", "identifiers": {"ror": "https://ror.org/01tevnk56", "GRID": "grid.9024.f"}}}, {"given": "Francesca", "family": "Biliotti", "affiliation": {"original_name": "Dipartimento di Scienze della Formazione, Scienze Umane e della Comunicazione Interculturale, Università di Siena", "normalized_name": "University of Siena", "country": "Italy", "identifiers": {"ror": "https://ror.org/01tevnk56", "GRID": "grid.9024.f"}}}], "publisher": "Bologna: AlmaDL", "date": "2017-10-13", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7211", "identifier": {"string_id": "10.6092/issn.2532-8816/7211", "id_scheme": "DOI"}, "abstract": "L’articolo presenta le modalità di visualizzazione dei contenuti e delle reti di relazioni del portale web del Centro interdipartimentale di ricerca Aspi - Archivio storico della psicologia italiana (Università di Milano-Bicocca). Nato nel 2005, il Centro si occupa di conservazione, inventariazione, digitalizzazione e valorizzazione delle carte di psicologi e psichiatri dell’Otto e Novecento. Tramite il portale www.aspi.unimib.it1, mette a disposizione le fonti documentarie corredate da apparati critici e schede di contestualizzazione storico-scientifica che permettono di ricostruire le biografie e lo sviluppo delle diverse discipline, di cogliere i legami interpersonali, interdisciplinari e tra diverse istituzioni. Il portale è un valido strumento di lavoro per storici e ricercatori, che possono accedere direttamente alle fonti d’archivio e collaborare con la redazione pubblicando i risultati delle proprie ricerche. Un software custom estrae direttamente i dati dalla piattaforma opensource CollectiveAccess e genera visualizzazioni dinamiche e interattive utilizzando tre criteri: persone, luoghi, tempo. In particolare, grafi di tipo gravitazionale mostrano le relazioni tra i protagonisti (es. allievo, maestro, collaboratore, parente) e tra i protagonisti e i luoghi in cui hanno operato; timeline e mappe indicano invece luoghi e date di nascita e morte, collocazioni geografiche e periodi di attività dei luoghi di cura e di ricerca.", "article_title": "Le trame invisibili. Nuove modalità di esplorazione online dell’Archivio storico della psicologia italiana", "authors": [{"given": "Letizia", "family": "Bollini", "affiliation": {"original_name": "Centro interdipartimentale di ricerca Aspi -  Archivio storico della psicologia italiana, Università degli studi di Milano Bicocca", "normalized_name": "University of Milano-Bicocca", "country": "Italy", "identifiers": {"ror": "https://ror.org/01ynf4891", "GRID": "grid.7563.7"}}}, {"given": "Dario", "family": "De Santis", "affiliation": {"original_name": "Centro interdipartimentale di ricerca Aspi -  Archivio storico della psicologia italiana, Università degli studi di Milano Bicocca", "normalized_name": "University of Milano-Bicocca", "country": "Italy", "identifiers": {"ror": "https://ror.org/01ynf4891", "GRID": "grid.7563.7"}}}, {"given": "Sara", "family": "Radice", "affiliation": {"original_name": "Centro interdipartimentale di ricerca Aspi -  Archivio storico della psicologia italiana, Università degli studi di Milano Bicocca", "normalized_name": "University of Milano-Bicocca", "country": "Italy", "identifiers": {"ror": "https://ror.org/01ynf4891", "GRID": "grid.7563.7"}}}, {"given": "Paola", "family": "Zocchi", "affiliation": {"original_name": "Centro interdipartimentale di ricerca Aspi -  Archivio storico della psicologia italiana, Università degli studi di Milano Bicocca", "normalized_name": "University of Milano-Bicocca", "country": "Italy", "identifiers": {"ror": "https://ror.org/01ynf4891", "GRID": "grid.7563.7"}}}], "publisher": "Bologna: AlmaDL", "date": "2017-10-13", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7196", "identifier": {"string_id": "10.6092/issn.2532-8816/7196", "id_scheme": "DOI"}, "abstract": "Impact and sustainability are the leitmotiv of current Research Policies in Europe. Science is required to show its positive socio-economic influence on Society, and Humanities Research is not exempted from this requirement. Within this context, Digital Humanities might enhance the external impact of Humanities Research, more specifically the commitment to public engagement, by means of strategic opportunities offered by digital techniques. To pursue this objective, intermediation seems necessary in order ‘to switch Humanities on’ within Society. Actually, virtual objects might be as speechless as real ones, i.e. books in a library without users. The value of a Digital approach lies in its usability, in the additional tools and helps it supplies, and in stimulating users in becoming active agents of their reading. As in a good storytelling the attention to what can provoke reactions is as important as the action narrated itself, digital objects need hints to stimulate and activate users’ curiosity, questions and original solutions. The paper concentrates on three elements: the requirement for external impact of research activities; the need for intermediary agents and a concrete experimentation of intermediation. Digital Humanities are analysed in the context of the Humanities and beyond the academic realm, in their targeting diverse recipients, external to the scientific community. The test conducted so far is addressed to the specific stakeholder community of teachers, called to act as intermediaries between Humanities Research outcomes and the Scholastic Community.", "article_title": "Digital Humanities and Society: an impact requiring ‘intermediation’", "authors": [{"given": "Carla", "family": "Basili", "affiliation": {"original_name": "Istituto IRCrES, Consiglio Nazionale delle Ricerche", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}}, {"given": "Grazia", "family": "Biorci", "affiliation": {"original_name": "Istituto IRCrES, Consiglio Nazionale delle Ricerche", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}}, {"given": "Antonella", "family": "Emina", "affiliation": {"original_name": "Istituto IRCrES, Consiglio Nazionale delle Ricerche", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}}], "publisher": "Bologna: AlmaDL", "date": "2017-10-13", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7195", "identifier": {"string_id": "10.6092/issn.2532-8816/7195", "id_scheme": "DOI"}, "abstract": "L’articolo intende riflettere sulla necessaria ibridazione fra le discipline che si occupano della descrizione del patrimonio culturale, in particolare nell’ottica della valorizzazione attraverso le tecnologie del Web Semantico. Solo attraverso la condivisione di dati e la costruzione di mutue relazioni fra oggetti culturali la prospettiva dei Linked Open Data può diventare autenticamente efficace e trasformarsi in un veicolo di trasmissione della conoscenza. Un esempio condotto sull’Archivio fotografico della Fondazione Zeri esemplifica il ragionamento su modalità e sistemi di integrazione del sapere disciplinare.", "article_title": "Linked Cultural Objects: dagli standard di catalogazione ai modelli per il web of data. Spunti di riflessione dalla Fototeca Zeri", "authors": [{"given": "Marilena", "family": "Daquino", "affiliation": {"original_name": "Università di Bologna", "normalized_name": "University of Bologna", "country": "Italy", "identifiers": {"ror": "https://ror.org/01111rn36", "GRID": "grid.6292.f"}}}, {"given": "Francesca", "family": "Tomasi", "affiliation": {"original_name": "Università di Bologna", "normalized_name": "University of Bologna", "country": "Italy", "identifiers": {"ror": "https://ror.org/01111rn36", "GRID": "grid.6292.f"}}}], "publisher": "Bologna: AlmaDL", "date": "2017-10-13", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7194", "identifier": {"string_id": "10.6092/issn.2532-8816/7194", "id_scheme": "DOI"}, "abstract": "L’Archivio storico della Pontificia Università Gregoriana (d’ora in avanti APUG) ha intrapreso un percorso di ricerca intorno al carteggio di Cristoforo Clavio (1538-1612), una delle raccolte epistolari più importanti che conserva. Ad arricchire il progettoClavius on the web si è aggiunto il coinvolgimento di docenti e studenti di tre licei romani: il Liceo Ennio Quirino Visconti, il Liceo Virgilio e il Liceo Aristofane. Questo nuovo modulo del progetto è stato denominato Clavius@school. L’articolo, dopo aver presentato l’APUG, le sue attività e il personaggio al centro dell’iniziativa, intende prendere in esame il lavoro svolto con le scuole a partire da una visione filosofica che analizza la tecnologia nel senso più ampio del termine.", "article_title": "Un caso di integrazione tra Public History, Cultural Heritage e Digital Humanities: l’Archivio storico della Pontificia Università Gregoriana e il progetto Clavius@school", "authors": [{"given": "Lorenzo", "family": "Mancini", "affiliation": {"original_name": "Istituto di Linguistica Computazionale ”Antonio Zampolli”, Pisa", "normalized_name": "Institute for Computational Linguistics “A. Zampolli”", "country": "Italy", "identifiers": {"ror": "https://ror.org/028g3pe33", "GRID": "grid.503055.6"}}}, {"given": "Irene", "family": "Pedretti", "affiliation": {"original_name": "Archivio storico della Pontificia Università Gregoriana, Roma", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}], "publisher": "Bologna: AlmaDL", "date": "2017-10-13", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7193", "identifier": {"string_id": "10.6092/issn.2532-8816/7193", "id_scheme": "DOI"}, "abstract": "Il progetto ALIM (Archivio della Latinit. Italiana del Medioevo) intende offrire alla libera consultazione online tutti i testi in latino composti in Italia nel corso del medioevo. Il latino rappresentó, infatti, per molti secoli la sola lingua in cui ebbero espressione scritta molte delle principali creazioni del pensiero, della scienza e della letteratura del medioevo, oltre che la documentazione storica; anche quando si affermarono nella scrittura le lingue nazionali, il latino non perse mai la funzione e il prestigio di lingua transnazionale. Il progetto di ricerca, nato negli anni Novanta, si propone di completare le informazioni linguistiche reperibili, per i secoli precedenti, nel dizionario della latinit. medievale italiana, promosso dall?U.A.N. (Unione Accademica Nazionale) e curato da F. Arnaldi e P. Smiraglia (Latinitatis Italicae Medii Aevi lexicon, Firenze 2001). Il progetto ALIM intende contribuire, oltre che a fornire testi criticamente affidabili per la consultazione di filologi, storici della letteratura, storici delle istituzioni, della cultura e della scienza medievali, anche a produrre materiali analizzabili per il progetto di un dizionario del latino medievale europeo, che integri i lessici delle rispettive latinitá medievali elaborati da tutti gli Stati europei.", "article_title": "ALIM ieri e oggi", "authors": [{"given": "Edoardo", "family": "Ferrarini", "affiliation": {"original_name": "Università degli Studi di Verona", "normalized_name": "University of Verona", "country": "Italy", "identifiers": {"ror": "https://ror.org/039bp8j42", "GRID": "grid.5611.3"}}}], "publisher": "Bologna: AlmaDL", "date": "2017-10-13", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/9330", "identifier": {"string_id": "10.6092/issn.2532-8816/9330", "id_scheme": "DOI"}, "abstract": "Digitales forum romanum è un progetto di storia pubblica digitale promosso e sviluppato dal Winckelmann Institute dell’Università Humboldt (Berlino) in collaborazione con numerosi altri enti e istituzioni, non solo tedeschi. Il progetto, partendo dalla ricerca scientifica sugli edifici del Foro Romano, intende ricostruire in 3D le diverse versioni del luogo nel tempo, rendendole accessibili via web. Si tratta di un progetto unico nel panorama variegato e complesso del 3D applicato al patrimonio archeologico, proprio perché affronta il problema della visualizzazione dei dati lungo una linea temporale.", "article_title": "Digitales forum romanum: un progetto per la ricostruzione storico-scientifica in 3D del Foro Romano", "authors": [{"given": "Alessia", "family": "Spadi", "affiliation": {"original_name": "Università di Pisa", "normalized_name": "University of Pisa", "country": "Italy", "identifiers": {"ror": "https://ror.org/03ad39j10", "GRID": "grid.5395.a"}}}], "publisher": "Bologna: AlmaDL", "date": "2019-12-18", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/9063", "identifier": {"string_id": "10.6092/issn.2532-8816/9063", "id_scheme": "DOI"}, "abstract": "This paper pursues the analysis, modelling and representation of the relationships between the different entities concerned by genetic criticism (documents and publications), in the context of a scholarly digital edition. Our cases study are taken from the project \"Gustave Roud, Œuvres complètes\", whose principal aim is to edit the complete works of the Swiss author Gustave Roud (1897-1976). Roud's writing process is rooted in his diary: a first note, for instance taken during a walk in the countryside, can be typed or copied together with other notes in a dedicated notebook, and then inserted in a journal article, which will be itself modified and assembled with others to form a poetic collection. This mechanism of rhapsodic montage is used at various stages of the writing processes, allowing for multiple assemblages of the same materials, for new texts to be produced from existing ones and for the same diary note to appear in multiple texts. In this article, we present an ontology for modelling the genetic relationships between the documents. The available data-model for genetic criticism are firstly discussed: they concentrate on a single document or on the textual variation between them, but no formal model for their relationships is available. Existing visualizations of those relationships are then taken into account. The ontology that we propose to fill this void is detailed and its compatibility with widespread conceptual models, such as FRBRoo and CIDOC CRM, is discussed. Two case studies are presented to test the ontology. In the article we consider the application of our model to other corpora and we conclude with suggestions for the improvement of this work.", "article_title": "Modeling genetic networks. Gustave Roud's œuvre, from diary to poetry collections", "authors": [{"given": "Alessio", "family": "Christen", "affiliation": {"original_name": "Université de Lausanne", "normalized_name": "University of Lausanne", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/019whta54", "GRID": "grid.9851.5"}}}, {"given": "Elena", "family": "Spadini", "affiliation": {"original_name": "Université de Lausanne", "normalized_name": "University of Lausanne", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/019whta54", "GRID": "grid.9851.5"}}}], "publisher": "Bologna: AlmaDL", "date": "2019-12-18", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/9091", "identifier": {"string_id": "10.6092/issn.2532-8816/9091", "id_scheme": "DOI"}, "abstract": "Le edizioni scientifiche digitali (ESD) sono uno strumento necessario alla divulgazione del patrimonio culturale. Con l’affermarsi delle tecnologie del Semantic Web per la disseminazione dei dati dei beni culturali, le ESD diventano un tassello fondamentale da integrare nella Linked Open Data cloud. Linee guida per la codifica del testo e standard tecnologici vengono correntemente utilizzati nella comunità accademica per condividere i informazioni tra ricercatori e sviluppatori (p.e. XML/TEI, noSQL database, RESTful API). Nondimeno, esistono diverse lacune nella creazione di edizioni scientifiche semantiche: (1) l’assenza di un workflow per la pubblicazione di ESD come knowledge graph, (2) l’identificazione di modelli concettuali per la rappresentazione di aspetti caratterizzanti le ESD, (3) un’analisi dei costi, dei vantaggi e dei benefici derivanti dall’utilizzo di cutting-edge technology in giustapposizione alla “tradizionale” codifica del testo. In questo articolo presentiamo il proof-of-concept dell’edizione semantica digitale del quaderno di appunti di Paolo Bufalini che tenta di rispondere a tali lacune.", "article_title": "Linked Data per le edizioni scientifiche digitali. Il workflow di pubblicazione dell’edizione semantica del quaderno di appunti di Paolo Bufalini", "authors": [{"given": "Marilena", "family": "Daquino", "affiliation": {"original_name": "Digital Humanities Advanced Research Centre (DHARC), Università di Bologna", "normalized_name": "University of Bologna", "country": "Italy", "identifiers": {"ror": "https://ror.org/01111rn36", "GRID": "grid.6292.f"}}}, {"given": "Francesca", "family": "Giovannetti", "affiliation": {"original_name": "Digital Humanities Advanced Research Centre (DHARC), Università di Bologna", "normalized_name": "University of Bologna", "country": "Italy", "identifiers": {"ror": "https://ror.org/01111rn36", "GRID": "grid.6292.f"}}}, {"given": "Francesca", "family": "Tomasi", "affiliation": {"original_name": "Digital Humanities Advanced Research Centre (DHARC), Università di Bologna", "normalized_name": "University of Bologna", "country": "Italy", "identifiers": {"ror": "https://ror.org/01111rn36", "GRID": "grid.6292.f"}}}], "publisher": "Bologna: AlmaDL", "date": "2019-12-18", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/9162", "identifier": {"string_id": "10.6092/issn.2532-8816/9162", "id_scheme": "DOI"}, "abstract": "Within the “Museo Virtuale della Musica BellinInRete” project, a corpus of letters, written by the renowned composer Vincenzo Bellini (1801 - 1835) from Catania, will be encoded and made publicly available. This contribution aims at illustrating the part of the project regarding the implementation of the prototype for the metadata and text encoding, indexing and visualisation of Bellini’s correspondence. The encoding scheme has been defined according to the latest guidelines of the Text Encoding Initiative and it has been instantiated on a sample of letters. Contextually, a first environment has been implemented by customizing two open source tools: Edition Visualization Technology and Omega Scholarly platform. The main objective of the digital edition is to engage general public with the cultural heritage held by the Belliniano Civic Museum of Catania. This wide access to Bellini’s correspondence has been conceived preserving the scholarly transcriptions of the letters edited by Seminara within her most recent critical edition (Olschki, 2017). The digital edition of the corpus takes care of handling the correspondence metadata by means of the correspDesc TEI tagset. Finally, Bellini's letters will be accessible via the Web platform as well as integrated into a forthcoming interactive and multimedia tour hosted at the museum.", "article_title": "Bellini’s Correspondence: a Digital Scholarly Edition for a Multimedia Museum", "authors": [{"given": "Angelo Mario", "family": "Del Grosso", "affiliation": {"original_name": "Istituto di Linguistica Computazionale - Consiglio Nazionale delle Ricerche", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}}, {"given": "Erica", "family": "Capizzi", "affiliation": {"original_name": "Cultore della materia in musicologia, Università di Catania", "normalized_name": "University of Catania", "country": "Italy", "identifiers": {"ror": "https://ror.org/03a64bh57", "GRID": "grid.8158.4"}}}, {"given": "Salvatore", "family": "Cristofaro", "affiliation": {"original_name": "Istituto di Scienze e Tecnologie della Cognizione - Consiglio Nazionale delle Ricerche", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}}, {"given": "Maria Rosa", "family": "De Luca", "affiliation": {"original_name": "Università di Catania", "normalized_name": "University of Catania", "country": "Italy", "identifiers": {"ror": "https://ror.org/03a64bh57", "GRID": "grid.8158.4"}}}, {"given": "Emiliano", "family": "Giovannetti", "affiliation": {"original_name": "Istituto di Linguistica Computazionale - Consiglio Nazionale delle Ricerche", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}}, {"given": "Simone", "family": "Marchi", "affiliation": {"original_name": "Istituto di Linguistica Computazionale - Consiglio Nazionale delle Ricerche", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}}, {"given": "Graziella", "family": "Seminara", "affiliation": {"original_name": "Università di Catania", "normalized_name": "University of Catania", "country": "Italy", "identifiers": {"ror": "https://ror.org/03a64bh57", "GRID": "grid.8158.4"}}}, {"given": "Daria", "family": "Spampinato", "affiliation": {"original_name": "Istituto di Scienze e Tecnologie della Cognizione - Consiglio Nazionale delle Ricerche", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}}], "publisher": "Bologna: AlmaDL", "date": "2019-12-18", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/9322", "identifier": {"string_id": "10.6092/issn.2532-8816/9322", "id_scheme": "DOI"}, "abstract": "EVT (Edition Visualization Technology) è un software per la pubblicazione di Edizioni Scientifiche Digitali sul Web. Il suo sviluppo risale agli inizi di questa decade, e può vantare una storia alquanto interessante: nato come una iniziativa di tipo didattico nell’ambito di uno specifico progetto di edizione digitale, nel corso del tempo si è evoluto in uno strumento flessibile apprezzato e utilizzato da molti ricercatori. La versione di sviluppo attuale si basa sulla beta che è stata pubblicata nell’ottobre del 2017: pur essendo molto più ricca di funzionalità rispetto alla prima versione alpha (rilasciata nel luglio 2016) è ancora incentrata sul supporto per edizioni critiche. Una versione completa, con il supporto per edizioni di tipo diplomatico e diplomatico-interpretativo sarà pubblicata nella prima metà del 2019. Questo contributo intende fornire un aggiornamento sui progressi più recenti e anche proporre alcune considerazioni riguardo lo sviluppo di tale strumento, in particolare riguardo i problemi che si incontrano nel progettare un’Interfaccia Utente che deve organizzare in uno spazio bi-dimensionale un gran numero di elementi posti su livelli diversi; le nuove funzionalità che saranno introdotte nella prima versione stabile e l’impatto che avranno sugli utenti; la validità del metodo di sviluppo open source e i rapporti con altri progetti.", "article_title": "Progettazione e implementazione di nuove funzionalità per EVT 2: lo stato attuale dello sviluppo", "authors": [{"given": "Roberto", "family": "Rosselli Del Turco", "affiliation": {"original_name": "Università di Torino", "normalized_name": "University of Turin", "country": "Italy", "identifiers": {"ror": "https://ror.org/048tbm396", "GRID": "grid.7605.4"}}}, {"given": "Chiara", "family": "Di Pietro", "affiliation": {"original_name": "Dipartimento di Lettere e Filosofia, Università di Firenze", "normalized_name": "University of Florence", "country": "Italy", "identifiers": {"ror": "https://ror.org/04jr1s763", "GRID": "grid.8404.8"}}}, {"given": "Chiara", "family": "Martignano", "affiliation": {"original_name": "Dipartimento di Lettere e Filosofia, Università di Firenze", "normalized_name": "University of Florence", "country": "Italy", "identifiers": {"ror": "https://ror.org/04jr1s763", "GRID": "grid.8404.8"}}}], "publisher": "Bologna: AlmaDL", "date": "2019-12-18", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/9055", "identifier": {"string_id": "10.6092/issn.2532-8816/9055", "id_scheme": "DOI"}, "abstract": "La rivoluzione digitale porta con sé la sfida più complessa della contemporaneità. Il digitale ha trasformato completamente le modalità di produzione, trasmissione e condivisione del sapere e il nostro modo stesso d’interagire con esso. Diventa ineludibile ripensare il digitale e la digitalizzazione quali espressioni sociali e culturali dell’epoca contemporanea. Il che comporta la necessità di ripensare i dati digitali in quanto entità culturali prodotte dalle società, e non più quali meri strumenti di semplificazione della gestione amministrativa o surroghe virtuali del patrimonio culturale analogico. Diviene urgente intraprendere serie politiche finalizzate a garantirne la conservazione non solo degli aspetti formali, ma soprattutto degli aspetti strutturali e descrittivi che ne qualificano e identificano i processi creativi ed evolutivi, e ne giustificano il ruolo di testimoni e memoria storica da trasferire nell’integrità dei processi nel tempo e nello spazio. Il presente contributo intende proporre una ridefinizione strutturale dei dati digitali, finalizzata a conferirgli caratteristiche utili a configurarli quali risorse culturali tramite cui conoscere i processi che caratterizzano l’era digitale contemporanea, affidando ai metadati la funzione di fonti primarie cui le generazioni future potranno accedere per leggerne, studiarne, condividerne e riusarne le informazioni.", "article_title": "Ripensare i formati, ripensare i metadati: prove “tecniche” di conservazione digitale", "authors": [{"given": "Nicola", "family": "Barbuti", "affiliation": {"original_name": "Università di Bari Aldo Moro", "normalized_name": "University of Bari Aldo Moro", "country": "Italy", "identifiers": {"ror": "https://ror.org/027ynra39", "GRID": "grid.7644.1"}}}], "publisher": "Bologna: AlmaDL", "date": "2019-05-28", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8562", "identifier": {"string_id": "10.6092/issn.2532-8816/8562", "id_scheme": "DOI"}, "abstract": "Il contributo studia gli aspetti metodologici della raccolta e della gestione di documentazione fotografica, archivistica e bibliografica relative a vari siti archeologici presenti nel territorio del XV Municipio di Roma. Il presente articolo vuole essere dunque, oltre che la presentazione di un progetto in fase di sviluppo, una riflessione sulla metodologia di gestione dei dati archeologici, non solo nell’ambito della ricerca, ma anche nel più ampio contesto della gestione e divulgazione dei patrimoni culturali. La sperimentazione di tali metodi ha previsto l’utilizzo di un GIS e la creazione di un data model.", "article_title": "L’impatto culturale e sociale dei dati archeologici nella tutela e valorizzazione del paesaggio storico. Un case study: il XV Municipio di Roma", "authors": [{"given": "Margherita", "family": "Bartoli", "affiliation": {"original_name": "Università La Sapienza di Roma", "normalized_name": "Sapienza University of Rome", "country": "Italy", "identifiers": {"ror": "https://ror.org/02be6w209", "GRID": "grid.7841.a"}}}], "publisher": "Bologna: AlmaDL", "date": "2019-05-28", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8585", "identifier": {"string_id": "10.6092/issn.2532-8816/8585", "id_scheme": "DOI"}, "abstract": "Data visualization is a powerful tool for digital scholarship yet not without its pitfalls. Based on the dissertation “Visualizing Gender Balance” comparing ten computer science conferences, several visualization techniques and tools undergo a critical review. The dataset underlying the visualizations contains data researchers encounter daily: bibliographic information. Analyzing larger sets of authors writing and publishing for conferences in computer science changes our perception of the gender (im)balance in this academic research area. But only a careful curation and visualization can truly reveal what goes on behind the scenes. Still the more complicated, detailed and nuanced the visualization, the harder it becomes for an untrained eye to interpret the patterns.", "article_title": "Visualizing Gender Balance in Conferences", "authors": [{"given": "Sytze", "family": "Van Herck", "affiliation": {"original_name": "Center for Contemporary Digital History, University of Luxembourg", "normalized_name": "University of Luxembourg", "country": "Luxembourg", "identifiers": {"ror": "https://ror.org/036x5ad56", "GRID": "grid.16008.3f"}}}], "publisher": "Bologna: AlmaDL", "date": "2019-05-28", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8581", "identifier": {"string_id": "10.6092/issn.2532-8816/8581", "id_scheme": "DOI"}, "abstract": "Questo articolo propone il primo studio comparativo di quattro anni di conferenze italiane nel campo delle Digital Humanities e della Linguistica Computazionale. Nello specifico, è stato creato un corpus costituito dai contributi presentati tra il 2014 ed il 2017 nelle conferenze AIUCD e CLiC-it a cui è stata applicata un’analisi multidimensionale prendendo in considerazione: (i) lo studio delle collaborazioni tra autori usando tecniche di analisi delle reti sociali, (ii) l’estrazione automatica di terminologia ed informazioni e (iii) l’esame delle pratiche citazionali. Combinano metodi di indagine sia qualitativi che quantitativi, questo lavoro vuole far luce su convergenze e discrepanze tra due ambiti di ricerca che storicamente hanno sorgenti comuni.", "article_title": "Un’Analisi Multidimensionale della Ricerca Italiana nel Campo delle Digital Humanities e della Linguistica Computazionale", "authors": [{"given": "Rachele", "family": "Sprugnoli", "affiliation": {"original_name": "Fondazione Bruno Kessler", "normalized_name": "Fondazione Bruno Kessler", "country": "Italy", "identifiers": {"ror": "https://ror.org/01j33xk10", "GRID": "grid.11469.3b"}}}, {"given": "Gabriella", "family": "Pardelli", "affiliation": {"original_name": "Istituto di Linguistica Computazionale \"A. Zampolli\" - CNR", "normalized_name": "Institute for Computational Linguistics “A. Zampolli”", "country": "Italy", "identifiers": {"ror": "https://ror.org/028g3pe33", "GRID": "grid.503055.6"}}}, {"given": "Federico", "family": "Boschetti", "affiliation": {"original_name": "Istituto di Linguistica Computazionale \"A. Zampolli\" - CNR", "normalized_name": "Institute for Computational Linguistics “A. Zampolli”", "country": "Italy", "identifiers": {"ror": "https://ror.org/028g3pe33", "GRID": "grid.503055.6"}}}, {"given": "Riccardo", "family": "Del Gratta", "affiliation": {"original_name": "Istituto di Linguistica Computazionale \"A. Zampolli\" - CNR", "normalized_name": "Institute for Computational Linguistics “A. Zampolli”", "country": "Italy", "identifiers": {"ror": "https://ror.org/028g3pe33", "GRID": "grid.503055.6"}}}], "publisher": "Bologna: AlmaDL", "date": "2019-05-28", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8555", "identifier": {"string_id": "10.6092/issn.2532-8816/8555", "id_scheme": "DOI"}, "abstract": "In this contribution, two open problems in computational stemmatology are being considered. The first one is contamination, an umbrella term referring to all phenomena of admixture of text variants resulting from scribes considering more than one manuscript or even memory when copying a text. This problem is one of the biggest to date in stemmatology since it implies an entirely different formal approach to the reconstruction of the copy history of a tradition and in turn to the reconstruction of an urtext. (Maas 1937) famously stated that there is no remedy against contamination and (Pasquali and Pieraccioni 1952) coined the terms 'open' vs. 'closed' recensions to distinguish contaminated from uncontaminated. We present a graph theoretical model which formally accommodates traditions with any degree of contamination while maintaining a temporal ordering and give combinatorial numbers and formula on the implication for numbers of possible scenarios.", "article_title": "An open problem in computational stemmatology -  a model for contamination", "authors": [{"given": "Armin", "family": "Hoenen", "affiliation": {"original_name": "Goethe University Frankfurt, Academy of Sciences Göttingen", "normalized_name": "Goethe University Frankfurt", "country": "Germany", "identifiers": {"ror": "https://ror.org/04cvxnb49", "GRID": "grid.7839.5"}}}], "publisher": "Bologna: AlmaDL", "date": "2019-05-28", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8575", "identifier": {"string_id": "10.6092/issn.2532-8816/8575", "id_scheme": "DOI"}, "abstract": "The Digital Humanities (DH), as Rob Kitchin reminds us, have always been interested in the building of infrastructure for research (Kitchin 2014, Loc. 222 of 6164). Imagining how emerging technologies could first be applied to Humanities problems and then scaled up to infrastructure for others to use has been one of the defining features of the field, by which we mean the field has evolved through projects that experimented with the application of new computing technologies to the difficult problems of the Humanities. Such experimentation began with Father Busaís Index Thomisticus (IT) project (Busa 1980; Winter 1999; Busa 1974-1980) which is why many genetic descriptions of the field returns to the Index. The Index Thomisticus (IT) project was not only the first, but also one of the largest Digital Humanities projects of all time, even though the outcome might, by today’s standards be considered “small”. The project lasted 34 years and at its peak (1962) involved a staff of as many as 70 persons all housed in a large ex-textile factory in Gallarate. For that time they were dealing with big data, we might even say really big data, and the infrastructure they had to build was unlike any ever built before. If we want to understand what is involved in scaling up to big infrastructure we should look back to the beginnings of the field and the emergence of big projects like the Index. This paper will therefore look at the Busa’s project as a way to think through big projects by first discussing the historiography of the IT project and DH projects in general. We will ask how can we study projects as bearers of ideas? What resources do we need/have? Then we will look at specific aspects of the project that shed light on DH projects in general. In particular we will look at how the project was communicated, conceived, and the data processing innovations. Finally, we will reflect on what lessons the IT project has for us at a time when big data has become an end in itself. What can we learn from Busa’s attention to data in the face of the temptations of automatically gathered data?", "article_title": "The Index Thomisticus as a Big Data Project", "authors": [{"given": "Geoffrey", "family": "Rockwell", "affiliation": {"original_name": "University of Alberta, Canada", "normalized_name": "University of Alberta", "country": "Canada", "identifiers": {"ror": "https://ror.org/0160cpw27", "GRID": "grid.17089.37"}}}, {"given": "Marco", "family": "Passarotti", "affiliation": {"original_name": "Università Cattolica del Sacro Cuore, Milano", "normalized_name": "Catholic University of the Sacred Heart", "country": "Italy", "identifiers": {"ror": "https://ror.org/03h7r5v07", "GRID": "grid.8142.f"}}}], "publisher": "Bologna: AlmaDL", "date": "2019-05-28", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8511", "identifier": {"string_id": "10.6092/issn.2532-8816/8511", "id_scheme": "DOI"}, "abstract": "In this essay, we reflect on distant reading as one of the various takes on reading that currently prevail in literary scholarship as well as the teaching of literature. We focus on three concepts of reading which for various reasons can be considered inter-related: close reading, surface reading and distant reading. We offer a theoretical treatment of distant reading and demonstrate why it is closely related to the concept of machine reading (part of artificial intelligence). Throughout, we focus on the role of the individual reader in all this and argue that Digital Literary Studies have much to gain from paying closer attention to the so-called “natural” reading process of individual humans.", "article_title": "Can Machines Read (Literature)?", "authors": [{"given": "Mike", "family": "Kestemont", "affiliation": {
                    "original_name": null,
                    "normalized_name": null,
                    "country": null,
                    "identifiers": {
                        "ror": null,
                        "GRID": null
                    }                    
                } }, {"given": "Luc", "family": "Herman", "affiliation": {
                    "original_name": null,
                    "normalized_name": null,
                    "country": null,
                    "identifiers": {
                        "ror": null,
                        "GRID": null
                    }                    
                } }], "publisher": "Bologna: AlmaDL", "date": "2019-05-28", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8209", "identifier": {"string_id": "10.6092/issn.2532-8816/8209", "id_scheme": "DOI"}, "abstract": "In questo testo si presenta una guida alle strategie di conservazione nel lungo periodo di opere d’arte digitale. Oltre a una breve presentazione di ogni strategia che viene menzionata dalla letteratura sull’argomento, il lettore troverà un primo approccio alle principali problematiche e riferimenti bibliografici alle trattazioni tecniche. Gli studi consultati parlano di una serie di strategie tra le quali gli addetti dei musei e i professionisti della conservazione devono scegliere caso per caso a seconda della natura dell’opera. I lavori di arte digitale, infatti, presentano caratteristiche (le componenti fisiche, l’architettura dei programmi informatici e gli aspetti comunicativi e interattivi) estremamente multiformi e variabili durante il loro ciclo di vita. Gli esempi di opere raccolti dalla bibliografia rappresentano questo fluido scenario. Il computer permette la creazione di nuovi linguaggi artistici, di nuove forme e di nuove estetiche, come la realtà virtuale o aumentata, che mettono in crisi pratiche e principi conservativi legati alla preservazione di oggetti. Concettuale, effimera e processuale, l’arte digitale presenta similitudini con le problematiche conservative dell’arte contemporanea. Si aggiungono problemi legati all’uso delle reti di computer, alla miniaturizzazione delle componenti fisiche (hardware) e all’estrema volatilità delle istruzioni (software) in linguaggio informatico. Queste sono impartite dal programmatore/artista, nelle quali vi lascia spesso il suo “segno”. Poiché il sistema operativo, i computer e i supporti di memoria hanno un ciclo di vita breve e vengono rimpiazzati rapidamente dalla ricerca e dal mercato, senza interventi conservativi le opere digitali rimangono indietro e sono condannate all’illeggibilità in pochi anni. La letteratura sull’argomento privilegia la conservazione delle componenti immateriali e concettuali del prodotto artistico rispetto a quelle fisiche e tecnologiche. Queste ultime sono soggette a obsolescenza e possono (devono) essere sostituite o riadattate al contesto nel lungo periodo.", "article_title": "Una panoramica delle strategie di conservazione di opere d’arte digitale", "authors": [{"given": "Michele", "family": "Foti", "affiliation": {
                    "original_name": null,
                    "normalized_name": null,
                    "country": null,
                    "identifiers": {
                        "ror": null,
                        "GRID": null
                    }                    
                } }], "publisher": "Bologna: AlmaDL", "date": "2018-11-30", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8187", "identifier": {"string_id": "10.6092/issn.2532-8816/8187", "id_scheme": "DOI"}, "abstract": "Quello della monografia accademica di ambito umanistico, e delle questioni di forma, pubblicazione e fruizione ad essa connesse, è un tema qualitativamente e quantitativamente poco indagato nella sua specificità. Partendo dalle lacune presenti in letteratura e dalla stasi in cui il genere monografico versa, l’articolo intende operare una ricognizione critica dello stato dell’arte, per poi esplorare nuove possibilità e sviluppi legati al digitale. Ci si vuole focalizzare in particolare sulle nuove forme della testualità liquida e multimodale che, imperniate sui paradigmi delle Digital Humanities, ripensano il modello a stampa del saggio tradizionalmente inteso sia a livello compositivo che editoriale. Si passeranno dunque in rassegna alcune tra le sperimentazioni editoriali più significative, per poi proporre un confronto con il caso d’eccellenza del progetto Stanford University Press Digital. Si tenterà, infine, di proporre delle linee guida per lo sviluppo di un modello di monografia born-digital che sia sostenibile e valutabile, e che rappresenti un’innovazione strutturale nel campo della scholarly communication.", "article_title": "La monografia digitale: pratiche, potenzialità e prospettive di rinnovamento", "authors": [{"given": "Alessandra", "family": "Di Tella", "affiliation": {
                    "original_name": null,
                    "normalized_name": null,
                    "country": null,
                    "identifiers": {
                        "ror": null,
                        "GRID": null
                    }                    
                } }], "publisher": "Bologna: AlmaDL", "date": "2018-11-30", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8174", "identifier": {"string_id": "10.6092/issn.2532-8816/8174", "id_scheme": "DOI"}, "abstract": "This article presents the rationale and the proposal of a preliminary architecture of a formal ontology of the Text Encoding Initiative markup language. The reasons to have a formal and machine-readable semantics for TEI are manifold. In the first place, it would have a number of pragmatic and technical benefits, like better support for semantic interoperability in text encoding practices, easier cross-corpora query processing, seamless integration with Linked Open Data ecosystem. In second place, it would give a formalized account of the quasi-formal notion of the TEI abstract model, fostering the consistency and soundness of the TEI model. Given the complexity of the TEI encoding schema, such an ontology must necessarily have a very complex architecture, and its thorough definition will be a time consuming intellectual activity: in a first stage, we propose to limit its scope to a well-defined subdomain of the TEI, and to build it adopting pre-existing meta-ontology like EARMARK. The final part of the article gives some preliminary details of this design", "article_title": "A Formal Ontology for the Text Encoding Initiative", "authors": [{"given": "Fabio", "family": "Ciotti", "affiliation": {"original_name": "Università di Roma Tor Vergata", "normalized_name": "University of Rome Tor Vergata", "country": "Italy", "identifiers": {"ror": "https://ror.org/02p77k626", "GRID": "grid.6530.0"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-11-30", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8161", "identifier": {"string_id": "10.6092/issn.2532-8816/8161", "id_scheme": "DOI"}, "abstract": "This paper consists of the cataloguing, mapping, and the study of the street poetry of Rome, written on the walls of the Italian capital by a group of street artists who started their activity in 2012: The Poeti der Trullo (The poets of the Trullo). Through the use of digital humanities tools, the article describes the Poeti der Trullo and their district, developing some considerations on the themes and the language that characterise their poems. The aim is to understand the cultural and social roots of this street poetry phenomenon and its effects on contemporary society. This study, which combines tools such as WordSmith, TXM, RStudio, Q-GIS, CartoDB, and Gephi, explains how the Poeti der Trullo interpret and interact with society through an interdisciplinary approach. The activity of the Poeti der Trullo, which blends the tradition of Roman graffiti and Pasquinate with the urban culture of slam poetry, shows a poetic resistance towards the image of contemporary society. Through a simple gesture such as writing a poetic message on a wall, these young performers reveal the strength of a cultural tradition that discloses a new act of resistance which has a pragmatic effect on society. In only six years of existence, these poets have effectively created a movement able to generate effective change in their district.", "article_title": "Rethinking Rome as an Anthology: The Poeti der Trullo’s Street Poetry", "authors": [{"given": "Giovanni Pietro", "family": "Vitali", "affiliation": {"original_name": "Université de Poitiers", "normalized_name": "University of Poitiers", "country": "France", "identifiers": {"ror": "https://ror.org/04xhy8q59", "GRID": "grid.11166.31"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-11-30", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8141", "identifier": {"string_id": "10.6092/issn.2532-8816/8141", "id_scheme": "DOI"}, "abstract": "Questo elaborato ha lo scopo di esaminare l’Archivio degli Iblei, un progetto di storia pubblica digitale che si presenta come un archivio partecipato collaborativo. L’elaborato parte da una descrizione dettagliata del progetto, per poi fare un esame dello stato dell’arte e, infine, arrivare a evidenziare i pregi e i difetti del progetto, presentando anche eventuali proposte di miglioramento.", "article_title": "L'Archivio degli Iblei", "authors": [{"given": "Elisabetta", "family": "Triolo", "affiliation": {"original_name": "Università di Pisa", "normalized_name": "University of Pisa", "country": "Italy", "identifiers": {"ror": "https://ror.org/03ad39j10", "GRID": "grid.5395.a"}}}, {"given": "Pietro", "family": "Dell'oglio", "affiliation": {"original_name": "Università di Pisa", "normalized_name": "University of Pisa", "country": "Italy", "identifiers": {"ror": "https://ror.org/03ad39j10", "GRID": "grid.5395.a"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-11-30", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8189", "identifier": {"string_id": "10.6092/issn.2532-8816/8189", "id_scheme": "DOI"}, "abstract": "La Società Storica Spezzina è un’associazione ONLUS che si propone di stimolare il rapporto tra gli abitanti della provincia di La Spezia con la propria storia locale, utilizzando tecnologie, strategie e metodi di Digital Public History. A questo scopo è stata creata una piattaforma online che vuole essere sia un luogo di incontro tra studiosi e cittadini, sia una sorta di laboratorio in cui sperimentare insieme progetti collaborativi. In quest'articolo, attraverso la nozione di 'design della partecipazione’, tenteremo di suggerire un possibile cambio di prospettiva sul ruolo e sull'ambito di competenza del digital public historian. Il sito della Società Storica Spezzina ci darà l'opportunità di verificarne le linee teoriche e di avanzare, infine, alcune riflessioni e proposte.", "article_title": "Digital Public History e design della partecipazione. Riflessioni e proposte a partire dalla Società Storica Spezzina", "authors": [{"given": "Stefano", "family": "Capezzuto", "affiliation": {"original_name": "Università di Pisa", "normalized_name": "University of Pisa", "country": "Italy", "identifiers": {"ror": "https://ror.org/03ad39j10", "GRID": "grid.5395.a"}}}, {"given": "Andrea", "family": "Pedrotti", "affiliation": {"original_name": "Università di Pisa", "normalized_name": "University of Pisa", "country": "Italy", "identifiers": {"ror": "https://ror.org/03ad39j10", "GRID": "grid.5395.a"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-11-30", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8144", "identifier": {"string_id": "10.6092/issn.2532-8816/8144", "id_scheme": "DOI"}, "abstract": "Il paper descrive un processo di pattern recognition, che utilizza un algoritmo di graphic matching basato sulla funzione shape contour recognition senza necessità di applicare funzioni di segmentazione. Il processo si avvia partendo dall’individuazione di una Region of Interest (ROI) all’interno dell’immagine. La ROI è quindi gestita per la creazione del shape model poi utilizzato per eseguire le ricerche di modelli simili in una o più immagini target. Il sistema è stato sviluppato e testato con l'obiettivo di proporre un approccio innovativo nella ricerca e recupero di informazioni in digital libraries relative a documentazione antica manoscritta e a stampa. Questo approccio si basa sull'applicazione ai data humanities del quarto paradigma della conoscenza che è alla base dei data science. Seguendo questo approccio, l'algoritmo si utilizza per dedurre nuove ipotesi di ricerca attraverso la scoperta di modelli direttamente derivati da digital libraries di grandi dimensioni.", "article_title": "Un innovativo Graphic Matching System per la ricerca in database di manoscritti antichi", "authors": [{"given": "Nicola", "family": "Barbuti", "affiliation": {"original_name": "Università degli Studi di Bari Aldo Moro", "normalized_name": "University of Bari Aldo Moro", "country": "Italy", "identifiers": {"ror": "https://ror.org/027ynra39", "GRID": "grid.7644.1"}}}, {"given": "Stefano", "family": "Ferilli", "affiliation": {"original_name": "Università degli Studi di Bari Aldo Moro", "normalized_name": "University of Bari Aldo Moro", "country": "Italy", "identifiers": {"ror": "https://ror.org/027ynra39", "GRID": "grid.7644.1"}}}, {"given": "Tommaso", "family": "Caldarola", "affiliation": {"original_name": "D.A.BI.MUS S.r.l.", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}], "publisher": "Bologna: AlmaDL", "date": "2018-11-30", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8135", "identifier": {"string_id": "10.6092/issn.2532-8816/8135", "id_scheme": "DOI"}, "abstract": "L’assenza di edizioni native digitali di testi classici a tradizione complessa ha indotto molti ad interrogarsi sulle ragioni di questa lacuna nelle DH. A fronte di alcune risposte e possibili soluzioni, questo articolo presenta un caso di applicazione di tecnologie esistenti alla tradizione manoscritta di Catullo, che si compone di circa 130 codici e presenta notevoli problemi paleografici, filologici e genetici. Il lavoro di collazione e spoglio di tutti i testimoni, portato avanti da un gruppo di ricerca afferente al CSC, ha permesso di individuare alcune delle cruces che l’editore classico si trova ad affrontare in ambiente digitale e ha altresì mostrato la distanza che separa l’edizione critica di un testo classico, così come si è canonicamente definita in seno alla filologia novecentesca, e l’edizione critica digitale di un testo classico: se da un lato infatti l’edizione critica cartacea ha una concretezza e un’uniformità che mancano a quella digitale, ma talvolta non consente la piena verificabilità dei dati, l’edizione digitale potrebbe consentire un controllo più puntuale e garantire un più alto grado di scientificità del lavoro dell’editore, permettendo di rinnovare profondamente il contesto di studi; tuttavia, gli strumenti attualmente esistenti talvolta si dimostrano inadeguati. Questo articolo offre qualche esempio e spera di stimolare una discussione proficua.", "article_title": "Verso il trattamento automatico della tradizione manoscritta del liber di Catullo", "authors": [{"given": "Susanna", "family": "Bertone", "affiliation": {"original_name": "Università di Parma", "normalized_name": "University of Pavia", "country": "Italy", "identifiers": {"ror": "https://ror.org/00s6t1f81", "GRID": "grid.8982.b"}}}, {"given": "Giovanni", "family": "Grandi", "affiliation": {"original_name": "Università di Parma", "normalized_name": "University of Pavia", "country": "Italy", "identifiers": {"ror": "https://ror.org/00s6t1f81", "GRID": "grid.8982.b"}}}, {"given": "Alessandro", "family": "Bettoni", "affiliation": {"original_name": "Università di Parma", "normalized_name": "University of Pavia", "country": "Italy", "identifiers": {"ror": "https://ror.org/00s6t1f81", "GRID": "grid.8982.b"}}}, {"given": "Francesco", "family": "Cavalli", "affiliation": {"original_name": "Università di Parma", "normalized_name": "University of Pavia", "country": "Italy", "identifiers": {"ror": "https://ror.org/00s6t1f81", "GRID": "grid.8982.b"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-11-30", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8146", "identifier": {"string_id": "10.6092/issn.2532-8816/8146", "id_scheme": "DOI"}, "abstract": "Il contributo si propone di ragionare sulle potenzialità dell’ecdotica digitale tramite l’uso di alcuni testi esemplificativi. La finalità è quella di provare a riflettere, da un lato sul peso da dare all’atto ricostruttivo rispetto all’atto costruito; dall’altro, sulla tipologia di testo da editare. L’esemplificazione verterà su tre tipologie di testi a cui sono associate diversi modelli o ipotesi di codifica. Le tipologie testuali fanno riferimento a testi inediti nei quali non è espressa l’ultima volontà d’autore e i processi compositivi risultano fluidi e instabili; a testi inediti che pongono problemi di rappresentazione e di intelligibilità, oltre a una possibile riscrittura coatta a scopo difensivo; a testi preparatori per un progetto letterario non realizzato e documentati da diversi testimoni, uno dei quali viene pubblicato senza espressa volontà dell’autore ma secondo un principio di volontà dell’editore. I testi di riferimento sono due autografi inediti di attilio bertolucci risalenti agli anni ’30-’40 del Novecento; un estratto del manoscritto autografo 2Qq E 29 (sec. XVII ex.) di teresa di s. geronimo e del «manoscritto di Populonia» (1959-1961) di elio vittorini. Le riflessioni sui modelli di marcatura hanno l’obiettivo di far emergere il testo come soggetto dinamicamente instabile e tentare di ricostruire così la sua trans-fisicità o trans-testualità attiva, trasformandolo da reale in virtuale. Il contributo, senza nessuna pretesa esaustiva e normativa, si propone anche in dialogo con la prassi dell’ecdotica tradizionale, per ricercare modelli standardizzati di marcatura e rispondere così a possibili dubbi metodologici alla base di una edizione critica.", "article_title": "Dai testi cartacei ai testi virtuali: potenzialità dell’ecdotica digitale", "authors": [{"given": "Luciano", "family": "Longo", "affiliation": {"original_name": "Università di Palermo", "normalized_name": "University of Palermo", "country": "Italy", "identifiers": {"ror": "https://ror.org/044k9ta02", "GRID": "grid.10776.37"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-11-30", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7298", "identifier": {"string_id": "10.6092/issn.2532-8816/7298", "id_scheme": "DOI"}, "abstract": "Questo contributo illustra un’efficace esperienza di collaborazione tra diverse istituzioni, quali enti di ricerca, di tutela e formazione, e differenti professionalitá, coinvolte nell’ambito dell’alternanza scuola-lavoro, ai fini della digitalizzazione e valorizzazione del patrimonio epigrafico del Museo Civico Castello Ursino del Comune di Catania. Il Museo possiede una rilevante collezione epigrafica, costituita da due raccolte settecentesche catanesi. Alcune iscrizioni sono esposte secondo i vecchi criteri di fruizione museale; la maggior parte é custodita in deposito. Uno degli obiettivi dell’esperienza é dunque far conoscere al pubblico fruitore ed alla comunitá degli studiosi l’ingente patrimonio epigrafico del Castello attualmente non esposto al pubblico. Il progetto di durata triennale é stato caratterizzato in un primo momento da una attivitá di digitalizzazione di schede catalografiche e di documentazione grafica e fotografica di parte delle epigrafi; durante il secondo anno di attivit. é stata realizzata una esposizione presso il Castello Ursino di un gruppo selezionato di epigrafi di provenienza catanese, che sono state sottoposte a un primo restauro conservativo ed inserite nel catalogo digitale con la relativa documentazione. Le epigrafi sono codificate secondo standard e vocabolari controllati internazionali (formatto EpiDoc TEI XML, Pleiades per posizioni geografiche e lessici controllati di EAGLE per i tipi di iscrizioni, i materiali e i supporti) al fine di consentire la creazione di Linked Open Data. La mostra presenta, tra l’altro, la realizzazione di due video e l’inserimento di un chiosco digitale multimediale per accedere a contenuti di approfondimento e immagini 3D. Durante il terzo anno é programmata la prosecuzione dell’attivit. di digitalizzazione e documentazione ed un approfondimento della disseminazione dei risultati sul web.", "article_title": "Una collaborazione tra museo, enti di ricerca e scuola: l'epigrafia digitale e l'alternanza scuola lavoro", "authors": [{"given": "Serena", "family": "Agodi", "affiliation": {"original_name": "Liceo Artistico \"M.M. Lazzaro\"", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}, {"given": "Salvatore", "family": "Cristofaro", "affiliation": {"original_name": "Consiglio Nazionale delle Ricerche", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}}, {"given": "Valentina", "family": "Noto", "affiliation": {"original_name": "Comune di Catania", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}, {"given": "Jonathan R.W.", "family": "Prag", "affiliation": {"original_name": "University of Oxford", "normalized_name": "University of Oxford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/052gg0110", "GRID": "grid.4991.5"}}}, {"given": "Daria", "family": "Spampinato", "affiliation": {"original_name": "Consiglio Nazionale delle Ricerche", "normalized_name": "National Research Council", "country": "Italy", "identifiers": {"ror": "https://ror.org/04zaypm56", "GRID": "grid.5326.2"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7305", "identifier": {"string_id": "10.6092/issn.2532-8816/7305", "id_scheme": "DOI"}, "abstract": "Conceptual Analysis (CA) is a matter-of-course practice for philosophers and other scholars in the humanities. Exploring one author’s corpus of texts in order to discover the various properties of a concept is a classic example of CA. Recently, a corpus-based computational framework for CA has been emerging in response to the methodological challenges brought about by the massive digitization of texts. In this framework, CA is approached by implementing a computer-assisted text analysis method, within which algorithms are used to support the various cognitive operations involved in CA. In this article, we focus on the retrieval of relevant text segments for analysis. However, this is a complex issue within a computational framework, since the relation between concept and natural language depends on several semantic phenomena, including synonymy, polysemy, and contextual modulation. The main contribution of this article is methodological because it explores the computational approach to CA. We present three algorithmic methods, which identify relevant text segments while taking into account various semantic phenomena. The results show the potential of computer-assisted CA, thereby highlighting the need to overcome the limitations of these first experiments. An additional contribution of this work takes the form of knowledge transfer from Artificial Intelligence to the Humanities.", "article_title": "Conceptual Analysis in a computer-assisted framework: mind in Peirce", "authors": [{"given": "Davide", "family": "Pulizzotto", "affiliation": {"original_name": "LANCI-UQAM (Laboratoire d'ANalyse Cognitive de l'Information)", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}, {"given": "Jean-François", "family": "Chartier", "affiliation": {"original_name": "LANCI-UQAM (Laboratoire d'ANalyse Cognitive de l'Information)", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}, {"given": "Francis", "family": "Lareau", "affiliation": {"original_name": "LANCI-UQAM (Laboratoire d'ANalyse Cognitive de l'Information)", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}, {"given": "Jean-Guy", "family": "Meunier", "affiliation": {"original_name": "LANCI-UQAM (Laboratoire d'ANalyse Cognitive de l'Information)", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}, {"given": "Louis", "family": "Chartrand", "affiliation": {"original_name": "LANCI-UQAM (Laboratoire d'ANalyse Cognitive de l'Information)", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7253", "identifier": {"string_id": "10.6092/issn.2532-8816/7253", "id_scheme": "DOI"}, "abstract": "How can we study, present and teach complex cultural phenomena such as the Russian philological culture of the 1920s? To achieve this goal, we elaborated a knowledge representation that facilitates scientific collaboration, enables distant reading, improves the navigation of scholarly literature, links classical texts to rich international scholarship, and provides a basis of effective visualization. Digital Humanities offer an ideal framework for the intense human-computer collaboration required to carry out such a project. We focus on the network of relations both within and between three key communities of the early Soviet philological milieu – the Formalists, the Marrists and the Bakhtinists – approaching them through the optics of two major philological romans à clef of the period. To this end, we (1) prepared a collection of primary texts; (2) built a repository of secondary literature; (3) using this research literature, enriched primary texts with both general and ad locum annotations; (4) adapted the nano-publications method as a comprehensive approach for representing this scholarly knowledge in the Semantic Web. We make use of the quantitative methods toolkit of the VicoGlossia  system, which was developed as part of an international and inter-institutional collaboration.", "article_title": "VICOGLOSSIA: Annotatable and Commentable Library as a Bridge between Reader and Scholar (a proof of concept study: Early Soviet Philological Culture)", "authors": [{"given": "Michail", "family": "Maiatsky", "affiliation": {"original_name": "University of Lausanne", "normalized_name": "University of Lausanne", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/019whta54", "GRID": "grid.9851.5"}}}, {"given": "Alexey", "family": "Boyarsky", "affiliation": {"original_name": "Leiden University", "normalized_name": "Leiden University", "country": "Netherlands", "identifiers": {"ror": "https://ror.org/027bh9e22", "GRID": "grid.5132.5"}}}, {"given": "Natalia", "family": "Boyarskaya", "affiliation": {"original_name": "EPFL, Lausanne", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}, {"given": "Ekaterina", "family": "Velmezova", "affiliation": {"original_name": "Faculté des Lettres", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}}, {"given": "Michael", "family": "Piotrowski", "affiliation": {"original_name": "University of Lausanne", "normalized_name": "University of Lausanne", "country": "Switzerland", "identifiers": {"ror": "https://ror.org/019whta54", "GRID": "grid.9851.5"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7262", "identifier": {"string_id": "10.6092/issn.2532-8816/7262", "id_scheme": "DOI"}, "abstract": "L'articolo delinea gli obiettivi del progetto di edizione digitale del manoscritto Napoli, Biblioteca Nazionale, MS XIII.B.29. Il codice, preziosissimo in quanto unico esempio di letteratura inglese tardomedievale conservato in Italia, contiene romanzi cavallereschi e un poema agiografico che conobbero ampia circolazione nell’Inghilterra del quattordicesimo e quindicesimo secolo, oltre a ricette mediche finora inedite. A parte la sua rilevanza filologica e letteraria (la maggior parte dei testimoni delle opere ivi contenuti si differenzia talvolta anche in modo marcato rispetto al resto delle rispettive tradizioni testuali), la presenza di note in italiano e, soprattutto, di un’illustrazione che testimonierebbe la sua appartenenza a Tommaso Campanella pone il codice in una posizione di sicuro interesse storico e contestualizza in modo peculiare la sua fruizione nell’ambiente culturale napoletano del sedicesimo e diciassettesimo secolo. L’obiettivo principale del progetto consiste, dunque, nel fornire uno strumento che permetta la più ampia fruizione di un manoscritto finora praticamente sconosciuto ma unico nel suo genere, al fine di preservarne l’integrità materiale. Oltre a dettagliare le modalità di marcatura dei testi e di codifica degli elementi paratestuali, si fornirà un piano preliminare di edizione, che verrà realizzato attraverso l'interfaccia open source EVT.", "article_title": "Un progetto di edizione digitale del codice Napoli, Biblioteca Nazionale, MS XIII.B.29.", "authors": [{"given": "Omar", "family": "Khalaf", "affiliation": {"original_name": "Dipartimento di Diritto, Economia e Culture, Università  degli Studi dell'Insubria, Como", "normalized_name": "University of Insubria", "country": "Italy", "identifiers": {"ror": "https://ror.org/00s409261", "GRID": "grid.18147.3b"}}}, {"given": "Raffaele", "family": "Cioffi", "affiliation": {"original_name": "Dipartimento di Studi Umanistici, Università  degli Studi di Torino", "normalized_name": "University of Turin", "country": "Italy", "identifiers": {"ror": "https://ror.org/048tbm396", "GRID": "grid.7605.4"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7261", "identifier": {"string_id": "10.6092/issn.2532-8816/7261", "id_scheme": "DOI"}, "abstract": "TRANSSCRIPT (Transcription et scripturalité. Écrit et gouvernance entre France et Empire, XIIIe-XIVe siècle), trascrizione e studio della documentazione medioevale transfrontaliera (Francia - Lussemburgo), è un progetto finanziato dall’Agence Nationale de la Recherche (ANR), in Francia, e dal Fonds National de la Recherche (FNR), in Lussemburgo. Il suo scopo è quello di assemblare, in un vasto corpus, la documentazione medievale dei duchi di Lorena e dei conti, poi duchi, del Lussemburgo (XIII - XVI secolo) in maniera tale da sviluppare riflessioni sulla “governance” e sui “transfers” tra due culture, due universi vicini, complementari, e nel contempo distanti. Le lingue utilizzate nei documenti sono tre: latino, francese e tedesco. L’utilizzazione dell’informatica applicata alle fonti storiche permette di esplorare agevolmente questa documentazione facendo ricerche mirate.", "article_title": "Edizione diplomatica digitale di un corpus trilingue: il progetto ANR TRANSSCRIPT", "authors": [{"given": "Laura", "family": "Gili-Thébaudeau", "affiliation": {"original_name": "Université de Lorraine", "normalized_name": "University of Lorraine", "country": "France", "identifiers": {"ror": "https://ror.org/04vfs2w97", "GRID": "grid.29172.3f"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7257", "identifier": {"string_id": "10.6092/issn.2532-8816/7257", "id_scheme": "DOI"}, "abstract": "L’articolo presenta l’edizione di una corrispondenza diplomatica francese del XVII secolo. Dopo un breve excursus sull’autore delle lettere, verrà presentata l’edizione critica tradizionale a stampa e saranno esplicitati gli interventi realizzati sul testo. Ci si interrogherà sulla questione della modernizzazione del testo, per privilegiare la comprensione del contenuto, a scapito però dell’autenticità della lingua. Verranno analizzate le edizioni digitali di corrispondenze attualmente pubblicate. Sarà quindi presentata l’edizione digitale della corrispondenza oggetto di questo articolo, mettendo in luce i vantaggi offerti dall’edizione digitale, realizzata usando il software EVT e visualizzatore Oxygen. Verrà mostrato un esempio di marcatura linguistica con software Treetagger, saranno messe in evidenza alcune problematicità legate alle etichette oggi utilizzate dal sistema sia per quanto riguarda il francese moderno che quello antico. Saranno presentati alcuni gruppi di ricerca europei che stanno affinando delle etichette più specifiche, in particolare il gruppo PRESTO. Saranno analizzate alcune difficoltà riscontrate realizzando l’edizione digitale, come l’assenza delle conoscenze informatiche necessarie e la necessità di un lavoro di équipe tra filologo e informatico, ma verrà anche proposta una riflessione sulla figura dell’umanista digitale e sulle competenze necessarie per poter dialogare con chi praticamente realizzerà l’edizione. Si affronteranno alcune questioni legate alla necessità di associare all’edizione digitale un codice ISBN, un codice DOI e eventualmente una registrazione alla SIAE. Verranno presentati alcuni esempi di conservazione di documenti digitali da parte delle Biblioteche dell’Università degli studi di Torino, in particolare i progetti: SIRIO@UNITO e TUTTO.", "article_title": "Corrispondenze diplomatiche francesi del Seicento: le possibilità offerte dall’edizione digitale", "authors": [{"given": "Cecilia", "family": "Russo", "affiliation": {"original_name": "Università degli Studi di Torino", "normalized_name": "University of Turin", "country": "Italy", "identifiers": {"ror": "https://ror.org/048tbm396", "GRID": "grid.7605.4"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7288", "identifier": {"string_id": "10.6092/issn.2532-8816/7288", "id_scheme": "DOI"}, "abstract": "La Ricerca, finalizzata alla costruzione di una bibliografia italiana delle scritture fuori dal canone del Novecento, consta di un sistema di tabelle che ricostruiscono un quadro di presenze atipiche nel panorama letterario del Novecento. Le fonti utilizzate per la ricerca sono molteplici: SBN, InternetCulturale, AIB, risorse di Istituti di Ricerca internazionali, oltre a Google-books per rintracciare informazioni o disambiguare dati controversi. La costruzione della bibliografia in formato elettronico ha dunque condotto a ripensare la strutturazione dei dati bibliografici al fine di ottenere il massimo grado di leggibilità e di chiarezza della cospicua mole di dati catalogata, ma anche la massima permeabilità ed adattamento dei dati grezzi immessi nel database. Seguendo lo schema della “scheda di autorità” proposto da SBN, per ogni autore/autrice il data base bibliografico contiene di prassi la dichiarazione delle fonti utilizzate sotto forma di link attivi, strumento essenziale per validare l'attendibilità delle fonti. La ricostruzione della bibliografia delle opere ha implicato inoltre la selezione non solamente della prima attestazione a stampa di ogni opera, ma delle nuove edizioni successive. Con tale ricerca è stato ripensato il concetto stesso di bio-bibliografia delle opere del Novecento, attualizzandone scopi e architettura, riflettendo infine sulle specificità introdotte dalle Digital Humanities.", "article_title": "Un secolo di scritture fuori dal canone: la bibliografia come modello informatico per la ricerca", "authors": [{"given": "Alessia", "family": "Scacchi", "affiliation": {"original_name": "Università di Roma \"La Sapienza\"", "normalized_name": "Sapienza University of Rome", "country": "Italy", "identifiers": {"ror": "https://ror.org/02be6w209", "GRID": "grid.7841.a"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7286", "identifier": {"string_id": "10.6092/issn.2532-8816/7286", "id_scheme": "DOI"}, "abstract": "Viene presentato l’impianto metodologico e tecnologico dell’edizione critica digitale del De nominedi Orso Beneventano (http://www.unipa.it/paolo.monella/ursus), una proof of concept delle innovazioni metodologiche proposte da Tito Orlandi. Il modello qui sperimentato intende superare la dicotomia tra edizione diplomatica e critica grazie ad un ripensamento profondo, semioticamente fondato, dei livelli di trascrizione e di edizione di un testo. I livelli scelti per questa edizione sono: (1) Livello grafematico, le cui unità minime sono i grafemi, inclusi i segni paragrafematici e le brachilogie sistematiche. Tutti i grafemi individuati dall’editore sono elencati nella Graphemic Table of Signs (GToS), che costituisce parte integrante dell’edizione. (2) Livello alfabetico, le cui unità minime sono le lettere alfabetiche. La GToS riporta il significato alfabetico standard dei grafemi. La codifica a livello alfabetico è fornita esplicitamente dall’editore all’interno di un elemento  solo quando essa non sia desumibile dalla codifica grafematica tramite la tabella di corrispondenze fornita nella GToS. (3) Livello linguistico, le cui unità minime sono le parole flesse (), identificate tramite la combinazione di un lemma (lupus, -i: attributo @lemma) e di informazioni morfologiche (genitivo singolare: attributo @ana). Questo livello di codifica è utile per la visualizzazione (edizione critica), l’analisi testuale, l’interoperabilità e la collazione. L’ultima parte dell’articolo traccia un bilancio dell’edizione di Orso e delinea alcune strategie per velocizzare il flusso del lavoro in vista della futura edizione del Chronicon di Romualdo Salernitano.", "article_title": "Livelli di rappresentazione del testo nell’edizione del De nomine di Orso Beneventano", "authors": [{"given": "Paolo", "family": "Monella", "affiliation": {"original_name": "Università di Palermo", "normalized_name": "University of Palermo", "country": "Italy", "identifiers": {"ror": "https://ror.org/044k9ta02", "GRID": "grid.10776.37"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/8053", "identifier": {"string_id": "10.6092/issn.2532-8816/8053", "id_scheme": "DOI"}, "abstract": "In this paper we study, analyse and comment on rhetorical figures present in a selected body of poetry of the first half of the 20th century. These figures are at first traced back to famous poets of the past and then compared to classical Latin prose. Linguistic theory is then called upon to show how these rethorical figures can be represented in syntactic structures and classified as noncanonical structures, by positioning discontinuous or displaced linguistic elements in SpecXP projections at various levels of constituency. We then introduce LFG – Lexical Functional Grammar – as the theory that allows us to connect syntactic noncanonical structures with informational structure and psycholinguistic theories for complexity evaluation. We end up with two computational linguistics experiments and then evaluate the results. The first experiment uses the best performing online parsers of Italian to parse poetic structures; the second experiment use Getarun – a system created at the Computational Linguistics Laboratory of Ca' Foscari. As will be shown, the first approach is unable to cope with these structures because only statistical probabilistic information is used. Conversely, as a symbolic rule-based system, the second approach is much superior and facilitates both semantic and pragmatic analyses.", "article_title": "Syntax and Semantics of Italian Poetry in the First Half of the 20th Century", "authors": [{"given": "Rodolfo", "family": "Delmonte", "affiliation": {"original_name": "Università Ca'Foscari Venezia", "normalized_name": "Ca Foscari University of Venice", "country": "Italy", "identifiers": {"ror": "https://ror.org/04yzxz566", "GRID": "grid.7240.1"}}}], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}, {"url": "https://umanisticadigitale.unibo.it/article/view/7814", "identifier": {"string_id": "10.6092/issn.2532-8816/7814", "id_scheme": "DOI"}, "abstract": "This paper introduces two projects in the realm of Digital Humanities, Mapping Visions of Rome and Digital Roman Heritage. The first project was conceived as a digital aid to my traditional research, while the second developed as a digital aid to the collaboration with other people and projects. Together they reflect how I, trained as a Latinist, entered the field of Digital Humanities, in which I have no specific training. The goal of this paper is therefore primarily to explore the opportunities offered by Digital Humanities for humanities researchers like myself who do not regard this field as their native soil but still wish to contribute to it and benefit from digital research infrastructures and technologies. In particular, it will reflect on the way in which Digital Humanities can further interdisciplinary collaboration and exchange, which I consider to be one of its greatest assets.", "article_title": "Mapping Visions of Rome and Digital Roman Heritage Connectivity between Literary and Artistic Heritage in a Digital Age", "authors": [{"given": "Susanna De", "family": "Beer", "affiliation": {
                    "original_name": null,
                    "normalized_name": null,
                    "country": null,
                    "identifiers": {
                        "ror": null,
                        "GRID": null
                    }                    
                } }], "publisher": "Bologna: AlmaDL", "date": "2018-05-23", "keywords": null, "journal_title": "Umanistica Digitale", "volume": null, "issue": null, "ISSN": [{"value": "2532-8816", "type": "electronic"}]}]