[
{"string_id": "10.3389/fdigh.2019.00009", "abstract": "<p>Immersive technology, such as virtual reality, provides us with novel opportunities to create and explore affective experiences with a transformative potential mediated through awe. The profound emotion of awe, that is experienced in response to witnessing vastness and creates the need for accommodation that can lead to restructuring of one's worldview and an increased feeling of connectedness. An iconic example of the powers of awe is observed in astronauts who develop instant social consciousness and strong pro-environmental values in response to the overwhelming beauty of Earth observed from space. Here on Earth, awe can also be experienced in response to observing vast natural phenomenon or even sometimes in response to some forms of art, presenting vast beauty to its audience. Can virtual reality provide a new powerful tool for reliably inducing such experiences? What are some unique potentials of this emerging medium? This paper describes the evaluation of an immersive installation “<i>AWE”</i>—Awe-inspiring Wellness Environment. The results indicate that the experience of being in “<i>AWE”</i> can elicit some components of awe emotion and induce minor cognitive shifts in participant's worldview similar to the Overview Effect, while this experience also has its own attributes that might be unique to this specific medium. Comparing the results of this exploratory study to other virtual environments designed to elicit Overview Effect provides insights on the relationship between design features and participant's experience. The qualitative results highlight the importance of perceived safety, personal background and familiarity with the environment, and the induction of a small visceral fear reaction as a part of the emotional arc of the virtual journey—as some of the key contributers to the affective experience of the immersive installation. Even though the observed components of awe and a few indications of cognitive shift support the potential of Virtual Reality as a transformative medium, many more iterations of the design and research tools are required before we can achieve and fully explore a profound awe-inspiring transformative experience mediated through immersive technologies.</p>"},
{"string_id": "10.3389/fdigh.2018.00028", "abstract": "<p>The Everyday Sexism Project documents everyday examples of sexism reported by volunteer contributors from all around the world. It collected 100,000 entries in 13+ languages within the first 3 years of its existence. The content of reports in various languages submitted to Everyday Sexism is a valuable source of crowdsourced information with great potential for feminist and gender studies. In this paper, we take a computational approach to analyze the content of reports. We use topic-modeling techniques to extract emerging topics and concepts from the reports, and to map the semantic relations between those topics. The resulting picture closely resembles and adds to that arrived at through qualitative analysis, showing that this form of topic modeling could be useful for sifting through datasets that had not previously been subject to any analysis. More precisely, we come up with a map of topics for two different resolutions of our topic model and discuss the connection between the identified topics. In the low-resolution picture, for instance, we found Public space/Street, Online, Work related/Office, Transport, School, Media harassment, and Domestic abuse. Among these, the strongest connection is between Public space/Street harassment and Domestic abuse and sexism in personal relationships. The strength of the relationships between topics illustrates the fluid and ubiquitous nature of sexism, with no single experience being unrelated to another.</p>"},
{"string_id": "10.3389/fdigh.2018.00019", "abstract": "<p>Middle High German (MHG) epic poetry presents a unique solution to the linguistic changes underpinning the transition from classical Latin poetry, based on syllable length, into later vernacular rhythmic poetry, based on phonological stress. The predominating pattern in MHG verse is the alternation between stressed and unstressed syllables, but syllable length also plays a crucial role. There are a total of eight possible metrical values. Single or half mora syllables can carry any one of three types of stress, resulting in six combinations. The seventh value is a double mora, i.e., a long stressed syllable. The eighth value is an elided syllable. We construct a supervised Conditional Random Field (CRF) model to predict the metrical value of syllables, and subsequently investigate medieval German poets' use of semantic and sonorous emphasis through meter. The features used are: (1) the syllable's position within the line, (2) the syllable's length in characters, (3) the syllable's characters, (4) elision (last two characters of previous syllable and first two characters of focal syllable), (5) syllable weight, and (6) word boundaries. Additional metrical rules are enforced and marginal probabilities are calculated to yield the most likely legal scansion of a line. The model achieves a weighted average F-score of 0.925 on internal cross-validation and 0.909 on held-out testing data. We determine that trochaic alternation with a one syllable anacrusis and words carrying clear stress assignment are the easiest for the model to scan. Lines with multiple double morae of syllables with few characters are the most difficult. We then rank all the epic poetry in the Mittelhochdeutsche Begriffsdatenbank (MHDBDB) by the difficulty of the meter. Finally, we investigate the double mora, which MHG poets used to draw attention to chosen concepts. We conclude that poets generally chose to use the double mora to emphasize highly sonorant words.</p>"},
{"string_id": "10.3389/fdigh.2019.00003", "abstract": "<p>Metaphors are commonly used in interface design within Human-Computer Interaction (HCI). Interface metaphors provide users with a way to interact with the computer that resembles a known activity, giving instantaneous knowledge or intuition about how the interaction works. A widely used one in Digital Musical Instruments (DMIs) is the conductor-orchestra metaphor, where the orchestra is considered as an instrument controlled by the movements of the conductor. We propose a DMI based on the conductor metaphor that allows to control tempo and dynamics and adapts its mapping specifically for each user by observing spontaneous conducting movements (i.e., movements performed on top of fixed music without any instructions). We refer to this as mapping by observation given that, even though the system is trained specifically for each user, this training is not done explicitly and consciously by the user. More specifically, the system adapts its mapping based on the tendency of the user to anticipate or fall behind the beat and observing the Motion Capture descriptors that best correlate to loudness during spontaneous conducting. We evaluate the proposed system in an experiment with twenty four (24) participants where we compare it with a baseline that does not perform this user-specific adaptation. The comparison is done in a context where the user does not receive instructions and, instead, is allowed to discover by playing. We evaluate objective and subjective measures from tasks where participants have to make the orchestra play at different loudness levels or in synchrony with a metronome. Results of the experiment prove that the usability of the system that automatically learns its mapping from spontaneous movements is better both in terms of providing a more intuitive control over loudness and a more precise control over beat timing. Interestingly, the results also show a strong correlation between measures taken from the data used for training and the improvement introduced by the adapting system. This indicates that it is possible to estimate in advance how useful the observation of spontaneous movements is to build user-specific adaptations. This opens interesting directions for creating more intuitive and expressive DMIs, particularly in public installations.</p>"},
{"string_id": "10.3389/fdigh.2019.00010", "abstract": "<p>The Trypillia megasites of Ukraine are the largest known settlements in 4th millennium BC Europe and possibly the world. With the largest reaching 320 ha in size, megasites pose a serious question about the origins of such massive agglomerations. Most current solutions assume maximum occupation, with all houses occupied at the same time, and target defence against other agglomerations as the cause of their formation. However, recent alternative views of megasites posit smaller long-term occupations or seasonal assembly places, creating a settlement rather than military perspective on origins. <a style=\"color:grey;\" href=\"#B94\">Shukurov et al. (2015)</a>'s model of Trypillia arable land-use demonstrates that subsistence stresses begin when site size exceeded 35 ha. Over half of the sites dated to the Trypillia BI stage—the stage before the first megasites—were larger than 35 ha, suggesting that some form of buffering involving exchange of goods for food was in operation. There were two settlement responses to buffering:- clustering of sites with enhanced inter-site exchange networks and the creation of megasites. The trend to increased site clustering can be seen from Phase BI to CI, coeval with the emergence of megasites. We can therefore re-focus the issue of origins on why create megasites in site clusters. In this article, we discuss the two strategies in terms of informal network analysis and suggest reasons why, in some cases, megasites developed in certain site clusters. Finally, we consider the question of whether Trypillia megasites can be considered as “cities.”</p>"},
{"string_id": "10.3389/fdigh.2020.00001", "abstract": "<p>This paper examines the patterns of Etruscan urbanism by the innovative use of newly available rural data, employing rank size, and indices of centralization. The detailed case study looks at the development of urbanism of pre-Roman Etruria where both robust and delicate urbanism were present alongside one another. To achieve this end, the paper will draw on the complementary features of two recent articles—<a style=\"color:grey;\" href=\"#B117\">Redhouse and Stoddart (2011)</a> and <a style=\"color:grey;\" href=\"#B95\">Palmisano et al. (2018)</a>—to provide a synthesis that both examines the large places and the supporting rural settlement. The territorial boundaries of the major urban places were predicted by the XTENT model in the first article. The cumulative numbers of rural settlement (and other proxies of population) over time were examined in the second article. This paper will look at the regional variation in landscape organization within the predicted territorial boundaries of the major robust centres and the more delicate transitory centres, as well as the buffer zones in between. At least three phases of boundary development can be examined, equivalent broadly to the Iron Age, Orientalizing/Archaic and Post Archaic periods, seeking to match these with the correspondingly dated rural settlement. The results will be critically examined in terms of broader knowledge of the economic and political development from current fieldwork in Etruria. The ethnographic analysis of <a style=\"color:grey;\" href=\"#B78\">Kopytoff (1989)</a> will also be applied to assess the application of the internal African frontier to the central Italian context. In this way, the quantitative will be matched with the qualitative to provide a deeper understanding of urban development in an under-assessed example within the Mediterranean world.</p>"},
{"string_id": "10.3389/fdigh.2018.00023", "abstract": "<p>The Design-to-Robotic-Assembly project presented in this paper showcases an integrative approach for stacking architectural elements with varied sizes in multiple directions. Several processes of parametrization, structural analysis, and robotic assembly are algorithmically integrated into a Design-to-Robotic-Production method. This method is informed by the systematic control of density, dimensionality, and directionality of the elements while taking environmental, functional, and structural requirements into consideration. It is tested by building a one-to-one prototype, which is presented and discussed in the paper with respect to the development and implementation of the computational design workflow coupled with robotic kinematic simulation that is enabling the materialization of a multidirectional and multidimensional assembly system.</p>"},
{"string_id": "10.3389/fdigh.2018.00029", "abstract": "<p>In this paper, we present an analysis of feedback as it occurs in classroom-based and technology supported music instrument learning. Feedback is key to learning in music education and we have developed technology based on ideas from social media and audio annotation which aims to make feedback more effective. The analysis here aims to enhance our understanding of technology-mediated feedback. The result of this analysis is three ontologies describing feedback and feedback systems. First, we developed the <i>teacher's ontology</i> using a qualitative, observational approach to describe the types of feedback that music instrument tutors give to their students. We used this ontology to inform the design of an online music annotation platform for music students. Second, we develop the <i>grounded ontology</i> using a grounded theory approach, based on 2,000 annotations made by students and tutors using the annotation platform. We compare the grounded and teacher's ontologies by examining structural, semantic and expressive features. Through this comparison, we find that the grounded ontology includes elements of the teacher's ontology as well as elements relating to practical and social aspects of the annotation platform, while the teacher's ontology contains more domain knowledge. Third, we formalize the transactional capabilities of the platform into the third ontology, the <i>platform ontology</i>, which we have written in the OWL language, and show how this allows us to develop several practical use cases, including the use of semantic web capabilities in music education contexts.</p>"},
{"string_id": "10.3389/fdigh.2019.00004", "abstract": "<p>The promise of digitization of historical archives lies in their indexation at the level of contents. Unfortunately, this kind of indexation does not scale, if done manually. In this article we present a method to bootstrap the deployment of a content-based information system for digitized historical archives, relying on historical indexing tools. Commonly prepared to search within homogeneous records when the archive was still current, such indexes were as widespread as they were disconnected, that is to say situated in the very records they were meant to index. We first present a conceptual model to describe and manipulate historical indexing tools. We then introduce a methodological framework for their use in order to guide digitization campaigns and index digitized historical records. Finally, we exemplify the approach with a case study on the indexation system of the <i>X Savi alle Decime in Rialto</i>, a Venetian magistracy in charge for the exaction—and related record keeping—of a tax on real estate in early modern Venice.</p>"},
{"string_id": "10.3389/fdigh.2019.00011", "abstract": "<p>Empirical studies of ancient cities must break down communities into their component parts, but frequently encounter difficulty with the scarcity of excavated domestic structures (e.g., <a style=\"color:grey;\" href=\"#B32\">Kramer, 1982</a>, p. 673). I introduce to the archaeological literature the entropy estimating statistical bootstrap (EESB), a tool developed in information theory and computational social science by <a style=\"color:grey;\" href=\"#B20\">DeDeo et al. (2013)</a> which provides a way to assess how representative a small dataset is of a parent population, categorized according to some useful typology. This method can be used to decide when small datasets can add further detail to our quantitative studies of archaeological settlements or when they need to be rejected as too small. I then illustrate its uses within the context of urban demography by examining the distribution of house forms to calculate household characteristics specific to Metapontum, an ancient Greek city. Future applications will include building larger urban datasets that are empirically grounded in the specific evidence for each community, facilitating the work of research programs such as urban scaling.</p>"},
{"string_id": "10.3389/fdigh.2019.00018", "abstract": "<p>This article investigates the urban expansion and economic development of ancient Rome through the application of models and theories originally designed for the study of contemporary cities. While the growth of ancient settlements is often difficult to track and analyze, archaeologically observable changes in land use can be read and interpreted as a function of broader economic oscillations over the <i>longue durée</i>. By re-examining the available archaeological and textual evidence pertaining to land use change on Rome's eastern periphery this article demonstrates how the frameworks selected can be successfully appropriated via a narration of Rome's urban transformations from the mid-Republic to the later Imperial period. The ultimate goal is to determine if the patterns of urban expansion identified in modern cities also existed in ancient Rome. The findings provided have the potential to produce rich insights on the dynamics of urban and economic growth across time and geographies, thereby opening the door for new and further studies.</p>"},
{"string_id": "10.3389/fdigh.2019.00015", "abstract": "<p>The rise of the state in Ancient Italy went hand in hand with an increase in infrastructural power, i.e., settlement centralization and urbanization. The paper discusses theoretical challenges and introduces a modeling approach to a case study, one of the earliest cities in Southern Italy, Pontecagnano, with the aim of understanding the community dynamics at the time of the earliest urbanization (ca. 900–600 BC). The model is a two-mode model that derives from social network analysis, an approach that has been fruitfully adapted to archaeological research. The model is applied to detect trends in burial contexts from the community involved. Burial was, at that time, in the region, a key instrument in the creation of memory and display of status and thus for building and consolidating state power. The analytical network model is able to detect the dynamics in the community over time very well: network Cohesion is expanding and contracting, and points to the existence of tension and a tight control of funerary behavior. The study of Centrality of selected nodes provides a good understanding of the strategies in terms of the circulation of key resources. The latter is particularly significant for studying urbanization because the appropriation of resources was not possible without centralization and the development of infrastructure, as well as an ideology. Based on the study of selected resources, it is suggested that an increase in crop storage has played a particular role in the development of state power and the urbanization process at Pontecagnano. In due course, the paper also addresses methodological challenges of working with fragmented datasets when applying models to study the past.</p>"},
{"string_id": "10.3389/fdigh.2020.00002", "abstract": "<p>In the past numerous concepts of urbanity have been discussed and a variety of criteria for towns have been developed. They include size, population, legal aspects, way of life, structural and functional approaches. However, since the mentioned criteria cover only a part of the phenomenon and partly use fixed and arbitrary thresholds, they are not sufficient for analysis. We turn to an understanding of urbanity as a process that creates and shapes the scenery of the buildings and people and that is mainly driven by complexity. In this sense, we understand urbanity as a process of adaptation to changing conditions or contexts in a complex settlement system, which is triggered by size, attracted by exemplary solutions and characterized by the emergence of new structures. In this paper we address the issue of relative centrality as proposed by Christaller in the urbanity process as well as centrality within a network sciences approach. Our aim is to interweave different concepts of urbanity, centrality, interaction and connectivity, combining different concepts and research traditions as well as expanding them, resulting in a collection of different terminological frameworks. In the context of adaptation, urbanity is relative in the sense that different places may have gained better or worse adaptation under different conditions. The urbanity process is always shaped by the threat of too much complexity and too little connectivity. Above all, it is a certain surplus of connectivity that characterizes urbanity. This surplus is mapped by the variant of centrality proposed by Christaller. While Christaller's models can be transferred into network sciences frameworks, Christaller does not offer an adequate centrality measure. Therefore, his concept of centrality cannot be transferred correctly without being translated carefully into the network research context. In this article, we argue why this is necessary and explain how it can be done. In this paper the above concept will be applied to the Early Iron Age Princely Seats with a special focus on the Heuneburg. In order to represent similarities and interaction between different nodes a very limited part of the material culture can be used. For this purpose we use fibulae which allow for fairly accurate dating and hence ensure a narrow time slice for the network analysis. Using Fibulae the research will be limited to a certain social segment, which we refer to as “middle class.” This paper is intended to deal with the rather complex issue of urbanity using more simple approaches such as network analysis. In this context, we pursue a tight integration of theory and methodology and we consider certain conceptual issues. This paper has two main results. Firstly, we develop a consistent approach in order to apply social network centrality measures on geographical networks. Secondly, we will analyse which role the above mentioned middle class played in the course of urbanity processes.</p>"},
{"string_id": "10.3389/fdigh.2019.00017", "abstract": "<p>Comparative studies of cities throughout history are one of the greatest sources of insight into the nature of change in human societies. This paper discusses strategies to anchor these comparisons on well-defined, quantitative and empirical characteristics of cities, derived from theory and observable in the archeological and historical records. We show how quantitative comparisons based on a few simple variables across settlements allow us to analyze how different places and peoples dealt with general problems of any society. These include demographic change, the organization of built spaces, the intensity and size of socioeconomic networks and the processes underlying technological change and economic growth. Because the historical record contains a much more varied and more independent set of experiences than contemporary urbanization, it has a unique power for illuminating present puzzles of human development and testing emergent urban theory.</p>"},
{"string_id": "10.3389/fdigh.2019.00014", "abstract": "<p>The conventional history of urban growth defines agrarian-based cities prior to the nineteenth century CE as densely inhabited and commonly bounded by defenses such as walls. By contrast industrial-based cities are viewed as more spread out and without marked boundaries. Since the 1960s a trajectory toward extensive, low-density urbanism with sprawling, scattered suburbs surrounding a denser core has been formally recognized and given various names such as megalopolis in the West and desakota in southern and eastern Asia. These sprawling industrial cities have been regarded as a unique derivative of modern phenomena such as mechanized transport and the commercial property market. However, this set of premises are not valid. The agrarian-based world also contained dispersed, low-density urbanism—on its grandest scale, the vast circa 1,000 sq km urban complex of Greater Angkor and the famous Maya cities of lowland Central America with maximum areas of about 200 sq km. The Maya only used pedestrian and riverine transport so the conventional transport explanation for industrial dispersed urbanism is at best partial. There was another trajectory to extensive, low-density settlement forms for places which were generally &lt;15–20 sq km in extent but could on rare occasions reach areas as large as 40 to 90 sq km. Famous examples are Great Zimbabwe, Chaco Canyon and the European oppida of the late 1st millennium BCE. No-formally agreed term is available to refer to them. I will refer to them by default as “Giants.” The three trajectories to low-density settlement form redefine the history of settlement growth and the meanings of the term “urban.” Worryingly, none of the successive low-density settlements derive from any of the low-density cases of the preceding trajectory. Neither Angkor nor the Classic Maya cities have any connection to the industrial low-density cities. By contrast compact cities, the epitome of the obsolete definition of cities display continuity to succeeding urban forms over several 1,000 years. The implications for modern, giant, low-density cities are ominous.</p>"},
{"string_id": "10.3389/fdigh.2019.00008", "abstract": "<p>Vast in scale and densely inhabited, Late Neolithic Near Eastern megasites have been variously considered in relation to urbanity. Often viewed as failed experiments on the path to proper urbanism or proto-urban sites, these settlements reveal few signs of hierarchical social stratification despite their large size; as such, they represent a challenge for the understanding of early processes of community formation and social integration. Drawing upon a wide range of data and using socio-material network analysis as a methodological tool, this paper explores the way the late Neolithic site of Çatalhöyük was organized internally and specifically the way individual houses were embedded in the wider social fabric of the site. This study sheds light on the nature of the networks of social engagement and affiliation that emerge in the Holocene within large early agricultural communities and the way such networks were manifested.</p>"},
{"string_id": "10.3389/fdigh.2018.00014", "abstract": "<p>Trust is a crucial guide in interpersonal interactions, helping people to navigate through social decision-making problems and cooperate with others. In human–computer interaction (HCI), trustworthy computer agents foster appropriate trust by supporting a match between their perceived and actual characteristics. As computers are increasingly endowed with capabilities for cooperation and intelligent problem-solving, it is critical to ask under which conditions people discern and distinguish trustworthy from untrustworthy technology. We present an interactive cooperation game framework allowing us to capture human social attributions that indicate trust in continued and interdependent human–agent cooperation. Within this framework, we experimentally examine the impact of two key dimensions of social cognition, warmth and competence, as antecedents of behavioral trust and self-reported trustworthiness attributions of intelligent computers. Our findings suggest that, first, people infer warmth attributions from unselfish vs. selfish behavior and competence attributions from competent vs. incompetent problem-solving. Second, warmth statistically mediates the relation between unselfishness and behavioral trust as well as between unselfishness and perceived trustworthiness. We discuss the possible role of human social cognition for human–computer trust.</p>"},
{"string_id": "10.3389/fdigh.2018.00015", "abstract": "<p>This paper analyzes the application of LDA topic modeling to a corpus of poetry. First, it explains how the most coherent LDA-topics have been established by running several tests and automatically evaluating the coherence of the resulting LDA-topics. Results show, on one hand, that when dealing with a corpus of poetry, lemmatization is not advisable because several poetic features are lost in the process; and, on the other hand, that a standard LDA algorithm is better than a specific version of LDA for short texts (LF-LDA). The resulting LDA-topics have then been manually analyzed in order to define the relation between word topics and poems. The analysis shows that there are mainly two kinds of semantic relations: an LDA-topic could represent the subject or theme of the poem, but it could also represent a poetic motif. All these analyses have been undertaken on a large corpus of Golden Age Spanish sonnets. Finally, the paper shows the most relevant themes and motifs in this corpus such as “love,” “religion,” “heroics,” “moral,” or “mockery” on one hand, and “rhyme,” “marine,” “music,” or “painting” on the other hand.</p>"},
{"string_id": "10.3389/fdigh.2018.00010", "abstract": "<p>Rhetorical figures are valuable linguistic data for literary analysis. In this article, we target the detection of three rhetorical figures that belong to the family of repetitive figures: chiasmus (I <strong>go</strong> where I <strong>please</strong>, and I <strong>please</strong> where I <strong>go</strong>.), epanaphora also called anaphora (“<strong>Poor old</strong> European Commission! <strong>Poor old</strong> European Council.”) and epiphora (“This house is <strong>mine</strong>. This car is <strong>mine</strong>. You are <strong>mine</strong>.”). Detecting repetition of words is easy for a computer but detecting only the ones provoking a rhetorical effect is difficult because of many accidental and irrelevant repetitions. For all figures, we train a log-linear classifier on a corpus of political debates. The corpus is only very partially annotated, but we nevertheless obtain good results, with more than 50% precision for all figures. We then apply our models to totally different genres and perform a comparative analysis, by comparing corpora of fiction, science and quotes. Thanks to the automatic detection of rhetorical figures, we discover that chiasmus is more likely to appear in the scientific context whereas epanaphora and epiphora are more common in fiction.</p>"},
{"string_id": "10.3389/fdigh.2018.00011", "abstract": "<p class=\"mb15\"><strong>Background:</strong> Increasing numbers of variables in surveys and administrative databases are created. Principal component analysis (PCA) is important to summarize data or reduce dimensionality. However, one disadvantage of using PCA is the interpretability of the principal components (PCs), especially in a high-dimensional database. By analyzing the variance distribution according to PCA loadings and approximating PCs with input variables, we aim to demonstrate the importance of variables based on the proportions of total variances contributed or explained by input variables.</p>"},
{"string_id": "10.3389/fdigh.2017.00022", "abstract": "<p>In this work, we describe a methodology to interpret large persons’ networks extracted from text by classifying cliques using the DBpedia ontology. The approach relies on a combination of NLP, Semantic web technologies, and network analysis. The classification methodology that first starts from single nodes and then generalizes to cliques is effective in terms of performance and is able to deal also with nodes that are not linked to Wikipedia. The gold standard manually developed for evaluation shows that groups of co-occurring entities share in most of the cases a category that can be automatically assigned. This holds for both languages considered in this study. The outcome of this work may be of interest to enhance the readability of large networks and to provide an additional semantic layer on top of cliques. This would greatly help humanities scholars when dealing with large amounts of textual data that need to be interpreted or categorized. Furthermore, it represents an unsupervised approach to automatically extend DBpedia starting from a corpus.</p>"},
{"string_id": "10.3389/fdigh.2018.00002", "abstract": "<p>The field of Spatial Humanities has advanced substantially in the past years. The identification and extraction of toponyms and spatial information mentioned in historical text collections has allowed its use in innovative ways, making possible the application of spatial analysis and the mapping of these places with geographic information systems. For instance, automated place name identification is possible with Named Entity Recognition (NER) systems. Statistical NER methods based on supervised learning, in particular, are highly successful with modern datasets. However, there are still major challenges to address when dealing with historical corpora. These challenges include language changes over time, spelling variations, transliterations, OCR errors, and sources written in multiple languages among others. In this article, considering a task of place name recognition over two collections of historical correspondence, we report an evaluation of five NER systems and an approach that combines these through a voting system. We found that although individual performance of each NER system was corpus dependent, the ensemble combination was able to achieve consistent measures of precision and recall, outperforming the individual NER systems. In addition, the results showed that these NER systems are not strongly dependent on preprocessing and translation to Modern English.</p>"},
{"string_id": "10.3389/fdigh.2018.00007", "abstract": "<p>Studies of olfactory perception and about the way humans interact with, and perceive food and beverages require appropriate olfactory devices. Moreover, small size, and portable interfaces are needed within the context of Human Computer Interaction (HCI), to enrich and complete the design of different mediated experiences. In this paper, the authors tested a new portable olfactory device for the orthonasal administration of smells. The main aim was to verify if the experience generated by the odors delivered through such device can affect people's taste perception. Once established that people could perceive odors using the olfactory device, a group of participants was asked to taste two different types of food (Experiment 1) and three types of beverages (Experiment 2) and to evaluate them on a number of perceptual-dimensions (such as pleasantness, freshness, sweetness, saltiness, and bitterness). The participants could taste the food and the beverage without the presence of additional olfactory stimuli, or under conditions where olfactory stimuli (the smell of chocolate or citrus) were also presented using the device. The results showed that the participants' evaluation of food and beverages was significantly modulated by the concurrently presented odors. The experimental results suggest that: (1) the device is effective in controlling the delivery of odors to human participants without the complexity of management that often affect larger odors delivery systems; (2) odors administered by means of such device can have an effects on food and beverage perception, without the need to change their chemical properties.</p>"},
{"string_id": "10.3389/fdigh.2018.00005", "abstract": "<p>This paper describes a corpus of about 3,000 English literary texts with about 250 million words extracted from the Gutenberg project that span a range of genres from both fiction and non-fiction written by more than 130 authors (e.g., Darwin, Dickens, Shakespeare). Quantitative narrative analysis (QNA) is used to explore a cleaned subcorpus, the <i>Gutenberg English Poetry Corpus</i> (GEPC), which comprises over 100 poetic texts with around two million words from about 50 authors (e.g., Keats, Joyce, Wordsworth). Some exemplary QNA studies show author similarities based on latent semantic analysis, significant topics for each author or various text-analytic metrics for George Eliot’s poem “How Lisa Loved the King” and James Joyce’s “Chamber Music,” concerning, e.g., lexical diversity or sentiment analysis. The GEPC is particularly suited for research in Digital Humanities, Computational Stylistics, or Neurocognitive Poetics, e.g., as training and test corpus for stimulus development and control in empirical studies.</p>"},
{"string_id": "10.3389/fdigh.2018.00009", "abstract": "<p>We conduct the first experiment in the literature in which a novel is translated automatically and then post-edited by professional literary translators. Our case study is <i>Warbreaker</i>, a popular fantasy novel originally written in English, which we translate into Catalan. We translated one chapter of the novel (over 3,700 words, 330 sentences) with two data-driven approaches to Machine Translation (MT): phrase-based statistical MT (PBMT) and neural MT (NMT). Both systems are tailored to novels; they are trained on over 100 million words of fiction. In the post-editing experiment, six professional translators with previous experience in literary translation translate subsets of this chapter under three alternating conditions: from scratch (the norm in the novel translation industry), post-editing PBMT, and post-editing NMT. We record all the keystrokes, the time taken to translate each sentence, as well as the number of pauses and their duration. Based on these measurements, and using mixed-effects models, we study post-editing effort across its three commonly studied dimensions: temporal, technical and cognitive. We observe that both MT approaches result in increases in translation productivity: PBMT by 18%, and NMT by 36%. Post-editing also leads to reductions in the number of keystrokes: by 9% with PBMT, and by 23% with NMT. Finally, regarding cognitive effort, post-editing results in fewer (29 and 42% less with PBMT and NMT, respectively) but longer pauses (14 and 25%).</p>"},
{"string_id": "10.3389/fdigh.2016.00006", "abstract": "<p>With the increased application of network analysis in archeology to form hypotheses, particularly concerning the research on mobility, a need has arisen to validate the network analysis results. This paper presents a case study of a local transport network in the Dutch part of the Roman <i>limes</i> between 70 and 270 AD created using a least-cost approach, and tests the robustness of the local network metric of betweenness centrality and the archeological interpretation thereof. It is demonstrated that while the majority of sites have a robust and thus reliable betweenness centrality, there are still a large number of sites for which the network measurements are very dependent on the precise structure of the network present. Testing robustness of network analysis results thus proves a useful tool for both validating the network modeling results and the archeological interpretations of that network.</p>"},
{"string_id": "10.3389/fdigh.2015.00008", "abstract": "<p>This article describes the use of latent Dirichlet allocation (LDA), or topic modeling, to explore the discursive makeup of the eighteenth century <i>Encyclopédie</i> of Denis Diderot and Jean le Rond d’Alembert (1751–1772). Expanding upon previous work modeling the <i>Encyclopédie</i>’s ontology, or classification scheme, we examine the abstractions used by its editors to visualize the various “systems” of knowledge that the work proposes, considered here as heuristic tools for navigating the complex information space of the <i>Encyclopédie</i>. Using these earlier experiments with supervised machine-learning models as a point of reference, we introduce the notion of topic modeling as a “discourse analysis tool” for Enlightenment studies. In so doing, we draw upon the tradition of post-structuralist French discourse analysis, one of the first fields to embrace computational approaches to discursive text analysis. Our particular use of LDA is thus aimed primarily at uncovering interdisciplinary “discourses” in the <i>Encyclopédie</i> that run alongside, under, above, and through the original classifications. By mapping these discourses and discursive practices, we can begin to move beyond the organizational (and physical) limitations of the print edition, suggesting several possible avenues of future research. These experiments thus attest once again to the enduring relevance of the <i>Encyclopédie</i> as an exemplary Enlightenment text. Its rich dialogical structure, whether studied using traditional methods of close reading or through the algorithmic processes described in this article, is perhaps only now coming fully to light thanks to recent developments in digital resources and methods.</p>"},
{"string_id": "10.3389/fdigh.2016.00003", "abstract": "<p>Historical handwritten Hebrew manuscripts are one of the most unique and authentic witnesses of Jewish culture and thought that survived through the centuries. In order to enable a systematic research of the knowledge embedded in the manuscripts, there is a need for a formal conceptual data model with a high level of semantic granularity, an ontology. We propose to build a dynamic web-based framework that will allow scholars to create, enrich, and consult an “ontopedia” (ontology-based encyclopedia) of Hebrew manuscripts. The framework is based on an ontology especially designed and implemented for this domain and goals. We view a manuscript as a “living entity” and propose to design a new ontological data model of the narrative for a manuscript, stages/milestones in its biography (creation, copying, and acquisition). A sequence of events and places constitutes a timeline of history against which manuscripts, people, and their relationships can be placed. A large-scale automated reasoning based on the ontology will also enable us to construct a semantically rich social network of people and manuscripts, and to compare the effect of time and place on the manuscripts’ qualitative characteristics and quantitative distribution.</p>"},
{"string_id": "10.3389/fdigh.2015.00003", "abstract": "<p>Large areas within the old urban core of American cities were destroyed in the post-war era as city leaders sought to counteract metropolitan decentralization by implementing urban renewal programs. For the most part, these places were deemed not worthy of documentation; indeed, areas declared as “blighted” were widely viewed as ugly, cancerous threats to the future health of the city and were enthusiastically demolished. For this reason, they have rarely been the object of study. This paper attempts to address the neglect of such lost landscapes by using GIS to provide a means to envision the urban past. Focusing on the case of the old Auraria district in downtown Denver, the paper pursues three aims. The first aim is to develop and test a new method for reconstructing urban landscapes at the district scale using GIS methods and data derived from historic Sanborn fire insurance maps. The second aim is to conduct preliminary analysis of this historic district-scale GIS, focusing on land use, spatial connectivity, and building massing, in order to evaluate its utility in generating new insight into the form, character, and functioning of the historic city core. The third aim is to assess the degree to which historic urban reconstructions of this kind can become valuable tools in contemporary urban planning efforts.</p>"},
{"string_id": "10.3389/fdigh.2016.00007", "abstract": "<p>We present a tool for re-ranking the results of a specific query by considering the matrix of pairwise similarities among the elements of the set of retrieved results and the query itself. The re-ranking, thus, makes use of the similarities between the various results and does not employ additional sources of information. The tool is based on graphical Bayesian models, which reinforce retrieved items strongly linked to other retrievals, and on repeated clustering to measure the stability of the obtained associations. To this, we add an active relevance-based re-ranking process in order to leverage true matches, which have very low similarity to the query. The utility of the tool is demonstrated within the context of a visual search of documents from the Cairo Genizah. It is also demonstrated in a completely different domain or retrieving, given an input image of a painting, other related paintings.</p>"},
{"string_id": "10.3389/fdigh.2016.00009", "abstract": "<p>Digital tools, and in particular GIS, have enormously increased the possibilities for analysis in historical geography. In this article, we shall explain how these tools can be used to study the evolution of population density over a significant period. The territorial units used will be municipalities, as they allow detailed territorial analysis. However, research projects that take municipalities as their points of reference tend to be complex because their territorial boundaries have often undergone numerous changes over the course of modern history. The same has occurred, to a greater or lesser degree, in all of the countries in Europe (<a href=\"#B5\">Bennett, 1989</a>). The countries that have had the most stable municipal boundaries over the past 150 years include France, Italy, and Spain, though the modifications to their boundaries have also been notable. However, like all relevant challenges, these changes also offer us new opportunities, if we are able to cope with them. In this particular case, the challenge will be to achieve the territorial homogenization of the historical municipal series. In other words, when the municipal limits have changed, it will be necessary to adapt the data from the old municipal territories to the new ones. This exercise will have a number of applications. In this article, we present just one of these: the possibility of detecting areas and periods in which, over the course of history, there has been population growth, decline, or stagnation. This will serve as a relevant indicator, or proxy, for organizing research in other fields. For example, in the case of economic history, it is clear that variations in the density of population provide clues for interpreting the territorial distribution of economic activity. We also understand that it will be possible to apply our research about Spain to other countries and that this will make it possible to evaluate the interest and results that we can expect from the homogenized work. We think that, despite its interest, this type of study has, until now, been very rare on account of the methodological difficulties involved. However, these new digital tools in the field of historical GIS, as spatial aggregation and Moran I techniques, have helped to provide solutions to assume this challenge.</p>"},
{"string_id": "10.3389/fdigh.2017.00003", "abstract": "<p>The rapid progress of deep neural network architectures is allowing both to automate the production of artworks and to extend the domain of creative expression. As such, it is opening new ground for professional and amateur artists alike. A major asset of these new computer processes is their capacity to derive, from a training phase, a generative model from which new artifacts can be produced. This attribute allows for a wide range of novel applications. New music or paintings in the style of famous artists can be produced at the click of a button, or combined to form new artworks. New graphical compositions can be “hallucinated” by the deep algorithmic models to produce striking, unexpected, visual forms. By the same token, the dependence on preexisting, protected, artworks lays the ground for potential zones of friction with the rights holders of the source data that helped shape the generative model. This articulation, between the popular creative movement initiated by the deep neural architectures and the preexisting rights of the authors, leads to a confrontation between the present legal framework for the protection of artistic creations and the new modalities offered by these new technological objects. The present work will address the conditions of protection of creations generated by deep neural networks under the main copyright regimes.</p>"},
{"string_id": "10.3389/fdigh.2017.00001", "abstract": "<p>This article presents one of the first steps of a project that aims at exploring the diffusion patterns of Mediterranean imported goods in Late Iron Age Europe (250–25 BC) and the organization of the commercial interactions of these goods. It brings together two archeologists and a mathematician in the study of a large inventory of 57,735 Italian and Greek imports discovered from England to Serbia. This large amount of new and unpublished data is analyzed through the joint use of network analysis tools and formal statistical methods. The analysis focuses on detecting patterns in the association of imported artifacts that are often found on the same sites. The objectives are to highlight groups of imports that may have circulated together and to emphasize regional selections by local populations. At this stage of the study, two main systems of imports have been highlighted used, respectively, in West and Central Europe. Interesting leads that will need further investigation include the imports status and the role they played in Celtic societies, as acculturated objects or more as objects for acculturation.</p>"},
{"string_id": "10.3389/fdigh.2017.00004", "abstract": "<p>The period between the beginning of the Early Iron Age and the end of the Archaic Period is a time of changes and developments in the Italian Peninsula, which led to the creation of regional ethnic and political groups and to the formation of the first city-states in Western Europe. In the present study, we focus on the evolution of terrestrial route network in the Tyrrhenian region of Latium vetus as it has been hypothesized by scholars from the archeological evidence. Our main goal is to investigate the mechanisms linking decision making processes and the structure of transportation networks. We first attempted to replicate some of its features applying three models previously elaborated for the neighboring region of Southern Etruria. Since it was not possible to attain entirely satisfactory results, we modified the model that performed better in the Etruscan region by including a tunable amount of rich-get-richer bias, which improved considerably its performance. Our results suggest that coordinated decision making with a slightly unbalanced power was responsible for the peculiar characteristics of the route network topology of Latium vetus. Moreover, the mechanism implemented by this model implies that places located at favorable positions can build on their initial advantage and get more and more powerful. This fits very well with the picture elaborated by different scholars on the nature of power balance and dynamics in this region.</p>"},
{"string_id": "10.3389/fdigh.2017.00007", "abstract": "<p>Recent approaches have described the evolutionary dynamics of the first Neolithic societies as a cycle of rise and fall. Several authors, using mainly c14 dates as a demographic proxy, identified a general pattern of a boom in population coincident with the arrival of food production economies followed by a rapid decline some centuries afterward in multiple European regions. Concerning Iberia, we also noted that this phenomenon correlates with an initial development of archeological entities (i.e., “cultures”) over large areas (e.g., the Impresso-Cardial in West Mediterranean), followed by a phase of “cultural fragmentation” by the end of Early Neolithic. This results in a picture of higher cultural diversity as an effect of more limited spread of cultural artifacts. In this work, we propose to apply a network approach to the analysis of material culture. In particular, we consider the spatiotemporal patterns of material culture as an emergent effect of local interaction processes. As recent research has pointed out, the spatiotemporal variability of material culture is an emergent phenomenon resulting from individual and group interactions whose structure resembles those of spatially structured complex networks. Our results suggest that the observed global patterns could be explained by the network dynamics, especially by structural (measured as the betweenness centrality) and geographical position of some nodes. The appearance and disappearance of nodes in specific positions correlate with the observed changes in the pattern of material culture distribution throughout the Early Neolithic (c. 7700–6700 cal BP) in East Iberia. In our view, this could be explained by the special role played by those nodes facilitating or limiting the information flow over the entire network. Network growth and posterior fragmentation seem to be the key drivers behind these dynamics.</p>"},
{"string_id": "10.3389/fdigh.2016.00008", "abstract": "<p class=\"mb15\">Women owned a quarter of all rental units in Montréal, QC, Canada, in 1903, a city where 85% of the population were tenants. In no major city in the world today, do women control an equivalent area of the formal economy. This paper asks did the gender of proprietorship matter? It answers this through a series of tests linking a 30% sample of all immigrant-headed households in the 1901 census with a complete historical GIS of all properties and their owners in the city for 1903. The paper plays special attention to Ashkenazi Jews, Syrians, Chinese, and Italians, as these relatively recent immigrants constituted a major break with the largely British and French ancestry of the majority of the population in this 300-year-old settler colony. It then links the patterns in the sample to an index of all households in the census, to explore how these immigrant families integrated into the larger host communities. The paper shows that landladies and landlords had differing practices with regard to overcrowding and to the enforcement of segregation. The paper makes a sustained argument for rethinking how we should approach the relationship between gender and property.</p>"},
{"string_id": "10.3389/fdigh.2017.00008", "abstract": "<p>When data are poor, we resort to theory modeling. This is a two-step process. We have first to identify the appropriate type of model for the system under consideration and then to tailor it to the specifics of the case. To understand settlement formation, which is the concern of this article, this involves choosing not only input parameter values such as site separations but also input functions that characterizes the ease of travel between sites. Although the generic behavior of the model is understood, the details are not. Different choices will necessarily lead to different outputs (for identical inputs). We can only proceed if choices that are “close” give outcomes that are similar. Where there are local differences, it suggests that there was no compelling reason for one outcome rather than the other. If these differences are important for the historic record, we may interpret this as sensitivity to contingency. We re-examine the rise of Greek city-states as first formulated by Rihll and Wilson in 1979, initially using the same “retail” gravity model. We suggest that, although cities like Athens owe their position to a combination of geography and proximity to other sites, the rise of Thebes is the most contingent, whose success reflects social forces outside the grasp of simple network modeling.</p>"},
{"string_id": "10.3389/fdigh.2017.00009", "abstract": "<p>The measurement and tracking of body movement within musical performances can provide valuable sources of data for studying interpersonal interaction and coordination between musicians. The continued development of tools to extract such data from video recordings will offer new opportunities to research musical movement across a diverse range of settings, including field research and other ecological contexts in which the implementation of complex motion capture (MoCap) systems is not feasible or affordable. Such work might also make use of the multitude of video recordings of musical performances that are already available to researchers. This study made use of such existing data, specifically, three video datasets of ensemble performances from different genres, settings, and instrumentation (a pop piano duo, three jazz duos, and a string quartet). Three different computer vision techniques were applied to these video datasets—frame differencing, optical flow, and kernelized correlation filters (KCF)—with the aim of quantifying and tracking movements of the individual performers. All three computer vision techniques exhibited high correlations with MoCap data collected from the same musical performances, with median correlation (Pearson’s <i>r</i>) values of 0.75–0.94. The techniques that track movement in two dimensions (optical flow and KCF) provided more accurate measures of movement than a technique that provides a single estimate of overall movement change by frame for each performer (frame differencing). Measurements of performer’s movements were also more accurate when the computer vision techniques were applied to more narrowly defined regions of interest (head) than when the same techniques were applied to larger regions (entire upper body, above the chest, or waist). Some differences in movement tracking accuracy emerged between the three video datasets, which may have been due to instrument-specific motions that resulted in occlusions of the body part of interest (e.g., a violinist’s right hand occluding the head while tracking head movement). These results indicate that computer vision techniques can be effective in quantifying body movement from videos of musical performances, while also highlighting constraints that must be dealt with when applying such techniques in ensemble coordination research.</p>"},
{"string_id": "10.3389/fdigh.2017.00020", "abstract": "<p>This article provides insights into aspects of tempo and rhythmic elaboration in Hindustani music, based on a study of a large corpus of recorded performances. Typical tempo developments and stress patterns within a metrical cycle are computed, which we refer to as tempo and rhythm patterns, respectively. Rhythm patterns are obtained by aggregating spectral features over metrical cycles. They reflect percussion patterns that are frequent in the corpus and enable a discussion of the relation between such patterns and the underlying metrical framework, the tāl. Tempo patterns, on the other hand, are computed using reference beat annotations. They document the dynamic development of tempo throughout a metrical cycle and reveal insights into the flexibility of time in Hindustani music for the first time using quantitative methods on a large set of performances. Focusing on aspects of tempo and rhythm, we demonstrate the value of a computational methodology for the analysis of large music corpora by revealing the range of tempi used in performances, intra-cycle tempo dynamics and percussion accents at different positions of the tāl cycle.</p>"},
{"string_id": "10.3389/fdigh.2017.00017", "abstract": "<p>A review of the archeological and non-archeological use of visibility networks reveals the use of a limited range of formal techniques, in particular for representing visibility theories. This paper aims to contribute to the study of complex visual relational phenomena in landscape archeology by proposing a range of visibility network patterns and methods. We propose first- and second-order visibility graph representations of total and cumulative viewsheds, and two-mode representations of cumulative viewsheds. We present network patterns that can be used to represent aspects of visibility theories and that can be used in statistical simulation models to compare theorized networks with observed networks. We argue for the need to incorporate observed visibility network density in these simulation models, by illustrating strong differences in visibility network density in three example landscapes. The approach is illustrated through a brief case study of visibility networks of long barrows in Cranborne Chase.</p>"},
{"string_id": "10.3389/fdigh.2017.00005", "abstract": "<p>In the area of Linked Open Data (LOD), meaningful and high-performance interlinking of different datasets has become an ongoing challenge. Necessary tasks are supported by established standards and software, e.g., for the transformation, storage, interlinking, and publication of data. Our use case Swissbib &lt;<a href=\"https://www.swissbib.ch/\">https://www.swissbib.ch/</a>&gt; is a well-known provider for bibliographic data in Switzerland representing various libraries and library networks. In this article, a case study is presented from the project <a href=\"http://linked.swissbib.ch\">linked.swissbib.ch</a> which focuses on the preparation and publication of the Swissbib data by means of LOD. Data available in Marc21 XML are extracted from the Swissbib system and transformed into an RDF/XML representation. From approximately 21 million monolithic records, the author information is extracted and interlinked with authority files from the Virtual International Authority File (VIAF) and DBpedia. The links are used to extract additional data from the counterpart corpora. Afterward, data are pushed into an Elasticsearch index to make the data accessible for other components. As a demonstrator, a search portal is developed which presents the additional data and the generated links to users. In addition to that, a REST interface is developed in order to enable also access by other applications. A main obstacle in this project is the amount of data and the necessity of day-to-day (partial) updates. In the current situation, the data in Swissbib and in the external corpora are too large to be processed by established linking tools. The arising memory footprint prevents the correct functioning of these tools. Also triple stores are unhandy by revealing a massive overhead for import and update operations. Hence, we have developed procedures for extracting and shaping the data into a more suitable form, e.g., data are reduced to the necessary properties and blocked. For this purpose, we used sorted N-Triples as an intermediate data format. This method proved to be very promising as our preliminary results show. Our approach could establish 30,773 links to DBpedia and 20,714 links to VIAF and both link sets show high precision values and could be generated in reasonable expenditures of time.</p>"},
{"string_id": "10.3389/fdigh.2017.00021", "abstract": "<p>Halal is a notion that applies to both objects and actions, and means <i>permissible</i> according to Islamic law. It may be most often associated with food and the rules of selecting, slaughtering, and cooking animals. In the globalized world, halal can be found in street corners of New York and beauty shops of Manila. In this study, we explore the cultural diversity of the concept, as revealed through social media, and specifically the way it is expressed by different populations around the world, and how it relates to their perception of (i) religious and (ii) governmental authority, and (iii) personal health. Here, we analyze two Instagram datasets, using Halal in Arabic (325,665 posts) and in English (1,004,445 posts), which provide a global view of major Muslim populations around the world. We find a great variety in the use of halal within Arabic, English, and Indonesian-speaking populations, with animal trade emphasized in first (making up 61% of the language’s stream), food in second (80%), and cosmetics and supplements in third (70%). The commercialization of the term halal is a powerful signal of its detraction from its traditional roots. We find a complex social engagement around posts mentioning religious terms, such that when a food-related post is accompanied by a religious term, it on average gets more likes in English and Indonesian, but not in Arabic, indicating a potential shift out of its traditional moral framing.</p>"}
]