[
{"string_id": "10.22148/16.008", "abstract": "Genre is a word whose time has come — and gone — and might now, perhaps, be coming back again. Debates about particular literary kinds have been com-mon in literary criticism since Aristotle’s Poetics, but they acquired a new intensity and reflexivity in the third quarter of the twentieth century, as structuralists and poststructuralists struggled to redefine the concept of genre itself."},
{"string_id": "10.22148/16.022", "abstract": "Literary  readings  provoke  strong  feelings,  which  feed  intense  critical  de-bates. And while recorded literary readings have long been available for study, few scholars have applied to them the empirical methods that the digitalhumanities and interdisciplinary sound studies now offer."},
{"string_id": "10.22148/16.005", "abstract": "The concept of genre is as old as literary theory itself, but centuries of debate haven’t produced much consensus on the topic. Part of the reason is that genre looks like a different thing at different points in the life of a text."},
{"string_id": "10.22148/16.031", "abstract": "This article seeks to bridge two scholarly fields often seen as incommensurable:cultural analytics (also known as “computational criticism”) and critical racestudies. It does so by discovering generative points of contact between two sets of methods that are also typically viewed as antithetical: data science and critique.Cultural analytics is an emerging field wherein humanist scholars leverage the in-creasing availability of large digital corpora and the affordances of new computa-tional tools."},
{"string_id": "10.22148/16.032", "abstract": "Across a variety of cultural fields, researchers have identified a near ubiquitous\nunderrepresentation and decentralization of women.  This occurs both at the\nlevel of who is able to produce cultural works and who is depicted within them.\nWomen are less likely to be directors of Hollywood films and also less likely to\nhave starring roles."},
{"string_id": "10.22148/16.010", "abstract": "The relationship between character identity and character action is an established topic of literary study.  In Morphology of the Folktale, Vladimir Propp argues against the separation of “who acts” from “the question of the actions themselves,” instead advocating an approach that studies characters according to their functions."},
{"string_id": "10.22148/16.009", "abstract": "Is “literary fiction” a useful genre label in the post-World War II United States? In some sense, the answer is obviously yes; there are sections marked “literary fiction” on Amazon, in bookstores, and on Goodreads, all of which contain many postwar and contemporary titles. Much of what is taught in contemporary fiction classes also falls under the heading of literary fiction, even if that label isn’t alwaysused explicitly."},
{"string_id": "10.22148/16.014", "abstract": "According to Rita Felski, context is overrated. Even in the sophisticated variants of contextualization typical of the New Historicism, she explains, scholars’ obsession with historical context as the ultimate source of textual meaning disregards the capacity of literature to resonate across time and space."},
{"string_id": "10.22148/16.011", "abstract": "The distinction between fiction and non-fiction, between a text that is true and one that is not, is one of the oldest on record. Ever since we have been thinking about the act of narration, we have addressed the related meanings of truth and imagination."},
{"string_id": "10.22148/16.021", "abstract": "Readers are never merely passive recipients of textual messages. One of themost powerful insights of reader-response theory in the 1970s and 1980s is that the meaning of a text never resides entirely within the artifact itself. Commentators from Carlo Ginzberg (“aggressive originality”), to Jauss (“horizon of ex-pectations”), to Fish (“interpretive communities”), and Radway (“Reading is notEating”) have long-since established that readers are creators of meaning."},
{"string_id": "10.22148/16.024", "abstract": "Among the most pressing problems in modernist literary studies are those re-lated to Britain’s engagement with the wider world under empire and to its ownrapidly evolving urban spaces in the years before the Second World War. In both cases, the literary-geographic imagination—or unconscious—of the periodbetween 1880 and 1940 can help to shed light on how texts by British and British-aligned writers of the era understood these issues and how they evolved over time."},
{"string_id": "10.22148/16.036", "abstract": "A growing list of high-profile controversies involving the social impacts of ar-\ntificial intelligence systems (AI), digital data collection and algorithmic analy-\nsis have forced difficult conversations around the ethics of data-intensive digi-\ntal technologies and so-called “big data” research.These incidents are directly\nrelevant to newly coalescing cultures of “data science,” an emergent field which\nseeks both to interpret and capitalize on the creation, collection, and processing\nof knowledge through large collections of digital data, often in conjunction with\nparticular techniques like machine learning (ML)."},
{"string_id": "10.22148/16.019", "abstract": "This essay explores the changing significance of gender in fiction, asking especially whether its prominence in characterization has varied from the end of the eighteenth century to the beginning of the twenty-first. We have reached twoconclusions, which may seem in tension with each other. The first is that gen-der divisions between characters have become less sharply marked over the last 170 years."},
{"string_id": "10.22148/16.044", "abstract": "--"},
{"string_id": "10.22148/16.038", "abstract": "On February 17th, 2017, Mark Zuckerberg published a 5,800-word Facebook\npost rescripting the company’s Corporate Social Responsibility strategy and\ndefining its future directions. The manifesto, as some commentators referred\nto it, declared Facebook’s future vision for “developing the social infrastructure\nfor community” and emphasized the company’s focus on fostering a global\ncommunity that is supportive, safe, informed, civically-engaged, and inclusive."},
{"string_id": "10.22148/16.020", "abstract": "This special issue of Cultural Analyticstackles the urgent question of how so-cial identities can be addressed through computational methods. In particular, it probes the extent to which large datasets can be used to elucidate the kindsof questions that humanities scholars want to ask about historical and represen-tational processes that structure social relations and positions."},
{"string_id": "10.22148/16.037", "abstract": "Big Data represents a tremendous opportunity to drill down and tap\ninto these critical insights. In fact, the powerful potential to mine\nand refine this vital, valuable resource points to a direct comparison\nto a similarly vital resource in the modern economy: crude oil."},
{"string_id": "10.22148/16.041", "abstract": "In 2016, a software developer named David and I met to discuss creating a quan-\ntitative demographic survey of the open source software community to which we\nwere both long-time contributors. David and I did not know each other well,\nbut shared a belief that our open source community (OSC, hereafter) was an un-\nsafe place for anyone who did not identify as white, cisgendered, heterosexual\nand male.  That lack of safety was further complicated by any one individual’s\ndistance from privileged modes of contribution."},
{"string_id": "10.22148/16.045", "abstract": "Most of the current academic literature on open data looks outward at thedata’s reuse by the public. This article describes, rather, the cultural practice ofopen data inside city governments."},
{"string_id": "10.22148/001c.12049", "abstract": "This paper compares social media traces from Goodreads to data from the MLA International Bibliography and the Open Syllabus Project, in order to better understand the preferences of readers of Victorian literature from different but overlapping communities. We find that the majority of works of Victorian literature that are indicated as being read on Goodreads occur about as often as they are taught or written about in the academy, although books aimed at an adult audience are written about more frequently in peer-reviewed venues. Interestingly, those works that are statistical outliers in terms of their greater popularity with a general audience than an academic audience tend to feature women authors, children’s literature, and works with a strong female protagonist. Turning to an analysis of the written reviews on Goodreads of three outliers that were more popular with a general audience--A Tale of Two Cities, Jane Eyre, and The Secret Garden--we find that readers tend to comment on plot (especially in Dickens), feminist themes (in Jane Eyre), and the importance of characters (in all three works). In conclusion, we suggest ways in which postsecondary teachers might draw on these results to inform their syllabi and formulate strategies for teaching Victorian literature. We argue that in terms of outliers, popular taste in Victorian literature among Goodreads users reflects more general reading preferences among this user group, as readers turn to the Victorian era to read children’s literature and books featuring strong female characters."},
{"string_id": "10.22148/001c.12266", "abstract": "We extracted 327,322 faces from an archive of Time magazine containing 3,389 issues dating from 1923 to 2014, classified the gender of each extracted face, and discovered that the proportion of female faces contained within this archive varied in interesting ways over time. The proportion of female faces first peaked in the mid-to-late 1940s. This was followed by a dip lasting from the mid-1950s to the early 1960s. The 1970s saw another peak followed by a dip over the course of the 1980s. Finally, we see a slow and steady rise in the proportion of female faces from the early 1990s onwards. In this paper, we seek to make sense of these variations through an interdisciplinary framework drawing on psychology, visual studies (in particular, photography theory), and history. Through a close reading of our Time archive from the 1940s through the 1990s, we conclude that the visual representation of women in Time magazine correlates with attitudes toward women in both the historical context of the era and the textual content of the magazine."},
{"string_id": "10.22148/001c.14112", "abstract": "Hosted out of the University of Virginia, Digital Yoknapatawpha is an international collaboration between scholars of William Faulkner and technologists at the Institute for Advanced Technology in the Humanities. The project team has encoded all the locations, characters, and events in Faulkner’s Yoknapatawpha fictions into a relational database that powers an open-access web-portal. Users can avail of an atlas of “deep-maps,” data visualizations, archival material, and aural and visual resources to explore, teach, and research his works. Using techniques common in ecology and demography, this paper leverages the data to investigate the relationship between race, kinship, and space. It concludes, tentatively, that the social world of Yoknapatawpha is far more rigidly bounded along racial lines than current scholarship suggests. In particular, most interactions between characters from different races happen in a familial context, and are the result of racialized labor exploitation or outright enslavement of African-American families by Anglo-Americans. The lack of interactions outside of this context underscores just how little agency non-white characters have in Faulkner’s fiction."},
{"string_id": "10.22148/16.039", "abstract": "Over the past three decades, scholarship in sociology, criminology, law, public\npolicy, history, science and technology studies (STS), and other allied fields has\naddressed various areas of concern at the intersections of race and correctional\nsupervision in the United States."},
{"string_id": "10.22148/16.040", "abstract": "At Ethics and Archiving the Web, a conference convened in March 2018 at the\nNew Museum in New York City, a group of artists, archivists, activists and re-\nsearchers met to critically examine the ethical implications of our ability to col-\nlect and archive content from the web."},
{"string_id": "10.22148/001c.12556", "abstract": "This article discusses ways that dramatic structure can be analyzed through the use of social titles in Shakespeare’s plays. Freytag’s (1863) pyramid of dramatic structure is based on patterns he found in Shakespearean and Greek tragedy; more recently, computational methods are being employed to model narrative structure at scale. However, there has not yet been a study which discusses whether or not specific lexical items can be indicative of dramatic structure. Using Shakespeare’s plays as an example, this essay fills the gap by observing how social titles can be used to explore the viability of narrative structure."},
{"string_id": "10.22148/16.046", "abstract": "Literary history is no longer written in books alone. As literary reception thrivesin blogs, Wikipedia entries, Amazon reviews, and Goodreads profiles, the Webhas become a key platform for the exchange of information on literature."},
{"string_id": "10.22148/16.028", "abstract": "On its release in 2004, theOxford Dictionary of National Biographywas called“the greatest book ever” and “a more enthralling read than all the novels everentered for the Booker Prize put together.” The tabloidThe Daily Mail, wherethese giddy pronouncements appeared, is not known for understatement, butmore cautious academic researchers have long held theODNBin similarly highesteem."},
{"string_id": "10.22148/001c.13680", "abstract": "One commonly recognized feature of the Ancient Greek corpus is that later texts frequently imitate and allude to model texts from earlier time periods, but analysis of this phenomenon is mostly done for specific author pairs based on close reading and highly visible instances of imitation. In this work, we use computational techniques to examine the similarity of a wide range of Ancient Greek authors, with a focus on similarity between authors writing many centuries apart. We represent texts and authors based on their usage of high-frequency words to capture author signatures rather than document topics and measure similarity using Jensen-Shannon Divergence. We then analyze author similarity across centuries, finding high similarity between specific authors and across the corpus that is not common to all languages."},
{"string_id": "10.22148/16.043", "abstract": "Extensive scholarship in media studies has established how formal elements of\nmoving images—such as camera angles, sound, and framing—reflect, establish,\nand challenge cultural norms. Prior computational analyses attempting to ana-\nlyze these elements have primarily relied on summarizing relatively low-level fea-\ntures."},
{"string_id": "10.22148/001c.11652", "abstract": "Distant readers have used predictive modelling to study the strength of the relationship between characterization and binary notions of gender. This essay builds on that research, shedding light on several historical trends concerning anatomical description and its relationship to gender. Some of the evidence suggests that bodily language has long played a larger role in configuring fictional women than it did for fictional men. Other evidence implies that bodily characteristics were increasingly bifurcated along a gender binary, reflecting how characters are more and more physically sorted along a feminine-masculine axis. Taken altogether, this essay unpacks a suggestive correlation: a growing aspect of characterization was increasingly imbricated in heteronormative discourses. By weighing the discrepancies between the evidence presented in this essay, and that of its predecessors, this essay will ultimately suggest that disaggregating statistical models can unfold patterns of literary change that would otherwise remain suppressed."},
{"string_id": "10.22148/16.025", "abstract": "Digital libraries today distribute their contents in a way that limits the sort ofwork that can be done with them. Modern libraries are so large-often containingmillions of books or articles-that the technical resources needed to work withthem can be immense."},
{"string_id": "10.22148/16.027", "abstract": "One may as well begin with two overly-cited quotations about novelty. Thefirst:  “On or about December, 1910, human character changed.” And, morepredictably: “Make It New!” That these two statements about change and innovation have been so frequentlycited reveals a contradiction in modernist studies:  novelty is commonplace,both for modernist writers and for literary critics."},
{"string_id": "10.22148/16.033", "abstract": "Literary scholars in the information age, whatever issues we may differ on, have\nlong shared a belief that the amount of “information” in literary language is not a\nphenomenon that can be empirically investigated. We tell our students, and\nremind each other, that the meaning in literary texts is inherently subjective,\nculture-specific, and contextual rather than fixed."},
{"string_id": "10.22148/16.017", "abstract": "This paper reports on a collaborative project that develops new applications ofspatial text analysis. We offer a methodology to identify and evaluate correlations between semantic and geographic distance in a printed corpus."},
{"string_id": "10.22148/16.030", "abstract": "Whether they work with pages hand-selected from an archive, or keywords hand-selected from a digital corpus, scholars of all kinds wrestle with the issue of exemplarity."},
{"string_id": "10.22148/16.035", "abstract": "Data have become pervasive in research in the humanities and the social sci-\nences.  New areas, objects, and situations for study have developed; and new\nmethods for working with data are shepherded by new epistemologies and (po-\ntential) paradigm shifts. But data didn’t just happen to us. We have happened\nto data."},
{"string_id": "10.22148/16.012", "abstract": "Classification is a vexing problem in folkloristics.  Although broad genre classifications such as “ballad”, “folktale”, “legend”, “proverb”, and “riddle” are well established and widely accepted, these formal classifications are coarse and dolittle more than provide a first level sort on materials for collections that can easily include tens, if not hundreds, of thousands of records."},
{"string_id": "10.22148/16.015", "abstract": "The trajectory of science fiction since World War II has been defined by its rela-tionship with technoscientific imaginaries. In the Golden Age of the 1930s and 1940s, writers like Isaac Asimov and Robert Heinlein dreamed of the robots and"},
{"string_id": "10.22148/16.002", "abstract": "Applause is a significant cultural marker in recorded performances. In poetry performances, applause can be a means by which an audience can indicate its response to a speaker’s performance or to the audience in general; a means for expressing elation and appreciation or, perhaps, dismay; and a way to engage indialog with a poem itself and affect its mode of meaning making."},
{"string_id": "10.22148/16.004", "abstract": "I developed the concept of cultural analytics in 2005 to refer to “the analysis ofmassive cultural datasets and flows using computational and visualization tech-niques.” In 2007 we established a research lab (Software Studies Initiative, softwarestudies.com) to start working on practical projects."},
{"string_id": "10.22148/16.018", "abstract": "As Renaissance conceptions of otherness have become a locus of critical study,no work has been more central for making the case about dominant ideologiesof race than Shakespeare’s Othello. Ania Loomba has suggested that ”more than any other play of the time, Othello allows us to see that skin colour, religion,and location were often contradictorily yoked together within ideologies of ‘race,’and that all these attributes were animated by notions of sexual and gender difference.”"},
{"string_id": "10.22148/16.006", "abstract": "Beginnings are always hard to trace. They tend to belong more to the realm of myth, as Tristram Shandy well knew. At what point did it become necessary, in the sense of unavoidable, to use computation to study culture? Was it a certain polemic, new kinds of data (Google Books, Project Gutenberg), the rise of analytical techniques (natural language processing, machine learning), technologies such as the internet or social media, or simply that powerful social actor called “critical mass”."}
]