[
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.1.1.1191",
       "identifier":{
          "string_id":"10.5399/uo/hsda.1.1.1191",
          "id_scheme":"DOI"
       },
       "abstract":"Art plays a fundamental role in Arthur Schopenhauer’s philosophical system, and among the many artists who Schopenhauer cites, Francis Petrarch may be considered the most significant. Schopenhauer includes Petrarch among his favorite authors, referring to him as “the poet of [his] heart” and quoting him in those parts of The World as Will and Representation and Parerga and Paralipomena that center on the topics of ethics and the art of living. In this essay, I analyze Schopenhauer’s most significant passages on Petrarch, suggest connections between those passages, and conclude that, for Schopenhauer, the Italian poet is much more than a poet; he is a true sage whose words one can turn to for comfort. Petrarch is a thinker, a promoter of solitary life and the love of knowledge, a writer of philosophy and, although only in part, even an ascetic man. From Schopenhauer’s writing, it appears that Petrarch encompasses many of the features of the ideal Schopenhauerian man: someone who understands the senselessness of life, who has succeeded in denying the Will and has been able to express it through his poetry, his philosophical writings and his life choices. Petrarch’s verses foreshadow the basic ideas of Schopenhauer’s philosophy; his actions and his example serve not only as a model and inspiration for the readers of Schopenhauer but also for the German philosopher himself.",
       "article_title":"Quanto piace al mondo è breve sogno. Petrarch and Schopenhauer: Elective Affinities",
       "authors":[
          {
             "given":"Enrico",
             "family":"Vettore",
             "affiliation":[
                {
                   "original_name":" California State University, Long Beach",
                   "normalized_name":"California State University, Chico",
                   "country":"United States",
                   "identifiers":{
                      "ror":"https://ror.org/027bzz146",
                      "GRID":"grid.253555.1"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2011-06-29",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"1",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.1.1.1181",
       "identifier":{
          "string_id":"10.5399/uo/hsda.1.1.1181",
          "id_scheme":"DOI"
       },
       "abstract":"The article discusses the benefits of having translations of Petrarch available in Japanese, and describes a project to digitize portions of a Japanese translation of the Canzoniere.  Conversion from printed Japanese to HTML posed several interesting challenges.",
       "article_title":"The Digitization of Japanese Translations of the Rvf in the Oregon Petrarch Open Book",
       "authors":[
          {
             "given":"Nobuko",
             "family":"Wingard",
             "affiliation":[
                {
                   "original_name":"University of Oregon",
                   "normalized_name":"University of Oregon",
                   "country":"United States",
                   "identifiers":{
                      "ror":"https://ror.org/0293rh119",
                      "GRID":"grid.170202.6"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2011-06-29",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"1",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.1.1.1176",
       "identifier":{
          "string_id":"10.5399/uo/hsda.1.1.1176",
          "id_scheme":"DOI"
       },
       "abstract":"Early modern women poets across Europe and at least one colony enlisted Petrarchist terms, often with a self-aware, parodic twist. Some examples, considered here, include (first) self-portrait poems that serve to critique not only the lyric speaker/portrait subject’s imperfect face or physique, but the very phenomenon of Petrarchist lyric objectifications of female love objects, and (second) love poems addressed by women to other women. By applying a theoretical grounding that combines feminist, lesbian, and queering approaches, we can bring to these poems a reading that is alert to moments when they reproduce, or rework, the kinds of gendered discourse and heteronormative paradigms that we find in better-known male-authored poems. The essay concludes with a survey of the kinds of cultural work performed by these texts in their ideological, religious, political, and poetic contexts. As cultural premises changed, the poems moved from widespread presence into illegibility or erasure from literary historiography.",
       "article_title":"Baroque Flair: Seventeenth-century European Sapphic Poetry",
       "authors":[
          {
             "given":"Amanda",
             "family":"Powell",
             "affiliation":[
                {
                   "original_name":"University of Oregon",
                   "normalized_name":"University of Oregon",
                   "country":"United States",
                   "identifiers":{
                      "ror":"https://ror.org/0293rh119",
                      "GRID":"grid.170202.6"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2011-06-29",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"1",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.1.1.1246",
       "identifier":{
          "string_id":"10.5399/uo/hsda.1.1.1246",
          "id_scheme":"DOI"
       },
       "abstract":"This article examines concepts such as creative imitation and the impossibility of representation in order to suggest an ethic of reading in Petrarch’s Canzoniere. Such ethics illuminate possible new relationships between Renaissance and Baroque",
       "article_title":"Petrarch’s Poetics: From the Abyss of Representation to Creative Imitation",
       "authors":[
          {
             "given":"Luis Gonzalo",
             "family":"Portugal",
             "affiliation":[
                {
                   "original_name":"University of Oregon",
                   "normalized_name":"University of Oregon",
                   "country":"United States",
                   "identifiers":{
                      "ror":"https://ror.org/0293rh119",
                      "GRID":"grid.170202.6"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2011-06-29",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"1",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.1.1.1201",
       "identifier":{
          "string_id":"10.5399/uo/hsda.1.1.1201",
          "id_scheme":"DOI"
       },
       "abstract":"The colossal project of the Encyclopédie (1751-1772), directed by Denis Diderot and Jean le Rond d’Alembert, aimed to create, as Voltaire contends, “a repository of all sciences and arts,” therefore establishing itself as the point of reference for literature, sciences, arts and crafts. This pretentious ambition contrasts in direct proportion with the peripheral depiction of Francis Petrarch. Although they acknowledge Petrarch’s poetic talent and innovation, the authors of the Encyclopédie confine the Tuscan poet within the French poetical tradition. This gesture of appropriating what is exterior to the French image can be partly justified by the objective of the encyclopédistes to design a venue where a homogenous French identity can emerge. This paper attempts to track—by exploring various articles in the Encyclopédie along with their ramifications in other published works of the period—the ambivalent reception and portrayal of the Italian poet and humanist.",
       "article_title":"The Representation of Petrarch in the Eighteenth-century Encyclopédie",
       "authors":[
          {
             "given":"Ana-Maria",
             "family":"M'Enesti",
             "affiliation":[
                {
                   "original_name":"University of Oregon",
                   "normalized_name":"University of Oregon",
                   "country":"United States",
                   "identifiers":{
                      "ror":"https://ror.org/0293rh119",
                      "GRID":"grid.170202.6"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2011-06-29",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"1",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.1.1.1236",
       "identifier":{
          "string_id":"10.5399/uo/hsda.1.1.1236",
          "id_scheme":"DOI"
       },
       "abstract":"Through a brief overview of seventeenth-century Italian travel writing, this article highlights the significant Petrarchan presence in this corpus. Petrarchan elements, from quotes of the Canzoniere to references to the poet-wanderer, are found in accounts that vary greatly in terms of itinerary, narrative style, and the author’s reasons for traveling. For some Italian travelers, Petrarch is a fundamental point of reference in creating an authoritative “Italian” travel narrative, both in terms of literary echoes and in representing the traveler-narrator.",
       "article_title":"Mapping Petrarch in Seventeenth-century Italian Travel Writing",
       "authors":[
          {
             "given":"Nathalie",
             "family":"Hester",
             "affiliation":[
                {
                   "original_name":"University of Oregon",
                   "normalized_name":"University of Oregon",
                   "country":"United States",
                   "identifiers":{
                      "ror":"https://ror.org/0293rh119",
                      "GRID":"grid.170202.6"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2011-06-29",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"1",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.1.1.1166",
       "identifier":{
          "string_id":"10.5399/uo/hsda.1.1.1166",
          "id_scheme":"DOI"
       },
       "abstract":"The scholastic ambience of  S’amor non è  (Rvf 132) is not accidental; in it Petrarch demolishes the medieval cornerstone of knowledge by contradicting Aristotle’s law of non-contradiction. When Chaucer, however, translated the sonnet in the Troilus, he had to ponder its pensive U-turns within the framework of Boccaccio’s Filostrato. From this perspective, Troilus’s “If no love is” is less a retort to the law of non-contradiction than an interrogation of the law of the excluded middle. Chaucer’s Pandarus simultaneously substantiates the law and gives it the lie.",
       "article_title":"Chaucer and Petrarch: “S’amor non è” and the Canticus Troili",
       "authors":[
          {
             "given":"Warren",
             "family":"Ginsberg",
             "affiliation":[
                {
                   "original_name":"University of Oregon",
                   "normalized_name":"University of Oregon",
                   "country":"United States",
                   "identifiers":{
                      "ror":"https://ror.org/0293rh119",
                      "GRID":"grid.170202.6"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2011-06-29",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"1",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.2.1.3011",
       "identifier":{
          "string_id":"10.5399/uo/hsda.2.1.3011",
          "id_scheme":"DOI"
       },
       "abstract":"This paper dialogues with the contributions included in Francesco Fiorentino and Domenico Firomonte’s edited volumes and Massimo Riva’s book from the point of view of feminist literary criticism. This diverse positioning in relation to the work of women writers has allowed feminist criticism to develop a path that has deconstructed the Italian literary canon and the promotion of critical stances that are no longer abstract or monologic, but rather situated in the point of view of the subject and its relational component. Works by Italian women writers present themselves as a body of texts of high material density that transfer questions of textual mobility both within digital and print culture onto the subject and its style of enunciation.",
       "article_title":"Umane lettere: dai corpi testuali agli stili dell’enunciazione",
       "authors":[
          {
             "given":"Laura",
             "family":"Fortini",
             "affiliation":[
                {
                   "original_name":"Università Roma Tre",
                   "normalized_name":"Roma Tre University",
                   "country":"Italy",
                   "identifiers":{
                      "ror":"https://ror.org/05vf0dg29",
                      "GRID":"grid.8509.4"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2013-08-12",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"2",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.2.1.3016",
       "identifier":{
          "string_id":"10.5399/uo/hsda.2.1.3016",
          "id_scheme":"DOI"
       },
       "abstract":"The title of this paper is inspired by the book edited by Domenico Fiormonte entitled Canoni liquidi (Liquid Canons). Of course, the adjective “liquid” refers to Zygmunt Bauman’s term at which my critique is also indirectly aimed. The title of Fiormonte’s book seems to suggest equivalence between textual “mobility” and “liquidity.” Yet the “liquefying” of (literary) canons and the emergence of new intrinsically kinetic or fluid forms of mobile textuality requires a critical assessment that does not prematurely celebrate the funeral of the text as we know it but pays close attention to what seems to be waiting for us beyond the text, as suggested in Francesco Fiorentino’s recent edited volume. This means paying attention to what in my recent book, Il futuro della letteratura (The Future of Literature), I call digital incunabula: objects/textual tools, devices programmed in a twofold, reciprocal sense, whose linguistic properties and rules interact and interfere with the algorithmic procedures of artificial languages. In this programmed and programmable interaction and intermediation one can perceive the horizon of incomprehensibility of posthuman language, providing a new aporetic dimension to Gadamer’s assertion that “the being that can be understood is language.“ This assertion is by now the most significant issue in the horizon of literary (digital) arts.",
       "article_title":"\"Liquid/Cloudy/Foggy: For a Critique of Fluid Textuality\"",
       "authors":[
          {
             "given":"Massimo",
             "family":"Riva",
             "affiliation":[
                {
                   "original_name":"Brown University",
                   "normalized_name":"Brown University",
                   "country":"United States",
                   "identifiers":{
                      "ror":"https://ror.org/05gq02987",
                      "GRID":"grid.40263.33"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2013-08-12",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"2",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.2.1.3006",
       "identifier":{
          "string_id":"10.5399/uo/hsda.2.1.3006",
          "id_scheme":"DOI"
       },
       "abstract":"This essay proposes going beyond the difference between literary writing and new communication technologies. This appears to be possible by using a genealogical perspective that can recognize the underlying relationships between communication strategies that on the surface seem different. For this, it is necessary to identify the remote and unexpected ascendancies of diverse languages at a moment when the various media express themselves in an increasingly similar style. Even literary language should be considered a medium that shapes and models reality, using codes that are anthropological before they are aesthetic. As Viktor Shklovsky, Italo Calvino, and Paolo Fabbri have shown, literary language explores reality by revealing its incompleteness. On the contrary, ordinary language is confined to that incompleteness with its standard lexicon that would claim to enclose reality within a net of pre-established recurrences.",
       "article_title":"Dalla galassia digitale alla galassia Gutenberg",
       "authors":[
          {
             "given":"Arturo",
             "family":"Mazzarella",
             "affiliation":[
                {
                   "original_name":"Università Roma Tre",
                   "normalized_name":"Roma Tre University",
                   "country":"Italy",
                   "identifiers":{
                      "ror":"https://ror.org/05vf0dg29",
                      "GRID":"grid.8509.4"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2013-08-12",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"2",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.2.1.3001",
       "identifier":{
          "string_id":"10.5399/uo/hsda.2.1.3001",
          "id_scheme":"DOI"
       },
       "abstract":"This paper addresses the modern crisis of the philosophical project that conceived of literature as mathesis universalis. In the digital universe, literature maintains its relationship with truth, which is no longer considered as transcending the process of knowing, but as given in unity with it. The new statute of the text is captured well by Carlo Sini’s idea of “foglio-mondo” (“world-page”). Sini suggests that the desacralized text is not situated “outside” of truth; it does not become, as happens in many postmodern thinkers, play, deceit, and gratuitous narration. Rather, “foglio-mondo” is the text freed from the tutelage of transcendental truth to become an “event” of truth.",
       "article_title":"Dal testo mathema al testo “evento” di verità",
       "authors":[
          {
             "given":"Rocco",
             "family":"Ronchi",
             "affiliation":[
                {
                   "original_name":"Università dell’Aquila",
                   "normalized_name":"University of L'Aquila",
                   "country":"Italy",
                   "identifiers":{
                      "ror":"https://ror.org/01j9p1r26",
                      "GRID":"grid.158820.6"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2013-08-12",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"2",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.2.1.2996",
       "identifier":{
          "string_id":"10.5399/uo/hsda.2.1.2996",
          "id_scheme":"DOI"
       },
       "abstract":"This article tries to show the strict interdependence of the concepts of text, time, and truth in relation to textual transmission. It develops the thesis that the identity of the text is a function of a series of actors working on the historic, cultural, religious, and other levels. It offers the example of the origination of the Old Testament, which is considered the real foundational act of Western practices of identity construction/reconstruction. This event generated the metaphysics of the text that produced the overlapping of theological and philological truth. Nonetheless, the digital dimension seems potentially able to call into crisis the pact of identity that is based on the assumed stability of the written document and the idea of time that derives from it. The present scenario sees a tension between the data preservation/retrieval paradigm and the creative/performative style of online writing. We are facing a dialogue and interaction with and between machines that the methods and traditional tools of the humanist sciences find increasingly difficult to understand, describe, and map.",
       "article_title":"Testo Tempo Verità",
       "authors":[
          {
             "given":"Domenico",
             "family":"Fiormonte",
             "affiliation":[
                {
                   "original_name":"Università Roma Tre",
                   "normalized_name":"Roma Tre University",
                   "country":"Italy",
                   "identifiers":{
                      "ror":"https://ror.org/05vf0dg29",
                      "GRID":"grid.8509.4"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2013-08-12",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"2",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.2.1.2991",
       "identifier":{
          "string_id":"10.5399/uo/hsda.2.1.2991",
          "id_scheme":"DOI"
       },
       "abstract":"The transformation of the text from the pre-information technology and Gutenberg modes to the model marked by information or digital technology is such that it substantially changes not only the concept of the text but also the nature of philology itself. This paper presents and discusses the problems encountered in producing a digital edition of the Zibaldone Laurenziano, Giovanni Boccaccio’s handwritten manuscript conserved in the Laurenziana Library in Florence (Pluteo XXIX, 8). The Medieval text in general, and even more with the case of a zibaldone-type text, has intrinsic characteristics that clash with the immobility and definitive nature typical of the print text. The digital edition has been defined by Lebrave as the “critical edition of the 21st century.” It can be based on hypertextuality and hypermediality, using the internet as a resource, and is perfectly able to render textual movement, restoring the text to its specific mobility.",
       "article_title":"Filologia digitale (a partire dal lavoro per l’edizione informatica dello Zibaldone Laurenziano di Boccaccio)",
       "authors":[
          {
             "given":"Raul",
             "family":"Mordenti",
             "affiliation":[
                {
                   "original_name":"Università di Roma “Tor Vergata”",
                   "normalized_name":null,
                   "country":null,
                   "identifiers":{
                      "ror":null,
                      "GRID":null
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2013-08-12",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"2",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.2.1.2986",
       "identifier":{
          "string_id":"10.5399/uo/hsda.2.1.2986",
          "id_scheme":"DOI"
       },
       "abstract":"The framework for this contribution is the transformation of the textual community, namely, modern society, into a digital community, in other words, a network society. This paper analyzes two theses. The first holds that the text, due to its genetic and historic nature, is always IMMUTABLE, STABLE, and never mobile. For this reason, the text represents the foundational element of a specific society, modern society. The second thesis is based on the assertion that within information and hypertext technologies two diverse views confront and contrast each other. I locate these tendencies in the following key words: “dream” (Nelson) and “intellect” (Engelbart). Hypertext technology and culture represent the most transformative location and agency, they are the actors of the paradigm shift in which we are implicated. The hypertext revolution is based on the criticism of and attack against the material supports of writing and reading, as well as typographic technologies. Hypertext fights and wins this battle. However, hypertext technology is not able to reach the deep structure of alphabetic culture that is made not only of material support but also mental and bodily experience, consolidated and evolving, and of social relationships that are implied in the materiality of the support.",
       "article_title":"Il testo (non) è mobile",
       "authors":[
          {
             "given":"Mario",
             "family":"Ricciardi",
             "affiliation":[
                {
                   "original_name":"Politecnico di Torino",
                   "normalized_name":"Polytechnic University of Turin",
                   "country":"Italy",
                   "identifiers":{
                      "ror":"https://ror.org/00bgk9508",
                      "GRID":"grid.4800.c"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2013-08-12",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"2",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.2.1.2981",
       "identifier":{
          "string_id":"10.5399/uo/hsda.2.1.2981",
          "id_scheme":"DOI"
       },
       "abstract":"The internet changes our ways of both knowing and thinking. A person who has grown up using the internet, whether for school or simply to play videogames, tends to extend and reproduce the same model of knowing in other instances. The internet replaces a linear and centralized model with a circular and diffused framework for self-learning that presents certain familiar limits: it demands speed or, at least, not pausing. The internet user is omnivorous, in a rush, and develops a memory that is limited to the short term. However, there are some positive aspects of circular learning that should be emphasized: the possibility of constructing personal paths, comparing different opinions, innovating, overcoming old disciplinary divisions, surmounting the drawbacks of linear learning that often lead to uncritical and purely molecular thinking.",
       "article_title":"Studiare dopo internet",
       "authors":[
          {
             "given":"Alberto",
             "family":"Sobrero",
             "affiliation":[
                {
                   "original_name":"Università La Sapienza di Roma",
                   "normalized_name":"Sapienza University of Rome",
                   "country":"Italy",
                   "identifiers":{
                      "ror":"https://ror.org/02be6w209",
                      "GRID":"grid.7841.a"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2013-08-12",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"2",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.1.1.1226",
       "identifier":{
          "string_id":"10.5399/uo/hsda.1.1.1226",
          "id_scheme":"DOI"
       },
       "abstract":"In Spain as in Spanish America in the Golden Age, imitatio held sway as the dominant poetics. Yet the concept of imitatio is an elastic one. How can a twenty-first century reader grasp the meaning of Renaissance imitatio? As a means of addressing this question, this essay analyzes the relationship of important poems to their source text, foregrounding Bartolomeo Ricci’s concepts of sequi, imitare, and aemulare, presented in the 1541 De imitatione. Focusing on the rich legacies of Canzone 323  (delle Visioni) by Francesco Petrarca in the poetry of (among others) Diego Dávalos y Figueroa, Francisco de Quevedo, Lope de Vega, Fray Luís de León and Juan de Guevara, the essay provides a powerful explication of the generative properties of imitatio. [This article published in the author's original Spanish.]",
       "article_title":"Las visiones de Petrarca en la poesía hispánica y en la poética renacentista",
       "authors":[
          {
             "given":"Alicia de",
             "family":"Colombí-Monguió",
             "affiliation":[
                {
                   "original_name":"University at Albany, SUNY",
                   "normalized_name":"University at Albany, State University of New York",
                   "country":"United States",
                   "identifiers":{
                      "ror":"https://ror.org/012zs8222",
                      "GRID":"grid.265850.c"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2011-06-29",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"1",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.1.1.1196",
       "identifier":{
          "string_id":"10.5399/uo/hsda.1.1.1196",
          "id_scheme":"DOI"
       },
       "abstract":"English translation of Petrarch—translation that is also metamorphosis in a manner that Petrarch would have recognized—begins with Chaucer's rendition of canticus TroiliTroilus and Criseyde, an inaugural moment of lyric imitation long thought unique in Chaucer's work. Yet suggestive claims have been made that Rvf 189 was also rendered by Chaucer as Troilus' second canticus in book V, within a context inclusive of additional Petrarchan influences on Chaucer.  Chaucer's versions, and their contextualization in the Troilus, had definite consequences for Petrarchan translation when it resumed with the Henrician poets Thomas Wyatt and Henry Howard a century and a half later. For the Tudor poets living under the tyranny of Henry VIII the Petrarch-inspired sonnet offered a richly articulated space of private reflection that did not fail to register the pressure of court politics. Wyatt's Petrarchan translations in the Egerton manuscript represent a privileged part of his lyric production, a preference that the Earl of Surrey absorbed for his very different poetic program, one designed to exalt both aristocratic lineage and an aureate genealogy of poets including Virgil, Dante, and Chaucer along with Petrarch and Wyatt. Mediated by multiple editions of Tottel's Songs and Sonnettes between 1557 and 1594, the legacy of Wyatt's and Surrey's Petrarchan translations reached the Elizabethans with an emphasis on Petrarch's poetic supremacy that stimulated emulation by the young Shakespeare. His tragedy Romeo and Juliet threw down a challenge to Petrarch with respect to sonnet forms, sonnet rhetoric, and the typical story of enamorment, a story still discernibly affiliated with Chaucer's .",
       "article_title":"Francis, Thou Art Translated: Petrarch Metamorphosed in English, 1380-1595",
       "authors":[
          {
             "given":"Ronald L.",
             "family":"Martinez",
             "affiliation":[
                {
                   "original_name":"Brown University",
                   "normalized_name":"Brown University",
                   "country":"United States",
                   "identifiers":{
                      "ror":"https://ror.org/05gq02987",
                      "GRID":"grid.40263.33"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2011-06-29",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"1",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.1.1.1101",
       "identifier":{
          "string_id":"10.5399/uo/hsda.1.1.1101",
          "id_scheme":"DOI"
       },
       "abstract":"This article examines the theoretical premises and consequences of the renewed attention to the intersection between philology, hermeneutics, and criticism in humanist studies in general and in Petrarch studies in particular. The most recent philological achievements–from the new facsimile of Rerum vulgarium fragmenta: Codex Vat. Lat. 3195 (Rvf), edited by Belloni, Brugnolo, Storey, and Zamponi to the new critical edition of Petrarch’s masterpiece by Giuseppe Savoca–are presented and discussed as introduction to reflections on the role that a hypertext project, such as the Oregon Petrarch Open Book initiated at the University of Oregon, may play in the return to philology as necessary tool of textual criticism and hermeneutics.",
       "article_title":"Return to Philology and Hypertext in and around Petrarch’s Rvf",
       "authors":[
          {
             "given":"Massimo",
             "family":"Lollini",
             "affiliation":[
                {
                   "original_name":"University of Oregon",
                   "normalized_name":"University of Oregon",
                   "country":"United States",
                   "identifiers":{
                      "ror":"https://ror.org/0293rh119",
                      "GRID":"grid.170202.6"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2011-06-29",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"1",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.1.1.1211",
       "identifier":{
          "string_id":"10.5399/uo/hsda.1.1.1211",
          "id_scheme":"DOI"
       },
       "abstract":"After describing the close relation between Petrarch’s and Dante’s conceptions of canzone form, this article explores the formats followed by Petrarch and his scribe Giovanni Malpaghini in their transcriptions in Vat. Lat. 3195. Giovanni’s traditional horizontal format allows for certain striking effects of collocation (as of 125-126) and for minimal page turns in canzoni; however, the vertical format of the sestinas and the vertical alignment of even-numbered verses in Petrarch’s own transcriptions of sonnets and canzoni suggest a gradually increasing sense of the possibilities of vertical format.",
       "article_title":"Rerum vulgarium fragmenta: From Manuscript to Print",
       "authors":[
          {
             "given":"Robert M.",
             "family":"Durling",
             "affiliation":[
                {
                   "original_name":"University of California, Santa Cruz",
                   "normalized_name":"California Coast University",
                   "country":"United States",
                   "identifiers":{
                      "ror":"https://ror.org/05t99sp05",
                      "GRID":"grid.468726.9"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2011-06-29",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"1",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.1.1.1231",
       "identifier":{
          "string_id":"10.5399/uo/hsda.1.1.1231",
          "id_scheme":"DOI"
       },
       "abstract":"This essay questions the use of the term original to refer to Petrarch’s partial holograph of the Fragmenta (Vaticano Latino 3195) by examining the essential scribal change of register, from “fair” to “service” copy, that the poet imposed upon the still unsewn quires. Especially for an author like Petrarch, keen upon revising minute details of his lyrics and upon authorizing an “edition” of his own work, a fair copy produced by a professional copyist under his supervision was, as we see in much of Latino 3195 and in professional copies of other works supervised by the poet, a key component of his “original.” Examining four integrated critical and material approaches to Petrarch’s work not only in the partial holograph but also in early codices and early printed editions, this study analyzes the utility of early fair copies in tracing the “original” of the Fragmenta.",
       "article_title":"Petrarch’s “Original” of the Fragmenta 1362-1558: from Boccaccio to Rovillio’s third printing",
       "authors":[
          {
             "given":"H. Wayne",
             "family":"Storey",
             "affiliation":[
                {
                   "original_name":"Textual Cultures",
                   "normalized_name":null,
                   "country":null,
                   "identifiers":{
                      "ror":null,
                      "GRID":null
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2011-06-29",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"1",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    },
    {
       "url":"http://dx.doi.org/10.5399/uo/hsda.1.1.1186",
       "identifier":{
          "string_id":"10.5399/uo/hsda.1.1.1186",
          "id_scheme":"DOI"
       },
       "abstract":"This article presents some features of the new the edition of the Rerum vulgarium fragmenta recently published by the author. This edition is very different from all previous editions and arguably the most innovative in its editorial decisions. Preparation of the edition involved approaching the Canzoniere with a view to establishing concordances/correlations among all aspects of its “lexicon” (literally lexical, graphemic, and visual). The use of computer technology, both on the lexical level and in the treatment of images, made the difference with respect to the traditional philological approach, both in analysis and in the properly editorial phase. Proceeding by concordance/correlation implies that before making any editorial decision one must compare all analogous elements of the work. Today only computer science can provide a scientific basis for our textual analyses. Digital treatment of a text allows us to move from the syntagm to the paradigm, that is, puts us in contact with the system specific to the text that we wish to understand and also publish.",
       "article_title":"Prolegomena to a New Lyric Petrarch in the Digital Future",
       "authors":[
          {
             "given":"Giuseppe",
             "family":"Savoca",
             "affiliation":[
                {
                   "original_name":"University of Catania",
                   "normalized_name":"University of Catania",
                   "country":"Italy",
                   "identifiers":{
                      "ror":"https://ror.org/03a64bh57",
                      "GRID":"grid.8158.4"
                   }
                }
             ]
          }
       ],
       "publisher":"Oregon State University",
       "date":"2011-06-29",
       "keywords":null,
       "journal_title":"Humanist Studies & the Digital Age",
       "volume":"1",
       "issue":"1",
       "ISSN":[
          {
             "value":"2158-3846",
             "type":"electronic"
          }
       ]
    }
 ]