{"url": "http://dx.doi.org/10.1093/llc/fqr039", "identifier": {"string_id": "10.1093/llc/fqr039", "id_scheme": "DOI"}, "abstract": "This study is to investigate the translator's fingerprints as manifested in his/her style in translation. It reports a case study of two Chinese translations of Ulysses, adopting a corpus-based approach. The parallel subcorpora of the self-built Bilingual Corpus of Ulysses (BCU) consist of Joyce's Ulysses and its two Chinese versions produced by Xiao (1994 Tran. Ulysses, Nanjing: Yilin Press) and Jin (1997 Tran. Ulysses, Beijing: People's Literature Publishing House), respectively, and the comparable subcorpora include Xiao's original writings in Chinese. The comparison of the keyword lists shows that Xiao, the literary writer and translator, leaves some traces of lexical idiosyncrasy in his composition and translation. On the syntactic level the comparison reveals that due to the interference of the English language Xiao post-positions more adverbial clauses in translation than in composition, a feature that distinguishes the translated text from non-translated original writing. This indicates that the fingerprints of the translator are left on the translated text both as a result of his/her linguistic idiosyncrasy and of the interference and constraints of the languages s/he is dealing with in translation.", "article_title": "Looking for translator's fingerprints: a corpus-based study on Chinese translations of Ulysses", "authors": [{"given": " Qing", "family": "Wang", "affiliation": [{"original_name": "Shandong Jiaotong University, Jinan, China", "normalized_name": "Shandong Jiaotong University", "country": "China", "identifiers": {"ror": "https://ror.org/01848hk04", "GRID": "grid.460017.4"}}]}, {"given": " Defeng", "family": "Li", "affiliation": [{"original_name": "SOAS, UK & SJTU, China", "normalized_name": "School of Oriental and African Studies", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04vrxay34", "GRID": "grid.22631.34"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2011-11-04", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "27", "issue": "1", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}