{"url": "http://dx.doi.org/10.2218/ijdc.v6i1.172", "identifier": {"string_id": "10.2218/ijdc.v6i1.172", "id_scheme": "DOI"}, "abstract": "There is almost universal agreement that scientific data should be shared for use beyond the purposes for which they were initially collected. Access to data enables system-level science, expands the instruments and products of research to new communities, and advances solutions to complex human problems. While demands for data are not new, the vision of open access to data is increasingly ambitious. The aim is to make data accessible and usable to anyone, anytime, anywhere, and for any purpose. Until recently, scholarly investigations related to data sharing and reuse were sparse. They have become more common as technology and instrumentation have advanced, policies that mandate sharing have been implemented, and research has become more interdisciplinary. Each of these factors has contributed to what is commonly referred to as the \"data deluge\". Most discussions about increases in the scale of sharing and reuse have focused on growing amounts of data. There are other issues related to open access to data that also concern scale which have not been as widely discussed: broader participation in data sharing and reuse, increases in the number and types of intermediaries, and more digital data products. The purpose of this paper is to develop a research agenda for scientific data sharing and reuse that considers these three areas.", "article_title": "Beyond the Data Deluge: A Research Agenda for Large-Scale Data Sharing and Reuse", "authors": [{"given": "Ixchel M.", "family": "Faniel", "affiliation": [{"original_name": "University of Michigan", "normalized_name": "University of Michigan–Ann Arbor", "country": "United States", "identifiers": {"ror": "https://ror.org/00jmfr291", "GRID": "grid.214458.e"}}]}, {"given": "Ann", "family": "Zimmerman", "affiliation": [{"original_name": "University of Michigan", "normalized_name": "University of Michigan–Ann Arbor", "country": "United States", "identifiers": {"ror": "https://ror.org/00jmfr291", "GRID": "grid.214458.e"}}]}], "publisher": "Edinburgh University", "date": "2011-03-08", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "6", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}