{"url": "http://dx.doi.org/10.2218/ijdc.v6i1.175", "identifier": {"string_id": "10.2218/ijdc.v6i1.175", "id_scheme": "DOI"}, "abstract": "Emulation has been widely discussed as a preservation strategy for digital documents that depend upon proprietary executables, as well as for legacy programs. The fundamental assumption of this strategy is that an artifact (document or program) will be bundled with any required contemporaneous software in an archival information package (AIP) which can be loaded and executed in an emulation environment by patrons wishing to access the preserved artifact, yet little has been written about how to identify the required components for such an AIP. Even where a digital document was distributed with a binary viewer, there may be dependencies on other software libraries. In this paper we discuss a pilot study that performed dependency analysis for digital materials originally distributed on CD-ROM. In particular, we show how to utilize a small number of existing off-the-shelf libraries to build a tool that can analyze executables within ISO (CD-ROM) images, and then examine the results of applying this tool to a body of archived images.", "article_title": "Dependency Analysis of Legacy Digital Materials to Support Emulation Based Preservation", "authors": [{"given": "Aaron", "family": "Hsu", "affiliation": [{"original_name": "Indiana University School of Informatics and Computing", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}, {"given": "Geoffrey", "family": "Brown", "affiliation": [{"original_name": "Indiana University School of Informatics and Computing", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}], "publisher": "Edinburgh University", "date": "2011-03-08", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "6", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}