{"url": "https://doi.org/10.3366/ijhac.2011.0006", "identifier": {"string_id": "10.3366/ijhac.2011.0006", "id_scheme": "DOI"}, "abstract": " This article documents the digital humanities aspects of The Holinshed Project at the University of Oxford. It outlines the nature of the project, in particular the need to compare paragraphs of the 1577 and 1587 editions of Holinshed's Chronicles of England, Scotland, and Ireland. In order to accomplish these comparisons, a tool known as the TEI-Comparator was created. This is a bespoke fuzzy text comparison engine with a frontend web interface designed for the project. The TEI-Comparator automatically matches reorganised and fragmented paragraphs in the two editions. It is then used for confirming, removing, creating and annotating the links between the editions. This article describes the steps necessary to use the TEI-Comparator, its comparison algorithm, and the handling of the output it creates with respect to its use for The Holinshed Project. The TEI-Comparator was launched in 2009 as an open source project on Sourceforge and is available for other projects to use. ", "article_title": "The Holinshed Project: Comparing and linking two editions of Holinshed's Chronicle", "authors": [{"given": "James", "family": "Cummings", "affiliation": [{"original_name": "University of Oxford, UK", "normalized_name": "University of Oxford", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/052gg0110", "GRID": "grid.4991.5"}}]}, {"given": "Arno", "family": "Mittelbach", "affiliation": [{"original_name": "Technical University of Darmstadt", "normalized_name": "TU Darmstadt", "country": "Germany", "identifiers": {"ror": "https://ror.org/05n911h24", "GRID": "grid.6546.1"}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2011-03-24", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "4", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}