{"url": "https://doi.org/10.3366/ijhac.2011.0021", "identifier": {"string_id": "10.3366/ijhac.2011.0021", "id_scheme": "DOI"}, "abstract": " The act of classification has the widest implications for scholarship. Whatever the format, it involves the totality of our being. The use of our eyes indicates that decisions about whatever it is that we observe have already been made. Yet the interaction between the mechanical act of seeing and the mind or memory has rarely been registered. An object once seen implies that the researcher's consciousness is engaged. The description of mere shape records that interaction. To establish whether sub-conscious decisions have been made as to the meaning of a shape, it might be placed in an armature. VIPS/ip software, created by both computer scientists and art historians, provides such an armature. The separate roles played by memory, brain, and eye in engaging with the shapes, encountered on the pictograph sites of the Lake of the Woods might then be detected. Subsequent labelling which bears these roles in mind just might isolate the contribution made by memory. The systematic identification and cataloguing of such images by an investigator may also enable us to understand something of the intricate and uncharted past of the Canadian Shield and about ourselves. ", "article_title": "Do not make snap decisions about what you are seeing: how digital analysis of the images from the Canadian Shield highlights the difficulties in classifying shapes", "authors": [{"given": "Alicia", "family": "Colson", "affiliation": [{"original_name": "British Exploring Society: London, GB", "normalized_name": "British Exploring Society", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/015qzxt65", "GRID": "grid.468533.f"}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2011-06-22", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "5", "issue": "1", "ISSN": [{"value": null, "type": null}]}