{"url": "https://doi.org/10.3366/ijhac.2011.0012", "identifier": {"string_id": "10.3366/ijhac.2011.0012", "id_scheme": "DOI"}, "abstract": " Documents of all forms have always been at the centre of research in the humanities and arts. As more literature becomes available electronically, the impact of the digital medium on reading and research also grows. This article provides a review of key research on the limitations of digital reading, spanning a twenty-year period. Most of this literature is from the computer science field of human-computer interaction. From this backdrop, this article reports the main findings of a series of detailed studies that have investigated the current difficulties and limitations of digital document reader software. These studies, all conducted in the last four years, demonstrate that there are major limitations in digital document reader software that impede a number of simple interactions between user and document. It is also demonstrated that the current problems with this software can be overcome through a re-design of the human-computer interface. Ultimately, the current shortcomings of digital document reader software are a major impediment to realising the full potential of digital humanities. However, there is ample scope to make tangible improvements and progress is urgently needed. ", "article_title": "The usability of digital documents – A barrier to digital scholarship", "authors": [{"given": "George", "family": "Buchanan", "affiliation": [{"original_name": "City University of London, Department of Computer Science, UK", "normalized_name": "City, University of London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/04489at23", "GRID": "grid.28577.3f"}}, {"original_name": "University of Melbourne, School of Computing and Information Systems, Australia", "normalized_name": "University of Melbourne", "country": "Australia", "identifiers": {"ror": "https://ror.org/01ej9dk98", "GRID": "grid.1008.9"}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2011-03-24", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "4", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}