{"url": "https://doi.org/10.3366/ijhac.2011.0014", "identifier": {"string_id": "10.3366/ijhac.2011.0014", "id_scheme": "DOI"}, "abstract": " The Educause Horizon Report states that while web-based tools are rapidly becoming standard in education and in the workplace and technologically mediated communication is the norm, fluency in information, visual, and technological literacy is not formally taught to most students. In the light of this we need new and expanded definitions and paradigms of Information and Media Literacy (IML) that promote mastering critical thinking as well as technical proficiency. This study, forming part of the Irish Integrative Learning Project, attempts to test an assumption that entrants to the humanities are media literate. This assumption, often made by educators in higher education, largely goes unchallenged. This paper reflects on the strengths and weaknesses of a series of media literacy workshops when facilitated in conjunction with the undergraduate History of Art course at University College Cork, Republic of Ireland from 2007–2009. It concludes with an example of how these media literacy workshops, indirectly, had surprisingly positive affects on a dyslexic student by scaffolding his learning and providing him with alternative entry points to learning whereby he was empowered to confidently articulate History of Art's signature disciplinary skills-set at a foundation level: critical visual analysis. ", "article_title": "Too much information: Why facilitate information and media literacy?", "authors": [{"given": "James G. R.", "family": "Cronin", "affiliation": [{"original_name": "University College Cork, Ireland", "normalized_name": "University College Cork", "country": "Ireland", "identifiers": {"ror": "https://ror.org/03265fv13", "GRID": "grid.7872.a"}}]}], "publisher": " Edinburgh University Press  22 George Square, Edinburgh EH8 9LF UK  ", "date": "2011-03-24", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "4", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}