[
    {
        "url": "http://computerphilologie.digital-humanities.de/jg00/christma/christma.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "Much praised and much criticized but certainly unique: The forming of the Deutsches Wörterbuch (DWB) by Jacob and Wilhelm Grimm took far more than one hundred years and engaged generations of lexicographers who have contributed a total of approximately 350.000 entries to be collected in 67.744 dictionary columns that were published in sixteen volumes (32 sections). The DWB comprises the most thorough account of the German language and reflects a period of more than one hundred years of lexicographical, cultural, institutional, and also political history; thus it proves indispensable for research and teaching. It marks a further step in the history of this dictionary, to make it available in the electronic medium, and to recognize and encode its heterogeneous structures systematically. Since November 1998 a project team at the University of Trier prepares a computerized version of the DWB to be published on CD-ROM and also be made available via Internet. Accessibility of this outstanding dictionary will be improved thereby enlargening its user community independent of libraries' opening hours. The adaptation of the dictionary's contents will be according to international standards: The use of SGML determined by the TEI-guidelines will support the aim to obtain new possibilities in its usage: A markup of the dictionary's contents taking into account the specific demands of dictionary structures enables to provide selective access to various positions of each dictionary entry, offering far wider possibilities of dictionary usage than conventional full-text search requests can supply. Systematic analysis of quotations and its references will be ensured by interlinking those with the DWB's index volume. After a brief outline of the DWB's structure, history, and value, this paper stresses upon following the steps to a computerized version of the DWB. The stages from data input, correction procedures, and automatic markup according to SGML standards to the provision of a graphical user interface will be discussed, emphasizing on the difficulties arising from the dictionary's hetergeneous structure and contents.",
        "article_title": "EIN »HAUSBUCH«[1] FÜR ALLE? - DAS DEUTSCHE WÖRTERBUCH DER BRÜDER GRIMM AUF CD-ROM UND IM INTERNET",
        "authors": [
            {
                "given": "Thomas",
                "family": "Burch",
                "affiliation": [
                    "Germanistik/Ältere deutsche Philologie, Universität Trier"
                ]
            },
            {
                "given": "Ruth",
                "family": "Christmann",
                "affiliation": [
                    "Germanistik/Ältere deutsche Philologie, Universität Trier"
                ]
            },
            {
                "given": "Vera",
                "family": "Hildenbrandt",
                "affiliation": [
                    "Germanistik/Ältere deutsche Philologie, Universität Trier"
                ]
            },
            {
                "given": "Thomas",
                "family": "Schares",
                "affiliation": [
                    "Germanistik/Ältere deutsche Philologie, Universität Trier"
                ]
            }
        ],
        "publisher": null,
        "date": "11. August 2000",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg00/maxeibl/maxeibl2.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "This article describes ergonomical aspects of hypermedia systems. First, the basic concepts of hypertext, multimedia and hypermedia are defined and discussed. Then the main problems of hypertext systems, such as navigation, orientation, and search, and their possible solutions are discussed. Different methods are presented and evaluated according to their usability. The article closes with a short introduction to usability problems of different modalities.",
        "article_title": "HYPERTEXT, MULTIMEDIA, HYPERMEDIA: ERGONOMISCHE ASPEKTE",
        "authors": [
            {
                "given": "Maximilian",
                "family": "Eibl",
                "affiliation": [
                    "Berlin"
                ]
            }
        ],
        "publisher": null,
        "date": "1.Oktober 2000",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg00/landfest/landfest.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "This essay suggests a website edition of Bettine von Arnims complete works, including all her correspondances, concepts and other manuscript material. Crucial arguments in favor of such an edition are first von Arnim's constant interweaving of published books and private correspondances which lent her writings their specific network structure; second the problem of handling the sources, von Arnim's papers partly having disappeared after an auction in 1929 and the rest being scattered wide. To give plausibility to these argu-ments the essay sketches the works' net structure as well as the state of the manuscript sources.",
        "article_title": "FASELEI ONLINE. VORÜBERLEGUNGEN ZU EINER INTERNET-PUBLIKATION VON BETTINE VON ARNIMS WERK",
        "authors": [
            {
                "given": "Ulrike",
                "family": "Landfester",
                "affiliation": [
                    "München/Frankfurt am Main"
                ]
            }
        ],
        "publisher": null,
        "date": "2. Juli 2000",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg00/richter/richter.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The project of a new, historical-critical edition of the entire corpus of letters written by Goethe has been a desideratum of German Studies research for decades. A total of more than 14.700 letters by Goethe to more than 1400 different correspondents, excluding official correspondence, have survived. Various particulars in part four of the Weimar Edition (which appeared between 1887 and 1912 and contains the only thorough academic edition of Goethe letters to date) have to be revised. More than 2.000 letters were published incompletely, while about 300 letters are not yet available in print. Besides a full presentation of the letters, there are two other strong arguments in favour of a revised and enlarged edition: improving both the chronology and the annotation of the letters in the Weimar Edition. As an essential preparatory work transmissions of manuscripts and prints of all Goethe letters were brought together in a database. In this complete index are noted all manuscripts, drafts, and contemporary copies of Goethe letters which have survived. It comprises over 15.200 records. In addition to the Goethe and Schiller Archives, where about 20.000 manuscripts of Goethe letters, including drafts and copies, are held, about 200 other libraries, archives, and private owners all over the world were contacted for materials. The database for the electronic index of transmissions of all Goethe letters is published on the internet now and is accessible to all users.",
        "article_title": "ZUR INTERNETVERÖFFENTLICHUNG. DER DATENBANK: JOHANN WOLFGANG GOETHE. REPERTORIUM SÄMTLICHER BRIEFE 1764-1832. HG. V. DER STIFTUNG WEIMARER KLASSIK/GOETHE- UND SCHILLER-ARCHIV",
        "authors": [
            {
                "given": "Elke",
                "family": "Richter",
                "affiliation": [
                    "Stiftung Weimarer Klassik/Goethe- und Schiller-Archiv, Weimar"
                ]
            }
        ],
        "publisher": null,
        "date": "1. Oktober 2000",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg01/bein2.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "This feature is a summary of two round table talks conducted for several hours on 2 and 22 August 2001 at the Institute of German Literature of RWTH Aachen. The goal of these talks was to identify what practical consequences new computer and Internet based technologies have on research and teaching in the field of Medieval German studies and what requirements different university groups have for the future use of the new media and technologies. The talks deliberately set aside the field of specialist programming or special hardware configurations. The focus was to be on application. (Translation by Alison Dobson-Ottmers.)",
        "article_title": "PC UND INTERNET IN ALTGERMANISTISCHER. FORSCHUNG UND LEHRE. ERFAHRUNGEN UND DESIDERATE",
        "authors": [
            {
                "given": "Thomas",
                "family": "Bein",
                "affiliation": [
                    "Germanistisches Intitut der RWTH Aachen, Abteilung für Ältere Deutsche Literatur"
                ]
            }
        ],
        "publisher": null,
        "date": "26. November 2001",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg01/oberhofer.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "Distributed learning environments and content often lack common basis for the exchange of learning materials. This delays or even hinders both innovation and delivery of learning technology. Standards for platforms and authoring may provide a way to improve interoperability and cooperative development. This article provides an XML-based approach to this problem promoted by the IMS Global Learning Consortium.",
        "article_title": "XML-STANDARDS ALS MOTOR. FÜR DEN AUSBAU VIRTUELLER LEHRANGEBOTE",
        "authors": [
            {
                "given": "Thomas",
                "family": "Oberhofer",
                "affiliation": [
                    "Erlangen"
                ]
            }
        ],
        "publisher": null,
        "date": "26. November 2001",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg01/reinhardt-becker.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The following paper deals with the development of a hypertext-study program for personal use, connected with Jochen Vogts 1999 textbook Einladung zur Literaturwissenschaft (Invitation to Literary Studies), which is used for first year-classes of German literature in several universities home and abroad. Our hypertext-program is available in the World Wide Web and basically provides substantial information on authors (both literary and critical) and literary terms (in example genres, literary history, styles, theory) mentioned in the textbook. In addition, short original texts represent the most important critical schools. A system of links gives every user the opportunity to find her or his own path through the jungle of literary facts, concepts and terms. My paper tries to trace mainly the discussions and decisions in our working team, mostly of graduate students, to discuss the didactic possibilities of the hypertext, and to summarize the responses of users both in Essen and worldwide to our work-in-progress.",
        "article_title": "EINLADUNG ZUR LITERATURWISSENSCHAFT[1]. DAS ESSENER INTERNET-VERTIEFUNGSPROGRAMM ZUM SELBSTSTUDIUM. EIN ERFAHRUNGSBERICHT",
        "authors": [
            {
                "given": "Elke",
                "family": "Reinhardt-Becker",
                "affiliation": [
                    "Universität GHS Essen"
                ]
            }
        ],
        "publisher": null,
        "date": "26. November 2001",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg01/rohmer.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The World Wide Web offers a lot of information on poets and literary texts, which may motivate people in continuing and intensifying their reading. The web-catalogue Erlanger Liste – Germanistik im Internet <http://www.erlangerliste.uni-erlangen.de> (4.11.2001), where internet resources on german literature are listed and commented, could help to find such places in the web. In doing so, the list also takes part in the renewal of a cultural memory under the sign of the new media. Literary science should observe both: the way, how readers present their reading in the net, but also the consequences for the literary tradition.",
        "article_title": "LINKLISTE UND LESELUST. MÖGLICHKEITEN DER LITERATURVERMITTLUNG IM INTERNET",
        "authors": [
            {
                "given": "Ernst",
                "family": "Rohmer",
                "affiliation": [
                    "Institut für Germanistik, Universität Erlangen-Nürnberg"
                ]
            }
        ],
        "publisher": null,
        "date": "26. November 2001",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg01/doerr.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The article gives an overview about digitization activities from a German prospective. The setup of a specialized funding program for retrospective digitization of library holdings by the Deutsche Forschungsgemeinschaft in 1997 played an important role for inciting and promoting digitization projects. Giving direct access to broadly used research and teaching materials or facilitating the use of rare and precious documents are some of the most frequent selection criterias. The main lines of digitization activities of the Bavarian State Library are given as an example for building a digitization profile which is reflecting the missions of the library. Further American and French initiatives are cited in order to illustrate digitization programs of much greater dimensions. The second part of the article refers to the basic technical questions (scanners, resolution, text encoding) and also mentions some copyright issues.",
        "article_title": "RETRODIGITALISIERUNG IN BIBLIOTHEKEN UND WISSENSCHAFTLICHEN EINRICHTUNGEN",
        "authors": [
            {
                "given": "Marianne",
                "family": "Dörr",
                "affiliation": [
                    "Bayerische Staatsbibliothek, Leitung VD 12 und Münchner Digitalisierungszentrum"
                ]
            }
        ],
        "publisher": null,
        "date": "15. September 2001",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg01/kocher-boehler.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "Departing from an aphorism by G. Ch. Lichtenberg - that words stand still while the world designated by them moves on and that therefore words ought to be reexamined periodically for their adequacy vis-à-vis the new realities - the essay explores the term ›Spiel‹ (›play‹/›game‹) for its possible potential as a key-concept linking post-kantian Aesthetics, Gadamer’s Hermeneutics and Iser’s Reader-Response Criticism as analytical tools for the new artistic genres of electronic hyperfiction and computer games. Tracing the history of the term ›Spiel‹ as it oscillates between an abstract figurative meaning as a purely mental interplay between the different cognitive faculties and its reference to concrete performative acts in a leisurely purposeless mood the authors show their branching out into an outright dichotomy in the post-kantian Aesthetics and they postulate the re-convergence of the two meanings in the new artistic forms of literary hyperfictions and computer games.",
        "article_title": "ÜBER DEN ÄSTHETISCHEN BEGRIFF DES SPIELS ALS LINK ZWISCHEN TRADITIONELLER TEXTHERMENEUTIK, HYPERFICTION UND COMPUTERSPIELEN",
        "authors": [
            {
                "given": "Manuela",
                "family": "Kocher",
                "affiliation": [
                    "Zürich"
                ]
            },
            {
                "given": "Michael",
                "family": "Böhler",
                "affiliation": [
                    "Zürich"
                ]
            }
        ],
        "publisher": null,
        "date": "26. November 2001",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg01/tiutenko.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "A look from the viewpoint of the linguistic theory of text, as in this article, may result in reconsideration of some key-ideas common to many non-linguistic publications about hypertext. Since hypertext is frequently thought of as a primarily textual phenomenon (single text or system of texts), the authors of this article search for its linguistic definition based upon the knowledge about text production and reception that was gathered by many researchers in text linguistics during past four decades. A genuine concept of hypertext developed by computer science in 1960s-1980s serves in this case as a framework for the discussion. The article shows that verbal components of hypertext have to satisfy the general textuality criteria to become texts. Those criteria, however, clash with the notion of hypertext as a kind of non-constrained text and make the philosophical vision of an unlimited, universal hypertext unrealistic.",
        "article_title": "TEXT IM HYPERTEXT. EIN TEXTLINGUISTISCHER BLICK AUF DIE INFORMATIONSGESTALTUNG IM INTERNET",
        "authors": [
            {
                "given": "Klaudia",
                "family": "Prokopczuk",
                "affiliation": [
                    "Sprachenzentrum, Friedrich-Alexander-Universität, Erlangen"
                ]
            },
            {
                "given": "Arthur",
                "family": "Tiutenko",
                "affiliation": [
                    "Sprachenzentrum, Friedrich-Alexander-Universität, Erlangen"
                ]
            }
        ],
        "publisher": null,
        "date": "15. September 2001",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg01/rommel.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "Advanced Computing in the Humanities (ACO*HUM) was a SOCRATES/ ERASMUS thematic network designed to analyse the state of humanities computing in Europe. Experts from different countries and with different fields of expertise compiled a survey on the influence of humanities computing at European universities. The methodological implications of formal methods in the humanities and the different approaches to teaching advanced computational skills provide valuable insights into the different attitudes towards education and in particular humanities education at universities in Europe. The revision of curricula and the implementation of humanities computing centres seems a necessary development in the information society of the twenty-first century; here ACO*HUM provides a knowledge base for students, teachers, and administrators.",
        "article_title": "EUROPA UND DIE NEUEN MEDIEN. ACO*HUM EVALUIERT DIE GEISTESWISSENSCHAFTEN",
        "authors": [
            {
                "given": "Thomas",
                "family": "Rommel",
                "affiliation": [
                    "School of Humanities an Social Sciences, International University Bremen"
                ]
            }
        ],
        "publisher": null,
        "date": "7. September 2001",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg01/steding.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "Many paper based scholarly editions struggle with the limitations of paper and the typographic means of expression. They are difficult to use, potentially incomplete, and in many cases they do not meet the informational needs and expectations of the users. Digital editions offer serious solutions to many of these problems. They should not be seen simply as ›improved‹ editions, but as a new form of philological data storage. The computer allows new types of scholarly editions and new methods for accessing the data. It therefore is no longer necessary to offer all scholarly editions in print.",
        "article_title": "WARUM NOCH DRUCKEN? ÜBER DIE NACHTEILE GEDRUCKTER EDITIONEN",
        "authors": [
            {
                "given": "Sören",
                "family": "Steding",
                "affiliation": [
                    "Institut für Germanistik, Regensburg"
                ]
            }
        ],
        "publisher": null,
        "date": "26. November 2001",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg02/mccarty.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The question of academic legitimacy for humanities computing is argued from an heuristic, experimental perspective. The basic approach is to privilege what happens in actual practice, to observe the commonalities and generalize from them to a picture of the interrelations between the field and the non-technical disciplines of the humanities. These generalizations also lead to discovery of intellectual kinships with several traditional fields of study: philosophy and history (including the history and philosophy of science), ethnography, sociology, literary criticism and so on. The essay argues that in these kinships are to be found the basic questions with which we may build a computing that is of as well as in the humanities.",
        "article_title": "NEW SPLASHINGS IN THE OLD POND: THE COHESIBILITY OF HUMANITIES COMPUTING",
        "authors": [
            {
                "given": "Willard",
                "family": "McCarty",
                "affiliation": [
                    "Centre for Computing in the Humanities, King's College London"
                ]
            }
        ],
        "publisher": null,
        "date": "16. Oktober 2002",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg02/meister2.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The article's point of departure is a clarification of the principle conditions that would have to be fulfilled by Computer Philology in order to qualify as a discipline. This is followed by reviewing steps taken with a view to the possible institutionalization of Computer Philology at Hamburg University. The above theoretical considerations, as well as the reference to the practical example will form the backdrop for reviewing three articles presented in recent years which have aimed to answer the question »What is Computer Philology?«. The contributions under discussion are seen to differ mainly with regard to the implications which they hold for Computer Philology's development into a discipline proper. The article's conclusion is that we ought to »Think Big» in Computer Philology and aspire to meet the criteria for disciplinarity which are considered an important scholarly benchmark.",
        "article_title": "»THINK BIG»: DISZIPLINARITÄT ALS WISSENSCHAFTSTHEORETISCHE BENCHMARK DER COMPUTERPHILOLOGIE",
        "authors": [
            {
                "given": "Jan Christoph",
                "family": "Meister",
                "affiliation": [
                    "Forschergrupper Narratologie, Institut für Germanistik II, Hamburg"
                ]
            }
        ],
        "publisher": null,
        "date": "7. August 2002",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg02/orlandi.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "At the beginning, the article mentions the results of an enquiry on how humanities computing is being introduced into the curricula of the European universities; and the most important topics recently discussed around the theme of a theory of humanities computing. It appears that most experts agree on the opinion that humanities computing is an independent discipline, and as such it should be introduced into the faculties of humanities. The article then explains how the foundation of the discipline should be understood, on the basis of computing theory and the methodology of the different humanities disciplines.",
        "article_title": "IS HUMANITIES COMPUTING A DISCIPLINE?",
        "authors": [
            {
                "given": "Tito",
                "family": "Orlandi",
                "affiliation": [
                    "Centro Interdipartimentale di Servizio per l'Automazione nelle Discipline Umanistiche, Università degli Studi di Roma - LA SAPIENZA"
                ]
            }
        ],
        "publisher": null,
        "date": "17. Mai 2002",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg02/rockwell.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "While we are tired of discussing whether humanities computing is a discipline or an interdisciplinary field, it is still worth looking at what it is to become a discipline. Starting with a discussion of disciplinarity I argue that when a field begins to control the means of its academic reproduction through programmes it becomes a discipline. This founding moment of rupture with the surrounding disciplines should not be overlooked, nor should the dangers inherent in the defining of a field that happens through formalization in educational structures. In multimedia, in particular, there is a rupture around the place of the crafts of digital creation that places us in conflict with ideas about the liberal and servile (applied) arts. This will be the contribution of the digital humanities – a reorientation to craft and creative art in the humanities. There is no more stunning fact about the academic profession anywhere in the world than the simple one that academics are possessed by disciplines, fields of study, even as they are located in institutions. With the growth of specialization in the last century, the discipline has become everywhere an imposing, if not dominating, force in the working lives of the vast majority of academics. A discipline is born when a field takes control of its means of reproduction, specifically the ability to produce ›disciples‹ or students. The founding of a discipline is a rupture in the existing structure of institutions, one which is outside the founded discipline, being the condition of its becoming. The founding of a discipline is a liminal moment that defines the relationship between the discipline and those surrounding institutions. Humanities computing (HC) is becoming a discipline as it struggles to understand itself, struggles with existing disciplines and finds a new place within institutions. This paper will look at the emergence of humanities computing programmes as the founding of a discipline and the possibilities for rupture.",
        "article_title": "MULTIMEDIA, IS IT A DISCIPLINE? THE LIBERAL AND SERVILE ARTS IN HUMANITIES COMPUTING",
        "authors": [
            {
                "given": "Geoffrey",
                "family": "Rockwell",
                "affiliation": [
                    "School of the Arts, Humanities Computing Centre, McMaster University, Hamilton"
                ]
            }
        ],
        "publisher": null,
        "date": "8. November 2002",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg02/unsworth.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "I'll give the short answer to the question »what is humanities computing?« up front: it is foreshadowed by my two epigraphs. Humanities computing is a practice of representation, a form of modeling or, as Wallace Stevens has it, mimicry. It is also (as Davis and his co-authors put it) a way of reasoning and a set of ontological commitments, and its representational practice is shaped by the need for efficient computation on the one hand, and for human communication on the other. We'll come back to these ideas, but before we do, let's stop for a moment to consider why one would ask a question such as »what is humanities computing?«",
        "article_title": "WHAT IS HUMANITIES COMPUTING AND WHAT IS NOT?",
        "authors": [
            {
                "given": "John",
                "family": "Unsworth",
                "affiliation": [
                    "Department of English, Institute for Advanced Technology in the Humanities, University of Virginia"
                ]
            }
        ],
        "publisher": null,
        "date": "8. November 2002",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg02/boesken.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The past decade has seen the rise of quite a few new technologies. The computer and the internet have undoubtedly reached the status of mass media by now and discussions have been led about whether this phenomenon will finally force the exodus of ›the book‹ and of ›reading‹ – discussions that are well known from earlier times as in regard to the assumed competition between other electronic technologies, e.g. television, and the print media. This essay aims to take a closer look at these theories and tries to distinguish two different levels of the discussion that tend to be mixed up easily, as on one hand arguments are presented that relate to the medium itself and on the other hand arguments that relate to its products, such as the hypertext. Further to this, the essay aims to oppose the mentioned theories and assumptions with factual reality and examine their validity. It builds up on the results of a representative study investigating the attitude towards media in Germany in 2000 and it concludes that – at the time being – no extrusion of ›the book‹ or ›reading‹ in favour of the use of new technologies can be observed. Moreover, this essay aims to show that the assumed ›added value‹ of the hypertext (compared to linear presentation of printed text) should be studied more carefully. Hypertext does indeed offer some added value, but also bears the risk of disorientation and stress which might transform ›extra value‹ to ›less value‹.",
        "article_title": "LESEN AM COMPUTER – MEHRWERT ODER MEHR VERWIRRUNG? UNTERSUCHUNGEN ZUR ›KONKURRENZ‹ ZWISCHEN BUCH UND HYPERTEXT",
        "authors": [
            {
                "given": "Gesine",
                "family": "Boesken",
                "affiliation": [
                    "Köln"
                ]
            }
        ],
        "publisher": null,
        "date": "22. April 2002",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg02/gallet-martinet.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The technology of hypermedia presentation can be developed so as to highlight the new approaches of cultural geography, which emphasise the complexities of townscape perception. Hypermedia programs on urban history offer the options of relating maps and projects to views of built areas, or documents on social history to their cultural background, through interface elements such as windows, animations, interchangeable pictures, which structure the documents as embedded spaces, appearing as sets of options. This interactive presentation, which makes the unfolding of the program dependent on the user's choices, stresses the importance of the virtual as an essential constituent of the perception of cityscape. Historical studies of urban culture in recent years have stressed the complexities of townscape perception, favouring an interdisciplinary approach in which semiotics, including rhetoric and image analysis, are applied to cultural geography, an approach indebted to the ›linguistic turn‹ now followed by the ›visual turn‹. The technology of hypermedia presentation can be developed so as to highlight this new conceptualisation. The epistemology of hypermedia has itself undergone an evolution in the past ten years, since the first theories defined programs by their governing ›metaphors‹ whereas the more recent ones were indebted to ›constructivism‹, stressing the user's role. The argument will primarily be based on the CD-ROM Georgian Cities (authored by the research centre Cultures Anglophones et Technologies de l'Information – CATI, Université Paris-Sorbonne – Paris IV), which was designed so as to demonstrate the potential of hypermedia for urban studies.",
        "article_title": "HYPERMEDIA AND URBAN CULTURE: A PRESENTATION ON THE CD-ROM GEORGIAN CITIES",
        "authors": [
            {
                "given": "Liliane",
                "family": "Gallet-Blanchard",
                "affiliation": [
                    "Centre Cultures Anglophones et Technologies de l'Information CATI, Université Paris-Sorbonne - Paris IV"
                ]
            },
            {
                "given": "Marie-Madeleine",
                "family": "Martinet",
                "affiliation": [
                    "Centre Cultures Anglophones et Technologies de l'Information CATI, Université Paris-Sorbonne - Paris IV"
                ]
            }
        ],
        "publisher": null,
        "date": "17. Oktober 2002",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg02/rudman.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "Non-traditional authorship attribution studies are those attribution studies that make use of the computer, statistics, and stylistics. The hypothesis behind these studies is that an author has a unique and identifiable style. The computer has now become ubiquitous in eighteenth century literary studies and is the main reason why non-traditional authorship studies have advanced to where they are. David Holmes gives a good overview of the field in, The Analysis of Literary Style – A Review.[1] This article surveys a representative sample of authorship studies of eighteenth century literature and gives an exemplum of an ongoing study.",
        "article_title": "NON-TRADITIONAL AUTHORSHIP ATTRIBUTION STUDIES IN EIGHTEENTH CENTURY LITERATURE. STYLISTICS STATISTICS AND THE COMPUTER",
        "authors": [
            {
                "given": "Joseph",
                "family": "Rudman",
                "affiliation": [
                    "Department of English, Carnegie Mellon University, USA"
                ]
            }
        ],
        "publisher": null,
        "date": "16. Oktober 2002",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg02/will.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The transcription and electronic edition of Jean Paul's Exzerpthefte (excerpts), initiated and directed by Helmut Pfotenhauer at the University of Würzburg, is a project which was first sponsored by the Fritz Thyssen Foundation and is now supported by the Deutsche Forschungsgemeinschaft. The following article first gives a description of the manuscripts in question and outlines their special character and importance: in 45 years, Jean Paul has written down more than 12000 pages of excerpts, a very curious private encyclopaedia, which he intensively used during the writing of his novels and other texts. In a second part, the article delimits the philological and digital intentions of the edition: it is mainly conceived as a support for future editors of the revised historico-critical edition of Jean Paul's works, who will use it to comment the text and describe the author's writing method. In a third step, the article concentrates upon the digital realisation of the project, especially on the text markup, but also the used markup model designed by the Text Encoding Initiative (TEI) and the software used in different stages of the work (transcription, encoding, retrieval).",
        "article_title": "DIE ELEKTRONISCHE EDITION VON JEAN PAULS EXZERPTHEFTEN",
        "authors": [
            {
                "given": "Michael",
                "family": "Will",
                "affiliation": [
                    "Institut für Deutsche Philologie der Universität Würzbug"
                ]
            }
        ],
        "publisher": null,
        "date": "16. August 2002",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg03/froemming-etal.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The Internet-database Literary Life reflects the growing interest in interdependencies between literary production, reception and communication in relation to other fields and discourses. It aims to encourage occupation with and research on all aspects of literary life in the German-speaking countries from 1945 up to the present time. Provided is information on a variety of subjects such as literary prizes and exhibitions, literary debates and scandals, forms and aspects of political engagement of writers or the activities of institutions of the literary field. The form of presentation refrains from giving information bound in narrative structures, thus enabling the user to organize, combine and select materials according to the requirements of the particular question asked. The article gives further insight into problems and advantages of the database's design as well as its technical realization.",
        "article_title": "LITERARISCHES LEBEN. DATENBANK ZU DEN DEUTSCHSPRACHIGEN LäNDERN 1945-2000. Projektbericht http://www.literarischesleben.uni-goettingen.de",
        "authors": [
            {
                "given": "Gesa",
                "family": "Frömming",
                "affiliation": [
                    "Projekt Literarisches Leben, Seminar für Deutsche Philologie, Göttingen"
                ]
            },
            {
                "given": "Claudius",
                "family": "Sittig",
                "affiliation": [
                    "Projekt Literarisches Leben, Seminar für Deutsche Philologie, Göttingen"
                ]
            },
            {
                "given": "Roland",
                "family": "Baier",
                "affiliation": [
                    "Gesellschaft für wissenschaftliche Datenverarbeitung mbH Göttingen (GWDG)"
                ]
            },
            {
                "given": "Burkhard",
                "family": "Heise",
                "affiliation": [
                    "Gesellschaft für wissenschaftliche Datenverarbeitung mbH Göttingen (GWDG)"
                ]
            }
        ],
        "publisher": null,
        "date": "24. März 2004",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg03/mmeier.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "Journals are still the principal means by which new scientific knowledge is disseminated. The recent high and fast-rising cost of journals has had a devastating effect on the flow of scientific communication, the research community, and library collections. The following article provides an overview of the forces in the scientific communication market focusing on the particularly difficult situation for journals in the scientific, technical and medical (STM) fields. The impact of rising journal prices is aggravated by the availability of new media – such as Web editions of existing journals. Researchers – whose work is paid for by the university or the federal government – increasingly give away their research to commercial journals, which then charge universities high subscription fees in order to buy it back. The papers that appear in STM journals are typically provided free by academic researchers and are subject to peer review by academic referees and editors, who also receive little if any remuneration. To alleviate this difficult situation, numerous projects that represent a direct and strong competitive alternative to existing high-priced titles in important established STM fields have been launched. This article describes the far reaching transformation of the STM publishing market under way which will also change other scientific professions such as the humanities.",
        "article_title": "AUTOREN ALS VERLEGER. DIE ZUKUNFT DER WISSENSCHAFTLICHEN KOMMUNIKATION?",
        "authors": [
            {
                "given": "Michael",
                "family": "Meier",
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": "24. März 2004",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg03/morgenthaler2.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "Handwritten documents like Gottfried Keller's ›Studien- und Notizbücher‹ (›study and note books‹) demand an edition, which accounts for the special character of text witnesses. It is not the task to transfer the records into ›edited texts‹ only, but to make them visible inside their topographic embedding. The Historisch-Kritische Gottfried Keller-Ausgabe (Historical-Critical Gottfried Keller Edition) complies with these requirements owing to the complete reproduction of the text witnesses and the complement of each hand written page with a diplomatic transcription. The computer edition on CD-ROM, issued with the book, intends to implement appropriately the interaction of hand writing and transcription as well within the electronic media. This specification includes, aside from a word by word parallelisation, also a search option for character strings, which spans the entire corpus of the text witnesses. Thus, the limitation to sole textual and graphic display, which still rules today's electronic media, is overcome.",
        "article_title": "GOTTFRIED KELLERS STUDIENBÜCHER - ELEKTRONISCH EDIERT",
        "authors": [
            {
                "given": "Walter",
                "family": "Morgenthaler",
                "affiliation": [
                    "Basel, Schweiz"
                ]
            }
        ],
        "publisher": null,
        "date": "24. März 2004",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg03/opitz.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "With the help of specialists in the relevant fields the Herzog August Bibliothek is engaged in a pilot project concentrating on five genres characteristic of the 17th century – pamphlets, emblem books, almanacs, prayer books and books on the plague and other contagions – in order to develop document type definitions accessible via the internet. These DTDs can be employed in the future as worldwide standardisation tools for the publication and retrieval of the genres concerned. They will be developed on an empirical basis and demonstrated by using a large and representative sample of titles from each genre. We use the Text Encoding Initiative (TEI) and XML to encode text and metadata. The source XML-data is transformed into static HTML by an XSLT-script and thus offered to the public via the internet. The project is supported by the Deutsche Forschungsgemeinschaft (DFG)",
        "article_title": "DOCUMENT TYPE DEFINITIONS ZUR ERSCHLIEßUNG VON GATTUNGEN DES BAROCK IM INTERNET. EIN PROJEKT AN DER HERZOG AUGUST BIBLIOTHEK WOLFENBÜTTEL",
        "authors": [
            {
                "given": "Andrea",
                "family": "Opitz",
                "affiliation": [
                    "Herzog-August-Bibliothek, Abteilung Alte Drucke"
                ]
            }
        ],
        "publisher": null,
        "date": "24. März 2004",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg03/schicketanz-heiligenhaus.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "Historical newspapers and journals are invaluable sources for the study of the past. Especially, Jewish periodicals provide a detailed impression of the cultural development of Jewry and shed a quite different light on German history. Yet, it is tremendously difficult to obtain and to investigate these sources: Besides ›normal‹ losses (paper destruction et cetera), a great stock of Jewish newspapers was destroyed under the Nazi regime or are scattered all over the world – a fact, that forces a researcher to expensive stays in different libraries or archives and compels librarians to an extra burden of work. Within the funding program Scientific Library Services and Information Systems of the Deutsche Forschungsgemeinschaft the Aachen Chair of German-Jewish Literary History, the Cologne library Germania Judaica and the Town and University Library Frankfurt/Main carry out a digitization project, which already provides more than twenty representative periodicals, containing about 300.000 images in the WWW. The essay emphasizes the implications and the broad range of problems as well as their solutions in the process of digitizing periodicals. A discussion of the project's technological goals demonstrates the single strategies und procedures to publish large amounts of images, text and bibliographical data in an economic and structured way.",
        "article_title": "»INSELN IM MEER DES BELIEBIGEN«. ARCHITEKTUR UND IMPLEMENTIERUNG EINES INTERNETPORTALS DEUTSCH-JÜDISCHE PERIODIKA",
        "authors": [
            {
                "given": "Till",
                "family": "Schicketanz",
                "affiliation": [
                    "Germanistisches Institut der RWTH Aachen"
                ]
            },
            {
                "given": "Kay",
                "family": "Heiligenhaus",
                "affiliation": [
                    "Semantics Kommunikationsmanagement GmbH, Aachen"
                ]
            }
        ],
        "publisher": null,
        "date": "24. März 2004",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg03/schreier.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "This contribution focuses on pseudo-documentaries on the internet which are regarded as the most recent example of the present-day media trend towards an increasing blurring of the line between fact and fiction. After outlining the tradition of especially audiovisual hybrid media products in which pseudo-documentaries can be seen to stand, various approaches for [distinguishing between fact and fiction are discussed and a three-pronged model for evaluating the reality status of media products is presented. On the basis of this model, pseudo-documentaries are reconstructed as a type of fiction that lacks any clear paratextual signals as to its fictional status; instead, the impression is created (as part of the plot) that product actually constitutes fact. This impression is further supported by a highly realistic production mode that is achieved by presenting a large amount of seemingly authentic material. With respect to content, however, most pseudo-documentaries contain highly implausible as well as topical elements which in turn can function as signals pointing recipients to the fictional status of these products. Content analysis of a random sample of e-mails from internet newsgroups about the pseudo-documentary horror film The Blair Witch Project shows, however, that approximately one third of these recipients are somewhat confused concerning the reality status of the film, basing their evaluation for the most part on information obtained from other media products. Even those recipients who correctly consider the film to be fiction or a hybrid hardly ever make use of the strongest signals to that effect contained in the product, but rely on mediated information instead. These results are supported by a comparison with two companion studies.",
        "article_title": "PSEUDO-DOKUMENTATIONEN: ZUM VERSCHWIMMEN DER GRENZE ZWISCHEN REALITÄT UND FIKTION IN DEN MEDIEN",
        "authors": [
            {
                "given": "Margrit",
                "family": "Schreier",
                "affiliation": [
                    "International University Bremen, School of Humanities and Social Sciences"
                ]
            }
        ],
        "publisher": null,
        "date": "11. März 2004",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg04/buettner/buettner.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The integration of the medium Internet into the traditional system of scientific communication is still in a transitional process. New ways of knowledge transfer, different forms of communication as well as information retrieval are yet to be tested. Depending on the different communication cultures among academic disciplines, the focus of interest might vary and should be adjusted to a variety of needs and individual preferences. For the field of historical science, the example of the internet-project historicum.net and its predecessor Server Frühe Neuzeit may illustrate the search for appropriate concepts as well as the problems that arise.",
        "article_title": "ERFAHRUNGEN MIT DER VIRTUELLEN WISSENSCHAFT. VOM SERVER FRÜHE NEUZEIT ZUM HISTORICUM.NET",
        "authors": [
            {
                "given": "Sabine",
                "family": "Büttner",
                "affiliation": [
                    "Universität zu Köln"
                ]
            }
        ],
        "publisher": null,
        "date": "7. Dezember 2004",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg04/duerhub/duerhub.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "This paper focuses on the development of the e-journal IASLonline with special emphasis on the technical development of the publication of reviews. The technical editing process up to the publication of the reviews is presented in detail. As electronic publications can greatly increase the efficiency and pace of academic communication, the article argues for an equal treatment of non-profit electronic publications and print publications with regard to printing cost subsidies for publishing houses.",
        "article_title": "IASLONLINE – ZUM MEDIENWECHSEL. IN DER FACHKOMMUNIKATION",
        "authors": [
            {
                "given": "Oliver",
                "family": "Dürselen",
                "affiliation": [
                    "FernUniversität in Hagen, Institut für Neuere deutsche und europäische Literatur"
                ]
            },
            {
                "given": "Martin",
                "family": "Huber",
                "affiliation": [
                    "FernUniversität in Hagen, Institut für Neuere deutsche und europäische Literatur"
                ]
            }
        ],
        "publisher": null,
        "date": "10. Mai 2005",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg04/gross/gross.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The Heinrich-Heine-Portal (<http://www.hhp.uni-trier.de>) is a digital edition of Heinrich Heine's (1797-1856) works and letters. It was established in autumn 2002 as a cooperation between the Heinrich-Heine-Institut (HHI), Düsseldorf, and the Competence Centre for Information Retrieval and Electronic Publishing in the Humanities at the University of Trier and is being supported by the Deutsche Forschungsgemeinschaft (DFG) and the Kunststiftung Nordrhein-Westfalen. In addition to a complete, annotated scientific edition of the poet's works and letters, the Heinrich-Heine-Portal presents digital images of his manuscripts held by the Heinrich-Heine-Institut and other literary archives. Access for users is free of charge. The electronic version is based on the two reference editions of Heine: the Düsseldorfer Heine-Ausgabe (DHA) for the works and the Weimar Heine-Säkular-Ausgabe (HSA) for the letters. The edition of the letters is being revised and updated, newly-discovered letters and corrigenda are added. Not only does the portal interlink edited texts, indices, commentaries et cetera and vice-versa, it also provides the electronic facsimiles of the textual transmission in Heine's manuscripts and printed materials (i.e. First Editions, newspaper publications); it thus allows for a close study of all the primary sources still available. In addition, the portal offers digital images of contemporary pictures and paintings, including the portraits of the poet. An extensive bibliography will be added at a later date and kept up-to-date continually by the Heinrich-Heine-Institut. The HHP thus represents a comprehensive platform for research on Heinrich Heine. This paper describes the essential steps of the project from the close analysis of the printed editions and their structural and typographical characteristics, the digitizing process, the encoding principles and the encoding practices by means of TUSTEP (Tübinger System von Textverarbeitungsprogrammen), the markup according to the TEI Guidelines and, finally, the electronic publication by consistently using Open Source software such as the database management system MySQL and the content management system ZOPE.",
        "article_title": "DER DIGITALE HEINE – EIN INTERNETPORTAL. ALS INTEGRIERTES INFORMATIONSSYSTEM",
        "authors": [
            {
                "given": "Nathalie",
                "family": "Groß",
                "affiliation": [
                    "Kompetenzzentrum für elektronische, Erschließungs- und Publikationsverfahren in den Geisteswissenschaften an der Universität Trier"
                ]
            }
        ],
        "publisher": null,
        "date": "27. April 2005",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg04/jaeger.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The Goethezeitportal has been developed on the initiative of a team based at the Institute of German Literature at the university of Munich. It is a tool that can be used for the innovative processing and dissemination of knowledge by applying the possibilities offered by the new media to the cultural and scientific discourse on the most significant phase in the history of German intellectual history between 1770 and 1830. Further information on the concept, mission and current activities of the portal is available below.",
        "article_title": "DAS GOETHEZEITPORTAL – EIN WERKSTATTBERICHT",
        "authors": [
            {
                "given": "Georg",
                "family": "Jäger",
                "affiliation": [
                    "Ludwig-Maximilians-Universität München, Institut für Deutsche Philologie"
                ]
            }
        ],
        "publisher": null,
        "date": "25. Oktober 2004",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg04/michel.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The Virtual Library for German Studies (ViFa Germanistik) is being developed at the University Library of Frankfurt/Main in cooperation with Deutscher Germanistenverband, Deutsches Literaturarchiv Marbach and with a group of German specialists. Intended as a central portal for German Studies, it will offer access not only to the fully integrated OPAC, containing both conventional and electronic media, but also to links with selective qualified information/internet resources. In addition, ViFa Germanistik will integrate a communication site allowing comprehensive orientation on scholarly and organizational matters.",
        "article_title": "DIE VIRTUELLE FACHBIBLIOTHEK GERMANISTIK – EINE PROJEKTSKIZZE",
        "authors": [
            {
                "given": "Volker",
                "family": "Michel",
                "affiliation": [
                    "Universitätsbibliothek Johann Christian Senckenberg, Frankfurt am Main"
                ]
            }
        ],
        "publisher": null,
        "date": "17. März 2005",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg04/dimpel.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "The following paper offers an introduction to a set of programs called ErMaStat, which is an instrument for textual analysis of Middle High German rhymed epics. With the help of ErMaStat, texts can be analysed with respect to statistical differences, for example in the case of uncertain authorship or if the relative chronology of works of one author is unclear. ErMaStat is the first set of programs in the area of German Medieval Studies which makes it possible to record a large number of different textual features automatically and without any manual input, and subsequently carries out a statistical analysis. The scope of the textual features that can be examined is wide: It ranges from simple quantitative features such as words per line, function words and grammatical phenomena to an automatic analysis of meter. The power of ErMaStat is demonstrated on a number of scholarly issues in German Medieval Literature. It can be shown that the results of the so-called ›schallanalytische Untersuchungen‹ practised by Elisabeth Karg-Gasterstädt are more plausible than hitherto assumed. Another result is that statistical evidence can be presented for the theory that the first thousand lines of Hartmann von Aue's Iwein were written immediately after Hartmann had finished Erec.",
        "article_title": "TEXTSTATISTISCHE UNTERSUCHUNGEN AN MITTELHOCHDEUTSCHEN TEXTEN",
        "authors": [
            {
                "given": "Friedrich Michael",
                "family": "Dimpel",
                "affiliation": [
                    "Universität Erlangen-Nürnberg"
                ]
            }
        ],
        "publisher": null,
        "date": "23. November 2004",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg04/luedeling/ddd.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": "This paper describes plans for a diachronic corpus of German, which contains texts from Old High German to Modern German. In order to serve as a resource for research questions from many different fields (linguistics, literature, lexicography et cetera) the corpus must have a flexible architecture as well as a high degree of standardization of content. This flexibility is possible through a multi-layer standoff corpus model where the texts are stored in a central database. Standardization is ensured through common tagsets on each annotation level.",
        "article_title": "DEUTSCHDIACHRONDIGITAL – EIN DIACHRONES KORPUS DES DEUTSCHEN",
        "authors": [
            {
                "given": "Anke",
                "family": "Lüdeling",
                "affiliation": [
                    "Institut für deutsche Sprache und Linguistik Humboldt-Universität zu Berlin"
                ]
            },
            {
                "given": "Thorwald",
                "family": "Poschenrieder",
                "affiliation": [
                    "Institut für deutsche Sprache und Linguistik Humboldt-Universität zu Berlin"
                ]
            },
            {
                "given": "Lukas",
                "family": "Faulstich",
                "affiliation": [
                    "Institut für deutsche Sprache und Linguistik Humboldt-Universität zu Berlin"
                ]
            }
        ],
        "publisher": null,
        "date": "7. Februar 2005",
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg04/simon.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg04/wirth.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg04/wolber.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg05/kornstaedt/kornstaedt.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg05/muxeneder/muxeneder.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg05/veit.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg05/eskelinen.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg05/furtwae.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg04/hamburg.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg05/hulle.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg05/kehrein/kehrein.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg05/wittdiewald.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg05/zoellner-weber.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg06/boot.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg06/fanta.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg06/kegelel.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg06/schmitzstark.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg06/czfrineu.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg06/giacomu.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg06/kueck.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg07/BassKarcz.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg07/annobiblio.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg07/bobgehl.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg07/bubenh.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg07/kuwalu.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg07/koenigrusch.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg07/luedzeldes.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg07/rischuetei.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg07/schmieder.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg08/tonra.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg08/mclough.pdf",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg08/rehbein.pdf",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg08/romary.pdf",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg08/pierazzo.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg08/cummings.pdf",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg08/moran.pdf",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg08/fischer.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg08/keating1.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg08/keating2.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg09/walkowski.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg09/boot.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg09/fanta.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg09/geykenetal.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg09/Ilsemann.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg09/viehhauser.html",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    },
    {
        "url": "http://computerphilologie.digital-humanities.de/jg09/lukasosthof.pdf",
        "identifier": {
            "string_id": null,
            "id_scheme": null
        },
        "abstract": null,
        "article_title": null,
        "authors": [
            {
                "given": null,
                "family": null,
                "affiliation": [
                    null
                ]
            }
        ],
        "publisher": null,
        "date": null,
        "keywords": null,
        "journal_title": null,
        "volume": null,
        "issue": null,
        "ISSN": [
            {
                "value": null,
                "type": null
            }
        ]
    }
]