{"url": "http://dx.doi.org/10.1093/llc/fqaa021", "identifier": {"string_id": "10.1093/llc/fqaa021", "id_scheme": "DOI"}, "abstract": "This article presents a relational database capable of integrating data from a variety of types of written sources as well as material remains. In response to historical research questions, information from such diverse sources as documentary, bioanthropological, isotopic, and DNA analyses has been assessed, homogenized, and situated in time and space. Multidisciplinary ontologies offer complementary and integrated perspectives regarding persons and goods. While responding to specific research questions about the impact of globalization on the isthmus of Panama during the sixteenth and seventeenth centuries, the data model and user interface promote the ongoing interrogation of diverse information about complex, changing societies. To this end, the application designed makes it possible to search, consult, and download data that researchers have contributed from anywhere in the world.", "article_title": "The integration of heterogeneous information from diverse disciplines regarding persons and goods", "authors": [{"given": " Bethany", "family": "Aram", "affiliation": [{"original_name": "Department of Geography, History and Philosophy, Universidad Pablo de Olavide de Sevilla, Spain", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Aurelio", "family": "López Fernández", "affiliation": [{"original_name": "Department of Sports and Computer Science, Universidad Pablo de Olavide de Sevilla, Spain", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": " Daniel", "family": "Muñiz Amian", "affiliation": [{"original_name": "Department of Sports and Computer Science, Universidad Pablo de Olavide de Sevilla, Spain", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020-03-26", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}