{"url": "http://dx.doi.org/10.1093/llc/fqaa024", "identifier": {"string_id": "10.1093/llc/fqaa024", "id_scheme": "DOI"}, "abstract": "This article brings current core concerns of multimodality into dialogue with approaches identified with media archaeology. I begin by considering the development of multimodality in relation to the emphasis that media archaeologists place on non-linear and parallel histories, the relativity of ‘newness’, and cyclical thinking. I then move on to consider some of the respective conceptual undergirding of multimodality and media archaeology, focussing on key issues of materiality and media specificity, signs and signals, media convergence and commensurability. I argue that this juxtaposition brings fresh perspectives to the question of ‘mode’. Significantly, these are attuned both to social and formal considerations, but in ways that differ from both social semiotic orientations and other approaches to multimodality. Having considered these fundamentals, I turn to questions of interactivity, product, and process, and the blurring of boundaries between categories such as reading and writing. As a final intersection, I bring the growing interest in integrating quantitative, corpus-based methods in multimodal analysis into dialogue with the prioritization of the digital archive as a site of specific media archaeological interest with inherent potential for algorithmic manipulation. I conclude with some observations about the status of multimodality and media archaeology as communities and, more specifically, the potential for complementarity between them.", "article_title": "Multimodality and media archaeology: Complementary optics for looking at digital stuff?", "authors": [{"given": " Martin", "family": "Thomas", "affiliation": [{"original_name": "University of Leeds, School of Languages, Cultures and Societies, Leeds, UK", "normalized_name": "University of Leeds", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/024mrxd33", "GRID": "grid.9909.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020-04-02", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}