{"url": "http://dx.doi.org/10.1093/llc/fqz092", "identifier": {"string_id": "10.1093/llc/fqz092", "id_scheme": "DOI"}, "abstract": "The moods, feelings, and attitudes represented in a novel will resonate in the reader by activating similar sentiments. It is generally accepted that sentiment analysis can capture aspects of such moods, feelings, and attitudes and can be used to summarize a novel’s plot in a story arc. With the availability of a number of algorithms to automatically extract sentiment-based story arcs, new approaches for their utilization becomes pertinent. We propose to use nonlinear adaptive filtering and fractal analysis in order to analyze the narrative coherence and dynamic evolution of a novel. Using Never Let Me Go by Kazuo Ishiguro, the winner of the 2017 Nobel Prize for Literature as an illustrative example, we show that: (1) nonlinear adaptive filtering can extract a story arc that reflects the tragic trend of the novel; (2) the story arc displays persistent dynamics as measured by the Hurst exponent at short and medium timescales; (3) the plot’s dynamic evolution is reflected in the time-varying Hurst exponent. We argue that these findings are indicative of the potential that multifractal theory has for computational narratology and large-scale literary analysis. Specifically that the global Hurst exponent of a story arc is an index of narrative coherence that can identify bland, incoherent, and coherent narratives on a continuous scale. And, further, that the local time-varying Hurst exponent captures variation of a novel’s plot such that the extrema have specific narratological interpretations.", "article_title": "Dynamic evolution of sentiments in Never Let Me Go: Insights from multifractal theory and its implications for literary analysis", "authors": [{"given": " Qiyue", "family": "Hu", "affiliation": [{"original_name": "Center for Geodata and Analysis, Faculty of Geographical Science, Beijing Normal University, China", "normalized_name": "Beijing Normal University", "country": "China", "identifiers": {"ror": "https://ror.org/022k4wk35", "GRID": "grid.20513.35"}}]}, {"given": " Bin", "family": "Liu", "affiliation": [{"original_name": "Business School, Guangxi University, China", "normalized_name": "Guangxi University", "country": "China", "identifiers": {"ror": "https://ror.org/02c9qn167", "GRID": "grid.256609.e"}}]}, {"given": " Mads Rosendahl", "family": "Thomsen", "affiliation": [{"original_name": "School of Communication and Culture, Aarhus University, Denmark", "normalized_name": "Aarhus University", "country": "Denmark", "identifiers": {"ror": "https://ror.org/01aj84f44", "GRID": "grid.7048.b"}}]}, {"given": " Jianbo", "family": "Gao", "affiliation": [{"original_name": "Center for Geodata and Analysis, Faculty of Geographical Science, Beijing Normal University, China", "normalized_name": "Beijing Normal University", "country": "China", "identifiers": {"ror": "https://ror.org/022k4wk35", "GRID": "grid.20513.35"}}, {"original_name": "Institute of Automation, Chinese Academy of Sciences, China and International College, Guangxi University, China", "normalized_name": "Guangxi University", "country": "China", "identifiers": {"ror": "https://ror.org/02c9qn167", "GRID": "grid.256609.e"}}]}, {"given": " Kristoffer L", "family": "Nielbo", "affiliation": [{"original_name": "Center for Humanities Computing, Aarhus University, Denmark", "normalized_name": "Aarhus University", "country": "Denmark", "identifiers": {"ror": "https://ror.org/01aj84f44", "GRID": "grid.7048.b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020-01-24", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}