{"url": "http://dx.doi.org/10.1093/llc/fqz086", "identifier": {"string_id": "10.1093/llc/fqz086", "id_scheme": "DOI"}, "abstract": "Situated within the debate that has taken place in the recent years on how Digital Humanities can break down barriers between countries of the Global North and South (Intersectionality in Digital Humanities Conference, 2016), and how materials in minority langauges can have presence in the network for the generation of new knowledge (Thieberger, 2017; Rodríguez-Ortega and Cruces Rodríguez, 2018), the objective of this article is to explain how (and if) digitalization and Digital Humanities can facilitate research in the Philippines, as well as make it visible, and how this can be facilitated by cooperation projects, citing the example of the project Philperiodicals, carried out by the University of Antwerp and the University of the Philippies. What opportunities and difficulties were encountered upon proposing a project with such characteristics? What problems (ethical, at times) do we encounter when subsidizing projects in the South from the North? We shall address these questions based on the current status of digitalization and Digital Humanities in the country. Lastly, we offer a series of good practices concluded from debates and experiences from the project Philperiodicals, in the hopes that our previous difficulties and discussions may be of use for the development of similar projects in what has been called the Global South. ", "article_title": "Humanidades Digitales en Filipinas: proyectos, dificultades y oportunidades de la colaboración Norte-Sur", "authors": [{"given": " Rocío", "family": "Ortuño Casanova", "affiliation": [{"original_name": "Department of Literature, Universiteit Antwerpen, Belgium", "normalized_name": "University of Antwerp", "country": "Belgium", "identifiers": {"ror": "https://ror.org/008x57b05", "GRID": "grid.5284.b"}}]}, {"given": " Anna", "family": "Sarmiento", "affiliation": [{"original_name": "Department of European Languages, University of the Philippines Diliman, Philippines", "normalized_name": "University of the Philippines Diliman", "country": "Philippines", "identifiers": {"ror": "https://ror.org/03tbh6y23", "GRID": "grid.11134.36"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020-01-23", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}