{"url": "http://dx.doi.org/10.1093/llc/fqaa008", "identifier": {"string_id": "10.1093/llc/fqaa008", "id_scheme": "DOI"}, "abstract": "This article examines the impact of the digital humanities on information science and information scientists and how information scientists can contribute to digital collaborations in the digital humanities. This article uses three basic concepts—user-researcher, digital information system, and digital research object—as the framework for a description of the digital humanities shift and discusses the consequences of this shift for information science with reference to these concepts. The second part of the article investigates the two pillars of the digital humanities shift, acknowledgement of digital structure and the exploring mind, in more detail. In the case of correspondences, acknowledgement of digital structure involves respecting the ‘thing-like’ properties of letters that cannot be handled (searched, classified, etc.) unless they are translated into digitized metadata; this elevates metadata to genuine digital research objects. These theoretical issues are illustrated by the Prior archive, a collection of digitized letters, manuscript drafts, and other ‘grey’ material bequeathed from the New Zealand logician-philosopher Arthur Norman Prior. The concept of the ‘exploring mind’ is connected to a movement in information science, away from the needful user and information gap paradigm towards more open and exploratory information behaviour in the digital humanities. A concluding literature review examines selected works of information science that deals with non-standard, serendipitous information behaviour and identifies exploratory and serendipitous design features of information systems for the digital humanities. These features are represented in a taxonomy consisting of six design categories.", "article_title": "‘Attention, attention, exploring minds acknowledge digital structure!’ The shift to digital humanities has happened, so what should information scientists do in response?", "authors": [{"given": " Volkmar P", "family": "Engerer", "affiliation": [{"original_name": "Department of Communication, University of Copenhagen, Copenhagen, Denmark", "normalized_name": "University of Copenhagen", "country": "Denmark", "identifiers": {"ror": "https://ror.org/035b05819", "GRID": "grid.5254.6"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2020-01-31", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}