{"url": "http://dx.doi.org/10.16995/dscn.315", "identifier": {"string_id": "10.16995/dscn.315", "id_scheme": "DOI"}, "abstract": "The National Library of Finland has digitized and made available the historical newspapers published in Finland between 1771 and 1910 (Bremer-Laamanen 2014; Kettunen et al. 2014). This collection contains approximately 1.95 million pages in Finnish and Swedish. The Finnish part of the collection consists of about 2.40 billion words. The National Library’s Digital Collections are offered via the digi.kansalliskirjasto.fi web service, also known as Digi. An open data package of the whole collection was released in early 2017 (Pääkkönen et al. 2016). Quality of OCRed collections is an important topic in digital humanities, as it affects general usability and searchability of collections. There is no single available method to assess quality of large collections, but different methods can be used to approximate quality. This paper discusses different corpus analysis style methods to approximate overall lexical quality of the Finnish part of the Digi collection. Methods include usage of parallel samples and word error rates, usage of morphological analysers, frequency analysis of words and comparisons to comparable edited lexical data. Our aim in the quality analysis is twofold: firstly to analyse the present state of the lexical data and secondly, to establish a set of assessment methods that build up a compact procedure for quality assessment after e.g. re-OCRing or post-correction of the material.", "article_title": "How to Do Lexical Quality Estimation of a Large OCRed Historical Finnish Newspaper Collection with Scarce Resources", "authors": [{"ORCID": "http://orcid.org/0000-0003-2747-1382", "authenticated-orcid": false, "given": "Kimmo", "family": "Kettunen", "affiliation": [{"original_name": "University of Helsinki", "normalized_name": "University of Helsinki", "country": "Finland", "identifiers": {"ror": "https://ror.org/040af2s02", "GRID": "grid.7737.4"}}]}], "publisher": "Open Library of the Humanities", "date": "2020-09-21", "keywords": [], "journal_title": "Digital Studies/Le champ numérique", "volume": "10", "issue": "1", "ISSN": [{"value": "1918-3666", "type": "electronic"}]}