{"url": "https://doi.org/10.3366/ijhac.2020.0244", "identifier": {"string_id": "10.3366/ijhac.2020.0244", "id_scheme": "DOI"}, "abstract": " This research introduces a novel geo-spatial sampling model to overcome a major difficulty in historical economic geography of Bulgarian lands during a crucial period: immediately before and after the de facto independence of the territory from the Ottoman Empire in the second half of the nineteenth century. At its core it seeks to investigate the research question how the Bulgarian independence affected agricultural production in two regions (centered around the cities of Plovdiv and Ruse) of today's Bulgaria, for which there are conflicting yet empirically unsubstantiated claims concerning the economic impact of the political independence. Using our be-spoke geo-sampling strategy we believe, we have sampled regionally representative commensurable agricultural data from the 1840s Ottoman archival documentation, in accord with agricultural censuses conducted by the nascent nation state of Bulgaria in the 1890s. ", "article_title": "Bridging the Gap between Pre-census and Census-era Historical Data: Devising a Geo-sampling Model to Analyse Agricultural Production in the Long Run for Southeast Europe, 1840–1897", "authors": [{"given": "M. Erdem", "family": "Kabadayi", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Piet", "family": "Gerrits", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Grigor", "family": "Boykov", "affiliation": [{"original_name": "Austrian Academy of Sciences", "normalized_name": "Austrian Academy of Sciences", "country": "Austria", "identifiers": {"ror": "https://ror.org/03anc3s24", "GRID": "grid.4299.6"}}]}], "publisher": "Edinburgh University Press", "date": "2020-02-26", "keywords": null, "journal_title": "International Journal of Humanities and Arts Computing", "volume": "14", "issue": "1-2", "ISSN": [{"value": null, "type": null}]}