{"url": "http://dx.doi.org/10.6853/DADH.202004_(5).0004", "identifier": {"string_id": "10.6853/DADH.202004_(5).0004", "id_scheme": "DOI"}, "abstract": "This paper deals with the functionality that DocuSky offers to enhance the design and application of metadata when the studies of humanities are being researched within this platform. It concerns not only technical protocols but also the utilization during the procedure of humantic studies. More importantly, this paper would like to demonstrate the approach to compose a metadata and construct a personal database correspondent to scholars' needs basing on their raw materials. As a demonstration, Buddhist inscriptions are employed to elaborate the usage of tools offered by DocuSky. This demonstration further reveals the integration of academic events and the practice of composing metadata. By means of these tools, scholars may be easier to research within diverse perspectives and contexts. DocuSky provides the digital approaches and concepts for the study of humanities as digital humanities. Metadata in this platform is no longer a professional concept attributed to information organization or secondary information for data retrieving, but the intellectual property resulted from the procedure of research as well as the meaning endued by researchers.", "article_title": "Design and Application of Metadata in Digital Humanities Basing on DocuSky: A Case Study of Buddhist Inscriptions", "authors": [{"given": "I-Mei", "family": "Hung", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Te-Chi", "family": "Tsao", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2020-04-01", "keywords": ["DocuSky Collaboration Platform ", " metadata ", " digital humanities"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "5", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}