{"url": "http://dx.doi.org/10.6853/DADH.202004_(5).0003", "identifier": {"string_id": "10.6853/DADH.202004_(5).0003", "id_scheme": "DOI"}, "abstract": "The National Chengchi University Library began to develop a digital humanities research platform for Mr. Lo Chia-Lun's writings since 2018. This platform provides several basic functions, including a convenient and user-friendly reading interface with the support of an automatic text annotation tool based on Chinese word segmentation and linked data, metadata search, full-text search, single and double words search, post-query classification, and information visualization analysis tool, to support digital humanities research. It aims to assist digital humanists to efficiently read or analyze the contents of Mr. Lo Chia-Lun's Writings through distant reading and close reading. Moreover, the texts of Mr. Lo Chia-Lun's Writings were aligned with time. This characteristic inspired us to develop an advanced function called Observation Tool of Viewpoint Migration and Age Division (OTVMAD) that can assist digital humanists to observe the concept change or migration with time based on dividing the texts into appropriate periods on this digital humanities platform. In addition to optimizing the functions and user interface of this platform, our future work will keep on developing more new functions, such as personal resource archives, character social network analysis, name entity recognition as well as try to apply this digital humanities research platform to assist digital humanities' instruction.", "article_title": "Development and Application of Digital Humanities Research Platform for Mr. Lo Chia-Lun's Writings", "authors": [{"given": "Chih-Ming", "family": "Chen", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Chung", "family": "Chang", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}, {"given": "Chih Fan", "family": "Hsu", "affiliation": [{"original_name": null, "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "臺灣數位人文學會 & Ainosco Press", "date": "2020-04-01", "keywords": ["digital humanities ", " text mining ", " information visualization ", " Mr. Lo Chia-Lun's Writings ", " conceptual history"], "journal_title": "Journal of Digital Archives and Digital Humanities", "volume": "5", "issue": null, "ISSN": [{"value": "2616-5732", "type": null}]}