{"url": "http://dx.doi.org/10.1093/llc/fqq004", "identifier": {"string_id": "10.1093/llc/fqq004", "id_scheme": "DOI"}, "abstract": "We report on a significant correlation between lexical items containing complex vowels in their present day canonical forms, and prosodic-syntactic boundaries in Milton’s Paradise Lost, where all line terminals, whether end-stopped or run-on, plus line-medials with associated punctuation, constitute boundary tokens and equate to gold-standard phrase break annotations. Real-world knowledge of present day English pronunciation is projected onto each word token in two different versions, constituting two phrasing variants, of Book 1 of the poem via ProPOSEL, a prosody and part-of-speech English lexicon developed by the authors; and pertinent differences in place of articulation of English vowels in Milton’s day and ours are also discussed. The chi-squared test for independence returns a two-tailed P-value of less than 0.0001 for the association of this vowel subset and phrase breaks in both samples. This leads us to speculate that the poet’s unpremeditated use of complex vowels—which slow down verse movement in Paradise Lost and thus generate rhythmic junctures—may represent a phrasing device habitual not just to poets but to native English speakers in general. Concurrent work on a corpus of present-day British English speech corroborates our findings. Hence, complex vowels may constitute new predictive features in phrasing models for English.", "article_title": "Holy smoke: vocalic precursors of phrase breaks in Milton's Paradise Lost", "authors": [{"given": " Claire", "family": "Brierley", "affiliation": [{"original_name": "University of Bolton, UK", "normalized_name": "University of Bolton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01t884y44", "GRID": "grid.36076.34"}}, {"original_name": "University of Leeds, UK", "normalized_name": "University of Leeds", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/024mrxd33", "GRID": "grid.9909.9"}}]}, {"given": " Eric", "family": "Atwell", "affiliation": [{"original_name": "University of Leeds, UK", "normalized_name": "University of Leeds", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/024mrxd33", "GRID": "grid.9909.9"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2010-04-15", "keywords": null, "journal_title": "Literary and Linguistic Computing", "volume": "25", "issue": "2", "ISSN": [{"value": "0268-1145", "type": "print"}, {"value": "1477-4615", "type": "electronic"}]}