{"url": "http://dx.doi.org/10.2218/ijdc.v5i1.150", "identifier": {"string_id": "10.2218/ijdc.v5i1.150", "id_scheme": "DOI"}, "abstract": "Emulation is frequently discussed as a failsafe preservation strategy for born-digital documents that depend on contemporaneous software for access (Rothenberg, 2000). Yet little has been written about the contextual knowledge required to successfully use such software. The approach we advocate is to preserve necessary contextual information through scripts designed to control the legacy environment, and created during the preservation workflow. We describe software designed to minimize dependence on this knowledge by offering automated configuration and execution of emulated environments. We demonstrate that even simple scripts can reduce impediments to casual use of the digital objects being preserved. We describe tools to automate the remote use of preserved objects on local emulation environments.  This can help eliminate both a dependence on physical reference workstations at preservation institutions, and provide users accessing materials over the web with simplified, easy-to-use environments. Our implementation is applied to examples from an existing collection of over 4,000 virtual CD-ROM images containing thousands of custom binary executables.", "article_title": "Assisted Emulation for Legacy Executables", "authors": [{"given": "Kam", "family": "Woods", "affiliation": [{"original_name": "School of Informatics and Computing,Indiana University", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}, {"given": "Geoffrey", "family": "Brown", "affiliation": [{"original_name": "School of Informatics and Computing,Indiana University", "normalized_name": "Indiana University", "country": "United States", "identifiers": {"ror": "https://ror.org/01kg8sb98", "GRID": "grid.257410.5"}}]}], "publisher": "Edinburgh University", "date": "2010-06-22", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "5", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}