[
    {
        "title": "Finding and Interpreting Arguments: An Important\n                    Challenge for Humanities Computing and Scholarly Practice",
        "authors": [
            {
                "full-name": "Andrew Ravenscroft",
                "affiliations": " Cass School of Education and Communities, University of East London, UK"
            },
            {
                "full-name": " Colin Allen",
                "affiliations": " History and Philosophy of Science, University of Pittsburgh, USA"
            },
            {
                "full-name": " Philosophy",
                "affiliations": " Xi’an Jiaotong University, Xi’an, China"
            }
        ],
        "abstract": "\n                Skillful identification and interpretation of arguments is a cornerstone of\n                    learning, scholarly activity and thoughtful civic engagement. These are\n                    difficult skills for people to learn, and they are beyond the reach of current\n                    computational methods from artificial intelligence and machine learning, despite\n                    hype suggesting the contrary. In previous work, we have attempted to build\n                    systems that scaffold these skills in people. In this paper we reflect on the\n                    difficulties posed by this work, and we argue that it is a serious challenge\n                    which ought to be taken up within the digital humanities and related efforts to\n                    computationally support scholarly practice. Network analysis, bibliometrics, and\n                    stylometrics, essentially leave out the fundamental humanistic skill of\n                    charitable argument interpretation because they touch very little on the\n                        meanings embedded in texts. We present a problematisation of\n                    the design space for potential tool development, as a result of insights about\n                    the nature and form of arguments in historical texts gained from our attempt to\n                    locate and map the arguments in one corner of the Hathi Trust digital\n                    library.\n            "
    },
    {
        "title": "Reading the ",
        "authors": [
            {
                "full-name": "Peter Broadwell",
                "affiliations": " Center for Interdisciplinary Research, Stanford University"
            },
            {
                "full-name": " Jack W. Chen",
                "affiliations": " University of Virginia"
            },
            {
                "full-name": " David Shepard",
                "affiliations": " Scholarly Innovation Lab, UCLA"
            }
        ],
        "abstract": "\n                \n                The present paper addresses the problem of literary history as a problem of data\n                    comprehensiveness and selection, seeking not to resolve the impossibility of\n                    literary historical narrative, but to reframe it through a computational\n                    perspective. Our focus is on the "
    },
    {
        "title": "Decoupling Quality Control and Publication: The Digital Latin\n                    Library and the Traveling Imprimatur.",
        "authors": [
            {
                "full-name": "Samuel J. Huskey",
                "affiliations": " University of Oklahoma"
            },
            {
                "full-name": " Jeffrey C. Witt",
                "affiliations": " Loyola University Maryland"
            }
        ],
        "abstract": "\n                With "
    },
    {
        "title": "Changes in Lyrical and Hit Diversity of Popular\n                    U.S. Songs 1956-2016",
        "authors": [
            {
                "full-name": "Peter Meindertsma",
                "affiliations": " Department of Language Technology - Computational Linguistics, University of Groningen, Netherlands"
            }
        ],
        "abstract": "\n                \n                To examine changes in the diversity of popular songs over time, I have analyzed\n                    the lyrics of 99% of all songs sung in English that have appeared on the U.S.\n                    Billboard Hot 100 chart from 1956 up to and including 2016 (n=27.108). I have\n                    found the number of songs that reached the Hot 100 per year more than halved\n                    between 1966 and 2002, which indicates a loss in diversity. I have also found\n                    that the variation of valence (or level of pleasantness) in the\n                    songs’ lyrics and the variation of a sampled Type Token ratio (an indicator for\n                    lexical complexity) decreases over time. This indicates that lyrics of popular\n                    songs become more similar and again signify a loss of diversity.\n            "
    },
    {
        "title": "Digital Collaborations: A Survey Analysis of\n                    Digital Humanities Partnerships Between Librarians and Other Academics",
        "authors": [
            {
                "full-name": "Jessica Wagner Webster",
                "affiliations": " Baruch College, City University of New York"
            }
        ],
        "abstract": "\n                \n                The present study will investigate the perceptions of information professionals\n                    about their role in the work of digital humanities scholars, as well as the\n                    perceptions of digital humanities scholars on the role of information\n                    professionals in their research. While other scholarly literature has considered\n                    collaborations between these groups via surveys or interviews with small project\n                    teams, the present study will provide a large-scale analysis of collaborations\n                    using survey responses from more than 500 scholars, librarians, and archivists.\n                    Questions sought to determine the extent to which these groups collaborate with\n                    one another on project teams; how these collaborations unfold and who initiates\n                    them; whether IPs have begun to adjust and adapt their work to support specific\n                    DH projects, or to make their content more appealing and easy for potential\n                    future DH projects; and what administrative hurdles are faced during the\n                    collaboration. The survey also address how information professionals and DH\n                    scholars view the success of the collaboration after completing their work, and\n                    whether they intend to collaborate in future. To conclude, the article will\n                    consider what these responses tell us about how best to support all members of\n                    these collaborations.\n            "
    },
    {
        "title": "“Cosmopolitanism”, “Japaneseness”, and Video Game Studies: A Review of Mia Consalvo's ",
        "authors": [
            {
                "full-name": "Steven Braun",
                "affiliations": " Northeastern University"
            }
        ],
        "abstract": "\n                The field of Japanese studies occupies many spaces of inquiry in popular culture and academic\n                    scholarship alike, illustrating the diverse ways products of Japanese culture,\n                    society, and technology have broadly influenced the global market. In "
    },
    {
        "title": "Creating a User Manual for Healthy Crowd\n                    Engagement: A Review of Mark Hedges and Stuart Dunn's ",
        "authors": [
            {
                "full-name": "Samantha Blickhan",
                "affiliations": " Zooniverse & Adler Planetarium"
            }
        ],
        "abstract": "\n                This piece examines "
    },
    {
        "title": "Persuasive Physical Computing: A Review of David\n                    M. Rieder’s ",
        "authors": [
            {
                "full-name": "Nathan Sullivan",
                "affiliations": " Texas A&M University-Central Texas"
            }
        ],
        "abstract": "\n                \n                "
    }
]