{"url": "https://journals.psu.edu/dls/article/view/59753", "identifier": {"string_id": "10.18113/P8dls1159753", "id_scheme": "DOI"}, "abstract": "Digital humanities research has frequently been characterized by a high degree of recursivity, that is to say, by attempts to use digital humanities tools and techniques to reflect back on the structures and history of the field. Digital Humanities Masterplots is intended as a contribution to this ongoing project of self-analysis, but one that shifts attention away from actors, institutions, and research agendas and toward what Matthew Kirschenbaum refers to as the digital humanities as a \"discursive construction.\" My aim is not to offer a survey of or an opinion piece on work in an emerging field, not least because a critical mass of such essays already exists. Rather, my primary material will comprise a series of second-order reflections on the field, and, more specifically, how they tend to emplot the rise of the digital humanities in order to render it intelligible within a range of intellectual, institutional, and societal contexts. Inspired by the narratologist Mieke Bal's assertion that \"the shape of the story you tell determines what knowledge you produce,\" my claim is that the shapes of these digital humanities stories derive from certain basic assumptions about the aims of humanistic inquiry, and that by attending to them we can better understand an emerging set of positions regarding the role of the humanities as such.", "article_title": "Digital Humanities Masterplots", "authors": [{"given": "Matt", "family": "Erlin", "affiliation": [{"original_name": "Washington University in St. Louis", "normalized_name": "Washington University in St. Louis", "country": "United States", "identifiers": {"ror": "https://ror.org/01yc7t268", "GRID": "grid.4367.6"}}]}], "publisher": null, "date": "2016-05-05", "keywords": null, "journal_title": "Digital Literary Studies", "volume": "1", "issue": "1", "ISSN": [{"value": "2376-4228", "type": "electronic"}]}