{"url": "http://dx.doi.org/10.1093/llc/fqw009", "identifier": {"string_id": "10.1093/llc/fqw009", "id_scheme": "DOI"}, "abstract": "As digital literary collections continue to expand their scope and to broaden their audience, documenting the collaborative editorial work involved in creating these collections—and rendering that documentation transparent for its users—ensures that scholars continue to develop the idea (and reality) of the ‘social text’ envisioned by D. F. McKenzie. By documenting their collaborative editorial practices in a digital environment, scholarly editors help instantiate both the material history and the authorial, literary, and social contexts of a particular text. By rendering these collaborative practices visible, they make digital collections dynamic and usable for a wide range of individuals. The Walt Whitman Archive (WWA) serves as an ideal case study for examining the ways this particular collection intermediates scholarly editorial practices within a collaborative digital environment, as well as conventions of a scholarly edition and an archive. Through its collaborative editorial practices and guidelines, its layout and design, and its detailed documentation about its conditions of use for the general public, the WWA at once renders more visible the iterative process involved in editorial work, and makes the publicly accessible documentation of that process part of its infrastructure.", "article_title": "Documentation for the public: Social editing inThe Walt Whitman Archive", "authors": [{"given": " Meg", "family": "Meiman", "affiliation": [{"original_name": "University of Delaware, USA", "normalized_name": "University of Delaware", "country": "United States", "identifiers": {"ror": "https://ror.org/01sbq1a82", "GRID": "grid.33489.35"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016-03-03", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "31", "issue": "4", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}