{"url": "http://dx.doi.org/10.1093/llc/fqw029", "identifier": {"string_id": "10.1093/llc/fqw029", "id_scheme": "DOI"}, "abstract": "Why are Romeo and Juliet prominent characters in Shakespeare’s play of the same name? Contrary to what common sense might suggest, the academic literature does not provide a unique answer to this question. Indeed, there is little agreement on who the main character is and which elements of a script contribute to establishing a character’s leading role. The objective of this article is to explore and compare the prominence of characters in Romeo and Juliet by using social network analysis. To this end, we calculate the centralities of several characters in Romeo and Juliet using a method based on Social Network Analysis. Comparing the scores generated by this analysis, we found that Romeo’s centrality is more stable than Juliet’s while hers is lower and supported by the ‘strength of the bonds’ she develops with other characters. Thus, the comparison of different centrality rankings and clusters provides new knowledge about the plays of Shakespeare. We show that the ‘strength’ of the relationships affects the prominence of the characters. This finding opens new directions for analyzing Shakespeare’s scripts and determining who the main character is using weighted centrality measures. Finally, we discuss some theoretical and practical implications of the method used in this study.", "article_title": "Exploring the prominence ofRomeo and Juliet’s characters using weighted centrality measures", "authors": [{"given": " Víctor Hugo", "family": "Masías", "affiliation": [{"original_name": "Department of Management Control and Information Systems, Universidad de Chile, Chile", "normalized_name": "University of Chile", "country": "Chile", "identifiers": {"ror": "https://ror.org/047gc3g35", "GRID": "grid.443909.3"}}]}, {"given": " Paula", "family": "Baldwin", "affiliation": [{"original_name": "Institute of Literature, Universidad de Los Andes, Chile", "normalized_name": "University of the Andes", "country": "Venezuela", "identifiers": {"ror": "https://ror.org/02h1b1x27", "GRID": "grid.267525.1"}}]}, {"given": " Sigifredo", "family": "Laengle", "affiliation": [{"original_name": "Department of Management Control and Information Systems, Universidad de Chile, Chile", "normalized_name": "University of Chile", "country": "Chile", "identifiers": {"ror": "https://ror.org/047gc3g35", "GRID": "grid.443909.3"}}]}, {"given": " Augusto", "family": "Vargas", "affiliation": [{"original_name": "Departamento de Diseño y Manufactura (DIMA), Universidad Técnica Federico Santa María, Chile", "normalized_name": "Universidad Técnica Federico Santa María", "country": "Ecuador", "identifiers": {"ror": "https://ror.org/02zbepj77", "GRID": "grid.472425.2"}}]}, {"given": " Fernando A.", "family": "Crespo", "affiliation": [{"original_name": "Universidad Bernardo OHiggins, Centro de Desarrollo y Transferencia Tecnológica (CEDYTEC), Dirección de Investigación, y Facultad de Ingeniería y Administración, Chile", "normalized_name": "Universidad Bernardo O'Higgins", "country": "Chile", "identifiers": {"ror": "https://ror.org/00x0xhn70", "GRID": "grid.440625.1"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016-08-31", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}