{"url": "http://dx.doi.org/10.1093/llc/fqw045", "identifier": {"string_id": "10.1093/llc/fqw045", "id_scheme": "DOI"}, "abstract": "In this paper we focus on modelling as a creative process to gain new knowledge about material and immaterial objects by generating and manipulating external representations of them. We aim at enriching the current theoretical understanding by contextualising digital humanities practices within a semiotic conceptualisation of modelling. A semiotic approach enables us to contextualise modelling in a scholarly framework well suited to humanistic enquiries, forcing us to investigate how models function as signs within specific contexts of production and use. Kralemann and Lattmann’s semiotic model of modelling complemented by Elleström's theories on iconicity are some of the tools we use to inform this semiotic perspective on modelling. We contextualise Kralemann and Lattmann’s theory within modelling practices in digital humanities by using three examples of models representing components and structure of historical artefacts. We show how their model of models can be used to understand and contextualise the models we study and how their classification of model types clarify important aspects of digital humanities modelling practice.", "article_title": "Modelling in digital humanities: Signs in context", "authors": [{"given": " Arianna", "family": "Ciula", "affiliation": [{"original_name": "Department of Humanities, University of Roehampton, London, UK", "normalized_name": "University of Roehampton", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/043071f54", "GRID": "grid.35349.38"}}]}, {"given": " Øyvind", "family": "Eide", "affiliation": [{"original_name": "Historisch-Kulturwissenschaftliche Informationsverarbeitung, Universität zu KölnGermany", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016-09-30", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}