{"url": "http://dx.doi.org/10.1093/llc/fqw041", "identifier": {"string_id": "10.1093/llc/fqw041", "id_scheme": "DOI"}, "abstract": "In recent years, public engagement is increasingly viewed as more than an ‘additional extra’ in academia. In the UK, it is becoming more common for research projects to embrace public engagement with the belief that it informs research, enhances teaching and learning, and increases research impact on society. Therefore, it is becoming increasingly important to consider ways of incorporating public engagement activities into digital humanities research. This article discusses public engagement and digital humanities in practice, highlighting how museums are utilizing digital technology to engage the public. This article describes the development and presents the results of a case study: The QRator project, an application for digital interpretation in the museum and cultural heritage sector. The QRator project took an innovative, multidisciplinary approach to creating new ways for museum visitors to engage with museum objects and discussions. The objective was to understand how digital technologies, such as interactive labels and smartphones, create new ways for users to engage with museum objects; investigate the value and constraints of digital sources and methods involving cultural content; and demonstrate how crowdsourced digital interpretation may be utilized as a research source. This article will use the QRator project as a case study to explore how mobile devices and interactive digital labels can create new models for public engagement, visitor meaning-making (Silverman, L. H. Visitor meaning-making in museums for a new age. Curator, 1995;38(3):161–70), and the construction of multiple interpretations inside museum spaces. This article will also put emphasis on how public engagement can and should be a core consideration of digital humanities projects.", "article_title": "Engaging the museum space: Mobilizing visitor engagement with digital content creation", "authors": [{"given": " Claire", "family": "Bailey-Ross", "affiliation": [{"original_name": "Department of English Studies, Durham University, Durham, UK", "normalized_name": "Durham University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01v29qb04", "GRID": "grid.8250.f"}}]}, {"given": " Steven", "family": "Gray", "affiliation": [{"original_name": "The Bartlett Centre for Advanced Spatial Analysis, University College London, London, UK", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Jack", "family": "Ashby", "affiliation": [{"original_name": "Grant Museum of Zoology, University College London, London, UK", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Melissa", "family": "Terras", "affiliation": [{"original_name": "Department of Information Studies, University College London, London, UK", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Andrew", "family": "Hudson-Smith", "affiliation": [{"original_name": "The Bartlett Centre for Advanced Spatial Analysis, University College London, London, UK", "normalized_name": "University College London", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/02jx3x895", "GRID": "grid.83440.3b"}}]}, {"given": " Claire", "family": "Warwick", "affiliation": [{"original_name": "Department of English Studies, Durham University, Durham, UK", "normalized_name": "Durham University", "country": "United Kingdom", "identifiers": {"ror": "https://ror.org/01v29qb04", "GRID": "grid.8250.f"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016-10-06", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}