{"url": "http://dx.doi.org/10.1093/llc/fqw036", "identifier": {"string_id": "10.1093/llc/fqw036", "id_scheme": "DOI"}, "abstract": "This study uses information gleaned from the front matter, or preliminaries, of Spanish Golden Age texts to model the social networks underpinning the early modern publication industry. Using a data-driven approach, we examine the historical and political conditions that influenced the process of approval, censorship, and publication in the Spanish Empire, with a particular focus on the concept of geography, as it relates to the process of community formation and composition. We find that the literary publishing scene was dominated by a small group of authors, generally tied to Madrid, but highly published across Iberian cultural and political capitals. These authors, together with the powerful literary patrons who they relied upon for support, served as local bridges between communities that formed primarily at the local level. Regionally, we find groups of literate bureaucrats, clergymen, printers, and booksellers working together to fulfill the legal requirements for publication as dictated by the Spanish crown. Finally, we see how certain individuals tend to stand out at the regional level as gatekeepers to the publication industry, interacting equally with high- and low-profile individuals to approve and publish texts.", "article_title": "The preliminaries project: Geography, networks, and publication in the Spanish Golden Age", "authors": [{"given": " David M", "family": "Brown", "affiliation": [{"original_name": "CulturePlex Lab, Western University, Canada", "normalized_name": "Western University", "country": "Cambodia", "identifiers": {"ror": "https://ror.org/02agqkc58", "GRID": "grid.443228.b"}}]}, {"given": " Adriana", "family": "Soto-Corominas", "affiliation": [{"original_name": "CulturePlex Lab, Western University, Canada", "normalized_name": "Western University", "country": "Cambodia", "identifiers": {"ror": "https://ror.org/02agqkc58", "GRID": "grid.443228.b"}}]}, {"given": " Juan Luis", "family": "Suárez", "affiliation": [{"original_name": "CulturePlex Lab, Western University, Canada", "normalized_name": "Western University", "country": "Cambodia", "identifiers": {"ror": "https://ror.org/02agqkc58", "GRID": "grid.443228.b"}}]}], "publisher": "Oxford University Press (OUP)", "date": "2016-08-31", "keywords": null, "journal_title": "Digital Scholarship in the Humanities", "volume": "", "issue": "", "ISSN": [{"value": "2055-7671", "type": "print"}, {"value": "2055-768X", "type": "electronic"}]}