{"url": "http://dx.doi.org/10.2218/ijdc.v11i1.357", "identifier": {"string_id": "10.2218/ijdc.v11i1.357", "id_scheme": "DOI"}, "abstract": "As scientific data volumes, format types, and sources increase rapidly with the invention and improvement of scientific capabilities, the resulting datasets are becoming more complex to manage as well. One of the significant management challenges is pulling apart the individual contributions of specific people and organizations within large, complex projects. This is important for two aspects: 1) assigning responsibility and accountability for scientific work, and 2) giving professional credit to individuals (e.g. hiring, promotion, and tenure) who work within such large projects. This paper aims to review the extant practice of data attribution and how it may be improved. Through a case study of creating a detailed attribution record for a climate model dataset, the paper evaluates the strengths and weaknesses of the current data attribution method and proposes an alternative attribution framework accordingly. The paper concludes by demonstrating that, analogous to acknowledging the different roles and responsibilities shown in movie credits, the methodology developed in the study could be used in general to identify and map out the relationships among the organizations and individuals who had contributed to a dataset.  As a result, the framework could be applied to create data attribution for other dataset types beyond climate model datasets.     ", "article_title": "Recognizing the Diversity of Contributions: A Case Study for Framing Attribution and Acknowledgement for Scientific Data", "authors": [{"given": "Chung-Yi", "family": "Hou", "affiliation": [{"original_name": "Graduate School of Library and Information Science University of Illinois at Urbana-Champaign", "normalized_name": "University of Illinois at Urbana-Champaign", "country": "United States", "identifiers": {"ror": "https://ror.org/047426m28", "GRID": "grid.35403.31"}}]}, {"given": "Matthew", "family": "Mayernik", "affiliation": [{"original_name": "NCAR Library National Center for Atmospheric Research (NCAR)", "normalized_name": null, "country": null, "identifiers": {"ror": null, "GRID": null}}]}], "publisher": "Edinburgh University", "date": "2016-10-05", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "11", "issue": "1", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}