{"url": "http://dx.doi.org/10.2218/ijdc.v10i2.375", "identifier": {"string_id": "10.2218/ijdc.v10i2.375", "id_scheme": "DOI"}, "abstract": "This article reports the results of a study examining the state of data guidance provided to authors by 50 oncology journals. The purpose of the study was the identification of data practices addressed in the journals’ policies. While a number of studies have examined data sharing practices among researchers, little is known about how journals address data sharing. Thus, what was discovered through this study has practical implications for journal publishers, editors, and researchers. The findings indicate that journal publishers should provide more meaningful and comprehensive data guidance to prospective authors. More specifically, journal policies requiring data sharing, should direct researchers to relevant data repositories, and offer better metadata consultation to strengthen existing journal policies. By providing adequate guidance for authors, and helping investigators to meet data sharing mandates, scholarly journal publishers can play a vital role in advancing access to research data. ", "article_title": "State of Data Guidance in Journal Policies: A Case Study in Oncology", "authors": [{"given": "Deborah H.", "family": "Charbonneau", "affiliation": [{"original_name": "School of Library and Information Science Wayne State University, Detroit, MI, USA", "normalized_name": "Wayne State University", "country": "United States", "identifiers": {"ror": "https://ror.org/01070mq45", "GRID": "grid.254444.7"}}]}, {"given": "Joan E.", "family": "Beaudoin", "affiliation": [{"original_name": "School of Library and Information Science Wayne State University, Detroit, MI, USA", "normalized_name": "Wayne State University", "country": "United States", "identifiers": {"ror": "https://ror.org/01070mq45", "GRID": "grid.254444.7"}}]}], "publisher": "Edinburgh University", "date": "2016-05-13", "keywords": null, "journal_title": "International Journal of Digital Curation", "volume": "10", "issue": "2", "ISSN": [{"value": "1746-8256", "type": "electronic"}]}