{"url": "http://dx.doi.org/10.3389/fdigh.2016.00009", "identifier": {"string_id": "10.3389/fdigh.2016.00009", "id_scheme": "DOI"}, "abstract": "Digital tools, and in particular GIS, have enormously increased the possibilities for analysis in historical geography. In this article, we shall explain how these tools can be used to study the evolution of population density over a significant period. The territorial units used will be municipalities, as they allow detailed territorial analysis. However, research projects that take municipalities as their points of reference tend to be complex because their territorial boundaries have often undergone numerous changes over the course of modern history. The same has occurred, to a greater or lesser degree, in all of the countries in Europe (Bennett, 1989). The countries that have had the most stable municipal boundaries over the past 150 years include France, Italy, and Spain, though the modifications to their boundaries have also been notable. However, like all relevant challenges, these changes also offer us new opportunities, if we are able to cope with them. In this particular case, the challenge will be to achieve the territorial homogenization of the historical municipal series. In other words, when the municipal limits have changed, it will be necessary to adapt the data from the old municipal territories to the new ones. This exercise will have a number of applications. In this article, we present just one of these: the possibility of detecting areas and periods in which, over the course of history, there has been population growth, decline, or stagnation. This will serve as a relevant indicator, or proxy, for organizing research in other fields. For example, in the case of economic history, it is clear that variations in the density of population provide clues for interpreting the territorial distribution of economic activity. We also understand that it will be possible to apply our research about Spain to other countries and that this will make it possible to evaluate the interest and results that we can expect from the homogenized work. We think that, despite its interest, this type of study has, until now, been very rare on account of the methodological difficulties involved. However, these new digital tools in the field of historical GIS, as spatial aggregation and Moran I techniques, have helped to provide solutions to assume this challenge.", "article_title": "The Use of Digital Tools for Spatial Analysis in Population Geography", "authors": [{"given": "Jordi", "family": "Marti-Henneberg", "affiliation": [{"original_name": "University of Lleida, Spain", "normalized_name": "University of Lleida", "country": "Spain", "identifiers": {"ror": "https://ror.org/050c3cw24", "GRID": "grid.15043.33"}}]}, {"given": "Xavier", "family": "Franch-Auladell", "affiliation": [{"original_name": "University of Lleida, Spain", "normalized_name": "University of Lleida", "country": "Spain", "identifiers": {"ror": "https://ror.org/050c3cw24", "GRID": "grid.15043.33"}}]}, {"given": "Jorge", "family": "Solanas-Jiménez", "affiliation": [{"original_name": "University of Lleida, Spain", "normalized_name": "University of Lleida", "country": "Spain", "identifiers": {"ror": "https://ror.org/050c3cw24", "GRID": "grid.15043.33"}}]}], "publisher": "Frontiers Media SA", "date": "2016-09-22", "keywords": [], "journal_title": "Frontiers in Digital Humanities", "volume": "3", "issue": "", "ISSN": [{"value": "2297-2668", "type": "electronic"}]}