[
{"string_id": "10.1353/dph.2012.0000", "abstract": "<p>\n      This essay explores the ways in which a single tongue can be said to be, in Brunetto Latini’s phrase, at once “delectable” and “common.” It is argued that such titles are suited to medieval texts that trouble the limits of individual languages and, further, that they pertain in exemplary fashion to a restricted but complex corpus of medieval poems that are written in several languages at once.\n    </p>"},
{"string_id": "10.1353/dph.2013.0004", "abstract": "<p>In this paper, the author considers the origins of the rhyme, -<i>aura</i>, which has played an important role in Western poetry. Numerous studies have addressed questions pertaining to the history of <i>aura</i> in general, but none have focused on the matter of <i>aura</i> specifically as a rhyme. Within this narrower focus, the history of the <i>aura-</i>rhyme is shown to center on one critical moment, in which the <i>aura</i>-pun in Ovid's <i>Metamorphoses</i> is transformed into the <i>aura</i>-rhyme in Arnaut Daniel's song \"En cest sonet.\" Through a comparative reading of these two texts, conclusions are drawn regarding the relation of puns to rhymes, nouns to names, and the problems of isolating the origin of a rhyme historically.</p>"},
{"string_id": "10.1353/dph.2013.0003", "abstract": "<p>This essay offers an insight into the way digital editions of medieval texts can be employed to replicate the medieval reading experience. Awareness of the characteristic features of medieval textuality, exemplified through select late medieval texts, can help in developing increasingly flexible editorial models, which are more consistent with medieval reading practices than current editions. Editions, transformed from single textual occurrences into fluid, communal, and unfolding processes, can uncover a complex notion of medieval hypertextuality by linking texts, images, and tunes. They can then even trace the reception of a given text. As readers are empowered to zoom in and out specific textual components, of manuscript witnesses, of families and printed editions, digital editions can present individual witnesses alongside editorial apparatuses and thus bridge the gap between the Old and the New Philology.</p>"},
{"string_id": "10.1353/dph.2012.0002", "abstract": "<p>\n      In the digital humanities much research has been done concerning stylometry, the computational study of style. Literary authorship at-tribution, especially, has been a central topic. After a brief introduction, I will discuss the enormous potential of this paradigm for medieval philology, a field that studies so many texts of unknown or disputed origin. At the same time, it will be stressed that stylometry’s application to medieval texts is currently not without problems: many attribution techniques are still controversial and do not account for the specific nature of medieval text production. Throughout this paper, I will tentatively apply two well-established attribution techniques (principal components analysis and Burrows’s Delta) to a number of case studies in Middle Dutch studies. These analyses shall be restricted to rhyme words, since these words are less likely to have been altered by scribes.\n    </p>"},
{"string_id": "10.1353/dph.2012.0006", "abstract": "<p>\n      In this paper I study the portrayal of Jean de Meun in Arsenal 3339, an early fifteenth-century manuscript collection in which the <i>Rose</i> precedes Jean’s <i>Testament</i>, <i>Codicille</i>, and <i>Tresor ou Sept articles de la foi</i>. I marshal manuscript evidence to show how the person who masterminded the production of Arsenal 3339 refuted certain of the reproaches leveled against Jean de Meun in the 1401–1403 Debate about the <i>Roman de la Rose</i>. They were, in effect, that he had erred on key theological points and had moreover employed questionable instructional methods. Although the Arsenal mastermind, whom I provisionally identify as its compiler, objects to the way that Jean as <i>Rose</i> author had portrayed himself by means of a negative persona, Jean “Clopinel,” which can be roughly translated as “Jean who limps,” he nevertheless declines to join with Jean Gerson and Christine de Pizan to consign the book to the flames. I make the case that the compiler was an early fifteenth-century reader exceptionally well versed in the <i>Rose</i>, the Debate documents, and Gerson’s sermons, who, by expertly designing the collection, seeks to rehabilitate Jean’s professional reputation in response to criticisms lodged by his detractors in the Debate.\n    </p>"},
{"string_id": "10.1353/dph.2013.0002", "abstract": "<p>In this article, the author explores the idea that during the thirteenth century there were implemented new vernacular legal languages that were communicated to the ignorant clients of the law or lay people by notarial officers. The article theorizes around the effects of this communication, understood as a process of second language acquisition in which the second language is the formulaic system contained in legal documents.</p>"},
{"string_id": "10.1353/dph.2013.0001", "abstract": "<p>Authorship attribution often suffers from charges of vicious circularity, of conflating authorship and style. We argue for a more virtuous circularity for attribution arguments made through the quantitative analyses of stylometry. Our study investigated temporal lexeme usage, which has been suggested as a mark of authorship style, in the corpus traditionally attributed to Chrétien de Troyes. Our analyses revealed different usage patterns for these lexemes after line 6150 of the Lancelot, possibly indicating the signature of another author in the text (traditionally presumed to be that of Godefroy de Lagny). By embracing probabilistic arguments instead of certainties, digital philology can employ stylometry to consider questions of authorship attribution for medieval texts.</p>"},
{"string_id": "10.1353/dph.2012.0004", "abstract": "<p>\n      Globalization is a “hot topic.” While language figures prominently in debates, its complexity defies descriptions of globalization adequate for other subjects. Increasingly diverse ethnicity in nation states alters the status of once dominant vernaculars—what Dante called the <i>parlar materno</i>—as factors of cultural and social cohesion. Language and religion, rather than nation, now serve as elective markers of identity. Inevitably, however, to assert global status for a language conveys overtones of linguistic, and thus cultural, hegemony.\n    </p>"},
{"string_id": "10.1353/dph.2012.0010", "abstract": "<p>\n      President Nicolas Sarkozy’s recent call for a debate on national identity generated controversy in France. I use this controversy as a point of departure from which to re-examine the nineteenth-century myth of nationalism that casts the Armagnacs, supporters of Charles VII, as protonationalists. If the type of nationalism that the Armagnacs represented possesses any didactic force today, it is as a negative exemplum. Based on contemporary chronicle representations of the faction revealing how it understood itself and how it was viewed by its enemies, I argue that the Armagnacs are better seen as members of a feuding faction than as early nationalists to conclude that recent debate over national identity would be well served by acknowledging from the outset the fictive nature of what the History of France relates about the trajectory towards national unity and the perennial disagreement over who is French and who is not.\n    </p>"},
{"string_id": "10.1353/dph.2013.0013", "abstract": "<p>This article reviews the terminological framework used to describe manuscripts. The Lachmannian terminology allows scholars to classify manuscripts as <i>versions</i> or <i>variants</i> of a <i>work</i> on a purely textual basis, but lacks a rigid designator to indicate a (part of a) manuscript as a unit of text and material considerations. Conversely, scholars who adopt Dagenais’s solution to renounce the work and concentrate on the material <i>scriptum</i> gain a rigid designator, but threaten to lose the ability to classify manuscripts at all. Proceeding from a case study, the article argues that the twelfth-century view of a work’s ontological status enables medievalists to keep classifying their <i>scripta</i> on both textual and material grounds. It explores the possibility of using Dagenais’s <i>scriptum</i> as the foundation for a Neo-Lachmannian terminological framework that allows scholars to study manuscript variance and materiality without losing the ability to classify them.</p>"},
{"string_id": "10.1353/dph.2013.0008", "abstract": "<p>This article argues that, in the <i>Series</i>, Thomas Hoccleve not only appeals to the system of patronage, but attempts to revise it, creating a new template for literary sponsorship and engagement based on collaboration and mutual responsibility. The process of literary production Hoccleve outlines supports a reading of patronage that is not exclusively financially-based; rather, it is flexible, less hierarchical, and demands more from the patron than Hoccleve’s previous work—and indeed the work of most medieval authors—would suggest. In order to understand Hoccleve’s attempts to redefine his relationship to the system of literary sponsorship, however, we must be willing to take the structure of the <i>Series</i> seriously, following the signposts of creative collaboration Hoccleve weaves throughout the texts rather than their misleading, seemingly random nature. In addition to offering an alternate reading of Hoccleve’s work in the <i>Series</i>, this article suggests new ways of thinking about literary patronage in the Middle Ages more generally.</p>"},
{"string_id": "10.1353/dph.2013.0005", "abstract": "<p>This essay discusses the racialized portrayal of Dangier in Bodleian Library MS Douce 195. In contrast to the notion that the Middle Ages had no recourse to race as phenotypical difference, it argues that the orientalization of depictions in late medieval manuscripts like Douce 195— mostly studied through costume—is also to be found in portrayals of skin pigmentation.</p>"},
{"string_id": "10.1353/dph.2013.0012", "abstract": "<p>Erich Auerbach held an expansive notion of what philology is and does. Taking literature as his starting point (often under the rubric of a concrete <i>Ansatzpunkt</i>, be this a phrase, an isolated feature of style, or a self-contained logical sequence), Auerbach restlessly sought to establish nothing less than an intellectual—or better yet, spiritual (he often calls it “inner”)—history of the Western European mind as it lunged into contemporary modernity. Literary forms were for Auerbach a gateway to forms of thought, feeling, and expression. Philology was the method best suited to grasping these. The result was a philology of the <i>world</i> (<i>Weltphilologie</i>)—a politically, ideologically, and ethically engaged counter-philology that is as relevant today as it was in his own lifetime.</p>"},
{"string_id": "10.1353/dph.2012.0008", "abstract": "<p>\n\tThis article offers a codicological description of the most complete extant manuscript containing the poetry of Ausiàs March (Valencia, 1400–1459). It lays out the material characteristics of the codex, and sets them in contrast with a matrix of relevant features from other witnesses of March’s poetry. As a result, this study uncovers several of the stages in the compilatory process of the manuscript and argues for it having been originally owned by Ferrando de Cardona, Admiral of Naples and Duke of Somma\n \t(Naples, 1521-Sant Cugat del Vallès, 1571).\n      </p>"},
{"string_id": "10.1353/dph.2013.0014", "abstract": "<p>Patronage regularly figures as the dominant paradigm in discussions of late-medieval literary production and circulation. Common practice dictates that behind every text, a patron-figure looms, typically identified as a member of nobility for whom the text was composed. Many medieval texts promote this view by spotlighting extratextual relations in dedication materials or by folding into the narrative itself the story of its inception. Regardless of the source of these narratives, scholarship places under the patronage umbrella a large spectrum of exchanges said to have fostered the literary enterprise while excluding other partnerships that are seen to destabilize the system. Thus, transactions as distinctive as Guillaume de Machaut’s <i>Confort d’amy</i>, presented as an unsolicited text intended to comfort the imprisoned Charles of Navarre; Jean Froissart’s fictive account of literary collaboration with a prince in the <i>Prison amoureuse</i>; Christine de Pizan’s biography of Charles V, identified in the prologue as a commission ordered by the duke of Burgundy; and Geoffrey Chaucer’s dedication of <i>Troilus and Criseyde</i> to fellow poet John Gower and the lawyer Ralph Strode are presented as forms of patronage with little thought to the implications of the relational variations. At the same time, a number of transactions are sidelined in patronage studies because they seem to transgress the boundaries of expected exchange, even though they reproduce many of the same dynamics; hence, regifting, seizure of books, multi-copy dissemination of a single work, and purchase of a book from a third party regularly fail to figure into analysis. To date, scholars have avoided interrogating these arbitrary boundaries that define patronage studies. Critical avoidance of the heterogeneity of literary support networks is further exacerbated by a generalized failure to interrogate the impact of time, place, or cultural practices on sponsorship, not to mention possible manipulations of this exchange based on political, economic or personal concerns.</p>"},
{"string_id": "10.1353/dph.2013.0010", "abstract": "<p>This essay applies a theoretical model drawn from twentieth-century organization studies to late-medieval texts written in defence of women, in order to refresh critical appreciation of the dynamics of poet-patron relations at play in this corpus, the interest of whose patronage situations has been underestimated. By reading three sample poems (in both textual and paratextual dimensions) as “circuits of power,” we will be able to unpick the manoeuvrings of the agents contributing to a given book’s production and reception; to re-assess the framework of power relations in patronage as fulfilling a productive rather than a regulatory role; and to question more fully what constitutes authority and identity, in its various and multi-faceted forms in premodern literary practice.</p>"},
{"string_id": "10.1353/dph.2013.0018", "abstract": "<p>Written in the wake of the devastating Christian defeat at Nicopolis, the <i>Epistre lamentable</i> consistently draws on individual examples to target universal reform. Mézières establishes an intimate connection to Duke Philip of Burgundy as a fellow sufferer in Christ, attentuating the distance of hierarchical position. Once the duke is consoled by means of proven analogies—Mézières, Burgundy, and indeed all Christians are bound by wounds that replicate those of the Crucifixion—the author can go further. He becomes the duke’s counselor, or physician, and seeks to address how the Christians were routed at Nicopolis despite the justice of their crusade. Mézières dismantles the standard, self-interested bases of authorpatron address by targeting a larger and higher purpose to which to recruit Philip. He points the way to Christian recovery through his long-cherished project of a perfect knighthood, the Order of the Passion of Jesus Christ.</p>"},
{"string_id": "10.1353/dph.2014.0002", "abstract": "<p>This essay explores the significance of what are described as the “tears of Moses” in the fourteenth-century <i>Libro de buen amor</i> (“Book of Good Love”). Using digitized <i>corpora</i>, I show how exegesis of this biblical image focused on Pharaoh’s daughter being moved by the weeping of the infant Moses. Her compassion was equated with the bridal and maternal Church lovingly receiving and nourishing the spirit of the Law of Moses as her groom and infant Christ. The Spanish poem parodies these meanings by portraying the relationship between the narrator and his procuress as that of a crying baby being soothed by his mother. In a subversion of the heart-rending cries of Moses being consoled by the Church, the old bawd enables him to seduce the object of his lust by perversely appealing to her maternal compassion.</p>"},
{"string_id": "10.1353/dph.2014.0000", "abstract": "<p>This study imagines a Sephardic archive not as a physical site that houses the artifacts, texts, and history of a nation-state or Empire, but one that allows us to access those objects (or exposes their absence) and to bring artifacts from different official archives into dialogue in a different, virtual space, thus creating an additional, but not exclusionary, epistemic home, namely that of Sephardic studies. In it the author explores the potential advantages and practical limitations, as well as existing models of transnational resources—such as the <i>Friedberg Genizah Project</i> and the Institute of Microfilmed Hebrew Manuscripts, as well as del Barco and Vegas Montaner’s project of cataloguing the Hebrew manuscripts in Spanish libraries—that could be considered when thinking of what form a Sephardic archive could take. This study also explores how issues of language and identity fare when translated into the metadata used to make digitized information available.</p>"},
{"string_id": "10.1353/dph.2013.0016", "abstract": "<p>This article explores the politics of owning, or taking ownership, of <i>Bible historiale</i> manuscripts during the Hundred Years’ War. As theft and capture disrupted predictable patterns of patronage and exchange, new owners’ additions, erasures, and alterations can shed new light on ways in which the French Bible conditioned readers’ experience of the war on both sides. Such marginal acts of appropriation also force us to revise traditional notions of patronage to account for the sometimes violent refashioning of books to match the image and needs of unintended owners.</p>"},
{"string_id": "10.1353/dph.2014.0004", "abstract": "<p>This article illustrates an important while comparably unattended role played by the making of digital databases in our contemporary philological study of medieval poetry. By presenting a case study devoted to the figure of Mossèn Avinyó, a fifteenth-century Catalan nobleman and poet, the authors of this essay exemplify the need for a rigorous perusal of the material evidence that is being archived in digital projects. With paleographical, codicological, and literary evidence, the authors show with great probability that Avinyó himself compiled two manuscripts currently held by the Hispanic Society of America: the <i>Cancionero de Vindel</i> and the <i>Cançoner llemosí del siglo XV</i>. In doing so, the authors also show that these two manuscripts contain the entirety of Avinyó’s lyric production, along with a sampling of the poetry produced by those who traveled in Avinyó’s cultural circles.</p>"},
{"string_id": "10.1353/dph.2014.0009", "abstract": "<p>This article explains how the <i>Llull DB</i>, a database devoted to Ramon Llull’s original works, apocryphal corpus, historical reception, and modern scholarship, was conceived and developed. In addition to addressing specific issues involved in the design of a database with a focus on the medieval author of a multilingual corpus that enjoyed a wide reception, this essay also shows how the <i>Llull DB</i> has provided the original template for a series of interconnected databases related to medieval Catalonia, and tackles the challenges posed by the need for an interoperative environment for all of them.</p>"},
{"string_id": "10.1353/dph.2014.0010", "abstract": "<p>The academic study of medieval manuscripts has always been undertaken as if in dialogue with printed books. This essay takes as its starting point the changes in the nature of printed books that have come about in the last decade with the dramatic increase in data storage and retrieval capabilities, paying particular attention to the impact of book digitization by <i>Google Books</i> and similar programs. After first considering how targeted textual searching has changed the way books are used for research—inverting the traditional hierarchy of text and reader by allowing the latter to use the text with greater speed and control than ever before—I suggest that the change in the function of books can also entail for medievalists a change in the meaning of manuscripts. Because manuscripts provide much more information than that which is encoded in their text, including many elements that defy systematic characterization, their idiosyncratic nature seems to be enhanced in comparison to the increasingly utilitarian nature of searchable books. Taking as an exemplary case the digitization of University of Coimbra MS 720, a late-medieval copy of the <i>Dagger of Faith</i> (<i>Pugio fidei</i>) by the Catalan Dominican Ramon Martí, this essay offers some personal reflections on the ways that the use of texts, information, and manuscripts is changing in the age of digital books.</p>"},
{"string_id": "10.1353/dph.2014.0007", "abstract": "<p>This article has a twofold purpose. By providing ample illustration of the difficulties encountered in the making of a catalogue of medieval Catalan translations, we first consider different cataloguing criteria in order to discuss the suitability of the database format vis-à-vis that of a PDF document. Secondly, through the former discussion we bring forth three main questions for the study of medieval translation in general, namely: autor-ship, mediation, and transmission. The third question elicits our philological discussion of what constitutes a translation and how we may distinguish different translations or versions of a same work.</p>"},
{"string_id": "10.1353/dph.2014.0005", "abstract": "<p>This article presents the <i>Cançoners DB</i>, a database devoted to medieval Catalan songbooks transmitting Catalan lyric and verse narrative works ca. 1300–1500. In addition to introducing the aims and scope of the project, this essay reflects on the challenges and prospects of studying and indexing the material characteristics of Catalan songbooks in order to research works in verse, book production, and the compared structure of songbooks in Romance language traditions.</p>"},
{"string_id": "10.1353/dph.2014.0003", "abstract": "<p>This article describes the project <i>An Electronic Corpus of Fifteenth-Century Castilian</i> Cancionero <i>Manuscripts</i>, paying particular attention to issues and solutions in matters related to textual criticism, such as the collation of witnesses and the generation of phylogenetic stemmata.</p>"},
{"string_id": "10.1353/dph.2014.0015", "abstract": "<p>\n\t  Through analysis of the patterns and layers of annotation in the Middle English Prose <i>Brut</i> manuscript now known as the Dartmouth <i>Brut</i>, I consider what the manuscript’s development over time reveals about annotation itself as a collaborative activity with a tradition of its own, grounded in widely held habits of reading and writing. Recognition of such factors is essential to assessing annotation (or its absence) as potential evidence for the interests of individual readers. I conclude with discussion of the promise and hazards of manuscript digitization for the study of annotation.\n\t</p>"},
{"string_id": "10.1353/dph.2014.0017", "abstract": "<p>\n\t  The texts and manuscripts of the Middle English prose <i>Brut</i> resist easy classification, largely because they have resulted from a long and ongoing history of re-writing. The articles in this volume grapple with these dynamics by bringing comparative perspectives to a single manuscript. In this afterword, I seek to make clear some of the pluralities at the heart of encountering the digital, physical, and always contingent <i>Brut</i>. I highlight the complexities of transmission with an example of how one late medieval reader responded not to the text at hand, but rather to his memories or expectations of other histories and other texts.\n\t</p>"},
{"string_id": "10.1353/dph.2014.0012", "abstract": "<p>\n\t  Art is some <i>Brut</i> manuscripts helped shape readers’ understanding of history. Whereas the Dartmouth <i>Brut</i>’s single painted border fulfills an “authorizing” function common in Middle English Prose <i>Brut</i> manuscripts, the seventy miniatures painted by the Master of Edward IV in Lambeth Palace Library MS 6 actually interpret history. This article transcribes instructions to the artist that survive on nine folios of Lambeth 6 and addresses how the manuscript planner and the artist negotiated differences of both medium (text, image) and language (English, French). The planner instructed that pictures match text; the artist’s interpretations and iconography yielded sometimes unexpected historical nuances.\n\t</p>"},
{"string_id": "10.1353/dph.2014.0013", "abstract": "<p>\n\t  This essay examines the annotations of three readers of the Dartmouth <i>Brut</i>. Each engaged the manuscript in different ways: the first had prior knowledge of its contents, the second used the text to teach himself English history, and the third mined the chronicle as a primary source for facts. Together, these readers provide insight into why a medieval chronicle—outdated in content and manuscript form—would continue to attract the attention of early modern readers.\n\t</p>"},
{"string_id": "10.1353/dph.2014.0019", "abstract": "<p>\n\t  This essay situates the Dartmouth <i>Brut</i> within the manuscript culture of mid- to late fifteenth-century England. After a brief sketch of the manuscript’s modern ownership, the author turns to the original owners, the Ewre family of County Durham, and then to a recently discovered <i>Brut</i> with some ownership associations with the Dartmouth <i>Brut</i>. Finally, the author compares the competently written Dartmouth manuscript with one of the physically sloppiest of all <i>Brut</i> manuscripts—Glasgow MS Hunter 443. These manuscripts provide useful foils to each other when examined against the large body of <i>Brut</i> manuscripts, illuminating the different methods available to fifteenth-century scribes.\n\t</p>"},
{"string_id": "10.1353/dph.2014.0011", "abstract": "<p>\n\t  A recently discovered fragment of the Middle English Prose <i>Brut</i>, from the Special Collections department of Queen’s University, Belfast, illuminates the diverse production methods used in the <i>Brut</i> corpus. As part of this process, the author investigates the origins of the unique textual interpolation contained in the Belfast <i>Brut</i> fragment. Through comparison with the Dartmouth <i>Brut</i>, the author suggests some of the different approaches <i>Brut</i> producers took when tasked with “making history.”\n\t</p>"},
{"string_id": "10.1353/dph.2015.0004", "abstract": "<p>\n\t  Erich Auerbach’s <i>Mimesis: The Representation of Reality in Western Literature</i> (1946) was profoundly influenced by George Wilhelm Friedrich Hegel’s idealist philosophy. Hegel held that concepts determine the structure of reality: the concept of freedom in his philosophy of history and, for Auerbach, the concept of history in the representation of reality. For both, reality is inextricable from reason, rationality, consciousness, and vice versa; hence, history signifies the rise and progress of human consciousness. Auerbach also shared Hegel’s view that the art of mimesis produces an image of a reality, in contrast to Plato, who thought a work of art is a resemblance opposed to reality. This paper analyzes the influence of Hegel’s philosophy of history on Auerbach’s conceptions of literary history, reality, and truth, as evidenced in <i>Mimesis</i>’s famous first chapter, “Odysseus’ Scar.” Auerbach chose the Hegelian concept of reality (<i>Wirklichkeit</i>) as the subtitle of his book to advance its main thesis, opposing realism to myths and legends, rationality to the flight from reason. He refutes the claim that classical Greek myths, legends, and heroes inaugurated Western culture’s representation of reality and, hence, conception of history. Instead, he finds their origins in the Old Testament, with its formulation of world, universal history, and “concept of the historically becoming,” an important Hegelian concept according to which the temporal becoming and unfolding of the life of human beings is meaningful, intelligible, and should be thought of as evolutionary progress toward a certain goal or end.\n\t</p>"},
{"string_id": "10.1353/dph.2015.0001", "abstract": "<p>\n\t  This article studies how modern philologists have reconstructed a now lost ninth-century Arabic chronicle, the so-called <i>Chronicle of al-Razi</i>, through the account found in fifteenth-century Castilian chronicles of the defeat of the last Visigothic king of Iberia, Rodrigo. In addition to exploring the construction of a textual history that is populated by a series of phantasmal Iberian translators, manuscripts, and copyists, the creation of a modern Castilian edition of this lost Arabic chronicle speaks to the ideological basis and desires of modern, national philology.\n\t</p>"},
{"string_id": "10.1353/dph.2015.0002", "abstract": "<p>\n\t  Resistance to digital technology in manuscript study stems in large part from what detractors perceive as a loss of contact with the material artifact. For them, the digital image represents an illegitimate substitution for “the real thing.” In two movements, this article first suggests why such a term radically misunderstands both the relationship of digital image to manuscript, and also the nature of the manuscript’s performance of the work it represents. A second movement illustrates the performative propensity of manuscript technology—under the impetus of the sudden accumulation of vernacular adaptations of classical works fostered by Charles V in the 1370s—to influence court culture.\n\t</p>"},
{"string_id": "10.1353/dph.2016.0008", "abstract": "<p>\n\t  This article examines the group of Machaut’s poems (a composite <i>lai</i> and ten <i>ballades</i>) copied into an anthology compiled by the French humanist Simon de Plumetot. More than half of the 155 items were composed by Eustache Deschamps, and most of the remainder are anonymous, but the collection has a markedly didactic character and many pieces make political allusions. The manuscript thus sets Machaut’s love poems in an unusual context. This essay argues that reading these poems as presented in the anthology enables the modern reader to approximate a medieval reading experience.\n\t</p>"},
{"string_id": "10.1353/dph.2015.0012", "abstract": "<p>Two manuscripts in the Parker Library at Corpus Christi College, Cambridge, are copied in a hand which resembles that of Richard Frampton, a known clerk of the House of Lancaster in the early fourteenth century. Frampton copied literary manuscripts as well as working for the civic bureaucracy at the London Guildhall. His connections with royalty, the nobility and with Guildhall colleagues engaged in similar activities prompted an exploration of his social networks by means of software created at the University of Sheffield. The research was funded by the Andrew W. Mellon Foundation and coordinated by the University of Toronto.</p>"},
{"string_id": "10.1353/dph.2015.0003", "abstract": "<p>\n\t  This article questions the “narrator theory of narration” with particular reference to medieval narratives, often retellings of existing stories, and generally neglected by current theory. Part I analyzes the concept of the internal, potentially unreliable narrator, widely regarded as a narratological necessity. Part II examines the history of the term <i>narrator</i>. Part III studies the theories of narration implied by scribal annotations in some medieval manuscripts. Parts IV, V, and VI discuss three medieval cases—Malory’s <i>Morte Darthur</i>, Chaucer’s <i>Physician’s Tale</i> and the anonymous <i>Pearl</i>—in which application of the narrator theory proves to be misleading.\n\t</p>"},
{"string_id": "10.1353/dph.2015.0013", "abstract": "<p>This article engages with the scholarly debate surrounding the scribal hands of the <i>Parker Chronicle</i>, the copy of the <i>Anglo-Saxon Chronicle</i> found in Cambridge, Corpus Christi College, MS 173. In light of new tools and practices within the digital humanities, the author suggests that the number of previously differentiated scribes writing between folios 16v–28r ought to be reduced. Fleck examines Corpus Christi’s digital holdings through the tools afforded by Stanford University’s <i>Parker on the Web Project</i>, and addresses questions of scribal identity treated most recently and prominently by Janet Bately and David Dumville, collaborative editors of the <i>Anglo-Saxon Chronicle</i>. In so doing, he demonstrates the utility of these digital tools for democratizing the practice of paleography.</p>"},
{"string_id": "10.1353/dph.2016.0007", "abstract": "<p>\n\t  This essay examines a late fourteenth-century compendium that combines an abridged version of Machaut’s <i>Confort d’amy</i> with a disparate sampling of contemporary devotional, didactic, and political vernacular writing. Many of the texts, including Machaut’s poem, appear in the compendium in anonymous and abridged versions that erase details pertaining to a specific author or patron. The systematic process of adaptation within the manuscript favors author anonymity and a more personalized approach to abstracting meaning from texts. This essay argues that the continuity of this reading experience across the compendium’s patchwork of devotional and political contents shows a reception history for Machaut’s poetry that was driven by readership more than authorship.\n\t</p>"},
{"string_id": "10.1353/dph.2014.0016", "abstract": "<p>\n\t  In this photo essay, we reflect on our respective encounters with the object now known as Dartmouth College, Rauner Special Collections Library, MS 003183. Deborah Howe describes the process that turned a fragile object into a functional codex. Michelle Warren considers how this process intersects with the practices of medieval studies and digital humanities. Together, we trace the kinds of collaborations that orient material history toward the future.\n\t</p>"},
{"string_id": "10.1353/dph.2014.0018", "abstract": "<p>\n\t  The text represented by the Dartmouth <i>Brut</i>, written before 1430, was probably influenced by the political turmoil following the death of Henry V. Its omission of the stories of Constantine and Havelok—but inclusion of the story of Cadwallader—appears to represent a stage in the government’s revision of history. The stories of Constantine and Havelok would have been offensive to some since the first suggests a continuation of heroic kingship among the Welsh and the second an unflattering parallel to Humphrey, Duke of Gloucester, who was attempting to control the government of the child-king Henry VI.\n\t</p>"},
{"string_id": "10.1353/dph.2016.0004", "abstract": "<p>\n\t  This chapter shakes up critical understanding of narrative voice in text and image of Machaut’s <i>dits</i>. It perceives narratorial activity as a function that, far from being proper to one party (“the narrator”), is inherently mobile, circulating around elements of a poem or miniature, whether human characters, animals or landscape features. Miniatures devised for the <i>jugement</i> poems are a particularly rich resource for analyzing this mobility being exploited by artists to draw attention to issues of narrative framing, communication and point of view – including, crucially, the point of view of the manuscript’s reader/viewer.\n\t</p>"},
{"string_id": "10.1353/dph.2016.0006", "abstract": "<p>\n\t  The ordering of polyphonic musical works in the Machaut manuscripts relates directly to issues of layout and readability. Considering the size of the manuscripts, calculated according to surface area, the paper compares musical layout across the six Machaut manuscripts including his musical works (Paris, BnF, fr. 1584, 1585, 1586, 9221, 22545–6, and the Ferrell manuscript). Focusing on BnF fr. 9221, which is the largest and latest of these manuscripts, and is often criticized for its musical readings, the paper examines the idea of authority and considers the value of the manuscript to its original owner, the Duke of Berry.\n\t</p>"},
{"string_id": "10.1353/dph.2015.0010", "abstract": "<p>In Old English poetry and prose, declarations of unknowing and inexpressibility appear as quasi-formulaic assertions that no human being exists who could know or express the declarations’ subject—even when the text surrounding the declaration of unknowing contains evidence to the contrary. Consistently, in homilies and poetry alike, declarations of unknowing mark out the supernatural, functioning as traditional poetic markers of wonder and awe. With declarations of unknowing as a case study, this paper proposes a network model for visualizing the relationship between motifs, texts, and traditional associations within the larger expressive economy of oral-traditional Old English poetics.</p>"},
{"string_id": "10.1353/dph.2016.0002", "abstract": "<p>\n\t  This article explores the overlapping experiences of Guillaume de Machaut’s medieval manuscript readers and modern viewers of the digitized codex to argue that they share a nostalgic desire for a multi-sensorial and intimate encounter with the textual body. This study first considers Guillaume’s disgruntled reader in the <i>Jugement dou roy de Navarre</i> before turning to later readers who reenacted her desires when dealing with Machaut’s manuscripts. Finally, nuancing complaints that digitization distances us from the manuscript artifact, I consider how the digital surrogate reignites a desire for the textual body that defined the late-medieval reading experience.\n\t</p>"},
{"string_id": "10.1353/dph.2015.0011", "abstract": "<p>In this article I analyze the contents and transmission of a group of related manuscripts containing copies of Ælfrician and anonymous homilies in order to demonstrate the linguistic potential of variant copies of texts. I consider them from a comparative textual and linguistic perspective in a way that privileges the scribe and scribal activity over traditional philology or editorial practice. The manuscripts are Oxford, Bodleian Library MSS Bodley 340 and 342, Cambridge, Corpus Christi College MSS 162, 198, and 303. They date from Ælfric’s lifetime (c. 950–c. 1010) to the mid-twelfth century. I focus on three Ælfrician homilies that appear in sequence uniquely in this cluster alongside four anonymous texts that, similarly, are not found together elsewhere. This research, funded by the Andrew W. Mellon foundation, was conducted as part of a collaborative project that sought to refine digital technologies to aid consequential research in book and language history.</p>"},
{"string_id": "10.1353/dph.2016.0005", "abstract": "<p>Medieval scribes used decorated letters to mark the beginnings of songs, highlighting the incipits of texted voices and the vocal designations of others (“Tenor”). But some motets from fourteenth-century France begin with sung, untexted fanfares. This study examines several instances in the Machaut and Ivrea manuscripts where shortages of space, missing opening letters, and unorthodox layout decisions point to scribal confusion in the face of such beginnings. This evidence raises the possibility that untexted introductory sections may have traveled independently of their host compositions, and suggests new answers to the problems these “introitus” sections raise for modern editors and performers.\n\t</p>"},
{"string_id": "10.1353/dph.2016.0013", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2016.0011", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2016.0012", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2016.0010", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2017.0004", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2016.0009", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2017.0005", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2017.0002", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2017.0003", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2017.0001", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2017.0015", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2017.0014", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2017.0013", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2017.0012", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2017.0010", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2017.0011", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2017.0009", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2018.0005", "abstract": null},
{"string_id": "10.1353/dph.2018.0003", "abstract": null},
{"string_id": "10.1353/dph.2018.0004", "abstract": null},
{"string_id": "10.1353/dph.2018.0002", "abstract": null},
{"string_id": "10.1353/dph.2019.0001", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2019.0002", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2018.0001", "abstract": null},
{"string_id": "10.1353/dph.2019.0003", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2019.0000", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2019.0010", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2019.0009", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2019.0007", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2019.0008", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2019.0017", "abstract": null},
{"string_id": "10.1353/dph.2019.0018", "abstract": null},
{"string_id": "10.1353/dph.2019.0016", "abstract": null},
{"string_id": "10.1353/dph.2019.0013", "abstract": null},
{"string_id": "10.1353/dph.2019.0015", "abstract": null},
{"string_id": "10.1353/dph.2019.0014", "abstract": null},
{"string_id": "10.1353/dph.2019.0024", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2019.0025", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2019.0012", "abstract": null},
{"string_id": "10.1353/dph.2019.0023", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2020.0004", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2020.0003", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2020.0002", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2019.0022", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2020.0001", "abstract": "<p></p>"},
{"string_id": "10.1353/dph.2012.0012", "abstract": "<p> </p>"},
{"string_id": "10.1353/dph.2012.0021", "abstract": "<p> </p>"},
{"string_id": "10.1353/dph.2013.0000", "abstract": "<p> </p>"},
{"string_id": "10.1353/dph.2012.0019", "abstract": "<p> </p>"},
{"string_id": "10.1353/dph.2012.0017", "abstract": "<p> </p>"},
{"string_id": "10.1353/dph.2012.0013", "abstract": "<p> </p>"},
{"string_id": "10.1353/dph.2012.0015", "abstract": "<p> </p>"},
{"string_id": "10.1353/dph.2012.0020", "abstract": "<p> </p>"}
]